; ModuleID = 'src/b2sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [39 x i8] c"Print or check %s (%d-bit) checksums.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"BLAKE2b\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [40 x i8] c"Legacy interface to the cksum utility.\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [6 x i8] c"b2sum\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [45 x i8] c"  -b, --binary\0A         read in binary mode\0A\00", align 1, !dbg !29

!290 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1852, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 35)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1866, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1868, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 54)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1893, type: !226, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !110, file: !2, line: 194, type: !308, isLocal: true, isDefinition: true)
!308 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !110, file: !2, line: 197, type: !311, isLocal: true, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !312, line: 130, baseType: !313)
!312 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !201, line: 35, baseType: !314)
!314 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !110, file: !2, line: 200, type: !311, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "digest_length", scope: !110, file: !2, line: 241, type: !311, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !132, line: 729, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 56)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !132, line: 736, type: !71, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !328, file: !132, line: 575, type: !133, isLocal: true, isDefinition: true)
!328 = distinct !DISubprogram(name: "oputs_", scope: !132, file: !132, line: 573, type: !329, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !331)
!329 = !DISubroutineType(cc: DW_CC_nocall, types: !330)
!330 = !{null, !202, !202}
!331 = !{!332, !333, !334, !337, !338, !339, !340, !344, !345, !346, !347, !349, !400, !401, !402, !404, !405}
!332 = !DILocalVariable(name: "program", arg: 1, scope: !328, file: !132, line: 573, type: !202)
!333 = !DILocalVariable(name: "option", arg: 2, scope: !328, file: !132, line: 573, type: !202)
!334 = !DILocalVariable(name: "term", scope: !335, file: !132, line: 585, type: !202)
!335 = distinct !DILexicalBlock(scope: !336, file: !132, line: 582, column: 5)
!336 = distinct !DILexicalBlock(scope: !328, file: !132, line: 581, column: 7)
!337 = !DILocalVariable(name: "double_space", scope: !328, file: !132, line: 594, type: !308)
!338 = !DILocalVariable(name: "first_word", scope: !328, file: !132, line: 595, type: !202)
!339 = !DILocalVariable(name: "option_text", scope: !328, file: !132, line: 596, type: !202)
!340 = !DILocalVariable(name: "s", scope: !341, file: !132, line: 608, type: !202)
!341 = distinct !DILexicalBlock(scope: !342, file: !132, line: 605, column: 5)
!342 = distinct !DILexicalBlock(scope: !343, file: !132, line: 604, column: 12)
!343 = distinct !DILexicalBlock(scope: !328, file: !132, line: 597, column: 7)
!344 = !DILocalVariable(name: "spaces", scope: !341, file: !132, line: 609, type: !200)
!345 = !DILocalVariable(name: "anchor_len", scope: !328, file: !132, line: 620, type: !200)
!346 = !DILocalVariable(name: "desc_text", scope: !328, file: !132, line: 625, type: !202)
!347 = !DILocalVariable(name: "__ptr", scope: !348, file: !132, line: 644, type: !202)
!348 = distinct !DILexicalBlock(scope: !328, file: !132, line: 644, column: 3)
!349 = !DILocalVariable(name: "__stream", scope: !348, file: !132, line: 644, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !352, line: 7, baseType: !353)
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !354, line: 49, size: 1728, elements: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !371, !373, !374, !375, !377, !378, !380, !381, !384, !386, !389, !392, !393, !394, !395, !396}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !353, file: !354, line: 51, baseType: !133, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !353, file: !354, line: 54, baseType: !197, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !353, file: !354, line: 55, baseType: !197, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !353, file: !354, line: 56, baseType: !197, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !353, file: !354, line: 57, baseType: !197, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !353, file: !354, line: 58, baseType: !197, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !353, file: !354, line: 59, baseType: !197, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !353, file: !354, line: 60, baseType: !197, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !353, file: !354, line: 61, baseType: !197, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !353, file: !354, line: 64, baseType: !197, size: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !353, file: !354, line: 65, baseType: !197, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !353, file: !354, line: 66, baseType: !197, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !353, file: !354, line: 68, baseType: !369, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !354, line: 36, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !353, file: !354, line: 70, baseType: !372, size: 64, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !353, file: !354, line: 72, baseType: !133, size: 32, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !353, file: !354, line: 73, baseType: !133, size: 32, offset: 928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !353, file: !354, line: 74, baseType: !376, size: 64, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !182, line: 152, baseType: !314)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !353, file: !354, line: 77, baseType: !199, size: 16, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !353, file: !354, line: 78, baseType: !379, size: 8, offset: 1040)
!379 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !353, file: !354, line: 79, baseType: !209, size: 8, offset: 1048)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !353, file: !354, line: 81, baseType: !382, size: 64, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !354, line: 43, baseType: null)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !353, file: !354, line: 89, baseType: !385, size: 64, offset: 1152)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !182, line: 153, baseType: !314)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !353, file: !354, line: 91, baseType: !387, size: 64, offset: 1216)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !354, line: 37, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !353, file: !354, line: 92, baseType: !390, size: 64, offset: 1280)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !354, line: 38, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !353, file: !354, line: 93, baseType: !372, size: 64, offset: 1344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !353, file: !354, line: 94, baseType: !198, size: 64, offset: 1408)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !353, file: !354, line: 95, baseType: !200, size: 64, offset: 1472)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !353, file: !354, line: 96, baseType: !133, size: 32, offset: 1536)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !353, file: !354, line: 98, baseType: !397, size: 160, offset: 1568)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 20)
!400 = !DILocalVariable(name: "__cnt", scope: !348, file: !132, line: 644, type: !200)
!401 = !DILocalVariable(name: "url_program", scope: !328, file: !132, line: 648, type: !202)
!402 = !DILocalVariable(name: "__ptr", scope: !403, file: !132, line: 686, type: !202)
!403 = distinct !DILexicalBlock(scope: !328, file: !132, line: 686, column: 3)
!404 = !DILocalVariable(name: "__stream", scope: !403, file: !132, line: 686, type: !350)
!405 = !DILocalVariable(name: "__cnt", scope: !403, file: !132, line: 686, type: !200)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !132, line: 585, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 5)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !132, line: 586, type: !408, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !132, line: 595, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 4)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !132, line: 620, type: !26, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !132, line: 648, type: !296, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !132, line: 648, type: !408, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !132, line: 649, type: !415, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !132, line: 649, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 3)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !132, line: 650, type: !408, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !132, line: 651, type: !26, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !132, line: 652, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 7)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !132, line: 653, type: !16, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !132, line: 654, type: !214, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !132, line: 655, type: !214, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !132, line: 656, type: !214, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !132, line: 657, type: !214, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !132, line: 663, type: !437, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !132, line: 664, type: !214, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !132, line: 669, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 17)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !132, line: 669, type: !21, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !132, line: 676, type: !226, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !132, line: 676, type: !465, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 61)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !132, line: 679, type: !428, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !132, line: 683, type: !408, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !132, line: 688, type: !408, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !132, line: 691, type: !16, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !132, line: 839, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 16)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !132, line: 840, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 22)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !132, line: 841, type: !226, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !132, line: 862, type: !415, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !132, line: 868, type: !61, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !132, line: 875, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 27)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !132, line: 877, type: !51, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !132, line: 877, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 12)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !437, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 460, type: !26, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 461, type: !226, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 462, type: !26, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !437, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !408, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 465, type: !437, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 466, type: !415, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !408, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 476, type: !437, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !408, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 483, type: !408, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !16, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "status_only", scope: !110, file: !2, line: 204, type: !308, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "warn", scope: !110, file: !2, line: 208, type: !308, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "quiet", scope: !110, file: !2, line: 214, type: !308, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !110, file: !2, line: 211, type: !308, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "strict", scope: !110, file: !2, line: 218, type: !308, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "digest_delim", scope: !110, file: !2, line: 224, type: !204, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "raw_digest", scope: !110, file: !2, line: 232, type: !308, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1390, type: !296, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1393, type: !428, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1410, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 28)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1440, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 47)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1461, type: !16, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1461, type: !397, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1490, type: !26, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1490, type: !437, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1492, type: !428, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1512, type: !226, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1520, type: !555, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 42)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !95, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1536, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 43)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1536, type: !95, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1544, type: !31, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1544, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 46)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1552, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 25)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !110, file: !2, line: 221, type: !133, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "bin2hex", scope: !602, file: !2, line: 1345, type: !612, isLocal: true, isDefinition: true)
!602 = distinct !DISubprogram(name: "hex_equal", scope: !2, file: !2, line: 1343, type: !603, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !607)
!603 = !DISubroutineType(types: !604)
!604 = !{!308, !605, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!607 = !{!608, !609, !610, !611}
!608 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !602, file: !2, line: 1343, type: !605)
!609 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !602, file: !2, line: 1343, type: !605)
!610 = !DILocalVariable(name: "digest_bin_bytes", scope: !602, file: !2, line: 1349, type: !311)
!611 = !DILocalVariable(name: "cnt", scope: !602, file: !2, line: 1353, type: !311)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !479)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !132, line: 952, type: !501, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1282, type: !415, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1292, type: !428, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1294, type: !408, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1309, type: !408, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 717, type: !415, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1152, type: !428, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1156, type: !428, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1160, type: !428, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 3584, elements: !232)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !634, line: 50, size: 256, elements: !635)
!634 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!635 = !{!636, !637, !638, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !634, line: 52, baseType: !202, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !633, file: !634, line: 55, baseType: !133, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !633, file: !634, line: 56, baseType: !639, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !633, file: !634, line: 57, baseType: !133, size: 32, offset: 192)
!641 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!642 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!643 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!644 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!645 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!646 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!647 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !650, file: !651, line: 27, type: !688, isLocal: true, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !661, globals: !669, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28d09caefc730ba5ec0593f4ff5ef776")
!652 = !{!653}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !654, line: 42, baseType: !114, size: 32, elements: !655)
!654 = !DIFile(filename: "src/blake2/blake2.h", directory: "/src", checksumkind: CSK_MD5, checksum: "98dc573ce8fd1dd56441f8e485f7bd5e")
!655 = !{!656, !657, !658, !659, !660}
!656 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!657 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!658 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!659 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!660 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!661 = !{!662, !664, !605, !198, !667}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !665, line: 24, baseType: !666)
!665 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !182, line: 38, baseType: !204)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !665, line: 27, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !182, line: 45, baseType: !178)
!669 = !{!648, !670, !684}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "memset_v", scope: !672, file: !673, line: 161, type: !679, isLocal: true, isDefinition: true)
!672 = distinct !DISubprogram(name: "secure_zero_memory", scope: !673, file: !673, line: 159, type: !674, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !676)
!673 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8e1e523af54e01275d11e95a252b1371")
!674 = !DISubroutineType(types: !675)
!675 = !{null, !198, !200}
!676 = !{!677, !678}
!677 = !DILocalVariable(name: "v", arg: 1, scope: !672, file: !673, line: 159, type: !198)
!678 = !DILocalVariable(name: "n", arg: 2, scope: !672, file: !673, line: 159, type: !200)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!198, !198, !133, !200}
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !650, file: !651, line: 35, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 1536, elements: !687)
!687 = !{!503, !480}
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 512, elements: !17)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !692, line: 3, type: !226, isLocal: true, isDefinition: true)
!692 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "Version", scope: !695, file: !692, line: 3, type: !202, isLocal: false, isDefinition: true)
!695 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !696, splitDebugInlining: false, nameTableKind: None)
!696 = !{!690, !693}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "file_name", scope: !699, file: !700, line: 45, type: !202, isLocal: true, isDefinition: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !701, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!701 = !{!702, !704, !706, !708, !697, !710}
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !700, line: 121, type: !437, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !700, line: 121, type: !501, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !700, line: 123, type: !437, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !700, line: 126, type: !428, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !699, file: !700, line: 55, type: !308, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !714, file: !715, line: 66, type: !761, isLocal: false, isDefinition: true)
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !716, globals: !717, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!716 = !{!198, !204}
!717 = !{!718, !720, !740, !742, !744, !746, !712, !748, !750, !752, !754, !759}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !715, line: 272, type: !408, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "old_file_name", scope: !722, file: !715, line: 304, type: !202, isLocal: true, isDefinition: true)
!722 = distinct !DISubprogram(name: "verror_at_line", scope: !715, file: !715, line: 298, type: !723, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !714, retainedNodes: !733)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !133, !133, !202, !114, !202, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !727)
!727 = !{!728, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !726, file: !729, baseType: !114, size: 32)
!729 = !DIFile(filename: "lib/error.c", directory: "/src")
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !726, file: !729, baseType: !114, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !726, file: !729, baseType: !198, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !726, file: !729, baseType: !198, size: 64, offset: 128)
!733 = !{!734, !735, !736, !737, !738, !739}
!734 = !DILocalVariable(name: "status", arg: 1, scope: !722, file: !715, line: 298, type: !133)
!735 = !DILocalVariable(name: "errnum", arg: 2, scope: !722, file: !715, line: 298, type: !133)
!736 = !DILocalVariable(name: "file_name", arg: 3, scope: !722, file: !715, line: 298, type: !202)
!737 = !DILocalVariable(name: "line_number", arg: 4, scope: !722, file: !715, line: 298, type: !114)
!738 = !DILocalVariable(name: "message", arg: 5, scope: !722, file: !715, line: 298, type: !202)
!739 = !DILocalVariable(name: "args", arg: 6, scope: !722, file: !715, line: 298, type: !725)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "old_line_number", scope: !722, file: !715, line: 305, type: !114, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !715, line: 338, type: !415, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !715, line: 346, type: !16, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !715, line: 346, type: !296, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "error_message_count", scope: !714, file: !715, line: 69, type: !114, isLocal: false, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !714, file: !715, line: 295, type: !133, isLocal: false, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !715, line: 208, type: !437, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !715, line: 208, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 21)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !715, line: 214, type: !408, isLocal: true, isDefinition: true)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null}
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "program_name", scope: !766, file: !767, line: 31, type: !202, isLocal: false, isDefinition: true)
!766 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !768, globals: !769, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!768 = !{!197}
!769 = !{!764, !770, !772}
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !767, line: 46, type: !16, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !767, line: 49, type: !415, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "utf07FF", scope: !776, file: !777, line: 46, type: !804, isLocal: true, isDefinition: true)
!776 = distinct !DISubprogram(name: "proper_name_lite", scope: !777, file: !777, line: 38, type: !778, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !780, retainedNodes: !782)
!777 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!778 = !DISubroutineType(types: !779)
!779 = !{!202, !202, !202}
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !781, splitDebugInlining: false, nameTableKind: None)
!781 = !{!774}
!782 = !{!783, !784, !785, !786, !791}
!783 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !776, file: !777, line: 38, type: !202)
!784 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !776, file: !777, line: 38, type: !202)
!785 = !DILocalVariable(name: "translation", scope: !776, file: !777, line: 40, type: !202)
!786 = !DILocalVariable(name: "w", scope: !776, file: !777, line: 47, type: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !788, line: 37, baseType: !789)
!788 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !182, line: 57, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !182, line: 42, baseType: !114)
!791 = !DILocalVariable(name: "mbs", scope: !776, file: !777, line: 48, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !794)
!793 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !796)
!795 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !796, file: !795, line: 15, baseType: !133, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !796, file: !795, line: 20, baseType: !800, size: 32, offset: 32)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !796, file: !795, line: 16, size: 32, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !800, file: !795, line: 18, baseType: !114, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !800, file: !795, line: 19, baseType: !415, size: 32)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 16, elements: !297)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !807, line: 78, type: !16, isLocal: true, isDefinition: true)
!807 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !807, line: 79, type: !26, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !807, line: 80, type: !240, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !807, line: 81, type: !240, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !807, line: 82, type: !397, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !807, line: 83, type: !296, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !807, line: 84, type: !16, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !807, line: 85, type: !437, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !807, line: 86, type: !437, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !807, line: 87, type: !16, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !828, file: !807, line: 76, type: !900, isLocal: false, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !829, retainedTypes: !835, globals: !836, splitDebugInlining: false, nameTableKind: None)
!829 = !{!152, !830, !137}
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !153, line: 254, baseType: !114, size: 32, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!833 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!834 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!835 = !{!133, !199, !200}
!836 = !{!805, !808, !810, !812, !814, !816, !818, !820, !822, !824, !826, !837, !841, !851, !853, !858, !860, !862, !864, !866, !889, !896, !898}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !828, file: !807, line: 92, type: !839, isLocal: false, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 320, elements: !215)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !828, file: !807, line: 1040, type: !843, isLocal: false, isDefinition: true)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !807, line: 56, size: 448, elements: !844)
!844 = !{!845, !846, !847, !849, !850}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !843, file: !807, line: 59, baseType: !152, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !843, file: !807, line: 62, baseType: !133, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !843, file: !807, line: 66, baseType: !848, size: 256, offset: 64)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 256, elements: !17)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !843, file: !807, line: 69, baseType: !202, size: 64, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !843, file: !807, line: 72, baseType: !202, size: 64, offset: 384)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !828, file: !807, line: 107, type: !843, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "slot0", scope: !828, file: !807, line: 831, type: !855, isLocal: true, isDefinition: true)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 256)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !807, line: 321, type: !296, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !807, line: 357, type: !296, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !807, line: 358, type: !296, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !807, line: 199, type: !437, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "quote", scope: !868, file: !807, line: 228, type: !887, isLocal: true, isDefinition: true)
!868 = distinct !DISubprogram(name: "gettext_quote", scope: !807, file: !807, line: 197, type: !869, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !828, retainedNodes: !871)
!869 = !DISubroutineType(types: !870)
!870 = !{!202, !202, !152}
!871 = !{!872, !873, !874, !875, !876}
!872 = !DILocalVariable(name: "msgid", arg: 1, scope: !868, file: !807, line: 197, type: !202)
!873 = !DILocalVariable(name: "s", arg: 2, scope: !868, file: !807, line: 197, type: !152)
!874 = !DILocalVariable(name: "translation", scope: !868, file: !807, line: 199, type: !202)
!875 = !DILocalVariable(name: "w", scope: !868, file: !807, line: 229, type: !787)
!876 = !DILocalVariable(name: "mbs", scope: !868, file: !807, line: 230, type: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !879, file: !795, line: 15, baseType: !133, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !879, file: !795, line: 20, baseType: !883, size: 32, offset: 32)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !879, file: !795, line: 16, size: 32, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !883, file: !795, line: 18, baseType: !114, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !883, file: !795, line: 19, baseType: !415, size: 32)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, elements: !888)
!888 = !{!298, !417}
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "slotvec", scope: !828, file: !807, line: 834, type: !891, isLocal: true, isDefinition: true)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !807, line: 823, size: 128, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !892, file: !807, line: 825, baseType: !200, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !892, file: !807, line: 826, baseType: !197, size: 64, offset: 64)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "nslots", scope: !828, file: !807, line: 832, type: !133, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "slotvec0", scope: !828, file: !807, line: 833, type: !892, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 704, elements: !902)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!902 = !{!903}
!903 = !DISubrange(count: 11)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !906, line: 67, type: !501, isLocal: true, isDefinition: true)
!906 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !906, line: 69, type: !437, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !906, line: 83, type: !437, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !906, line: 83, type: !415, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !906, line: 85, type: !296, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !906, line: 88, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 171)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !906, line: 88, type: !922, isLocal: true, isDefinition: true)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 34)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !906, line: 105, type: !478, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !906, line: 109, type: !929, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 23)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !906, line: 113, type: !550, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !906, line: 120, type: !936, isLocal: true, isDefinition: true)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 32)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !906, line: 127, type: !941, isLocal: true, isDefinition: true)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 36)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !906, line: 134, type: !21, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !906, line: 142, type: !95, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !906, line: 150, type: !950, isLocal: true, isDefinition: true)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 48)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !906, line: 159, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 52)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !906, line: 170, type: !257, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !906, line: 248, type: !397, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !906, line: 248, type: !483, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !906, line: 254, type: !397, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !906, line: 254, type: !231, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !906, line: 254, type: !21, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !906, line: 259, type: !3, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !906, line: 259, type: !974, isLocal: true, isDefinition: true)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !975)
!975 = !{!976}
!976 = !DISubrange(count: 29)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !979, file: !980, line: 26, type: !982, isLocal: false, isDefinition: true)
!979 = distinct !DICompileUnit(language: DW_LANG_C11, file: !980, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !981, splitDebugInlining: false, nameTableKind: None)
!980 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!981 = !{!977}
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 376, elements: !556)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "exit_failure", scope: !985, file: !986, line: 24, type: !988, isLocal: false, isDefinition: true)
!985 = distinct !DICompileUnit(language: DW_LANG_C11, file: !986, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !987, splitDebugInlining: false, nameTableKind: None)
!986 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!987 = !{!983}
!988 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !991, line: 34, type: !428, isLocal: true, isDefinition: true)
!991 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !991, line: 34, type: !437, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !991, line: 34, type: !456, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !998, line: 80, type: !437, isLocal: true, isDefinition: true)
!998 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1001, file: !1002, line: 506, type: !133, isLocal: true, isDefinition: true)
!1001 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1002, file: !1002, line: 485, type: !1003, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1005, retainedNodes: !1007)
!1002 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!133, !133, !133}
!1005 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1002, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1006, splitDebugInlining: false, nameTableKind: None)
!1006 = !{!999}
!1007 = !{!1008, !1009, !1010, !1011, !1014}
!1008 = !DILocalVariable(name: "fd", arg: 1, scope: !1001, file: !1002, line: 485, type: !133)
!1009 = !DILocalVariable(name: "target", arg: 2, scope: !1001, file: !1002, line: 485, type: !133)
!1010 = !DILocalVariable(name: "result", scope: !1001, file: !1002, line: 487, type: !133)
!1011 = !DILocalVariable(name: "flags", scope: !1012, file: !1002, line: 530, type: !133)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !1002, line: 529, column: 5)
!1013 = distinct !DILexicalBlock(scope: !1001, file: !1002, line: 528, column: 7)
!1014 = !DILocalVariable(name: "saved_errno", scope: !1015, file: !1002, line: 533, type: !133)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !1002, line: 532, column: 9)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !1002, line: 531, column: 11)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !1019, line: 108, type: !209, isLocal: true, isDefinition: true)
!1019 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "internal_state", scope: !1022, file: !1019, line: 97, type: !1025, isLocal: true, isDefinition: true)
!1022 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1019, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1023, globals: !1024, splitDebugInlining: false, nameTableKind: None)
!1023 = !{!198, !200, !204}
!1024 = !{!1017, !1020}
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1027, file: !795, line: 15, baseType: !133, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1027, file: !795, line: 20, baseType: !1031, size: 32, offset: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1027, file: !795, line: 16, size: 32, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1031, file: !795, line: 18, baseType: !114, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1031, file: !795, line: 19, baseType: !415, size: 32)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 35, type: !26, isLocal: true, isDefinition: true)
!1037 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1038 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1039, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1040, globals: !1042, splitDebugInlining: false, nameTableKind: None)
!1039 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0871d6b54d956be5985a128a1aa50d97")
!1040 = !{!1041, !178}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!1042 = !{!1043}
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "buffer_length", scope: !1045, file: !1039, line: 83, type: !1109, isLocal: true, isDefinition: true)
!1045 = distinct !DISubprogram(name: "blake2b_stream", scope: !1039, file: !1039, line: 78, type: !1046, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1038, retainedNodes: !1082)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!133, !1048, !198, !200}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !352, line: 7, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !354, line: 49, size: 1728, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1050, file: !354, line: 51, baseType: !133, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1050, file: !354, line: 54, baseType: !197, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1050, file: !354, line: 55, baseType: !197, size: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1050, file: !354, line: 56, baseType: !197, size: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1050, file: !354, line: 57, baseType: !197, size: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1050, file: !354, line: 58, baseType: !197, size: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1050, file: !354, line: 59, baseType: !197, size: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1050, file: !354, line: 60, baseType: !197, size: 64, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1050, file: !354, line: 61, baseType: !197, size: 64, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1050, file: !354, line: 64, baseType: !197, size: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1050, file: !354, line: 65, baseType: !197, size: 64, offset: 640)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1050, file: !354, line: 66, baseType: !197, size: 64, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1050, file: !354, line: 68, baseType: !369, size: 64, offset: 768)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1050, file: !354, line: 70, baseType: !1066, size: 64, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1050, file: !354, line: 72, baseType: !133, size: 32, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1050, file: !354, line: 73, baseType: !133, size: 32, offset: 928)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1050, file: !354, line: 74, baseType: !376, size: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1050, file: !354, line: 77, baseType: !199, size: 16, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1050, file: !354, line: 78, baseType: !379, size: 8, offset: 1040)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1050, file: !354, line: 79, baseType: !209, size: 8, offset: 1048)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1050, file: !354, line: 81, baseType: !382, size: 64, offset: 1088)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1050, file: !354, line: 89, baseType: !385, size: 64, offset: 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1050, file: !354, line: 91, baseType: !387, size: 64, offset: 1216)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1050, file: !354, line: 92, baseType: !390, size: 64, offset: 1280)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1050, file: !354, line: 93, baseType: !1066, size: 64, offset: 1344)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1050, file: !354, line: 94, baseType: !198, size: 64, offset: 1408)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1050, file: !354, line: 95, baseType: !200, size: 64, offset: 1472)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1050, file: !354, line: 96, baseType: !133, size: 32, offset: 1536)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1050, file: !354, line: 98, baseType: !397, size: 160, offset: 1568)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1106, !1107, !1108}
!1083 = !DILocalVariable(name: "stream", arg: 1, scope: !1045, file: !1039, line: 78, type: !1048)
!1084 = !DILocalVariable(name: "resstream", arg: 2, scope: !1045, file: !1039, line: 78, type: !198)
!1085 = !DILocalVariable(name: "outbytes", arg: 3, scope: !1045, file: !1039, line: 78, type: !200)
!1086 = !DILocalVariable(name: "ret", scope: !1045, file: !1039, line: 80, type: !133)
!1087 = !DILocalVariable(name: "sum", scope: !1045, file: !1039, line: 81, type: !200)
!1088 = !DILocalVariable(name: "n", scope: !1045, file: !1039, line: 81, type: !200)
!1089 = !DILocalVariable(name: "S", scope: !1045, file: !1039, line: 82, type: !1090)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 1984, elements: !210)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !654, line: 71, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !654, line: 62, size: 1984, elements: !1093)
!1093 = !{!1094, !1096, !1098, !1099, !1103, !1104, !1105}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1092, file: !654, line: 64, baseType: !1095, size: 512)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 512, elements: !17)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1092, file: !654, line: 65, baseType: !1097, size: 128, offset: 512)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 128, elements: !297)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1092, file: !654, line: 66, baseType: !1097, size: 128, offset: 640)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1092, file: !654, line: 67, baseType: !1100, size: 1024, offset: 768)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 1024, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1092, file: !654, line: 68, baseType: !200, size: 64, offset: 1792)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !1092, file: !654, line: 69, baseType: !200, size: 64, offset: 1856)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !1092, file: !654, line: 70, baseType: !664, size: 8, offset: 1920)
!1106 = !DILocalVariable(name: "buffer", scope: !1045, file: !1039, line: 84, type: !1041)
!1107 = !DILabel(scope: !1045, name: "final_process", file: !1039, line: 117)
!1108 = !DILabel(scope: !1045, name: "cleanup_buffer", file: !1039, line: 123)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!1110 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1111, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1112, splitDebugInlining: false, nameTableKind: None)
!1111 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1112 = !{!187}
!1113 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1114, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1114 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1115 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1116, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1117, splitDebugInlining: false, nameTableKind: None)
!1116 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1117 = !{!198}
!1118 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1119, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1119 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1121, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1121 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1122 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1123, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1117, splitDebugInlining: false, nameTableKind: None)
!1123 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1125, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1125 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1127, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1127 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1128 = distinct !DICompileUnit(language: DW_LANG_C11, file: !906, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1129, retainedTypes: !1117, globals: !1133, splitDebugInlining: false, nameTableKind: None)
!1129 = !{!1130}
!1130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !906, line: 40, baseType: !114, size: 32, elements: !1131)
!1131 = !{!1132}
!1132 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1133 = !{!904, !907, !909, !911, !913, !915, !920, !925, !927, !932, !934, !939, !944, !946, !948, !953, !958, !960, !962, !964, !966, !968, !970, !972}
!1134 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1135, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1136, retainedTypes: !1164, splitDebugInlining: false, nameTableKind: None)
!1135 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1136 = !{!1137, !1149}
!1137 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1138, file: !1135, line: 188, baseType: !114, size: 32, elements: !1147)
!1138 = distinct !DISubprogram(name: "x2nrealloc", scope: !1135, file: !1135, line: 176, type: !1139, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1134, retainedNodes: !1142)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!198, !198, !1141, !200}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!1142 = !{!1143, !1144, !1145, !1146}
!1143 = !DILocalVariable(name: "p", arg: 1, scope: !1138, file: !1135, line: 176, type: !198)
!1144 = !DILocalVariable(name: "pn", arg: 2, scope: !1138, file: !1135, line: 176, type: !1141)
!1145 = !DILocalVariable(name: "s", arg: 3, scope: !1138, file: !1135, line: 176, type: !200)
!1146 = !DILocalVariable(name: "n", scope: !1138, file: !1135, line: 178, type: !200)
!1147 = !{!1148}
!1148 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1149 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1150, file: !1135, line: 228, baseType: !114, size: 32, elements: !1147)
!1150 = distinct !DISubprogram(name: "xpalloc", scope: !1135, file: !1135, line: 223, type: !1151, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1134, retainedNodes: !1154)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!198, !198, !1153, !311, !313, !311}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!1154 = !{!1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163}
!1155 = !DILocalVariable(name: "pa", arg: 1, scope: !1150, file: !1135, line: 223, type: !198)
!1156 = !DILocalVariable(name: "pn", arg: 2, scope: !1150, file: !1135, line: 223, type: !1153)
!1157 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1150, file: !1135, line: 223, type: !311)
!1158 = !DILocalVariable(name: "n_max", arg: 4, scope: !1150, file: !1135, line: 223, type: !313)
!1159 = !DILocalVariable(name: "s", arg: 5, scope: !1150, file: !1135, line: 223, type: !311)
!1160 = !DILocalVariable(name: "n0", scope: !1150, file: !1135, line: 230, type: !311)
!1161 = !DILocalVariable(name: "n", scope: !1150, file: !1135, line: 237, type: !311)
!1162 = !DILocalVariable(name: "nbytes", scope: !1150, file: !1135, line: 248, type: !311)
!1163 = !DILocalVariable(name: "adjusted_nbytes", scope: !1150, file: !1135, line: 252, type: !311)
!1164 = !{!197, !198, !308, !314, !178}
!1165 = distinct !DICompileUnit(language: DW_LANG_C11, file: !991, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1166, splitDebugInlining: false, nameTableKind: None)
!1166 = !{!989, !992, !994}
!1167 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1168, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1169, globals: !1170, splitDebugInlining: false, nameTableKind: None)
!1168 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!1169 = !{!166, !112}
!1170 = !{!996}
!1171 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1172, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1173, retainedTypes: !1174, splitDebugInlining: false, nameTableKind: None)
!1172 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1173 = !{!166}
!1174 = !{!308, !314, !178, !1175}
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !180, line: 101, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !182, line: 72, baseType: !314)
!1177 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1178, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1117, splitDebugInlining: false, nameTableKind: None)
!1178 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1179 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1180, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1180 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1181 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1182, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1183, splitDebugInlining: false, nameTableKind: None)
!1182 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1183 = !{!308, !178, !198}
!1184 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1037, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1185, splitDebugInlining: false, nameTableKind: None)
!1185 = !{!1186, !1035}
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 35, type: !296, isLocal: true, isDefinition: true)
!1188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1189, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1189 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1190 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1191, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1117, splitDebugInlining: false, nameTableKind: None)
!1191 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1192 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1193 = !{i32 7, !"Dwarf Version", i32 5}
!1194 = !{i32 2, !"Debug Info Version", i32 3}
!1195 = !{i32 1, !"wchar_size", i32 4}
!1196 = !{i32 8, !"PIC Level", i32 2}
!1197 = !{i32 7, !"PIE Level", i32 2}
!1198 = !{i32 7, !"uwtable", i32 2}
!1199 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 489, type: !1200, scopeLine: 490, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1202)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !133}
!1202 = !{!1203}
!1203 = !DILocalVariable(name: "status", arg: 1, scope: !1199, file: !2, line: 489, type: !133)
!1204 = !DILocation(line: 0, scope: !1199)
!1205 = !DILocation(line: 491, column: 14, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1199, file: !2, line: 491, column: 7)
!1207 = !DILocation(line: 491, column: 7, scope: !1199)
!1208 = !DILocation(line: 492, column: 5, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1206, file: !2, line: 492, column: 5)
!1210 = !{!1211, !1211, i64 0}
!1211 = !{!"any pointer", !1212, i64 0}
!1212 = !{!"omnipotent char", !1213, i64 0}
!1213 = !{!"Simple C/C++ TBAA"}
!1214 = !DILocation(line: 495, column: 7, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1206, file: !2, line: 494, column: 5)
!1216 = !DILocation(line: 514, column: 7, scope: !1215)
!1217 = !DILocation(line: 519, column: 7, scope: !1215)
!1218 = !DILocation(line: 729, column: 3, scope: !1219, inlinedAt: !1221)
!1219 = distinct !DISubprogram(name: "emit_stdin_note", scope: !132, file: !132, line: 727, type: !762, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1220)
!1220 = !{}
!1221 = distinct !DILocation(line: 524, column: 7, scope: !1215)
!1222 = !DILocation(line: 736, column: 3, scope: !1223, inlinedAt: !1224)
!1223 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !132, file: !132, line: 734, type: !762, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1220)
!1224 = distinct !DILocation(line: 536, column: 9, scope: !1215)
!1225 = !DILocation(line: 561, column: 9, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1215, file: !2, line: 555, column: 11)
!1227 = !DILocation(line: 568, column: 9, scope: !1215)
!1228 = !DILocation(line: 576, column: 9, scope: !1215)
!1229 = !DILocation(line: 605, column: 7, scope: !1215)
!1230 = !DILocation(line: 620, column: 9, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1215, file: !2, line: 614, column: 11)
!1232 = !DILocation(line: 627, column: 7, scope: !1215)
!1233 = !DILocation(line: 632, column: 7, scope: !1215)
!1234 = !DILocation(line: 636, column: 7, scope: !1215)
!1235 = !DILocation(line: 640, column: 7, scope: !1215)
!1236 = !DILocation(line: 644, column: 7, scope: !1215)
!1237 = !DILocation(line: 648, column: 7, scope: !1215)
!1238 = !DILocation(line: 652, column: 7, scope: !1215)
!1239 = !DILocation(line: 664, column: 7, scope: !1215)
!1240 = !DILocation(line: 665, column: 7, scope: !1215)
!1241 = !DILocation(line: 684, column: 7, scope: !1215)
!1242 = !DILocation(line: 687, column: 7, scope: !1215)
!1243 = !DILocalVariable(name: "program", arg: 1, scope: !1244, file: !132, line: 836, type: !202)
!1244 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !132, file: !132, line: 836, type: !1245, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1247)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !202}
!1247 = !{!1243, !1248, !1255, !1256, !1258, !1259}
!1248 = !DILocalVariable(name: "infomap", scope: !1244, file: !132, line: 838, type: !1249)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1250, size: 896, elements: !438)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1244, file: !132, line: 838, size: 128, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1251, file: !132, line: 838, baseType: !202, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1251, file: !132, line: 838, baseType: !202, size: 64, offset: 64)
!1255 = !DILocalVariable(name: "node", scope: !1244, file: !132, line: 848, type: !202)
!1256 = !DILocalVariable(name: "map_prog", scope: !1244, file: !132, line: 849, type: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1258 = !DILocalVariable(name: "lc_messages", scope: !1244, file: !132, line: 861, type: !202)
!1259 = !DILocalVariable(name: "url_program", scope: !1244, file: !132, line: 874, type: !202)
!1260 = !DILocation(line: 0, scope: !1244, inlinedAt: !1261)
!1261 = distinct !DILocation(line: 702, column: 7, scope: !1215)
!1262 = !DILocation(line: 857, column: 3, scope: !1244, inlinedAt: !1261)
!1263 = !DILocation(line: 861, column: 29, scope: !1244, inlinedAt: !1261)
!1264 = !DILocation(line: 862, column: 7, scope: !1265, inlinedAt: !1261)
!1265 = distinct !DILexicalBlock(scope: !1244, file: !132, line: 862, column: 7)
!1266 = !DILocation(line: 862, column: 19, scope: !1265, inlinedAt: !1261)
!1267 = !DILocation(line: 862, column: 22, scope: !1265, inlinedAt: !1261)
!1268 = !DILocation(line: 862, column: 7, scope: !1244, inlinedAt: !1261)
!1269 = !DILocation(line: 868, column: 7, scope: !1270, inlinedAt: !1261)
!1270 = distinct !DILexicalBlock(scope: !1265, file: !132, line: 863, column: 5)
!1271 = !DILocation(line: 870, column: 5, scope: !1270, inlinedAt: !1261)
!1272 = !DILocation(line: 875, column: 3, scope: !1244, inlinedAt: !1261)
!1273 = !DILocation(line: 877, column: 3, scope: !1244, inlinedAt: !1261)
!1274 = !DILocation(line: 705, column: 3, scope: !1199)
!1275 = !DISubprogram(name: "dcgettext", scope: !1276, file: !1276, line: 51, type: !1277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1220)
!1276 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!197, !202, !202, !133}
!1279 = !DISubprogram(name: "__fprintf_chk", scope: !1280, file: !1280, line: 93, type: !1281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1220)
!1280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!133, !1283, !133, !1284, null}
!1283 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !350)
!1284 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !202)
!1285 = !DISubprogram(name: "__printf_chk", scope: !1280, file: !1280, line: 95, type: !1286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1220)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!133, !133, !1284, null}
!1288 = !DISubprogram(name: "fputs_unlocked", scope: !1289, file: !1289, line: 691, type: !1290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1220)
!1289 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!133, !1284, !1283}
!1292 = !DILocation(line: 0, scope: !328)
!1293 = !DILocation(line: 581, column: 7, scope: !336)
!1294 = !{!1295, !1295, i64 0}
!1295 = !{!"int", !1212, i64 0}
!1296 = !DILocation(line: 581, column: 19, scope: !336)
!1297 = !DILocation(line: 581, column: 7, scope: !328)
!1298 = !DILocation(line: 585, column: 26, scope: !335)
!1299 = !DILocation(line: 0, scope: !335)
!1300 = !DILocation(line: 586, column: 23, scope: !335)
!1301 = !DILocation(line: 586, column: 28, scope: !335)
!1302 = !DILocation(line: 586, column: 32, scope: !335)
!1303 = !{!1212, !1212, i64 0}
!1304 = !DILocation(line: 586, column: 38, scope: !335)
!1305 = !DILocalVariable(name: "__s1", arg: 1, scope: !1306, file: !1307, line: 1359, type: !202)
!1306 = distinct !DISubprogram(name: "streq", scope: !1307, file: !1307, line: 1359, type: !1308, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1310)
!1307 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!308, !202, !202}
!1310 = !{!1305, !1311}
!1311 = !DILocalVariable(name: "__s2", arg: 2, scope: !1306, file: !1307, line: 1359, type: !202)
!1312 = !DILocation(line: 0, scope: !1306, inlinedAt: !1313)
!1313 = distinct !DILocation(line: 586, column: 41, scope: !335)
!1314 = !DILocation(line: 1361, column: 11, scope: !1306, inlinedAt: !1313)
!1315 = !DILocation(line: 1361, column: 10, scope: !1306, inlinedAt: !1313)
!1316 = !DILocation(line: 586, column: 19, scope: !335)
!1317 = !DILocation(line: 587, column: 5, scope: !335)
!1318 = !DILocation(line: 588, column: 7, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !328, file: !132, line: 588, column: 7)
!1320 = !DILocation(line: 588, column: 7, scope: !328)
!1321 = !DILocation(line: 590, column: 7, scope: !1322)
