; ModuleID = 'src/cat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"cat\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [47 x i8] c"  -A, --show-all           equivalent to -vET\0A\00", align 1, !dbg !22

!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 647, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 19)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 647, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 20)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 657, type: !157, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 2)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 699, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 3)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 736, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 30)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 821, type: !235, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !2, line: 826, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 23)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "infile", scope: !89, file: !2, line: 50, type: !151, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "input_desc", scope: !89, file: !2, line: 53, type: !86, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !92, line: 729, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 56)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !266, file: !92, line: 575, type: !86, isLocal: true, isDefinition: true)
!266 = distinct !DISubprogram(name: "oputs_", scope: !92, file: !92, line: 573, type: !267, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !269)
!267 = !DISubroutineType(cc: DW_CC_nocall, types: !268)
!268 = !{null, !151, !151}
!269 = !{!270, !271, !272, !275, !276, !277, !278, !282, !283, !284, !285, !287, !336, !337, !338, !340, !341}
!270 = !DILocalVariable(name: "program", arg: 1, scope: !266, file: !92, line: 573, type: !151)
!271 = !DILocalVariable(name: "option", arg: 2, scope: !266, file: !92, line: 573, type: !151)
!272 = !DILocalVariable(name: "term", scope: !273, file: !92, line: 585, type: !151)
!273 = distinct !DILexicalBlock(scope: !274, file: !92, line: 582, column: 5)
!274 = distinct !DILexicalBlock(scope: !266, file: !92, line: 581, column: 7)
!275 = !DILocalVariable(name: "double_space", scope: !266, file: !92, line: 594, type: !145)
!276 = !DILocalVariable(name: "first_word", scope: !266, file: !92, line: 595, type: !151)
!277 = !DILocalVariable(name: "option_text", scope: !266, file: !92, line: 596, type: !151)
!278 = !DILocalVariable(name: "s", scope: !279, file: !92, line: 608, type: !151)
!279 = distinct !DILexicalBlock(scope: !280, file: !92, line: 605, column: 5)
!280 = distinct !DILexicalBlock(scope: !281, file: !92, line: 604, column: 12)
!281 = distinct !DILexicalBlock(scope: !266, file: !92, line: 597, column: 7)
!282 = !DILocalVariable(name: "spaces", scope: !279, file: !92, line: 609, type: !149)
!283 = !DILocalVariable(name: "anchor_len", scope: !266, file: !92, line: 620, type: !149)
!284 = !DILocalVariable(name: "desc_text", scope: !266, file: !92, line: 625, type: !151)
!285 = !DILocalVariable(name: "__ptr", scope: !286, file: !92, line: 644, type: !151)
!286 = distinct !DILexicalBlock(scope: !266, file: !92, line: 644, column: 3)
!287 = !DILocalVariable(name: "__stream", scope: !286, file: !92, line: 644, type: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !290, line: 7, baseType: !291)
!290 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !292, line: 49, size: 1728, elements: !293)
!292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !309, !311, !312, !313, !316, !317, !319, !320, !323, !325, !328, !331, !332, !333, !334, !335}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !291, file: !292, line: 51, baseType: !86, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !291, file: !292, line: 54, baseType: !88, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !291, file: !292, line: 55, baseType: !88, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !291, file: !292, line: 56, baseType: !88, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !291, file: !292, line: 57, baseType: !88, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !291, file: !292, line: 58, baseType: !88, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !291, file: !292, line: 59, baseType: !88, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !291, file: !292, line: 60, baseType: !88, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !291, file: !292, line: 61, baseType: !88, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !291, file: !292, line: 64, baseType: !88, size: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !291, file: !292, line: 65, baseType: !88, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !291, file: !292, line: 66, baseType: !88, size: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !291, file: !292, line: 68, baseType: !307, size: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !292, line: 36, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !291, file: !292, line: 70, baseType: !310, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !291, file: !292, line: 72, baseType: !86, size: 32, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !291, file: !292, line: 73, baseType: !86, size: 32, offset: 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !291, file: !292, line: 74, baseType: !314, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !315, line: 152, baseType: !146)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !291, file: !292, line: 77, baseType: !148, size: 16, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !291, file: !292, line: 78, baseType: !318, size: 8, offset: 1040)
!318 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !291, file: !292, line: 79, baseType: !199, size: 8, offset: 1048)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !291, file: !292, line: 81, baseType: !321, size: 64, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !292, line: 43, baseType: null)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !291, file: !292, line: 89, baseType: !324, size: 64, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !315, line: 153, baseType: !146)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !291, file: !292, line: 91, baseType: !326, size: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !292, line: 37, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !291, file: !292, line: 92, baseType: !329, size: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !292, line: 38, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !291, file: !292, line: 93, baseType: !310, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !291, file: !292, line: 94, baseType: !144, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !291, file: !292, line: 95, baseType: !149, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !291, file: !292, line: 96, baseType: !86, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !291, file: !292, line: 98, baseType: !228, size: 160, offset: 1568)
!336 = !DILocalVariable(name: "__cnt", scope: !286, file: !92, line: 644, type: !149)
!337 = !DILocalVariable(name: "url_program", scope: !266, file: !92, line: 648, type: !151)
!338 = !DILocalVariable(name: "__ptr", scope: !339, file: !92, line: 686, type: !151)
!339 = distinct !DILexicalBlock(scope: !266, file: !92, line: 686, column: 3)
!340 = !DILocalVariable(name: "__stream", scope: !339, file: !92, line: 686, type: !288)
!341 = !DILocalVariable(name: "__cnt", scope: !339, file: !92, line: 686, type: !149)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !92, line: 585, type: !189, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !92, line: 586, type: !189, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !92, line: 595, type: !19, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !92, line: 620, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 6)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !235, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !189, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !19, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !240, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !92, line: 650, type: !189, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !92, line: 652, type: !162, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !92, line: 653, type: !194, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !92, line: 654, type: !177, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !92, line: 655, type: !177, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !92, line: 656, type: !177, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !92, line: 657, type: !177, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !92, line: 663, type: !162, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !92, line: 664, type: !177, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !172, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 40)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 15)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 61)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !92, line: 679, type: !240, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !92, line: 683, type: !189, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !92, line: 688, type: !189, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !92, line: 691, type: !194, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !92, line: 839, type: !157, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !92, line: 840, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 22)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !92, line: 841, type: !392, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !92, line: 862, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !92, line: 868, type: !29, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !92, line: 875, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 27)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 51)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 12)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 312, type: !412, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "newlines2", scope: !89, file: !2, line: 77, type: !86, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "line_num_end", scope: !89, file: !2, line: 74, type: !88, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "line_num_start", scope: !89, file: !2, line: 71, type: !88, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "line_buf", scope: !89, file: !2, line: 59, type: !228, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "line_num_print", scope: !89, file: !2, line: 68, type: !88, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "pending_cr", scope: !89, file: !2, line: 80, type: !145, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !92, line: 952, type: !433, isLocal: true, isDefinition: true)
!452 = !{!453, !454, !455, !456, !491, !492, !493, !494, !495, !496, !497, !498, !499, !503, !504, !505, !506, !507, !508, !510, !511, !512, !517, !520, !521, !524, !526, !527}
!453 = !DILocalVariable(name: "argc", arg: 1, scope: !83, file: !2, line: 550, type: !86)
!454 = !DILocalVariable(name: "argv", arg: 2, scope: !83, file: !2, line: 550, type: !87)
!455 = !DILocalVariable(name: "have_read_stdin", scope: !83, file: !2, line: 553, type: !145)
!456 = !DILocalVariable(name: "ostat_buf", scope: !83, file: !2, line: 555, type: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !458, line: 26, size: 1152, elements: !459)
!458 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!459 = !{!460, !462, !464, !466, !468, !470, !472, !473, !474, !475, !477, !479, !487, !488, !489}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !457, file: !458, line: 31, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !315, line: 145, baseType: !147)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !457, file: !458, line: 36, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !315, line: 148, baseType: !147)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !457, file: !458, line: 44, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !315, line: 151, baseType: !147)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !457, file: !458, line: 45, baseType: !467, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !315, line: 150, baseType: !98)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !457, file: !458, line: 47, baseType: !469, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !315, line: 146, baseType: !98)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !457, file: !458, line: 48, baseType: !471, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !315, line: 147, baseType: !98)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !457, file: !458, line: 50, baseType: !86, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !457, file: !458, line: 52, baseType: !461, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !457, file: !458, line: 57, baseType: !314, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !457, file: !458, line: 61, baseType: !476, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !315, line: 175, baseType: !146)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !457, file: !458, line: 63, baseType: !478, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !315, line: 180, baseType: !146)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !457, file: !458, line: 74, baseType: !480, size: 128, offset: 576)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !481, line: 11, size: 128, elements: !482)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!482 = !{!483, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !480, file: !481, line: 16, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !315, line: 160, baseType: !146)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !480, file: !481, line: 21, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !315, line: 197, baseType: !146)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !457, file: !458, line: 75, baseType: !480, size: 128, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !457, file: !458, line: 76, baseType: !480, size: 128, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !457, file: !458, line: 89, baseType: !490, size: 192, offset: 960)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 192, elements: !241)
!491 = !DILocalVariable(name: "number", scope: !83, file: !2, line: 558, type: !145)
!492 = !DILocalVariable(name: "number_nonblank", scope: !83, file: !2, line: 559, type: !145)
!493 = !DILocalVariable(name: "squeeze_blank", scope: !83, file: !2, line: 560, type: !145)
!494 = !DILocalVariable(name: "show_ends", scope: !83, file: !2, line: 561, type: !145)
!495 = !DILocalVariable(name: "show_nonprinting", scope: !83, file: !2, line: 562, type: !145)
!496 = !DILocalVariable(name: "show_tabs", scope: !83, file: !2, line: 563, type: !145)
!497 = !DILocalVariable(name: "file_open_mode", scope: !83, file: !2, line: 564, type: !86)
!498 = !DILocalVariable(name: "c", scope: !83, file: !2, line: 594, type: !86)
!499 = !DILocalVariable(name: "outsize", scope: !83, file: !2, line: 660, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !501, line: 130, baseType: !502)
!501 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !150, line: 35, baseType: !146)
!503 = !DILocalVariable(name: "out_flags", scope: !83, file: !2, line: 663, type: !86)
!504 = !DILocalVariable(name: "out_isreg", scope: !83, file: !2, line: 666, type: !145)
!505 = !DILocalVariable(name: "argind", scope: !83, file: !2, line: 677, type: !86)
!506 = !DILocalVariable(name: "ok", scope: !83, file: !2, line: 678, type: !145)
!507 = !DILocalVariable(name: "page_size", scope: !83, file: !2, line: 679, type: !500)
!508 = !DILocalVariable(name: "reading_stdin", scope: !509, file: !2, line: 686, type: !145)
!509 = distinct !DILexicalBlock(scope: !83, file: !2, line: 682, column: 5)
!510 = !DILocalVariable(name: "istat_buf", scope: !509, file: !2, line: 705, type: !457)
!511 = !DILocalVariable(name: "insize", scope: !509, file: !2, line: 714, type: !500)
!512 = !DILocalVariable(name: "in_pos", scope: !513, file: !2, line: 727, type: !515)
!513 = distinct !DILexicalBlock(scope: !514, file: !2, line: 726, column: 9)
!514 = distinct !DILexicalBlock(scope: !509, file: !2, line: 722, column: 11)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !516, line: 63, baseType: !314)
!516 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!517 = !DILocalVariable(name: "whence", scope: !518, file: !2, line: 732, type: !86)
!518 = distinct !DILexicalBlock(scope: !519, file: !2, line: 729, column: 13)
!519 = distinct !DILexicalBlock(scope: !513, file: !2, line: 728, column: 15)
!520 = !DILocalVariable(name: "inbuf", scope: !509, file: !2, line: 745, type: !88)
!521 = !DILocalVariable(name: "copy_cat_status", scope: !522, file: !2, line: 754, type: !86)
!522 = distinct !DILexicalBlock(scope: !523, file: !2, line: 753, column: 9)
!523 = distinct !DILexicalBlock(scope: !509, file: !2, line: 751, column: 11)
!524 = !DILocalVariable(name: "bufsize", scope: !525, file: !2, line: 794, type: !500)
!525 = distinct !DILexicalBlock(scope: !523, file: !2, line: 769, column: 9)
!526 = !DILocalVariable(name: "outbuf", scope: !525, file: !2, line: 799, type: !88)
!527 = !DILabel(scope: !509, name: "contin", file: !2, line: 810)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 2560, elements: !178)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !531, line: 50, size: 256, elements: !532)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!532 = !{!533, !534, !535, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !531, line: 52, baseType: !151, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !530, file: !531, line: 55, baseType: !86, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !531, line: 56, baseType: !536, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !530, file: !531, line: 57, baseType: !86, size: 32, offset: 192)
!538 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !541, line: 3, type: !392, isLocal: true, isDefinition: true)
!541 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "Version", scope: !544, file: !541, line: 3, type: !151, isLocal: false, isDefinition: true)
!544 = distinct !DICompileUnit(language: DW_LANG_C11, file: !541, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !545, splitDebugInlining: false, nameTableKind: None)
!545 = !{!539, !542}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "file_name", scope: !548, file: !549, line: 45, type: !151, isLocal: true, isDefinition: true)
!548 = distinct !DICompileUnit(language: DW_LANG_C11, file: !549, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !550, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!550 = !{!551, !553, !555, !557, !546, !559}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !549, line: 121, type: !162, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !549, line: 121, type: !433, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !549, line: 123, type: !162, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !549, line: 126, type: !240, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !548, file: !549, line: 55, type: !145, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !563, file: !564, line: 66, type: !610, isLocal: false, isDefinition: true)
!563 = distinct !DICompileUnit(language: DW_LANG_C11, file: !564, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !565, globals: !566, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!565 = !{!144, !153}
!566 = !{!567, !569, !589, !591, !593, !595, !561, !597, !599, !601, !603, !608}
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !564, line: 272, type: !189, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "old_file_name", scope: !571, file: !564, line: 304, type: !151, isLocal: true, isDefinition: true)
!571 = distinct !DISubprogram(name: "verror_at_line", scope: !564, file: !564, line: 298, type: !572, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !563, retainedNodes: !582)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !86, !86, !151, !98, !151, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !576)
!576 = !{!577, !579, !580, !581}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !575, file: !578, baseType: !98, size: 32)
!578 = !DIFile(filename: "lib/error.c", directory: "/src")
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !575, file: !578, baseType: !98, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !575, file: !578, baseType: !144, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !575, file: !578, baseType: !144, size: 64, offset: 128)
!582 = !{!583, !584, !585, !586, !587, !588}
!583 = !DILocalVariable(name: "status", arg: 1, scope: !571, file: !564, line: 298, type: !86)
!584 = !DILocalVariable(name: "errnum", arg: 2, scope: !571, file: !564, line: 298, type: !86)
!585 = !DILocalVariable(name: "file_name", arg: 3, scope: !571, file: !564, line: 298, type: !151)
!586 = !DILocalVariable(name: "line_number", arg: 4, scope: !571, file: !564, line: 298, type: !98)
!587 = !DILocalVariable(name: "message", arg: 5, scope: !571, file: !564, line: 298, type: !151)
!588 = !DILocalVariable(name: "args", arg: 6, scope: !571, file: !564, line: 298, type: !574)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "old_line_number", scope: !571, file: !564, line: 305, type: !98, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !564, line: 338, type: !19, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !564, line: 346, type: !194, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !564, line: 346, type: !235, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "error_message_count", scope: !563, file: !564, line: 69, type: !98, isLocal: false, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !563, file: !564, line: 295, type: !86, isLocal: false, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !564, line: 208, type: !162, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !564, line: 208, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 21)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !564, line: 214, type: !189, isLocal: true, isDefinition: true)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !615, file: !616, line: 506, type: !86, isLocal: true, isDefinition: true)
!615 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !616, file: !616, line: 485, type: !617, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !619, retainedNodes: !621)
!616 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!617 = !DISubroutineType(types: !618)
!618 = !{!86, !86, !86}
!619 = distinct !DICompileUnit(language: DW_LANG_C11, file: !616, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !620, splitDebugInlining: false, nameTableKind: None)
!620 = !{!613}
!621 = !{!622, !623, !624, !625, !628}
!622 = !DILocalVariable(name: "fd", arg: 1, scope: !615, file: !616, line: 485, type: !86)
!623 = !DILocalVariable(name: "target", arg: 2, scope: !615, file: !616, line: 485, type: !86)
!624 = !DILocalVariable(name: "result", scope: !615, file: !616, line: 487, type: !86)
!625 = !DILocalVariable(name: "flags", scope: !626, file: !616, line: 530, type: !86)
!626 = distinct !DILexicalBlock(scope: !627, file: !616, line: 529, column: 5)
!627 = distinct !DILexicalBlock(scope: !615, file: !616, line: 528, column: 7)
!628 = !DILocalVariable(name: "saved_errno", scope: !629, file: !616, line: 533, type: !86)
!629 = distinct !DILexicalBlock(scope: !630, file: !616, line: 532, column: 9)
!630 = distinct !DILexicalBlock(scope: !626, file: !616, line: 531, column: 11)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "program_name", scope: !633, file: !634, line: 31, type: !151, isLocal: false, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C11, file: !634, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, globals: !636, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!635 = !{!88}
!636 = !{!631, !637, !639}
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !634, line: 46, type: !194, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !634, line: 49, type: !19, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "utf07FF", scope: !643, file: !644, line: 46, type: !671, isLocal: true, isDefinition: true)
!643 = distinct !DISubprogram(name: "proper_name_lite", scope: !644, file: !644, line: 38, type: !645, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !647, retainedNodes: !649)
!644 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!645 = !DISubroutineType(types: !646)
!646 = !{!151, !151, !151}
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !648, splitDebugInlining: false, nameTableKind: None)
!648 = !{!641}
!649 = !{!650, !651, !652, !653, !658}
!650 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !643, file: !644, line: 38, type: !151)
!651 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !643, file: !644, line: 38, type: !151)
!652 = !DILocalVariable(name: "translation", scope: !643, file: !644, line: 40, type: !151)
!653 = !DILocalVariable(name: "w", scope: !643, file: !644, line: 47, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !655, line: 37, baseType: !656)
!655 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !315, line: 57, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !315, line: 42, baseType: !98)
!658 = !DILocalVariable(name: "mbs", scope: !643, file: !644, line: 48, type: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !660, line: 6, baseType: !661)
!660 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !662, line: 21, baseType: !663)
!662 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 13, size: 64, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !663, file: !662, line: 15, baseType: !86, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !663, file: !662, line: 20, baseType: !667, size: 32, offset: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !662, line: 16, size: 32, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !667, file: !662, line: 18, baseType: !98, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !667, file: !662, line: 19, baseType: !19, size: 32)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16, elements: !236)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !674, line: 78, type: !194, isLocal: true, isDefinition: true)
!674 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !674, line: 79, type: !350, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !674, line: 80, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 13)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !674, line: 81, type: !679, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !674, line: 82, type: !228, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !674, line: 83, type: !235, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !674, line: 84, type: !194, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !674, line: 85, type: !162, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !674, line: 86, type: !162, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !674, line: 87, type: !194, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !698, file: !674, line: 76, type: !770, isLocal: false, isDefinition: true)
!698 = distinct !DICompileUnit(language: DW_LANG_C11, file: !674, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !699, retainedTypes: !705, globals: !706, splitDebugInlining: false, nameTableKind: None)
!699 = !{!96, !700, !120}
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !97, line: 254, baseType: !98, size: 32, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!703 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!704 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!705 = !{!86, !148, !149}
!706 = !{!672, !675, !677, !682, !684, !686, !688, !690, !692, !694, !696, !707, !711, !721, !723, !728, !730, !732, !734, !736, !759, !766, !768}
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !698, file: !674, line: 92, type: !709, isLocal: false, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 320, elements: !178)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !698, file: !674, line: 1040, type: !713, isLocal: false, isDefinition: true)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !674, line: 56, size: 448, elements: !714)
!714 = !{!715, !716, !717, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !713, file: !674, line: 59, baseType: !96, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !713, file: !674, line: 62, baseType: !86, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !713, file: !674, line: 66, baseType: !718, size: 256, offset: 64)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !195)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !713, file: !674, line: 69, baseType: !151, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !713, file: !674, line: 72, baseType: !151, size: 64, offset: 384)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !698, file: !674, line: 107, type: !713, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "slot0", scope: !698, file: !674, line: 831, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 256)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !674, line: 321, type: !235, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !674, line: 357, type: !235, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !674, line: 358, type: !235, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !674, line: 199, type: !162, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "quote", scope: !738, file: !674, line: 228, type: !757, isLocal: true, isDefinition: true)
!738 = distinct !DISubprogram(name: "gettext_quote", scope: !674, file: !674, line: 197, type: !739, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !698, retainedNodes: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!151, !151, !96}
!741 = !{!742, !743, !744, !745, !746}
!742 = !DILocalVariable(name: "msgid", arg: 1, scope: !738, file: !674, line: 197, type: !151)
!743 = !DILocalVariable(name: "s", arg: 2, scope: !738, file: !674, line: 197, type: !96)
!744 = !DILocalVariable(name: "translation", scope: !738, file: !674, line: 199, type: !151)
!745 = !DILocalVariable(name: "w", scope: !738, file: !674, line: 229, type: !654)
!746 = !DILocalVariable(name: "mbs", scope: !738, file: !674, line: 230, type: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !660, line: 6, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !662, line: 21, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 13, size: 64, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !749, file: !662, line: 15, baseType: !86, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !749, file: !662, line: 20, baseType: !753, size: 32, offset: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !749, file: !662, line: 16, size: 32, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !753, file: !662, line: 18, baseType: !98, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !753, file: !662, line: 19, baseType: !19, size: 32)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !758)
!758 = !{!237, !21}
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "slotvec", scope: !698, file: !674, line: 834, type: !761, isLocal: true, isDefinition: true)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !674, line: 823, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !762, file: !674, line: 825, baseType: !149, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !762, file: !674, line: 826, baseType: !88, size: 64, offset: 64)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "nslots", scope: !698, file: !674, line: 832, type: !86, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "slotvec0", scope: !698, file: !674, line: 833, type: !762, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 704, elements: !212)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !774, line: 67, type: !433, isLocal: true, isDefinition: true)
!774 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !774, line: 69, type: !162, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !774, line: 83, type: !162, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !774, line: 83, type: !19, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !774, line: 85, type: !235, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !774, line: 88, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 171)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !774, line: 88, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 34)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !774, line: 105, type: !157, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !774, line: 109, type: !252, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !774, line: 113, type: !799, isLocal: true, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 28)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !774, line: 120, type: !804, isLocal: true, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 32)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !774, line: 127, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 36)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !774, line: 134, type: !387, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !774, line: 142, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 44)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !774, line: 150, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 48)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !774, line: 159, type: !44, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !774, line: 170, type: !828, isLocal: true, isDefinition: true)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 60)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !774, line: 248, type: !228, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !774, line: 248, type: !412, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !774, line: 254, type: !228, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !774, line: 254, type: !167, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !774, line: 254, type: !387, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !774, line: 259, type: !3, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !774, line: 259, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 29)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !850, file: !851, line: 26, type: !853, isLocal: false, isDefinition: true)
!850 = distinct !DICompileUnit(language: DW_LANG_C11, file: !851, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !852, splitDebugInlining: false, nameTableKind: None)
!851 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!852 = !{!848}
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 376, elements: !25)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "exit_failure", scope: !856, file: !857, line: 24, type: !859, isLocal: false, isDefinition: true)
!856 = distinct !DICompileUnit(language: DW_LANG_C11, file: !857, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !858, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!858 = !{!854}
!859 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !862, line: 34, type: !240, isLocal: true, isDefinition: true)
!862 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !862, line: 34, type: !162, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !862, line: 34, type: !172, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !869, line: 108, type: !199, isLocal: true, isDefinition: true)
!869 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "internal_state", scope: !872, file: !869, line: 97, type: !875, isLocal: true, isDefinition: true)
!872 = distinct !DICompileUnit(language: DW_LANG_C11, file: !869, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !873, globals: !874, splitDebugInlining: false, nameTableKind: None)
!873 = !{!144, !149, !153}
!874 = !{!867, !870}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !660, line: 6, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !662, line: 21, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 13, size: 64, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !877, file: !662, line: 15, baseType: !86, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !877, file: !662, line: 20, baseType: !881, size: 32, offset: 32)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !877, file: !662, line: 16, size: 32, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !881, file: !662, line: 18, baseType: !98, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !881, file: !662, line: 19, baseType: !19, size: 32)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !887, line: 35, type: !350, isLocal: true, isDefinition: true)
!887 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!888 = distinct !DICompileUnit(language: DW_LANG_C11, file: !889, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !890, splitDebugInlining: false, nameTableKind: None)
!889 = !DIFile(filename: "lib/copy-file-range.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6733a97916f50c6b003a01ea6f4c9f0a")
!890 = !{!139}
!891 = distinct !DICompileUnit(language: DW_LANG_C11, file: !892, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !893, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!893 = !{!111}
!894 = distinct !DICompileUnit(language: DW_LANG_C11, file: !895, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!896 = distinct !DICompileUnit(language: DW_LANG_C11, file: !897, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !898, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!898 = !{!151}
!899 = distinct !DICompileUnit(language: DW_LANG_C11, file: !900, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!900 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!901 = distinct !DICompileUnit(language: DW_LANG_C11, file: !902, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !890, retainedTypes: !903, splitDebugInlining: false, nameTableKind: None)
!902 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!903 = !{!149}
!904 = distinct !DICompileUnit(language: DW_LANG_C11, file: !774, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !905, retainedTypes: !909, globals: !910, splitDebugInlining: false, nameTableKind: None)
!905 = !{!906}
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !774, line: 40, baseType: !98, size: 32, elements: !907)
!907 = !{!908}
!908 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!909 = !{!144}
!910 = !{!772, !775, !777, !779, !781, !783, !788, !793, !795, !797, !802, !807, !812, !814, !819, !824, !826, !831, !833, !835, !837, !839, !841, !843}
!911 = distinct !DICompileUnit(language: DW_LANG_C11, file: !912, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !903, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "lib/xalignalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3b950fafb945919ba44141bc7f11141c")
!913 = distinct !DICompileUnit(language: DW_LANG_C11, file: !914, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !915, retainedTypes: !943, splitDebugInlining: false, nameTableKind: None)
!914 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!915 = !{!916, !928}
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !917, file: !914, line: 188, baseType: !98, size: 32, elements: !926)
!917 = distinct !DISubprogram(name: "x2nrealloc", scope: !914, file: !914, line: 176, type: !918, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !913, retainedNodes: !921)
!918 = !DISubroutineType(types: !919)
!919 = !{!144, !144, !920, !149}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!921 = !{!922, !923, !924, !925}
!922 = !DILocalVariable(name: "p", arg: 1, scope: !917, file: !914, line: 176, type: !144)
!923 = !DILocalVariable(name: "pn", arg: 2, scope: !917, file: !914, line: 176, type: !920)
!924 = !DILocalVariable(name: "s", arg: 3, scope: !917, file: !914, line: 176, type: !149)
!925 = !DILocalVariable(name: "n", scope: !917, file: !914, line: 178, type: !149)
!926 = !{!927}
!927 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !929, file: !914, line: 228, baseType: !98, size: 32, elements: !926)
!929 = distinct !DISubprogram(name: "xpalloc", scope: !914, file: !914, line: 223, type: !930, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !913, retainedNodes: !933)
!930 = !DISubroutineType(types: !931)
!931 = !{!144, !144, !932, !500, !502, !500}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942}
!934 = !DILocalVariable(name: "pa", arg: 1, scope: !929, file: !914, line: 223, type: !144)
!935 = !DILocalVariable(name: "pn", arg: 2, scope: !929, file: !914, line: 223, type: !932)
!936 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !929, file: !914, line: 223, type: !500)
!937 = !DILocalVariable(name: "n_max", arg: 4, scope: !929, file: !914, line: 223, type: !502)
!938 = !DILocalVariable(name: "s", arg: 5, scope: !929, file: !914, line: 223, type: !500)
!939 = !DILocalVariable(name: "n0", scope: !929, file: !914, line: 230, type: !500)
!940 = !DILocalVariable(name: "n", scope: !929, file: !914, line: 237, type: !500)
!941 = !DILocalVariable(name: "nbytes", scope: !929, file: !914, line: 248, type: !500)
!942 = !DILocalVariable(name: "adjusted_nbytes", scope: !929, file: !914, line: 252, type: !500)
!943 = !{!88, !144, !145, !146, !147}
!944 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !945, splitDebugInlining: false, nameTableKind: None)
!945 = !{!860, !863, !865}
!946 = distinct !DICompileUnit(language: DW_LANG_C11, file: !947, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!947 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!948 = distinct !DICompileUnit(language: DW_LANG_C11, file: !949, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!950 = distinct !DICompileUnit(language: DW_LANG_C11, file: !951, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !909, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!952 = distinct !DICompileUnit(language: DW_LANG_C11, file: !953, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !909, splitDebugInlining: false, nameTableKind: None)
!953 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!954 = distinct !DICompileUnit(language: DW_LANG_C11, file: !955, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !956, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!956 = !{!145, !147, !144}
!957 = distinct !DICompileUnit(language: DW_LANG_C11, file: !887, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !958, splitDebugInlining: false, nameTableKind: None)
!958 = !{!959, !885}
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !887, line: 35, type: !235, isLocal: true, isDefinition: true)
!961 = distinct !DICompileUnit(language: DW_LANG_C11, file: !962, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!963 = distinct !DICompileUnit(language: DW_LANG_C11, file: !964, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !909, splitDebugInlining: false, nameTableKind: None)
!964 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!965 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!966 = !{i32 7, !"Dwarf Version", i32 5}
!967 = !{i32 2, !"Debug Info Version", i32 3}
!968 = !{i32 1, !"wchar_size", i32 4}
!969 = !{i32 8, !"PIC Level", i32 2}
!970 = !{i32 7, !"PIE Level", i32 2}
!971 = !{i32 7, !"uwtable", i32 2}
!972 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 83, type: !973, scopeLine: 84, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !86}
!975 = !{!976}
!976 = !DILocalVariable(name: "status", arg: 1, scope: !972, file: !2, line: 83, type: !86)
!977 = !DILocation(line: 0, scope: !972)
!978 = !DILocation(line: 85, column: 14, scope: !979)
!979 = distinct !DILexicalBlock(scope: !972, file: !2, line: 85, column: 7)
!980 = !DILocation(line: 85, column: 7, scope: !972)
!981 = !DILocation(line: 86, column: 5, scope: !982)
!982 = distinct !DILexicalBlock(scope: !979, file: !2, line: 86, column: 5)
!983 = !{!984, !984, i64 0}
!984 = !{!"any pointer", !985, i64 0}
!985 = !{!"omnipotent char", !986, i64 0}
!986 = !{!"Simple C/C++ TBAA"}
!987 = !DILocation(line: 89, column: 7, scope: !988)
!988 = distinct !DILexicalBlock(scope: !979, file: !2, line: 88, column: 5)
!989 = !DILocation(line: 93, column: 7, scope: !988)
!990 = !DILocation(line: 729, column: 3, scope: !991, inlinedAt: !993)
!991 = distinct !DISubprogram(name: "emit_stdin_note", scope: !92, file: !92, line: 727, type: !611, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !992)
!992 = !{}
!993 = distinct !DILocation(line: 97, column: 7, scope: !988)
!994 = !DILocation(line: 99, column: 7, scope: !988)
!995 = !DILocation(line: 102, column: 7, scope: !988)
!996 = !DILocation(line: 105, column: 7, scope: !988)
!997 = !DILocation(line: 108, column: 7, scope: !988)
!998 = !DILocation(line: 111, column: 7, scope: !988)
!999 = !DILocation(line: 114, column: 7, scope: !988)
!1000 = !DILocation(line: 117, column: 7, scope: !988)
!1001 = !DILocation(line: 120, column: 7, scope: !988)
!1002 = !DILocation(line: 123, column: 7, scope: !988)
!1003 = !DILocation(line: 126, column: 7, scope: !988)
!1004 = !DILocation(line: 129, column: 7, scope: !988)
!1005 = !DILocation(line: 130, column: 7, scope: !988)
!1006 = !DILocation(line: 131, column: 7, scope: !988)
!1007 = !DILocalVariable(name: "program", arg: 1, scope: !1008, file: !92, line: 836, type: !151)
!1008 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !92, file: !92, line: 836, type: !1009, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1011)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !151}
!1011 = !{!1007, !1012, !1019, !1020, !1022, !1023}
!1012 = !DILocalVariable(name: "infomap", scope: !1008, file: !92, line: 838, type: !1013)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 896, elements: !163)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1008, file: !92, line: 838, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1015, file: !92, line: 838, baseType: !151, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1015, file: !92, line: 838, baseType: !151, size: 64, offset: 64)
!1019 = !DILocalVariable(name: "node", scope: !1008, file: !92, line: 848, type: !151)
!1020 = !DILocalVariable(name: "map_prog", scope: !1008, file: !92, line: 849, type: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1022 = !DILocalVariable(name: "lc_messages", scope: !1008, file: !92, line: 861, type: !151)
!1023 = !DILocalVariable(name: "url_program", scope: !1008, file: !92, line: 874, type: !151)
!1024 = !DILocation(line: 0, scope: !1008, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 138, column: 7, scope: !988)
!1026 = !DILocation(line: 857, column: 3, scope: !1008, inlinedAt: !1025)
!1027 = !DILocation(line: 861, column: 29, scope: !1008, inlinedAt: !1025)
!1028 = !DILocation(line: 862, column: 7, scope: !1029, inlinedAt: !1025)
!1029 = distinct !DILexicalBlock(scope: !1008, file: !92, line: 862, column: 7)
!1030 = !DILocation(line: 862, column: 19, scope: !1029, inlinedAt: !1025)
!1031 = !DILocation(line: 862, column: 22, scope: !1029, inlinedAt: !1025)
!1032 = !DILocation(line: 862, column: 7, scope: !1008, inlinedAt: !1025)
!1033 = !DILocation(line: 868, column: 7, scope: !1034, inlinedAt: !1025)
!1034 = distinct !DILexicalBlock(scope: !1029, file: !92, line: 863, column: 5)
!1035 = !DILocation(line: 870, column: 5, scope: !1034, inlinedAt: !1025)
!1036 = !DILocation(line: 875, column: 3, scope: !1008, inlinedAt: !1025)
!1037 = !DILocation(line: 877, column: 3, scope: !1008, inlinedAt: !1025)
!1038 = !DILocation(line: 140, column: 3, scope: !972)
!1039 = !DISubprogram(name: "dcgettext", scope: !1040, file: !1040, line: 51, type: !1041, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1040 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!88, !151, !151, !86}
!1043 = !DISubprogram(name: "__fprintf_chk", scope: !1044, file: !1044, line: 93, type: !1045, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1044 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!86, !1047, !86, !1048, null}
!1047 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !288)
!1048 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!1049 = !DISubprogram(name: "__printf_chk", scope: !1044, file: !1044, line: 95, type: !1050, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!86, !86, !1048, null}
!1052 = !DISubprogram(name: "fputs_unlocked", scope: !516, file: !516, line: 691, type: !1053, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!86, !1048, !1047}
!1055 = !DILocation(line: 0, scope: !266)
!1056 = !DILocation(line: 581, column: 7, scope: !274)
!1057 = !{!1058, !1058, i64 0}
!1058 = !{!"int", !985, i64 0}
!1059 = !DILocation(line: 581, column: 19, scope: !274)
!1060 = !DILocation(line: 581, column: 7, scope: !266)
!1061 = !DILocation(line: 585, column: 26, scope: !273)
!1062 = !DILocation(line: 0, scope: !273)
!1063 = !DILocation(line: 586, column: 23, scope: !273)
!1064 = !DILocation(line: 586, column: 28, scope: !273)
!1065 = !DILocation(line: 586, column: 32, scope: !273)
!1066 = !{!985, !985, i64 0}
!1067 = !DILocation(line: 586, column: 38, scope: !273)
!1068 = !DILocalVariable(name: "__s1", arg: 1, scope: !1069, file: !1070, line: 1359, type: !151)
!1069 = distinct !DISubprogram(name: "streq", scope: !1070, file: !1070, line: 1359, type: !1071, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1073)
!1070 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!145, !151, !151}
!1073 = !{!1068, !1074}
!1074 = !DILocalVariable(name: "__s2", arg: 2, scope: !1069, file: !1070, line: 1359, type: !151)
!1075 = !DILocation(line: 0, scope: !1069, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 586, column: 41, scope: !273)
!1077 = !DILocation(line: 1361, column: 11, scope: !1069, inlinedAt: !1076)
!1078 = !DILocation(line: 1361, column: 10, scope: !1069, inlinedAt: !1076)
!1079 = !DILocation(line: 586, column: 19, scope: !273)
!1080 = !DILocation(line: 587, column: 5, scope: !273)
!1081 = !DILocation(line: 588, column: 7, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !266, file: !92, line: 588, column: 7)
!1083 = !DILocation(line: 588, column: 7, scope: !266)
!1084 = !DILocation(line: 590, column: 7, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !92, line: 589, column: 5)
!1086 = !DILocation(line: 591, column: 7, scope: !1085)
!1087 = !DILocation(line: 595, column: 37, scope: !266)
!1088 = !DILocation(line: 595, column: 35, scope: !266)
!1089 = !DILocation(line: 596, column: 29, scope: !266)
!1090 = !DILocation(line: 597, column: 8, scope: !281)
!1091 = !DILocation(line: 597, column: 7, scope: !266)
!1092 = !DILocation(line: 604, column: 24, scope: !280)
!1093 = !DILocation(line: 604, column: 12, scope: !281)
!1094 = !DILocation(line: 0, scope: !279)
!1095 = !DILocation(line: 610, column: 16, scope: !279)
!1096 = !DILocation(line: 610, column: 7, scope: !279)
!1097 = !DILocation(line: 611, column: 21, scope: !279)
!1098 = !{!1099, !1099, i64 0}
!1099 = !{!"short", !985, i64 0}
!1100 = !DILocation(line: 611, column: 19, scope: !279)
!1101 = !DILocation(line: 611, column: 16, scope: !279)
!1102 = !DILocation(line: 610, column: 30, scope: !279)
!1103 = distinct !{!1103, !1096, !1097, !1104}
!1104 = !{!"llvm.loop.mustprogress"}
!1105 = !DILocation(line: 612, column: 18, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !279, file: !92, line: 612, column: 11)
!1107 = !DILocation(line: 612, column: 11, scope: !279)
!1108 = !DILocation(line: 618, column: 5, scope: !279)
!1109 = !DILocation(line: 620, column: 23, scope: !266)
!1110 = !DILocation(line: 625, column: 39, scope: !266)
!1111 = !DILocation(line: 626, column: 3, scope: !266)
!1112 = !DILocation(line: 626, column: 10, scope: !266)
!1113 = !DILocation(line: 626, column: 21, scope: !266)
!1114 = !DILocation(line: 628, column: 44, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !92, line: 628, column: 11)
!1116 = distinct !DILexicalBlock(scope: !266, file: !92, line: 627, column: 5)
!1117 = !DILocation(line: 628, column: 32, scope: !1115)
!1118 = !DILocation(line: 628, column: 49, scope: !1115)
!1119 = !DILocation(line: 628, column: 11, scope: !1116)
!1120 = !DILocation(line: 630, column: 11, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1116, file: !92, line: 630, column: 11)
!1122 = !DILocation(line: 630, column: 11, scope: !1116)
!1123 = !DILocation(line: 632, column: 26, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !92, line: 632, column: 15)
!1125 = distinct !DILexicalBlock(scope: !1121, file: !92, line: 631, column: 9)
!1126 = !DILocation(line: 632, column: 34, scope: !1124)
!1127 = !DILocation(line: 632, column: 37, scope: !1124)
!1128 = !DILocation(line: 632, column: 15, scope: !1125)
!1129 = !DILocation(line: 636, column: 16, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1125, file: !92, line: 636, column: 15)
!1131 = !DILocation(line: 636, column: 29, scope: !1130)
!1132 = !DILocation(line: 640, column: 16, scope: !1116)
!1133 = distinct !{!1133, !1111, !1134, !1104}
!1134 = !DILocation(line: 641, column: 5, scope: !266)
!1135 = !DILocation(line: 644, column: 3, scope: !266)
!1136 = !DILocation(line: 0, scope: !1069, inlinedAt: !1137)
!1137 = distinct !DILocation(line: 648, column: 31, scope: !266)
!1138 = !DILocation(line: 0, scope: !1069, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 649, column: 31, scope: !266)
!1140 = !DILocation(line: 0, scope: !1069, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 650, column: 31, scope: !266)
!1142 = !DILocation(line: 0, scope: !1069, inlinedAt: !1143)
!1143 = distinct !DILocation(line: 651, column: 31, scope: !266)
!1144 = !DILocation(line: 0, scope: !1069, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 652, column: 31, scope: !266)
!1146 = !DILocation(line: 0, scope: !1069, inlinedAt: !1147)
!1147 = distinct !DILocation(line: 653, column: 31, scope: !266)
!1148 = !DILocation(line: 0, scope: !1069, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 654, column: 31, scope: !266)
!1150 = !DILocation(line: 0, scope: !1069, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 655, column: 31, scope: !266)
!1152 = !DILocation(line: 0, scope: !1069, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 656, column: 31, scope: !266)
!1154 = !DILocation(line: 0, scope: !1069, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 657, column: 31, scope: !266)
!1156 = !DILocation(line: 663, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !266, file: !92, line: 663, column: 7)
!1158 = !DILocation(line: 664, column: 7, scope: !1157)
!1159 = !DILocation(line: 664, column: 10, scope: !1157)
!1160 = !DILocation(line: 663, column: 7, scope: !266)
!1161 = !DILocation(line: 669, column: 7, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1157, file: !92, line: 665, column: 5)
!1163 = !DILocation(line: 671, column: 5, scope: !1162)
!1164 = !DILocation(line: 676, column: 7, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1157, file: !92, line: 673, column: 5)
!1166 = !DILocation(line: 679, column: 3, scope: !266)
!1167 = !DILocation(line: 683, column: 3, scope: !266)
!1168 = !DILocation(line: 686, column: 3, scope: !266)
!1169 = !DILocation(line: 688, column: 3, scope: !266)
!1170 = !DILocation(line: 691, column: 3, scope: !266)
!1171 = !DILocation(line: 695, column: 3, scope: !266)
!1172 = !DILocation(line: 696, column: 1, scope: !266)
!1173 = !DISubprogram(name: "setlocale", scope: !1174, file: !1174, line: 122, type: !1175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1174 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!88, !86, !151}
!1177 = !DISubprogram(name: "strncmp", scope: !1178, file: !1178, line: 159, type: !1179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1178 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!86, !151, !151, !149}
!1181 = !DISubprogram(name: "exit", scope: !1182, file: !1182, line: 624, type: !973, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1182 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1183 = !DISubprogram(name: "getenv", scope: !1182, file: !1182, line: 641, type: !1184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!88, !151}
!1186 = !DISubprogram(name: "strcmp", scope: !1178, file: !1178, line: 156, type: !1187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!86, !151, !151}
!1189 = !DISubprogram(name: "strspn", scope: !1178, file: !1178, line: 297, type: !1190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!147, !151, !151}
!1192 = !DISubprogram(name: "strchr", scope: !1178, file: !1178, line: 246, type: !1193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!88, !151, !86}
!1195 = !DISubprogram(name: "__ctype_b_loc", scope: !121, file: !121, line: 79, type: !1196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!1198}
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!1201 = !DISubprogram(name: "strcspn", scope: !1178, file: !1178, line: 293, type: !1190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1202 = !DISubprogram(name: "fwrite_unlocked", scope: !516, file: !516, line: 704, type: !1203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !992)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!149, !1205, !149, !149, !1047}
!1205 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1208 = !DILocation(line: 0, scope: !83)
!1209 = !DILocation(line: 555, column: 3, scope: !83)
!1210 = !DILocation(line: 555, column: 15, scope: !83)
!1211 = !DILocation(line: 581, column: 21, scope: !83)
!1212 = !DILocation(line: 581, column: 3, scope: !83)
!1213 = !DILocation(line: 582, column: 3, scope: !83)
!1214 = !DILocation(line: 583, column: 3, scope: !83)
!1215 = !DILocation(line: 584, column: 3, scope: !83)
!1216 = !DILocation(line: 590, column: 3, scope: !83)
!1217 = !DILocation(line: 595, column: 3, scope: !83)
!1218 = !DILocation(line: 562, column: 8, scope: !83)
!1219 = !DILocation(line: 561, column: 8, scope: !83)
!1220 = !DILocation(line: 560, column: 8, scope: !83)
!1221 = !DILocation(line: 559, column: 8, scope: !83)
!1222 = !DILocation(line: 558, column: 8, scope: !83)
!1223 = !DILocation(line: 595, column: 15, scope: !83)
!1224 = distinct !{!1224, !1217, !1225, !1104}
!1225 = !DILocation(line: 652, column: 5, scope: !83)
!1226 = !DILocation(line: 603, column: 11, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !2, line: 599, column: 9)
!1228 = distinct !DILexicalBlock(scope: !83, file: !2, line: 597, column: 5)
!1229 = !DILocation(line: 608, column: 11, scope: !1227)
!1230 = !DILocation(line: 612, column: 11, scope: !1227)
!1231 = !DILocation(line: 616, column: 11, scope: !1227)
!1232 = !DILocation(line: 621, column: 11, scope: !1227)
!1233 = !DILocation(line: 629, column: 11, scope: !1227)
!1234 = !DILocation(line: 635, column: 11, scope: !1227)
!1235 = !DILocation(line: 639, column: 11, scope: !1227)
!1236 = !DILocation(line: 643, column: 11, scope: !1227)
!1237 = !DILocation(line: 645, column: 9, scope: !1227)
!1238 = !DILocation(line: 647, column: 9, scope: !1227)
!1239 = !DILocation(line: 650, column: 11, scope: !1227)
!1240 = !DILocation(line: 656, column: 7, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !83, file: !2, line: 656, column: 7)
!1242 = !DILocation(line: 656, column: 41, scope: !1241)
!1243 = !DILocation(line: 656, column: 7, scope: !83)
!1244 = !DILocation(line: 657, column: 5, scope: !1241)
!1245 = !DILocalVariable(name: "st", arg: 1, scope: !1246, file: !136, line: 81, type: !1249)
!1246 = distinct !DISubprogram(name: "io_blksize", scope: !136, file: !136, line: 81, type: !1247, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1251)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!500, !1249}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!1251 = !{!1245, !1252, !1253, !1256}
!1252 = !DILocalVariable(name: "blocksize", scope: !1246, file: !136, line: 84, type: !500)
!1253 = !DILocalVariable(name: "leading_zeros", scope: !1254, file: !136, line: 98, type: !86)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !136, line: 97, column: 5)
!1255 = distinct !DILexicalBlock(scope: !1246, file: !136, line: 96, column: 7)
!1256 = !DILocalVariable(name: "power", scope: !1257, file: !136, line: 101, type: !1259)
!1257 = distinct !DILexicalBlock(scope: !1258, file: !136, line: 100, column: 9)
!1258 = distinct !DILexicalBlock(scope: !1254, file: !136, line: 99, column: 11)
!1259 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1260 = !DILocation(line: 0, scope: !1246, inlinedAt: !1261)
!1261 = distinct !DILocation(line: 660, column: 19, scope: !83)
!1262 = !DILocation(line: 84, column: 21, scope: !1246, inlinedAt: !1261)
!1263 = !{!1264, !1265, i64 56}
!1264 = !{!"stat", !1265, i64 0, !1265, i64 8, !1265, i64 16, !1058, i64 24, !1058, i64 28, !1058, i64 32, !1058, i64 36, !1265, i64 40, !1265, i64 48, !1265, i64 56, !1265, i64 64, !1266, i64 72, !1266, i64 88, !1266, i64 104, !985, i64 120}
!1265 = !{!"long", !985, i64 0}
!1266 = !{!"timespec", !1265, i64 0, !1265, i64 8}
!1267 = !DILocation(line: 84, column: 58, scope: !1246, inlinedAt: !1261)
!1268 = !DILocation(line: 88, column: 33, scope: !1246, inlinedAt: !1261)
!1269 = !DILocation(line: 88, column: 13, scope: !1246, inlinedAt: !1261)
!1270 = !DILocation(line: 96, column: 7, scope: !1255, inlinedAt: !1261)
!1271 = !{!1264, !1058, i64 24}
!1272 = !{i64 0, i64 65}
!1273 = !DILocation(line: 96, column: 29, scope: !1255, inlinedAt: !1261)
!1274 = !DILocalVariable(name: "n", arg: 1, scope: !1275, file: !1276, line: 436, type: !1259)
!1275 = distinct !DISubprogram(name: "stdc_leading_zeros_ull", scope: !1276, file: !1276, line: 436, type: !1277, scopeLine: 437, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1279)
!1276 = !DIFile(filename: "./lib/stdbit.h", directory: "/src", checksumkind: CSK_MD5, checksum: "22a94c18744c4eadd69210db6ede4b9c")
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!98, !1259}
!1279 = !{!1274}
!1280 = !DILocation(line: 0, scope: !1275, inlinedAt: !1281)
!1281 = distinct !DILocation(line: 98, column: 27, scope: !1254, inlinedAt: !1261)
!1282 = !DILocalVariable(name: "n", arg: 1, scope: !1283, file: !1276, line: 149, type: !1259)
!1283 = distinct !DISubprogram(name: "_gl_stdbit_clzll", scope: !1276, file: !1276, line: 149, type: !1284, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1286)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!86, !1259}
!1286 = !{!1282}
!1287 = !DILocation(line: 0, scope: !1283, inlinedAt: !1288)
!1288 = distinct !DILocation(line: 438, column: 10, scope: !1275, inlinedAt: !1281)
!1289 = !DILocation(line: 151, column: 10, scope: !1283, inlinedAt: !1288)
!1290 = !DILocation(line: 0, scope: !1254, inlinedAt: !1261)
!1291 = !DILocation(line: 0, scope: !1257, inlinedAt: !1261)
!1292 = !DILocation(line: 102, column: 21, scope: !1293, inlinedAt: !1261)
!1293 = distinct !DILexicalBlock(scope: !1257, file: !136, line: 102, column: 15)
!1294 = !DILocation(line: 102, column: 15, scope: !1257, inlinedAt: !1261)
!1295 = !DILocation(line: 105, column: 5, scope: !1254, inlinedAt: !1261)
!1296 = !DILocation(line: 110, column: 10, scope: !1246, inlinedAt: !1261)
!1297 = !DILocation(line: 666, column: 20, scope: !83)
!1298 = !DILocation(line: 668, column: 10, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !83, file: !2, line: 668, column: 7)
!1300 = !DILocation(line: 668, column: 17, scope: !1299)
!1301 = !DILocation(line: 676, column: 10, scope: !83)
!1302 = !DILocation(line: 677, column: 16, scope: !83)
!1303 = !DILocation(line: 679, column: 21, scope: !83)
!1304 = !DILocation(line: 681, column: 3, scope: !83)
!1305 = !DILocation(line: 663, column: 7, scope: !83)
!1306 = !DILocation(line: 683, column: 18, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !509, file: !2, line: 683, column: 11)
!1308 = !DILocation(line: 683, column: 11, scope: !509)
!1309 = !DILocation(line: 686, column: 35, scope: !509)
!1310 = !DILocation(line: 684, column: 18, scope: !1307)
!1311 = !DILocation(line: 684, column: 16, scope: !1307)
!1312 = !DILocation(line: 684, column: 9, scope: !1307)
!1313 = !DILocation(line: 0, scope: !1069, inlinedAt: !1314)
!1314 = distinct !DILocation(line: 686, column: 28, scope: !509)
!1315 = !DILocation(line: 1361, column: 11, scope: !1069, inlinedAt: !1314)
!1316 = !DILocation(line: 1361, column: 10, scope: !1069, inlinedAt: !1314)
!1317 = !DILocation(line: 0, scope: !509)
!1318 = !DILocation(line: 687, column: 11, scope: !509)
!1319 = !DILocation(line: 690, column: 22, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1321, file: !2, line: 688, column: 9)
!1321 = distinct !DILexicalBlock(scope: !509, file: !2, line: 687, column: 11)
!1322 = !DILocation(line: 696, column: 24, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1321, file: !2, line: 695, column: 9)
!1324 = !DILocation(line: 696, column: 22, scope: !1323)
!1325 = !DILocation(line: 697, column: 26, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1323, file: !2, line: 697, column: 15)
!1327 = !DILocation(line: 697, column: 15, scope: !1323)
!1328 = !DILocation(line: 699, column: 15, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1326, file: !2, line: 698, column: 13)
!1330 = !DILocation(line: 701, column: 15, scope: !1329)
!1331 = !DILocation(line: 706, column: 18, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !509, file: !2, line: 706, column: 11)
!1333 = !DILocation(line: 705, column: 7, scope: !509)
!1334 = !DILocation(line: 705, column: 19, scope: !509)
!1335 = !DILocation(line: 706, column: 11, scope: !1332)
!1336 = !DILocation(line: 706, column: 42, scope: !1332)
