; ModuleID = 'src/chgrp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.11 }
%union.anon.11 = type { i32 }
%struct.Chown_option = type { i32, i8, ptr, i8, i8, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!200 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!201 = !{!0, !7, !12, !17, !22, !27, !32, !34, !36, !41, !46, !51, !56, !61, !66, !71, !76, !78, !83, !88, !93, !98, !103, !108, !113, !118, !123, !128, !202, !207, !212, !217, !222, !227, !229, !234, !239, !244, !340, !342, !344, !423, !428, !430, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !458, !460, !462, !464, !466, !468, !470, !475, !480, !485, !490, !492, !494, !496, !498, !503, !508, !510, !515, !517, !522, !524, !526, !528, !533, !535, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !133}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 7)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 14)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 16)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 13)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 42)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 298, type: !214, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 300, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 25)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 31)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !246, file: !2, line: 353, type: !272, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 178, type: !247, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !135, retainedNodes: !250)
!247 = !DISubroutineType(types: !248)
!248 = !{!158, !158, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!250 = !{!251, !252, !253, !255, !260, !263, !264, !265, !285, !286, !290, !291, !295, !296, !297, !332, !334, !335, !336, !339}
!251 = !DILocalVariable(name: "argc", arg: 1, scope: !246, file: !2, line: 178, type: !158)
!252 = !DILocalVariable(name: "argv", arg: 2, scope: !246, file: !2, line: 178, type: !249)
!253 = !DILocalVariable(name: "preserve_root", scope: !246, file: !2, line: 180, type: !254)
!254 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!255 = !DILocalVariable(name: "required_uid", scope: !246, file: !2, line: 184, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !257, line: 79, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !259, line: 146, baseType: !139)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!260 = !DILocalVariable(name: "required_gid", scope: !246, file: !2, line: 185, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !257, line: 64, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !259, line: 147, baseType: !139)
!263 = !DILocalVariable(name: "bit_flags", scope: !246, file: !2, line: 188, type: !158)
!264 = !DILocalVariable(name: "dereference", scope: !246, file: !2, line: 192, type: !158)
!265 = !DILocalVariable(name: "chopt", scope: !246, file: !2, line: 194, type: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !144, line: 44, size: 320, elements: !267)
!267 = !{!268, !269, !270, !281, !282, !283, !284}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !266, file: !144, line: 47, baseType: !143, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !266, file: !144, line: 50, baseType: !254, size: 8, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !266, file: !144, line: 54, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !273, line: 30, size: 128, elements: !274)
!273 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!274 = !{!275, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !272, file: !273, line: 32, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !257, line: 47, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !259, line: 148, baseType: !197)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !272, file: !273, line: 33, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !257, line: 59, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !259, line: 145, baseType: !197)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !266, file: !144, line: 57, baseType: !254, size: 8, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !266, file: !144, line: 60, baseType: !254, size: 8, offset: 136)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !266, file: !144, line: 63, baseType: !192, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !266, file: !144, line: 66, baseType: !192, size: 64, offset: 256)
!285 = !DILocalVariable(name: "optc", scope: !246, file: !2, line: 206, type: !158)
!286 = !DILocalVariable(name: "warn", scope: !287, file: !2, line: 247, type: !254)
!287 = distinct !DILexicalBlock(scope: !288, file: !2, line: 246, column: 11)
!288 = distinct !DILexicalBlock(scope: !289, file: !2, line: 211, column: 9)
!289 = distinct !DILexicalBlock(scope: !246, file: !2, line: 209, column: 5)
!290 = !DILocalVariable(name: "e", scope: !287, file: !2, line: 248, type: !198)
!291 = !DILocalVariable(name: "__errstatus", scope: !292, file: !2, line: 252, type: !294)
!292 = distinct !DILexicalBlock(scope: !293, file: !2, line: 252, column: 15)
!293 = distinct !DILexicalBlock(scope: !287, file: !2, line: 251, column: 17)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!295 = !DILocalVariable(name: "uid", scope: !246, file: !2, line: 304, type: !256)
!296 = !DILocalVariable(name: "gid", scope: !246, file: !2, line: 305, type: !261)
!297 = !DILocalVariable(name: "ref_stats", scope: !298, file: !2, line: 309, type: !300)
!298 = distinct !DILexicalBlock(scope: !299, file: !2, line: 308, column: 5)
!299 = distinct !DILexicalBlock(scope: !246, file: !2, line: 307, column: 7)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !301, line: 26, size: 1152, elements: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!302 = !{!303, !304, !305, !307, !309, !310, !311, !312, !313, !316, !318, !320, !328, !329, !330}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !300, file: !301, line: 31, baseType: !280, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !300, file: !301, line: 36, baseType: !277, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !300, file: !301, line: 44, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !259, line: 151, baseType: !197)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !300, file: !301, line: 45, baseType: !308, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !259, line: 150, baseType: !139)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !300, file: !301, line: 47, baseType: !258, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !300, file: !301, line: 48, baseType: !262, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !300, file: !301, line: 50, baseType: !158, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !300, file: !301, line: 52, baseType: !280, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !300, file: !301, line: 57, baseType: !314, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !259, line: 152, baseType: !315)
!315 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !300, file: !301, line: 61, baseType: !317, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !259, line: 175, baseType: !315)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !300, file: !301, line: 63, baseType: !319, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !259, line: 180, baseType: !315)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !300, file: !301, line: 74, baseType: !321, size: 128, offset: 576)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !322, line: 11, size: 128, elements: !323)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!323 = !{!324, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !321, file: !322, line: 16, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !259, line: 160, baseType: !315)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !321, file: !322, line: 21, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !259, line: 197, baseType: !315)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !300, file: !301, line: 75, baseType: !321, size: 128, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !300, file: !301, line: 76, baseType: !321, size: 128, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !300, file: !301, line: 89, baseType: !331, size: 192, offset: 960)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 192, elements: !86)
!332 = !DILocalVariable(name: "ug", scope: !333, file: !2, line: 324, type: !192)
!333 = distinct !DILexicalBlock(scope: !299, file: !2, line: 323, column: 5)
!334 = !DILocalVariable(name: "warn", scope: !333, file: !2, line: 331, type: !254)
!335 = !DILocalVariable(name: "e", scope: !333, file: !2, line: 332, type: !198)
!336 = !DILocalVariable(name: "__errstatus", scope: !337, file: !2, line: 340, type: !294)
!337 = distinct !DILexicalBlock(scope: !338, file: !2, line: 340, column: 9)
!338 = distinct !DILexicalBlock(scope: !333, file: !2, line: 339, column: 11)
!339 = !DILocalVariable(name: "ok", scope: !246, file: !2, line: 361, type: !254)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !241, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "reference_file", scope: !135, file: !2, line: 41, type: !192, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !346, file: !157, line: 575, type: !158, isLocal: true, isDefinition: true)
!346 = distinct !DISubprogram(name: "oputs_", scope: !157, file: !157, line: 573, type: !347, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !135, retainedNodes: !349)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !198, !198}
!349 = !{!350, !351, !352, !355, !356, !357, !358, !362, !363, !364, !365, !367, !417, !418, !419, !421, !422}
!350 = !DILocalVariable(name: "program", arg: 1, scope: !346, file: !157, line: 573, type: !198)
!351 = !DILocalVariable(name: "option", arg: 2, scope: !346, file: !157, line: 573, type: !198)
!352 = !DILocalVariable(name: "term", scope: !353, file: !157, line: 585, type: !198)
!353 = distinct !DILexicalBlock(scope: !354, file: !157, line: 582, column: 5)
!354 = distinct !DILexicalBlock(scope: !346, file: !157, line: 581, column: 7)
!355 = !DILocalVariable(name: "double_space", scope: !346, file: !157, line: 594, type: !254)
!356 = !DILocalVariable(name: "first_word", scope: !346, file: !157, line: 595, type: !198)
!357 = !DILocalVariable(name: "option_text", scope: !346, file: !157, line: 596, type: !198)
!358 = !DILocalVariable(name: "s", scope: !359, file: !157, line: 608, type: !198)
!359 = distinct !DILexicalBlock(scope: !360, file: !157, line: 605, column: 5)
!360 = distinct !DILexicalBlock(scope: !361, file: !157, line: 604, column: 12)
!361 = distinct !DILexicalBlock(scope: !346, file: !157, line: 597, column: 7)
!362 = !DILocalVariable(name: "spaces", scope: !359, file: !157, line: 609, type: !195)
!363 = !DILocalVariable(name: "anchor_len", scope: !346, file: !157, line: 620, type: !195)
!364 = !DILocalVariable(name: "desc_text", scope: !346, file: !157, line: 625, type: !198)
!365 = !DILocalVariable(name: "__ptr", scope: !366, file: !157, line: 644, type: !198)
!366 = distinct !DILexicalBlock(scope: !346, file: !157, line: 644, column: 3)
!367 = !DILocalVariable(name: "__stream", scope: !366, file: !157, line: 644, type: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !370, line: 7, baseType: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !372, line: 49, size: 1728, elements: !373)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !389, !391, !392, !393, !394, !395, !397, !398, !401, !403, !406, !409, !410, !411, !412, !413}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !371, file: !372, line: 51, baseType: !158, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !371, file: !372, line: 54, baseType: !192, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !371, file: !372, line: 55, baseType: !192, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !371, file: !372, line: 56, baseType: !192, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !371, file: !372, line: 57, baseType: !192, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !371, file: !372, line: 58, baseType: !192, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !371, file: !372, line: 59, baseType: !192, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !371, file: !372, line: 60, baseType: !192, size: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !371, file: !372, line: 61, baseType: !192, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !371, file: !372, line: 64, baseType: !192, size: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !371, file: !372, line: 65, baseType: !192, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !371, file: !372, line: 66, baseType: !192, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !371, file: !372, line: 68, baseType: !387, size: 64, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !372, line: 36, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !371, file: !372, line: 70, baseType: !390, size: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !371, file: !372, line: 72, baseType: !158, size: 32, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !371, file: !372, line: 73, baseType: !158, size: 32, offset: 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !371, file: !372, line: 74, baseType: !314, size: 64, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !371, file: !372, line: 77, baseType: !194, size: 16, offset: 1024)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !371, file: !372, line: 78, baseType: !396, size: 8, offset: 1040)
!396 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !371, file: !372, line: 79, baseType: !115, size: 8, offset: 1048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !371, file: !372, line: 81, baseType: !399, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !372, line: 43, baseType: null)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !371, file: !372, line: 89, baseType: !402, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !259, line: 153, baseType: !315)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !371, file: !372, line: 91, baseType: !404, size: 64, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !372, line: 37, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !371, file: !372, line: 92, baseType: !407, size: 64, offset: 1280)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !372, line: 38, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !371, file: !372, line: 93, baseType: !390, size: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !371, file: !372, line: 94, baseType: !193, size: 64, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !371, file: !372, line: 95, baseType: !195, size: 64, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !371, file: !372, line: 96, baseType: !158, size: 32, offset: 1536)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !371, file: !372, line: 98, baseType: !414, size: 160, offset: 1568)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 20)
!417 = !DILocalVariable(name: "__cnt", scope: !366, file: !157, line: 644, type: !195)
!418 = !DILocalVariable(name: "url_program", scope: !346, file: !157, line: 648, type: !198)
!419 = !DILocalVariable(name: "__ptr", scope: !420, file: !157, line: 686, type: !198)
!420 = distinct !DILexicalBlock(scope: !346, file: !157, line: 686, column: 3)
!421 = !DILocalVariable(name: "__stream", scope: !420, file: !157, line: 686, type: !368)
!422 = !DILocalVariable(name: "__cnt", scope: !420, file: !157, line: 686, type: !195)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !157, line: 585, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 5)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !157, line: 586, type: !425, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !157, line: 595, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 4)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !157, line: 620, type: !19, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !241, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !425, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !432, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !85, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !157, line: 650, type: !425, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !19, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !19, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !157, line: 652, type: !204, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !157, line: 653, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 8)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !157, line: 654, type: !120, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !157, line: 655, type: !120, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !157, line: 656, type: !120, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !157, line: 657, type: !120, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !157, line: 663, type: !204, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !157, line: 664, type: !120, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 17)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 40)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 15)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 61)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !157, line: 679, type: !85, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !157, line: 683, type: !425, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !157, line: 688, type: !425, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !157, line: 691, type: !455, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !157, line: 801, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1464, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 183)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !157, line: 808, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 83)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !157, line: 812, type: !48, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !157, line: 816, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 51)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !157, line: 839, type: !214, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !157, line: 840, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 22)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !157, line: 841, type: !482, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !157, line: 862, type: !432, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !157, line: 868, type: !48, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !157, line: 875, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 27)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !512, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 12)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !120, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !455, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !537, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !425, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !482, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !472, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !209, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !19, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !204, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !120, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !455, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !425, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !455, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 3584, elements: !210)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !569, line: 50, size: 256, elements: !570)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!570 = !{!571, !572, !573, !575}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !569, line: 52, baseType: !198, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !568, file: !569, line: 55, baseType: !158, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !569, line: 56, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !568, file: !569, line: 57, baseType: !158, size: 32, offset: 192)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !578, line: 557, type: !214, isLocal: true, isDefinition: true)
!578 = !DIFile(filename: "src/chown-core.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0cc937f337309996c839dc01ee932e6")
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !578, line: 569, type: !472, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !241, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 45)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 58)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 49)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !578, line: 328, type: !472, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !578, line: 335, type: !85, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !578, line: 341, type: !231, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !578, line: 349, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 186)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !578, line: 385, type: !519, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !578, line: 473, type: !231, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !578, line: 473, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 21)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !578, line: 158, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 56)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !578, line: 171, type: !3, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !578, line: 172, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 35)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !578, line: 173, type: !632, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 30)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !578, line: 178, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 48)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !578, line: 179, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 44)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !578, line: 180, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 34)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !578, line: 184, type: !477, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !578, line: 185, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 36)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !578, line: 193, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 32)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !578, line: 194, type: !664, isLocal: true, isDefinition: true)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 28)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !578, line: 195, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 26)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !578, line: 199, type: !241, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !578, line: 199, type: !472, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !578, line: 199, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 888, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 111)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "chown_mode", scope: !683, file: !684, line: 2, type: !137, isLocal: false, isDefinition: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C11, file: !684, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !685, globals: !686, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "src/chown-chgrp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "95c1e3dffa01f14b53c4873690e08248")
!685 = !{!137}
!686 = !{!681}
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !689, line: 3, type: !482, isLocal: true, isDefinition: true)
!689 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "Version", scope: !692, file: !689, line: 3, type: !198, isLocal: false, isDefinition: true)
!692 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !693, splitDebugInlining: false, nameTableKind: None)
!693 = !{!687, !690}
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "file_name", scope: !696, file: !697, line: 45, type: !198, isLocal: true, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !697, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !698, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!698 = !{!699, !701, !703, !705, !694, !707}
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !697, line: 121, type: !204, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !697, line: 121, type: !537, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !697, line: 123, type: !204, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !697, line: 126, type: !85, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !696, file: !697, line: 55, type: !254, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !711, file: !712, line: 66, type: !755, isLocal: false, isDefinition: true)
!711 = distinct !DICompileUnit(language: DW_LANG_C11, file: !712, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !713, globals: !714, splitDebugInlining: false, nameTableKind: None)
!712 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!713 = !{!193, !200}
!714 = !{!715, !717, !737, !739, !741, !743, !709, !745, !747, !749, !751, !753}
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !712, line: 272, type: !425, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "old_file_name", scope: !719, file: !712, line: 304, type: !198, isLocal: true, isDefinition: true)
!719 = distinct !DISubprogram(name: "verror_at_line", scope: !712, file: !712, line: 298, type: !720, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !711, retainedNodes: !730)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !158, !158, !198, !139, !198, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !724)
!724 = !{!725, !727, !728, !729}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !723, file: !726, baseType: !139, size: 32)
!726 = !DIFile(filename: "lib/error.c", directory: "/src")
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !723, file: !726, baseType: !139, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !723, file: !726, baseType: !193, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !723, file: !726, baseType: !193, size: 64, offset: 128)
!730 = !{!731, !732, !733, !734, !735, !736}
!731 = !DILocalVariable(name: "status", arg: 1, scope: !719, file: !712, line: 298, type: !158)
!732 = !DILocalVariable(name: "errnum", arg: 2, scope: !719, file: !712, line: 298, type: !158)
!733 = !DILocalVariable(name: "file_name", arg: 3, scope: !719, file: !712, line: 298, type: !198)
!734 = !DILocalVariable(name: "line_number", arg: 4, scope: !719, file: !712, line: 298, type: !139)
!735 = !DILocalVariable(name: "message", arg: 5, scope: !719, file: !712, line: 298, type: !198)
!736 = !DILocalVariable(name: "args", arg: 6, scope: !719, file: !712, line: 298, type: !722)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "old_line_number", scope: !719, file: !712, line: 305, type: !139, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !712, line: 338, type: !432, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !712, line: 346, type: !455, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !712, line: 346, type: !241, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "error_message_count", scope: !711, file: !712, line: 69, type: !139, isLocal: false, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !711, file: !712, line: 295, type: !158, isLocal: false, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !712, line: 208, type: !204, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !712, line: 208, type: !615, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !712, line: 214, type: !425, isLocal: true, isDefinition: true)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !760, line: 399, type: !241, isLocal: true, isDefinition: true)
!760 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !760, line: 441, type: !115, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !760, line: 1080, type: !85, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !767, line: 226, type: !125, isLocal: true, isDefinition: true)
!767 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !767, line: 227, type: !125, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !767, line: 228, type: !772, isLocal: true, isDefinition: true)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 33)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !767, line: 231, type: !125, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "default_tuning", scope: !779, file: !767, line: 134, type: !783, isLocal: true, isDefinition: true)
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !780, globals: !782, splitDebugInlining: false, nameTableKind: None)
!780 = !{!197, !193, !781, !195}
!781 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!782 = !{!765, !768, !770, !775, !777}
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !785, line: 52, baseType: !786)
!785 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !785, line: 40, size: 160, elements: !787)
!787 = !{!788, !789, !790, !791, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !786, file: !785, line: 45, baseType: !781, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !786, file: !785, line: 46, baseType: !781, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !786, file: !785, line: 47, baseType: !781, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !786, file: !785, line: 48, baseType: !781, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !786, file: !785, line: 49, baseType: !254, size: 8, offset: 128)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "program_name", scope: !795, file: !796, line: 31, type: !198, isLocal: false, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C11, file: !796, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !797, globals: !798, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!797 = !{!192}
!798 = !{!793, !799, !801}
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !796, line: 46, type: !455, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !796, line: 49, type: !432, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "utf07FF", scope: !805, file: !806, line: 46, type: !833, isLocal: true, isDefinition: true)
!805 = distinct !DISubprogram(name: "proper_name_lite", scope: !806, file: !806, line: 38, type: !807, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !809, retainedNodes: !811)
!806 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!807 = !DISubroutineType(types: !808)
!808 = !{!198, !198, !198}
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !810, splitDebugInlining: false, nameTableKind: None)
!810 = !{!803}
!811 = !{!812, !813, !814, !815, !820}
!812 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !805, file: !806, line: 38, type: !198)
!813 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !805, file: !806, line: 38, type: !198)
!814 = !DILocalVariable(name: "translation", scope: !805, file: !806, line: 40, type: !198)
!815 = !DILocalVariable(name: "w", scope: !805, file: !806, line: 47, type: !816)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !817, line: 37, baseType: !818)
!817 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !259, line: 57, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !259, line: 42, baseType: !139)
!820 = !DILocalVariable(name: "mbs", scope: !805, file: !806, line: 48, type: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !822, line: 6, baseType: !823)
!822 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !824, line: 21, baseType: !825)
!824 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !824, line: 13, size: 64, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !825, file: !824, line: 15, baseType: !158, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !825, file: !824, line: 20, baseType: !829, size: 32, offset: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !825, file: !824, line: 16, size: 32, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !829, file: !824, line: 18, baseType: !139, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !829, file: !824, line: 19, baseType: !432, size: 32)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 16, elements: !242)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !836, line: 78, type: !455, isLocal: true, isDefinition: true)
!836 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !836, line: 79, type: !19, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !836, line: 80, type: !219, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !836, line: 81, type: !219, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !836, line: 82, type: !414, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !836, line: 83, type: !241, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !836, line: 84, type: !455, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !836, line: 85, type: !204, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !836, line: 86, type: !204, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !836, line: 87, type: !455, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !857, file: !836, line: 76, type: !929, isLocal: false, isDefinition: true)
!857 = distinct !DICompileUnit(language: DW_LANG_C11, file: !836, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !858, retainedTypes: !864, globals: !865, splitDebugInlining: false, nameTableKind: None)
!858 = !{!162, !859, !176}
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !163, line: 254, baseType: !139, size: 32, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!862 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!863 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!864 = !{!158, !194, !195}
!865 = !{!834, !837, !839, !841, !843, !845, !847, !849, !851, !853, !855, !866, !870, !880, !882, !887, !889, !891, !893, !895, !918, !925, !927}
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !857, file: !836, line: 92, type: !868, isLocal: false, isDefinition: true)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 320, elements: !121)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !857, file: !836, line: 1040, type: !872, isLocal: false, isDefinition: true)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !836, line: 56, size: 448, elements: !873)
!873 = !{!874, !875, !876, !878, !879}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !872, file: !836, line: 59, baseType: !162, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !872, file: !836, line: 62, baseType: !158, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !872, file: !836, line: 66, baseType: !877, size: 256, offset: 64)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !456)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !872, file: !836, line: 69, baseType: !198, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !872, file: !836, line: 72, baseType: !198, size: 64, offset: 384)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !857, file: !836, line: 107, type: !872, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "slot0", scope: !857, file: !836, line: 831, type: !884, isLocal: true, isDefinition: true)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 256)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !836, line: 321, type: !241, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !836, line: 357, type: !241, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !836, line: 358, type: !241, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !836, line: 199, type: !204, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "quote", scope: !897, file: !836, line: 228, type: !916, isLocal: true, isDefinition: true)
!897 = distinct !DISubprogram(name: "gettext_quote", scope: !836, file: !836, line: 197, type: !898, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !857, retainedNodes: !900)
!898 = !DISubroutineType(types: !899)
!899 = !{!198, !198, !162}
!900 = !{!901, !902, !903, !904, !905}
!901 = !DILocalVariable(name: "msgid", arg: 1, scope: !897, file: !836, line: 197, type: !198)
!902 = !DILocalVariable(name: "s", arg: 2, scope: !897, file: !836, line: 197, type: !162)
!903 = !DILocalVariable(name: "translation", scope: !897, file: !836, line: 199, type: !198)
!904 = !DILocalVariable(name: "w", scope: !897, file: !836, line: 229, type: !816)
!905 = !DILocalVariable(name: "mbs", scope: !897, file: !836, line: 230, type: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !822, line: 6, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !824, line: 21, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !824, line: 13, size: 64, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !908, file: !824, line: 15, baseType: !158, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !908, file: !824, line: 20, baseType: !912, size: 32, offset: 32)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !908, file: !824, line: 16, size: 32, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !912, file: !824, line: 18, baseType: !139, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !912, file: !824, line: 19, baseType: !432, size: 32)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 64, elements: !917)
!917 = !{!243, !434}
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "slotvec", scope: !857, file: !836, line: 834, type: !920, isLocal: true, isDefinition: true)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !836, line: 823, size: 128, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !921, file: !836, line: 825, baseType: !195, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !921, file: !836, line: 826, baseType: !192, size: 64, offset: 64)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "nslots", scope: !857, file: !836, line: 832, type: !158, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "slotvec0", scope: !857, file: !836, line: 833, type: !921, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 704, elements: !931)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!931 = !{!932}
!932 = !DISubrange(count: 11)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !935, line: 32, type: !241, isLocal: true, isDefinition: true)
!935 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !938, line: 274, type: !530, isLocal: true, isDefinition: true)
!938 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !938, line: 160, type: !219, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !938, line: 165, type: !115, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !938, line: 169, type: !219, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !938, line: 202, type: !209, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !938, line: 229, type: !204, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !951, line: 67, type: !537, isLocal: true, isDefinition: true)
!951 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !951, line: 69, type: !204, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !951, line: 83, type: !204, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !951, line: 83, type: !432, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !951, line: 85, type: !241, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !951, line: 88, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 171)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !951, line: 88, type: !647, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !951, line: 105, type: !214, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !951, line: 109, type: !971, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 23)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !951, line: 113, type: !664, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !951, line: 120, type: !659, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !951, line: 127, type: !654, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !951, line: 134, type: !477, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !951, line: 142, type: !642, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !951, line: 150, type: !637, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !951, line: 159, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 52)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !951, line: 170, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 60)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !951, line: 248, type: !414, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !951, line: 248, type: !519, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !951, line: 254, type: !414, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !951, line: 254, type: !209, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !951, line: 254, type: !477, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !951, line: 259, type: !3, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !951, line: 259, type: !1010, isLocal: true, isDefinition: true)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 29)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1015, file: !1016, line: 26, type: !1018, isLocal: false, isDefinition: true)
!1015 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1016, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!1016 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1017 = !{!1013}
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 376, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 47)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1023, file: !1024, line: 24, type: !1026, isLocal: false, isDefinition: true)
!1023 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1024, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1025, splitDebugInlining: false, nameTableKind: None)
!1024 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1025 = !{!1021}
!1026 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 34, type: !85, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 34, type: !204, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 34, type: !472, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 40, type: !1010, isLocal: true, isDefinition: true)
!1036 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 40, type: !1039, isLocal: true, isDefinition: true)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !931)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 40, type: !1042, isLocal: true, isDefinition: true)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 624, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 78)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 59, type: !125, isLocal: true, isDefinition: true)
!1047 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 59, type: !14, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 59, type: !1052, isLocal: true, isDefinition: true)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 536, elements: !74)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1055, file: !1056, line: 506, type: !158, isLocal: true, isDefinition: true)
!1055 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1056, file: !1056, line: 485, type: !1057, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1059, retainedNodes: !1061)
!1056 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!158, !158, !158}
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1056, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1060, splitDebugInlining: false, nameTableKind: None)
!1060 = !{!1053}
!1061 = !{!1062, !1063, !1064, !1065, !1068}
!1062 = !DILocalVariable(name: "fd", arg: 1, scope: !1055, file: !1056, line: 485, type: !158)
!1063 = !DILocalVariable(name: "target", arg: 2, scope: !1055, file: !1056, line: 485, type: !158)
!1064 = !DILocalVariable(name: "result", scope: !1055, file: !1056, line: 487, type: !158)
!1065 = !DILocalVariable(name: "flags", scope: !1066, file: !1056, line: 530, type: !158)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !1056, line: 529, column: 5)
!1067 = distinct !DILexicalBlock(scope: !1055, file: !1056, line: 528, column: 7)
!1068 = !DILocalVariable(name: "saved_errno", scope: !1069, file: !1056, line: 533, type: !158)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !1056, line: 532, column: 9)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !1056, line: 531, column: 11)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 108, type: !115, isLocal: true, isDefinition: true)
!1073 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(name: "internal_state", scope: !1076, file: !1073, line: 97, type: !1079, isLocal: true, isDefinition: true)
!1076 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1073, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1077, globals: !1078, splitDebugInlining: false, nameTableKind: None)
!1077 = !{!193, !195, !200}
!1078 = !{!1071, !1074}
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !822, line: 6, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !824, line: 21, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !824, line: 13, size: 64, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1081, file: !824, line: 15, baseType: !158, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1081, file: !824, line: 20, baseType: !1085, size: 32, offset: 32)
!1085 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1081, file: !824, line: 16, size: 32, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1085, file: !824, line: 18, baseType: !139, size: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1085, file: !824, line: 19, baseType: !432, size: 32)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1091, line: 35, type: !19, isLocal: true, isDefinition: true)
!1091 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1092 = distinct !DICompileUnit(language: DW_LANG_C11, file: !578, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1093, retainedTypes: !1107, globals: !1108, splitDebugInlining: false, nameTableKind: None)
!1093 = !{!143, !162, !1094, !1101}
!1094 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !578, line: 38, baseType: !139, size: 32, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DIEnumerator(name: "RC_ok", value: 2)
!1097 = !DIEnumerator(name: "RC_excluded", value: 3)
!1098 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!1099 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!1100 = !DIEnumerator(name: "RC_error", value: 6)
!1101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !144, line: 24, baseType: !139, size: 32, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106}
!1103 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!1104 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!1105 = !DIEnumerator(name: "CH_FAILED", value: 3)
!1106 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!1107 = !{!256, !261, !193}
!1108 = !{!576, !579, !581, !583, !588, !593, !598, !600, !602, !604, !609, !611, !613, !618, !623, !625, !630, !635, !640, !645, !650, !652, !657, !662, !667, !672, !674, !676, !1109}
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(scope: null, file: !578, line: 132, type: !241, isLocal: true, isDefinition: true)
!1111 = distinct !DICompileUnit(language: DW_LANG_C11, file: !760, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1112, retainedTypes: !1258, globals: !1269, splitDebugInlining: false, nameTableKind: None)
!1112 = !{!1113, !1117, !1234, !1237, !1241, !1252, !1255}
!1113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !760, line: 159, baseType: !139, size: 32, elements: !1114)
!1114 = !{!1115, !1116}
!1115 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1116 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1117 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1119, file: !1118, line: 54, baseType: !139, size: 32, elements: !1232)
!1118 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1119 = distinct !DISubprogram(name: "setup_dir", scope: !1118, file: !1118, line: 50, type: !1120, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1111, retainedNodes: !1230)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!254, !1122}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1124, line: 233, baseType: !1125)
!1124 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1124, line: 115, size: 1024, elements: !1126)
!1126 = !{!1127, !1180, !1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1196, !1197, !1200, !1219}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1125, file: !1124, line: 116, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1124, line: 235, size: 2048, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1150, !1151, !1152, !1153, !1176}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1129, file: !1124, line: 236, baseType: !1128, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1129, file: !1124, line: 237, baseType: !1128, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1129, file: !1124, line: 238, baseType: !1128, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1129, file: !1124, line: 239, baseType: !1135, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1137, line: 127, baseType: !1138)
!1137 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1137, line: 127, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1129, file: !1124, line: 242, baseType: !315, size: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1129, file: !1124, line: 243, baseType: !193, size: 64, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1129, file: !1124, line: 244, baseType: !192, size: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1129, file: !1124, line: 245, baseType: !192, size: 64, offset: 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1129, file: !1124, line: 246, baseType: !158, size: 32, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1129, file: !1124, line: 247, baseType: !158, size: 32, offset: 544)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1129, file: !1124, line: 248, baseType: !195, size: 64, offset: 576)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1129, file: !1124, line: 250, baseType: !1122, size: 64, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1129, file: !1124, line: 254, baseType: !1148, size: 64, offset: 704)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !196, line: 35, baseType: !315)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1129, file: !1124, line: 256, baseType: !195, size: 64, offset: 768)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1129, file: !1124, line: 272, baseType: !194, size: 16, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1129, file: !1124, line: 276, baseType: !194, size: 16, offset: 848)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1129, file: !1124, line: 282, baseType: !194, size: 16, offset: 864)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1129, file: !1124, line: 284, baseType: !1154, size: 1152, offset: 896)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 1152, elements: !116)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !301, line: 26, size: 1152, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1173, !1174, !1175}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1155, file: !301, line: 31, baseType: !280, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1155, file: !301, line: 36, baseType: !277, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1155, file: !301, line: 44, baseType: !306, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1155, file: !301, line: 45, baseType: !308, size: 32, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1155, file: !301, line: 47, baseType: !258, size: 32, offset: 224)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1155, file: !301, line: 48, baseType: !262, size: 32, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1155, file: !301, line: 50, baseType: !158, size: 32, offset: 288)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1155, file: !301, line: 52, baseType: !280, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1155, file: !301, line: 57, baseType: !314, size: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1155, file: !301, line: 61, baseType: !317, size: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1155, file: !301, line: 63, baseType: !319, size: 64, offset: 512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1155, file: !301, line: 74, baseType: !1169, size: 128, offset: 576)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !322, line: 11, size: 128, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1169, file: !322, line: 16, baseType: !325, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1169, file: !322, line: 21, baseType: !327, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1155, file: !301, line: 75, baseType: !1169, size: 128, offset: 704)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1155, file: !301, line: 76, baseType: !1169, size: 128, offset: 832)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1155, file: !301, line: 89, baseType: !331, size: 192, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !1129, file: !1124, line: 285, baseType: !1177, offset: 2048)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1178)
!1178 = !{!1179}
!1179 = !DISubrange(count: -1)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !1125, file: !1124, line: 117, baseType: !1128, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !1125, file: !1124, line: 118, baseType: !1182, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !1125, file: !1124, line: 119, baseType: !279, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1125, file: !1124, line: 120, baseType: !192, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !1125, file: !1124, line: 121, baseType: !158, size: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !1125, file: !1124, line: 122, baseType: !158, size: 32, offset: 352)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1125, file: !1124, line: 124, baseType: !195, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !1125, file: !1124, line: 125, baseType: !195, size: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !1125, file: !1124, line: 126, baseType: !1190, size: 64, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!158, !1193, !1193}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1129)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !1125, file: !1124, line: 196, baseType: !158, size: 32, offset: 576)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !1125, file: !1124, line: 205, baseType: !1198, size: 64, offset: 640)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1124, line: 205, flags: DIFlagFwdDecl)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1125, file: !1124, line: 227, baseType: !1201, size: 64, offset: 704)
!1201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1125, file: !1124, line: 207, size: 64, elements: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1201, file: !1124, line: 220, baseType: !1198, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1201, file: !1124, line: 226, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !1207, line: 32, size: 256, elements: !1208)
!1207 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!1208 = !{!1209, !1214, !1218}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !1206, file: !1207, line: 34, baseType: !1210, size: 128)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !273, line: 30, size: 128, elements: !1211)
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1210, file: !273, line: 32, baseType: !276, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1210, file: !273, line: 33, baseType: !279, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !1206, file: !1207, line: 35, baseType: !1215, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1216, line: 102, baseType: !1217)
!1216 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !259, line: 73, baseType: !197)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1206, file: !1207, line: 36, baseType: !158, size: 32, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !1125, file: !1124, line: 232, baseType: !1220, size: 256, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !1221, line: 47, baseType: !1222)
!1221 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !1221, line: 39, size: 256, elements: !1223)
!1223 = !{!1224, !1226, !1227, !1228, !1229}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !1222, file: !1221, line: 41, baseType: !1225, size: 128)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !433)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !1222, file: !1221, line: 42, baseType: !158, size: 32, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !1222, file: !1221, line: 43, baseType: !139, size: 32, offset: 160)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !1222, file: !1221, line: 44, baseType: !139, size: 32, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !1222, file: !1221, line: 45, baseType: !254, size: 8, offset: 224)
!1230 = !{!1231}
!1231 = !DILocalVariable(name: "fts", arg: 1, scope: !1119, file: !1118, line: 50, type: !1122)
!1232 = !{!1233}
!1233 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!1234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !760, line: 635, baseType: !139, size: 32, elements: !1235)
!1235 = !{!1236}
!1236 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2)
!1237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !760, line: 638, baseType: !139, size: 32, elements: !1238)
!1238 = !{!1239, !1240}
!1239 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0)
!1240 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1)
