; ModuleID = 'src/chmod.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.12 }
%union.anon.12 = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }

!78 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 62)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 465, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 75)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 10)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 24)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 498, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 72)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "long_options", scope: !109, file: !2, line: 106, type: !588, isLocal: true, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !174, globals: !184, splitDebugInlining: false, nameTableKind: None)
!110 = !{!111, !118, !123, !129, !143, !158}
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 98, baseType: !112, size: 32, elements: !113)
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !{!114, !115, !116, !117}
!114 = !DIEnumerator(name: "DEREFERENCE_OPTION", value: 128)
!115 = !DIEnumerator(name: "NO_PRESERVE_ROOT", value: 129)
!116 = !DIEnumerator(name: "PRESERVE_ROOT", value: 130)
!117 = !DIEnumerator(name: "REFERENCE_FILE_OPTION", value: 131)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !2, line: 56, baseType: !112, size: 32, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIEnumerator(name: "V_high", value: 0)
!121 = !DIEnumerator(name: "V_changes_only", value: 1)
!122 = !DIEnumerator(name: "V_off", value: 2)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 337, baseType: !125, size: 32, elements: !126)
!124 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!128 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !130, line: 42, baseType: !112, size: 32, elements: !131)
!130 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
!132 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!133 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!134 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!135 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!136 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!137 = !DIEnumerator(name: "c_quoting_style", value: 5)
!138 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!139 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!140 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!141 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!142 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 46, baseType: !112, size: 32, elements: !145)
!144 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!146 = !DIEnumerator(name: "_ISupper", value: 256)
!147 = !DIEnumerator(name: "_ISlower", value: 512)
!148 = !DIEnumerator(name: "_ISalpha", value: 1024)
!149 = !DIEnumerator(name: "_ISdigit", value: 2048)
!150 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!151 = !DIEnumerator(name: "_ISspace", value: 8192)
!152 = !DIEnumerator(name: "_ISprint", value: 16384)
!153 = !DIEnumerator(name: "_ISgraph", value: 32768)
!154 = !DIEnumerator(name: "_ISblank", value: 1)
!155 = !DIEnumerator(name: "_IScntrl", value: 2)
!156 = !DIEnumerator(name: "_ISpunct", value: 4)
!157 = !DIEnumerator(name: "_ISalnum", value: 8)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !159, file: !2, line: 43, baseType: !112, size: 32, elements: !168)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "change_status", file: !2, line: 41, size: 96, elements: !160)
!160 = !{!161, !162, !167}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !159, file: !2, line: 51, baseType: !158, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "old_mode", scope: !159, file: !2, line: 52, baseType: !163, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !164, line: 69, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !166, line: 150, baseType: !112)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "new_mode", scope: !159, file: !2, line: 53, baseType: !163, size: 32, offset: 64)
!168 = !{!169, !170, !171, !172, !173}
!169 = !DIEnumerator(name: "CH_NO_STAT", value: 0)
!170 = !DIEnumerator(name: "CH_FAILED", value: 1)
!171 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 2)
!172 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3)
!173 = !DIEnumerator(name: "CH_SUCCEEDED", value: 4)
!174 = !{!175, !176, !125, !177, !178, !181, !183}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 46, baseType: !180)
!179 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!180 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !102, !185, !190, !195, !200, !205, !210, !212, !217, !222, !227, !265, !270, !275, !277, !279, !281, !283, !286, !366, !371, !373, !378, !380, !382, !384, !386, !388, !390, !392, !394, !399, !404, !406, !408, !410, !412, !414, !416, !418, !423, !428, !433, !435, !437, !439, !441, !446, !451, !453, !458, !460, !465, !467, !469, !471, !476, !478, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !503, !505, !107, !507, !509, !511, !513, !515, !517, !519, !521, !526, !528, !533, !538, !543, !548, !550, !555, !560, !565, !570, !572, !577, !579, !581, !583}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 14)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 16)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 13)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 42)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 613, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 44)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 626, type: !192, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 628, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 25)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 636, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 31)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 644, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 17)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !229, file: !2, line: 652, type: !256, isLocal: true, isDefinition: true)
!229 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 478, type: !230, scopeLine: 479, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !109, retainedNodes: !233)
!230 = !DISubroutineType(types: !231)
!231 = !{!125, !125, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!233 = !{!234, !235, !236, !237, !242, !243, !245, !246, !247, !248, !249, !253, !254, !255}
!234 = !DILocalVariable(name: "argc", arg: 1, scope: !229, file: !2, line: 478, type: !125)
!235 = !DILocalVariable(name: "argv", arg: 2, scope: !229, file: !2, line: 478, type: !232)
!236 = !DILocalVariable(name: "mode", scope: !229, file: !2, line: 480, type: !175)
!237 = !DILocalVariable(name: "mode_len", scope: !229, file: !2, line: 481, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !239, line: 130, baseType: !240)
!239 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !179, line: 35, baseType: !241)
!241 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!242 = !DILocalVariable(name: "mode_alloc", scope: !229, file: !2, line: 482, type: !238)
!243 = !DILocalVariable(name: "ok", scope: !229, file: !2, line: 483, type: !244)
!244 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!245 = !DILocalVariable(name: "preserve_root", scope: !229, file: !2, line: 484, type: !244)
!246 = !DILocalVariable(name: "reference_file", scope: !229, file: !2, line: 485, type: !181)
!247 = !DILocalVariable(name: "c", scope: !229, file: !2, line: 486, type: !125)
!248 = !DILocalVariable(name: "bit_flags", scope: !229, file: !2, line: 487, type: !125)
!249 = !DILocalVariable(name: "arg", scope: !250, file: !2, line: 552, type: !181)
!250 = distinct !DILexicalBlock(scope: !251, file: !2, line: 546, column: 11)
!251 = distinct !DILexicalBlock(scope: !252, file: !2, line: 504, column: 9)
!252 = distinct !DILexicalBlock(scope: !229, file: !2, line: 502, column: 5)
!253 = !DILocalVariable(name: "arg_len", scope: !250, file: !2, line: 553, type: !238)
!254 = !DILocalVariable(name: "mode_comma_len", scope: !250, file: !2, line: 554, type: !238)
!255 = !DILocalVariable(name: "new_mode_len", scope: !250, file: !2, line: 555, type: !238)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !257, line: 30, size: 128, elements: !258)
!257 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!258 = !{!259, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !256, file: !257, line: 32, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !164, line: 47, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !166, line: 148, baseType: !180)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !256, file: !257, line: 33, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !164, line: 59, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !166, line: 145, baseType: !180)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 2)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "change", scope: !109, file: !2, line: 69, type: !272, isLocal: true, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !274, line: 35, flags: DIFlagFwdDecl)
!274 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "umask_value", scope: !109, file: !2, line: 72, type: !163, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "recurse", scope: !109, file: !2, line: 75, type: !244, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "force_silent", scope: !109, file: !2, line: 82, type: !244, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !109, file: !2, line: 87, type: !244, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !109, file: !2, line: 94, type: !285, isLocal: true, isDefinition: true)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !288, file: !124, line: 575, type: !125, isLocal: true, isDefinition: true)
!288 = distinct !DISubprogram(name: "oputs_", scope: !124, file: !124, line: 573, type: !289, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !109, retainedNodes: !291)
!289 = !DISubroutineType(cc: DW_CC_nocall, types: !290)
!290 = !{null, !181, !181}
!291 = !{!292, !293, !294, !297, !298, !299, !300, !304, !305, !306, !307, !309, !360, !361, !362, !364, !365}
!292 = !DILocalVariable(name: "program", arg: 1, scope: !288, file: !124, line: 573, type: !181)
!293 = !DILocalVariable(name: "option", arg: 2, scope: !288, file: !124, line: 573, type: !181)
!294 = !DILocalVariable(name: "term", scope: !295, file: !124, line: 585, type: !181)
!295 = distinct !DILexicalBlock(scope: !296, file: !124, line: 582, column: 5)
!296 = distinct !DILexicalBlock(scope: !288, file: !124, line: 581, column: 7)
!297 = !DILocalVariable(name: "double_space", scope: !288, file: !124, line: 594, type: !244)
!298 = !DILocalVariable(name: "first_word", scope: !288, file: !124, line: 595, type: !181)
!299 = !DILocalVariable(name: "option_text", scope: !288, file: !124, line: 596, type: !181)
!300 = !DILocalVariable(name: "s", scope: !301, file: !124, line: 608, type: !181)
!301 = distinct !DILexicalBlock(scope: !302, file: !124, line: 605, column: 5)
!302 = distinct !DILexicalBlock(scope: !303, file: !124, line: 604, column: 12)
!303 = distinct !DILexicalBlock(scope: !288, file: !124, line: 597, column: 7)
!304 = !DILocalVariable(name: "spaces", scope: !301, file: !124, line: 609, type: !178)
!305 = !DILocalVariable(name: "anchor_len", scope: !288, file: !124, line: 620, type: !178)
!306 = !DILocalVariable(name: "desc_text", scope: !288, file: !124, line: 625, type: !181)
!307 = !DILocalVariable(name: "__ptr", scope: !308, file: !124, line: 644, type: !181)
!308 = distinct !DILexicalBlock(scope: !288, file: !124, line: 644, column: 3)
!309 = !DILocalVariable(name: "__stream", scope: !308, file: !124, line: 644, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !312, line: 7, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !314, line: 49, size: 1728, elements: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !331, !333, !334, !335, !337, !338, !340, !341, !344, !346, !349, !352, !353, !354, !355, !356}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !313, file: !314, line: 51, baseType: !125, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !313, file: !314, line: 54, baseType: !175, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !313, file: !314, line: 55, baseType: !175, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !313, file: !314, line: 56, baseType: !175, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !313, file: !314, line: 57, baseType: !175, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !313, file: !314, line: 58, baseType: !175, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !313, file: !314, line: 59, baseType: !175, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !313, file: !314, line: 60, baseType: !175, size: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !313, file: !314, line: 61, baseType: !175, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !313, file: !314, line: 64, baseType: !175, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !313, file: !314, line: 65, baseType: !175, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !313, file: !314, line: 66, baseType: !175, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !313, file: !314, line: 68, baseType: !329, size: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !314, line: 36, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !313, file: !314, line: 70, baseType: !332, size: 64, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !313, file: !314, line: 72, baseType: !125, size: 32, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !313, file: !314, line: 73, baseType: !125, size: 32, offset: 928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !313, file: !314, line: 74, baseType: !336, size: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !166, line: 152, baseType: !241)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !313, file: !314, line: 77, baseType: !177, size: 16, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !313, file: !314, line: 78, baseType: !339, size: 8, offset: 1040)
!339 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !313, file: !314, line: 79, baseType: !89, size: 8, offset: 1048)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !313, file: !314, line: 81, baseType: !342, size: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !314, line: 43, baseType: null)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !313, file: !314, line: 89, baseType: !345, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !166, line: 153, baseType: !241)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !313, file: !314, line: 91, baseType: !347, size: 64, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !314, line: 37, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !313, file: !314, line: 92, baseType: !350, size: 64, offset: 1280)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !314, line: 38, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !313, file: !314, line: 93, baseType: !332, size: 64, offset: 1344)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !313, file: !314, line: 94, baseType: !176, size: 64, offset: 1408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !313, file: !314, line: 95, baseType: !178, size: 64, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !313, file: !314, line: 96, baseType: !125, size: 32, offset: 1536)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !313, file: !314, line: 98, baseType: !357, size: 160, offset: 1568)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 20)
!360 = !DILocalVariable(name: "__cnt", scope: !308, file: !124, line: 644, type: !178)
!361 = !DILocalVariable(name: "url_program", scope: !288, file: !124, line: 648, type: !181)
!362 = !DILocalVariable(name: "__ptr", scope: !363, file: !124, line: 686, type: !181)
!363 = distinct !DILexicalBlock(scope: !288, file: !124, line: 686, column: 3)
!364 = !DILocalVariable(name: "__stream", scope: !363, file: !124, line: 686, type: !310)
!365 = !DILocalVariable(name: "__cnt", scope: !363, file: !124, line: 686, type: !178)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !124, line: 585, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 5)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !124, line: 586, type: !368, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !124, line: 595, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 4)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !124, line: 620, type: !19, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !267, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !368, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !375, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !69, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !124, line: 650, type: !368, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !19, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !19, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !124, line: 652, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 7)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !124, line: 653, type: !401, isLocal: true, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 8)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !124, line: 654, type: !94, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !124, line: 655, type: !94, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !124, line: 656, type: !94, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !124, line: 657, type: !94, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !124, line: 663, type: !396, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !124, line: 664, type: !94, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !224, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 40)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 15)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 61)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !124, line: 679, type: !69, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !124, line: 683, type: !368, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !124, line: 688, type: !368, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !124, line: 691, type: !401, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !124, line: 801, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1464, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 183)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !124, line: 808, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 83)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !124, line: 812, type: !34, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !124, line: 816, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 51)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !124, line: 839, type: !192, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !124, line: 840, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 22)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !124, line: 841, type: !425, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !124, line: 862, type: !375, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !124, line: 868, type: !34, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !124, line: 875, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 27)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !455, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 12)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !401, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !480, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !94, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !425, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !224, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !187, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !19, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !94, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !396, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !401, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !368, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !401, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "dereference", scope: !109, file: !2, line: 79, type: !125, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "verbosity", scope: !109, file: !2, line: 90, type: !118, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !2, line: 388, type: !192, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !2, line: 399, type: !224, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 239, type: !224, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !69, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 250, type: !214, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 38)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !462, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 186)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 45)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 58)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 49)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !473, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 35)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 29)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 56)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 26)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !74, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 59)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !552, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !267, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !480, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 520, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 65)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 3328, elements: !198)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !591, line: 50, size: 256, elements: !592)
!591 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!592 = !{!593, !594, !595, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !590, file: !591, line: 52, baseType: !181, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !590, file: !591, line: 55, baseType: !125, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !591, line: 56, baseType: !596, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !590, file: !591, line: 57, baseType: !125, size: 32, offset: 192)
!598 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!599 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!600 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !603, line: 3, type: !425, isLocal: true, isDefinition: true)
!603 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "Version", scope: !606, file: !603, line: 3, type: !181, isLocal: false, isDefinition: true)
!606 = distinct !DICompileUnit(language: DW_LANG_C11, file: !603, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !607, splitDebugInlining: false, nameTableKind: None)
!607 = !{!601, !604}
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "file_name", scope: !610, file: !611, line: 45, type: !181, isLocal: true, isDefinition: true)
!610 = distinct !DICompileUnit(language: DW_LANG_C11, file: !611, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !612, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!612 = !{!613, !615, !617, !619, !608, !621}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !611, line: 121, type: !396, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !611, line: 121, type: !480, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !611, line: 123, type: !396, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !611, line: 126, type: !69, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !610, file: !611, line: 55, type: !244, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !625, file: !626, line: 66, type: !672, isLocal: false, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C11, file: !626, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !627, globals: !628, splitDebugInlining: false, nameTableKind: None)
!626 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!627 = !{!176, !183}
!628 = !{!629, !631, !651, !653, !655, !657, !623, !659, !661, !663, !665, !670}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !626, line: 272, type: !368, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "old_file_name", scope: !633, file: !626, line: 304, type: !181, isLocal: true, isDefinition: true)
!633 = distinct !DISubprogram(name: "verror_at_line", scope: !626, file: !626, line: 298, type: !634, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !625, retainedNodes: !644)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !125, !125, !181, !112, !181, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !638)
!638 = !{!639, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !637, file: !640, baseType: !112, size: 32)
!640 = !DIFile(filename: "lib/error.c", directory: "/src")
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !637, file: !640, baseType: !112, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !637, file: !640, baseType: !176, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !637, file: !640, baseType: !176, size: 64, offset: 128)
!644 = !{!645, !646, !647, !648, !649, !650}
!645 = !DILocalVariable(name: "status", arg: 1, scope: !633, file: !626, line: 298, type: !125)
!646 = !DILocalVariable(name: "errnum", arg: 2, scope: !633, file: !626, line: 298, type: !125)
!647 = !DILocalVariable(name: "file_name", arg: 3, scope: !633, file: !626, line: 298, type: !181)
!648 = !DILocalVariable(name: "line_number", arg: 4, scope: !633, file: !626, line: 298, type: !112)
!649 = !DILocalVariable(name: "message", arg: 5, scope: !633, file: !626, line: 298, type: !181)
!650 = !DILocalVariable(name: "args", arg: 6, scope: !633, file: !626, line: 298, type: !636)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "old_line_number", scope: !633, file: !626, line: 305, type: !112, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !626, line: 338, type: !375, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !626, line: 346, type: !401, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !626, line: 346, type: !267, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "error_message_count", scope: !625, file: !626, line: 69, type: !112, isLocal: false, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !625, file: !626, line: 295, type: !125, isLocal: false, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !626, line: 208, type: !396, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !626, line: 208, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 21)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !626, line: 214, type: !368, isLocal: true, isDefinition: true)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null}
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !677, line: 399, type: !267, isLocal: true, isDefinition: true)
!677 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !677, line: 441, type: !89, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !677, line: 1080, type: !69, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !684, line: 226, type: !99, isLocal: true, isDefinition: true)
!684 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !684, line: 227, type: !99, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !684, line: 228, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 33)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !684, line: 231, type: !99, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "default_tuning", scope: !696, file: !684, line: 134, type: !700, isLocal: true, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !684, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !697, globals: !699, splitDebugInlining: false, nameTableKind: None)
!697 = !{!180, !176, !698, !178}
!698 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!699 = !{!682, !685, !687, !692, !694}
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !702, line: 52, baseType: !703)
!702 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !702, line: 40, size: 160, elements: !704)
!704 = !{!705, !706, !707, !708, !709}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !703, file: !702, line: 45, baseType: !698, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !703, file: !702, line: 46, baseType: !698, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !703, file: !702, line: 47, baseType: !698, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !703, file: !702, line: 48, baseType: !698, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !703, file: !702, line: 49, baseType: !244, size: 8, offset: 128)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "program_name", scope: !712, file: !713, line: 31, type: !181, isLocal: false, isDefinition: true)
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !714, globals: !715, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!714 = !{!175}
!715 = !{!710, !716, !718}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !713, line: 46, type: !401, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !713, line: 49, type: !375, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "utf07FF", scope: !722, file: !723, line: 46, type: !750, isLocal: true, isDefinition: true)
!722 = distinct !DISubprogram(name: "proper_name_lite", scope: !723, file: !723, line: 38, type: !724, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !726, retainedNodes: !728)
!723 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!724 = !DISubroutineType(types: !725)
!725 = !{!181, !181, !181}
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !727, splitDebugInlining: false, nameTableKind: None)
!727 = !{!720}
!728 = !{!729, !730, !731, !732, !737}
!729 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !722, file: !723, line: 38, type: !181)
!730 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !722, file: !723, line: 38, type: !181)
!731 = !DILocalVariable(name: "translation", scope: !722, file: !723, line: 40, type: !181)
!732 = !DILocalVariable(name: "w", scope: !722, file: !723, line: 47, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !734, line: 37, baseType: !735)
!734 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !166, line: 57, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !166, line: 42, baseType: !112)
!737 = !DILocalVariable(name: "mbs", scope: !722, file: !723, line: 48, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !739, line: 6, baseType: !740)
!739 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !741, line: 21, baseType: !742)
!741 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 13, size: 64, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !742, file: !741, line: 15, baseType: !125, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !742, file: !741, line: 20, baseType: !746, size: 32, offset: 32)
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !742, file: !741, line: 16, size: 32, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !746, file: !741, line: 18, baseType: !112, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !746, file: !741, line: 19, baseType: !375, size: 32)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 16, elements: !268)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !753, line: 78, type: !401, isLocal: true, isDefinition: true)
!753 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !753, line: 79, type: !19, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !753, line: 80, type: !197, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !753, line: 81, type: !197, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !753, line: 82, type: !357, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !753, line: 83, type: !267, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !753, line: 84, type: !401, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !753, line: 85, type: !396, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !753, line: 86, type: !396, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !753, line: 87, type: !401, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !774, file: !753, line: 76, type: !846, isLocal: false, isDefinition: true)
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !753, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !775, retainedTypes: !781, globals: !782, splitDebugInlining: false, nameTableKind: None)
!775 = !{!129, !776, !143}
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !130, line: 254, baseType: !112, size: 32, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!779 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!780 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!781 = !{!125, !177, !178}
!782 = !{!751, !754, !756, !758, !760, !762, !764, !766, !768, !770, !772, !783, !787, !797, !799, !804, !806, !808, !810, !812, !835, !842, !844}
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !774, file: !753, line: 92, type: !785, isLocal: false, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 320, elements: !95)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !774, file: !753, line: 1040, type: !789, isLocal: false, isDefinition: true)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !753, line: 56, size: 448, elements: !790)
!790 = !{!791, !792, !793, !795, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !789, file: !753, line: 59, baseType: !129, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !753, line: 62, baseType: !125, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !789, file: !753, line: 66, baseType: !794, size: 256, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, elements: !402)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !789, file: !753, line: 69, baseType: !181, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !789, file: !753, line: 72, baseType: !181, size: 64, offset: 384)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !774, file: !753, line: 107, type: !789, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "slot0", scope: !774, file: !753, line: 831, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 256)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !753, line: 321, type: !267, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !753, line: 357, type: !267, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !753, line: 358, type: !267, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !753, line: 199, type: !396, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "quote", scope: !814, file: !753, line: 228, type: !833, isLocal: true, isDefinition: true)
!814 = distinct !DISubprogram(name: "gettext_quote", scope: !753, file: !753, line: 197, type: !815, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !774, retainedNodes: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{!181, !181, !129}
!817 = !{!818, !819, !820, !821, !822}
!818 = !DILocalVariable(name: "msgid", arg: 1, scope: !814, file: !753, line: 197, type: !181)
!819 = !DILocalVariable(name: "s", arg: 2, scope: !814, file: !753, line: 197, type: !129)
!820 = !DILocalVariable(name: "translation", scope: !814, file: !753, line: 199, type: !181)
!821 = !DILocalVariable(name: "w", scope: !814, file: !753, line: 229, type: !733)
!822 = !DILocalVariable(name: "mbs", scope: !814, file: !753, line: 230, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !739, line: 6, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !741, line: 21, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 13, size: 64, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !825, file: !741, line: 15, baseType: !125, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !825, file: !741, line: 20, baseType: !829, size: 32, offset: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !825, file: !741, line: 16, size: 32, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !829, file: !741, line: 18, baseType: !112, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !829, file: !741, line: 19, baseType: !375, size: 32)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 64, elements: !834)
!834 = !{!269, !377}
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "slotvec", scope: !774, file: !753, line: 834, type: !837, isLocal: true, isDefinition: true)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !753, line: 823, size: 128, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !838, file: !753, line: 825, baseType: !178, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !838, file: !753, line: 826, baseType: !175, size: 64, offset: 64)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "nslots", scope: !774, file: !753, line: 832, type: !125, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "slotvec0", scope: !774, file: !753, line: 833, type: !838, isLocal: true, isDefinition: true)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 704, elements: !848)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!848 = !{!849}
!849 = !DISubrange(count: 11)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !852, line: 32, type: !267, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !855, line: 67, type: !480, isLocal: true, isDefinition: true)
!855 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !855, line: 69, type: !396, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !855, line: 83, type: !396, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !855, line: 83, type: !375, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !855, line: 85, type: !267, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !855, line: 88, type: !866, isLocal: true, isDefinition: true)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 171)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !855, line: 88, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 34)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !855, line: 105, type: !192, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !855, line: 109, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 23)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !855, line: 113, type: !883, isLocal: true, isDefinition: true)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 28)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !855, line: 120, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 32)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !855, line: 127, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 36)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !855, line: 134, type: !420, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !855, line: 142, type: !207, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !855, line: 150, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 48)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !855, line: 159, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 52)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !855, line: 170, type: !912, isLocal: true, isDefinition: true)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 60)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !855, line: 248, type: !357, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !855, line: 248, type: !462, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !855, line: 254, type: !357, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !855, line: 254, type: !187, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !855, line: 254, type: !420, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !855, line: 259, type: !3, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !855, line: 259, type: !557, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !931, file: !932, line: 26, type: !934, isLocal: false, isDefinition: true)
!931 = distinct !DICompileUnit(language: DW_LANG_C11, file: !932, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !933, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!933 = !{!929}
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 376, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 47)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "exit_failure", scope: !939, file: !940, line: 24, type: !942, isLocal: false, isDefinition: true)
!939 = distinct !DICompileUnit(language: DW_LANG_C11, file: !940, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !941, splitDebugInlining: false, nameTableKind: None)
!940 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!941 = !{!937}
!942 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !125)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !945, line: 34, type: !69, isLocal: true, isDefinition: true)
!945 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !945, line: 34, type: !396, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !945, line: 34, type: !224, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !952, line: 40, type: !557, isLocal: true, isDefinition: true)
!952 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !952, line: 40, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !848)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !952, line: 40, type: !958, isLocal: true, isDefinition: true)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 624, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 78)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !963, line: 59, type: !99, isLocal: true, isDefinition: true)
!963 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !963, line: 59, type: !966, isLocal: true, isDefinition: true)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 18)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !963, line: 59, type: !971, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 536, elements: !55)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !974, file: !975, line: 506, type: !125, isLocal: true, isDefinition: true)
!974 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !975, file: !975, line: 485, type: !976, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !978, retainedNodes: !980)
!975 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!976 = !DISubroutineType(types: !977)
!977 = !{!125, !125, !125}
!978 = distinct !DICompileUnit(language: DW_LANG_C11, file: !975, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !979, splitDebugInlining: false, nameTableKind: None)
!979 = !{!972}
!980 = !{!981, !982, !983, !984, !987}
!981 = !DILocalVariable(name: "fd", arg: 1, scope: !974, file: !975, line: 485, type: !125)
!982 = !DILocalVariable(name: "target", arg: 2, scope: !974, file: !975, line: 485, type: !125)
!983 = !DILocalVariable(name: "result", scope: !974, file: !975, line: 487, type: !125)
!984 = !DILocalVariable(name: "flags", scope: !985, file: !975, line: 530, type: !125)
!985 = distinct !DILexicalBlock(scope: !986, file: !975, line: 529, column: 5)
!986 = distinct !DILexicalBlock(scope: !974, file: !975, line: 528, column: 7)
!987 = !DILocalVariable(name: "saved_errno", scope: !988, file: !975, line: 533, type: !125)
!988 = distinct !DILexicalBlock(scope: !989, file: !975, line: 532, column: 9)
!989 = distinct !DILexicalBlock(scope: !985, file: !975, line: 531, column: 11)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !992, line: 108, type: !89, isLocal: true, isDefinition: true)
!992 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "internal_state", scope: !995, file: !992, line: 97, type: !998, isLocal: true, isDefinition: true)
!995 = distinct !DICompileUnit(language: DW_LANG_C11, file: !992, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !996, globals: !997, splitDebugInlining: false, nameTableKind: None)
!996 = !{!176, !178, !183}
!997 = !{!990, !993}
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !739, line: 6, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !741, line: 21, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 13, size: 64, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1000, file: !741, line: 15, baseType: !125, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1000, file: !741, line: 20, baseType: !1004, size: 32, offset: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1000, file: !741, line: 16, size: 32, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1004, file: !741, line: 18, baseType: !112, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1004, file: !741, line: 19, baseType: !375, size: 32)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !1010, line: 35, type: !19, isLocal: true, isDefinition: true)
!1010 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1011 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1012, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "lib/filemode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4709245c6350fbec3a6a0f5fa66bc341")
!1013 = distinct !DICompileUnit(language: DW_LANG_C11, file: !677, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1014, retainedTypes: !1169, globals: !1180, splitDebugInlining: false, nameTableKind: None)
!1014 = !{!1015, !1019, !1145, !1148, !1152, !1163, !1166}
!1015 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !677, line: 159, baseType: !112, size: 32, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1018 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1019 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1021, file: !1020, line: 54, baseType: !112, size: 32, elements: !1143)
!1020 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1021 = distinct !DISubprogram(name: "setup_dir", scope: !1020, file: !1020, line: 50, type: !1022, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1013, retainedNodes: !1141)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!244, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1026, line: 233, baseType: !1027)
!1026 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1026, line: 115, size: 1024, elements: !1028)
!1028 = !{!1029, !1091, !1092, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1107, !1108, !1111, !1130}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1027, file: !1026, line: 116, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1026, line: 235, size: 2048, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1087}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1031, file: !1026, line: 236, baseType: !1030, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1031, file: !1026, line: 237, baseType: !1030, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1031, file: !1026, line: 238, baseType: !1030, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1031, file: !1026, line: 239, baseType: !1037, size: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1039, line: 127, baseType: !1040)
!1039 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1039, line: 127, flags: DIFlagFwdDecl)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1031, file: !1026, line: 242, baseType: !241, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1031, file: !1026, line: 243, baseType: !176, size: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1031, file: !1026, line: 244, baseType: !175, size: 64, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1031, file: !1026, line: 245, baseType: !175, size: 64, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1031, file: !1026, line: 246, baseType: !125, size: 32, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1031, file: !1026, line: 247, baseType: !125, size: 32, offset: 544)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1031, file: !1026, line: 248, baseType: !178, size: 64, offset: 576)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1031, file: !1026, line: 250, baseType: !1024, size: 64, offset: 640)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1031, file: !1026, line: 254, baseType: !240, size: 64, offset: 704)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1031, file: !1026, line: 256, baseType: !178, size: 64, offset: 768)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1031, file: !1026, line: 272, baseType: !177, size: 16, offset: 832)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1031, file: !1026, line: 276, baseType: !177, size: 16, offset: 848)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1031, file: !1026, line: 282, baseType: !177, size: 16, offset: 864)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1031, file: !1026, line: 284, baseType: !1055, size: 1152, offset: 896)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 1152, elements: !90)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1057, line: 26, size: 1152, elements: !1058)
!1057 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1058 = !{!1059, !1060, !1061, !1063, !1064, !1066, !1068, !1069, !1070, !1071, !1073, !1075, !1083, !1084, !1085}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1056, file: !1057, line: 31, baseType: !264, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1056, file: !1057, line: 36, baseType: !261, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1056, file: !1057, line: 44, baseType: !1062, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !166, line: 151, baseType: !180)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1056, file: !1057, line: 45, baseType: !165, size: 32, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1056, file: !1057, line: 47, baseType: !1065, size: 32, offset: 224)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !166, line: 146, baseType: !112)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1056, file: !1057, line: 48, baseType: !1067, size: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !166, line: 147, baseType: !112)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1056, file: !1057, line: 50, baseType: !125, size: 32, offset: 288)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1056, file: !1057, line: 52, baseType: !264, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1056, file: !1057, line: 57, baseType: !336, size: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1056, file: !1057, line: 61, baseType: !1072, size: 64, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !166, line: 175, baseType: !241)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1056, file: !1057, line: 63, baseType: !1074, size: 64, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !166, line: 180, baseType: !241)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1056, file: !1057, line: 74, baseType: !1076, size: 128, offset: 576)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1077, line: 11, size: 128, elements: !1078)
!1077 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1078 = !{!1079, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1076, file: !1077, line: 16, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !166, line: 160, baseType: !241)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1076, file: !1077, line: 21, baseType: !1082, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !166, line: 197, baseType: !241)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1056, file: !1057, line: 75, baseType: !1076, size: 128, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1056, file: !1057, line: 76, baseType: !1076, size: 128, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1056, file: !1057, line: 89, baseType: !1086, size: 192, offset: 960)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 192, elements: !70)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !1031, file: !1026, line: 285, baseType: !1088, offset: 2048)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: -1)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !1027, file: !1026, line: 117, baseType: !1030, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !1027, file: !1026, line: 118, baseType: !1093, size: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !1027, file: !1026, line: 119, baseType: !263, size: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1027, file: !1026, line: 120, baseType: !175, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !1027, file: !1026, line: 121, baseType: !125, size: 32, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !1027, file: !1026, line: 122, baseType: !125, size: 32, offset: 352)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1027, file: !1026, line: 124, baseType: !178, size: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !1027, file: !1026, line: 125, baseType: !178, size: 64, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !1027, file: !1026, line: 126, baseType: !1101, size: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!125, !1104, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !1027, file: !1026, line: 196, baseType: !125, size: 32, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !1027, file: !1026, line: 205, baseType: !1109, size: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1026, line: 205, flags: DIFlagFwdDecl)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1027, file: !1026, line: 227, baseType: !1112, size: 64, offset: 704)
!1112 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1027, file: !1026, line: 207, size: 64, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1112, file: !1026, line: 220, baseType: !1109, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1112, file: !1026, line: 226, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !1118, line: 32, size: 256, elements: !1119)
!1118 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!1119 = !{!1120, !1125, !1129}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !1117, file: !1118, line: 34, baseType: !1121, size: 128)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !257, line: 30, size: 128, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1121, file: !257, line: 32, baseType: !260, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1121, file: !257, line: 33, baseType: !263, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !1117, file: !1118, line: 35, baseType: !1126, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1127, line: 102, baseType: !1128)
!1127 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !166, line: 73, baseType: !180)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1117, file: !1118, line: 36, baseType: !125, size: 32, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !1027, file: !1026, line: 232, baseType: !1131, size: 256, offset: 768)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !1132, line: 47, baseType: !1133)
!1132 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !1132, line: 39, size: 256, elements: !1134)
!1134 = !{!1135, !1137, !1138, !1139, !1140}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !1133, file: !1132, line: 41, baseType: !1136, size: 128)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !376)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !1133, file: !1132, line: 42, baseType: !125, size: 32, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !1133, file: !1132, line: 43, baseType: !112, size: 32, offset: 160)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !1133, file: !1132, line: 44, baseType: !112, size: 32, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !1133, file: !1132, line: 45, baseType: !244, size: 8, offset: 224)
!1141 = !{!1142}
!1142 = !DILocalVariable(name: "fts", arg: 1, scope: !1021, file: !1020, line: 50, type: !1024)
!1143 = !{!1144}
!1144 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!1145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !677, line: 635, baseType: !112, size: 32, elements: !1146)
!1146 = !{!1147}
