; ModuleID = 'src/cksum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.base64_decode_context = type { i32, [4 x i8] }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha1_ctx = type { i32, i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha256_ctx = type { [8 x i32], [2 x i32], i64, [32 x i32] }
%struct.sha3_ctx = type { [25 x i64], [144 x i8], i64, i64, i64 }
%struct.sha512_ctx = type { [8 x i64], [2 x i64], i64, [32 x i64] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@cksum_algorithm = dso_local local_unnamed_addr global i32 2, align 4, !dbg !0

!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !179, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !428, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !433, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !433, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !433, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !184, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !428, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "algorithm_tags", scope: !2, file: !3, line: 360, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 960, elements: !317)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !42, line: 729, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 448, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 56)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !42, line: 736, type: !259, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !473, file: !42, line: 575, type: !43, isLocal: true, isDefinition: true)
!473 = distinct !DISubprogram(name: "oputs_", scope: !42, file: !42, line: 573, type: !474, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !476)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !142, !142}
!476 = !{!477, !478, !479, !482, !483, !484, !485, !489, !490, !491, !492, !494, !545, !546, !547, !549, !550}
!477 = !DILocalVariable(name: "program", arg: 1, scope: !473, file: !42, line: 573, type: !142)
!478 = !DILocalVariable(name: "option", arg: 2, scope: !473, file: !42, line: 573, type: !142)
!479 = !DILocalVariable(name: "term", scope: !480, file: !42, line: 585, type: !142)
!480 = distinct !DILexicalBlock(scope: !481, file: !42, line: 582, column: 5)
!481 = distinct !DILexicalBlock(scope: !473, file: !42, line: 581, column: 7)
!482 = !DILocalVariable(name: "double_space", scope: !473, file: !42, line: 594, type: !411)
!483 = !DILocalVariable(name: "first_word", scope: !473, file: !42, line: 595, type: !142)
!484 = !DILocalVariable(name: "option_text", scope: !473, file: !42, line: 596, type: !142)
!485 = !DILocalVariable(name: "s", scope: !486, file: !42, line: 608, type: !142)
!486 = distinct !DILexicalBlock(scope: !487, file: !42, line: 605, column: 5)
!487 = distinct !DILexicalBlock(scope: !488, file: !42, line: 604, column: 12)
!488 = distinct !DILexicalBlock(scope: !473, file: !42, line: 597, column: 7)
!489 = !DILocalVariable(name: "spaces", scope: !486, file: !42, line: 609, type: !140)
!490 = !DILocalVariable(name: "anchor_len", scope: !473, file: !42, line: 620, type: !140)
!491 = !DILocalVariable(name: "desc_text", scope: !473, file: !42, line: 625, type: !142)
!492 = !DILocalVariable(name: "__ptr", scope: !493, file: !42, line: 644, type: !142)
!493 = distinct !DILexicalBlock(scope: !473, file: !42, line: 644, column: 3)
!494 = !DILocalVariable(name: "__stream", scope: !493, file: !42, line: 644, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !497, line: 7, baseType: !498)
!497 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !499, line: 49, size: 1728, elements: !500)
!499 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !516, !518, !519, !520, !522, !523, !525, !526, !529, !531, !534, !537, !538, !539, !540, !541}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !498, file: !499, line: 51, baseType: !43, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !498, file: !499, line: 54, baseType: !136, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !498, file: !499, line: 55, baseType: !136, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !498, file: !499, line: 56, baseType: !136, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !498, file: !499, line: 57, baseType: !136, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !498, file: !499, line: 58, baseType: !136, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !498, file: !499, line: 59, baseType: !136, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !498, file: !499, line: 60, baseType: !136, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !498, file: !499, line: 61, baseType: !136, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !498, file: !499, line: 64, baseType: !136, size: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !498, file: !499, line: 65, baseType: !136, size: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !498, file: !499, line: 66, baseType: !136, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !498, file: !499, line: 68, baseType: !514, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !499, line: 36, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !498, file: !499, line: 70, baseType: !517, size: 64, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !498, file: !499, line: 72, baseType: !43, size: 32, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !498, file: !499, line: 73, baseType: !43, size: 32, offset: 928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !498, file: !499, line: 74, baseType: !521, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !417)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !498, file: !499, line: 77, baseType: !139, size: 16, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !498, file: !499, line: 78, baseType: !524, size: 8, offset: 1040)
!524 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !498, file: !499, line: 79, baseType: !295, size: 8, offset: 1048)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !498, file: !499, line: 81, baseType: !527, size: 64, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !499, line: 43, baseType: null)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !498, file: !499, line: 89, baseType: !530, size: 64, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !417)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !498, file: !499, line: 91, baseType: !532, size: 64, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !499, line: 37, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !498, file: !499, line: 92, baseType: !535, size: 64, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !499, line: 38, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !498, file: !499, line: 93, baseType: !517, size: 64, offset: 1344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !498, file: !499, line: 94, baseType: !138, size: 64, offset: 1408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !498, file: !499, line: 95, baseType: !140, size: 64, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !498, file: !499, line: 96, baseType: !43, size: 32, offset: 1536)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !498, file: !499, line: 98, baseType: !542, size: 160, offset: 1568)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 20)
!545 = !DILocalVariable(name: "__cnt", scope: !493, file: !42, line: 644, type: !140)
!546 = !DILocalVariable(name: "url_program", scope: !473, file: !42, line: 648, type: !142)
!547 = !DILocalVariable(name: "__ptr", scope: !548, file: !42, line: 686, type: !142)
!548 = distinct !DILexicalBlock(scope: !473, file: !42, line: 686, column: 3)
!549 = !DILocalVariable(name: "__stream", scope: !548, file: !42, line: 686, type: !495)
!550 = !DILocalVariable(name: "__cnt", scope: !548, file: !42, line: 686, type: !140)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !42, line: 585, type: !433, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !42, line: 586, type: !433, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !42, line: 595, type: !428, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !42, line: 620, type: !174, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !42, line: 648, type: !399, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !42, line: 648, type: !433, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !42, line: 649, type: !428, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !42, line: 649, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 24, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 3)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !42, line: 650, type: !433, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !42, line: 651, type: !174, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !42, line: 663, type: !179, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !42, line: 664, type: !189, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !42, line: 669, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 136, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 17)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !42, line: 669, type: !164, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !42, line: 676, type: !316, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !42, line: 676, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 488, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 61)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !42, line: 679, type: !567, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !42, line: 683, type: !433, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !42, line: 688, type: !433, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !42, line: 691, type: !184, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !42, line: 839, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 16)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !42, line: 840, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 176, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 22)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !42, line: 841, type: !316, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !42, line: 862, type: !428, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !42, line: 868, type: !249, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !42, line: 875, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 216, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 27)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !42, line: 877, type: !239, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !42, line: 877, type: !311, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !3, line: 456, type: !179, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !3, line: 460, type: !174, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !3, line: 461, type: !316, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !3, line: 462, type: !174, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !3, line: 463, type: !179, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !3, line: 464, type: !433, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !3, line: 465, type: !179, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !3, line: 466, type: !428, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !3, line: 467, type: !433, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !3, line: 470, type: !189, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !3, line: 471, type: !179, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !3, line: 472, type: !174, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !3, line: 473, type: !428, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !3, line: 474, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 72, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 9)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !3, line: 476, type: !179, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !3, line: 477, type: !433, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !3, line: 483, type: !433, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !3, line: 484, type: !184, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 453, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 4864, elements: !346)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !669, line: 50, size: 256, elements: !670)
!669 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!670 = !{!671, !672, !673, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !669, line: 52, baseType: !142, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !668, file: !669, line: 55, baseType: !43, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !669, line: 56, baseType: !674, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !668, file: !669, line: 57, baseType: !43, size: 32, offset: 192)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "algorithm_specified", scope: !2, file: !3, line: 375, type: !411, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "legacy_long_options", scope: !2, file: !3, line: 433, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 3328, elements: !331)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "algorithm_types", scope: !2, file: !3, line: 352, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 448, elements: !322)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !428, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !433, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !428, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !179, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !428, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !433, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !433, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !433, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !184, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !428, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "algorithm_args", scope: !2, file: !3, line: 346, type: !462, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 204, type: !411, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 208, type: !411, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 214, type: !411, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 211, type: !411, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 218, type: !411, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "base64_digest", scope: !2, file: !3, line: 228, type: !411, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "raw_digest", scope: !2, file: !3, line: 232, type: !411, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "digest_delim", scope: !2, file: !3, line: 224, type: !144, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "algorithm_bits", scope: !2, file: !3, line: 366, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 480, elements: !317)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1390, type: !399, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1393, type: !567, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1410, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 224, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 28)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1440, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 376, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 47)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1461, type: !184, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1461, type: !542, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1490, type: !174, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1490, type: !179, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1492, type: !567, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1512, type: !316, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1520, type: !746, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1528, type: !358, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1528, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 352, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 44)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1536, type: !772, isLocal: true, isDefinition: true)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 344, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 43)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1536, type: !767, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1544, type: !210, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1544, type: !394, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1552, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 200, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 25)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "max_tag_len", scope: !788, file: !3, line: 872, type: !414, isLocal: true, isDefinition: true)
!788 = distinct !DISubprogram(name: "algorithm_from_tag", scope: !3, file: !3, line: 869, type: !789, scopeLine: 870, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!416, !136}
!791 = !{!792, !793, !797, !799, !800, !801}
!792 = !DILocalVariable(name: "s", arg: 1, scope: !788, file: !3, line: 869, type: !136)
!793 = !DILocalVariable(name: "tag", scope: !794, file: !3, line: 875, type: !796)
!794 = distinct !DILexicalBlock(scope: !795, file: !3, line: 874, column: 5)
!795 = distinct !DILexicalBlock(scope: !788, file: !3, line: 873, column: 7)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!797 = !DILocalVariable(name: "tag_len", scope: !798, file: !3, line: 878, type: !414)
!798 = distinct !DILexicalBlock(scope: !794, file: !3, line: 877, column: 9)
!799 = !DILocalVariable(name: "i", scope: !788, file: !3, line: 883, type: !414)
!800 = !DILocalVariable(name: "sep", scope: !788, file: !3, line: 894, type: !137)
!801 = !DILocalVariable(name: "algo", scope: !788, file: !3, line: 896, type: !416)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 221, type: !43, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "bin2hex", scope: !806, file: !3, line: 1345, type: !816, isLocal: true, isDefinition: true)
!806 = distinct !DISubprogram(name: "hex_equal", scope: !3, file: !3, line: 1343, type: !807, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !811)
!807 = !DISubroutineType(types: !808)
!808 = !{!411, !809, !809}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!811 = !{!812, !813, !814, !815}
!812 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !806, file: !3, line: 1343, type: !809)
!813 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !806, file: !3, line: 1343, type: !809)
!814 = !DILocalVariable(name: "digest_bin_bytes", scope: !806, file: !3, line: 1349, type: !414)
!815 = !DILocalVariable(name: "cnt", scope: !806, file: !3, line: 1353, type: !414)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !603)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !42, line: 952, type: !311, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "cksumfns", scope: !2, file: !3, line: 379, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 896, elements: !322)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !823, line: 7, baseType: !824)
!823 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!43, !495, !138, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !104, line: 101, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !106, line: 72, baseType: !417)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !399, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !311, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 384, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 48)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !3, line: 332, type: !836, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "cksum_output_fns", scope: !2, file: !3, line: 396, type: !843, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 896, elements: !322)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !3, line: 244, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !142, !43, !134, !411, !411, !144, !411, !828}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1276, type: !174, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1285, type: !428, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1292, type: !567, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1294, type: !433, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1309, type: !433, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !3, line: 717, type: !428, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1152, type: !567, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1156, type: !567, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1160, type: !567, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!867 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!868 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!870 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!871 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!872 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!873 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!874 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!875 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!876 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!877 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 7, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !880, file: !881, line: 27, type: !918, isLocal: true, isDefinition: true)
!880 = distinct !DICompileUnit(language: DW_LANG_C11, file: !881, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !882, retainedTypes: !891, globals: !899, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28d09caefc730ba5ec0593f4ff5ef776")
!882 = !{!883}
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !884, line: 42, baseType: !7, size: 32, elements: !885)
!884 = !DIFile(filename: "src/blake2/blake2.h", directory: "/src", checksumkind: CSK_MD5, checksum: "98dc573ce8fd1dd56441f8e485f7bd5e")
!885 = !{!886, !887, !888, !889, !890}
!886 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!887 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!888 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!889 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!890 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!891 = !{!892, !894, !809, !138, !897}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !895, line: 24, baseType: !896)
!895 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !106, line: 38, baseType: !144)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 27, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !106, line: 45, baseType: !102)
!899 = !{!878, !900, !914}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "memset_v", scope: !902, file: !903, line: 161, type: !909, isLocal: true, isDefinition: true)
!902 = distinct !DISubprogram(name: "secure_zero_memory", scope: !903, file: !903, line: 159, type: !904, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !880, retainedNodes: !906)
!903 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8e1e523af54e01275d11e95a252b1371")
!904 = !DISubroutineType(types: !905)
!905 = !{null, !138, !140}
!906 = !{!907, !908}
!907 = !DILocalVariable(name: "v", arg: 1, scope: !902, file: !903, line: 159, type: !138)
!908 = !DILocalVariable(name: "n", arg: 2, scope: !902, file: !903, line: 159, type: !140)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!138, !138, !43, !140}
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !880, file: !881, line: 35, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 1536, elements: !917)
!917 = !{!313, !604}
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 512, elements: !185)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !922, line: 199, type: !653, isLocal: true, isDefinition: true)
!922 = !DIFile(filename: "src/sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "984061a05cf8100a66387ffa345dea00")
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !922, line: 202, type: !428, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !922, line: 224, type: !174, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "cksum_fp", scope: !929, file: !930, line: 287, type: !1039, isLocal: true, isDefinition: true)
!929 = distinct !DISubprogram(name: "crc_sum_stream", scope: !930, file: !930, line: 282, type: !931, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !967, retainedNodes: !1031)
!930 = !DIFile(filename: "src/cksum_crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6cd2e7250e6ce2490cff53f0738655c9")
!931 = !DISubroutineType(types: !932)
!932 = !{!43, !933, !138, !827}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !497, line: 7, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !499, line: 49, size: 1728, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !935, file: !499, line: 51, baseType: !43, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !935, file: !499, line: 54, baseType: !136, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !935, file: !499, line: 55, baseType: !136, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !935, file: !499, line: 56, baseType: !136, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !935, file: !499, line: 57, baseType: !136, size: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !935, file: !499, line: 58, baseType: !136, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !935, file: !499, line: 59, baseType: !136, size: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !935, file: !499, line: 60, baseType: !136, size: 64, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !935, file: !499, line: 61, baseType: !136, size: 64, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !935, file: !499, line: 64, baseType: !136, size: 64, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !935, file: !499, line: 65, baseType: !136, size: 64, offset: 640)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !935, file: !499, line: 66, baseType: !136, size: 64, offset: 704)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !935, file: !499, line: 68, baseType: !514, size: 64, offset: 768)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !935, file: !499, line: 70, baseType: !951, size: 64, offset: 832)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !935, file: !499, line: 72, baseType: !43, size: 32, offset: 896)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !935, file: !499, line: 73, baseType: !43, size: 32, offset: 928)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !935, file: !499, line: 74, baseType: !521, size: 64, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !935, file: !499, line: 77, baseType: !139, size: 16, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !935, file: !499, line: 78, baseType: !524, size: 8, offset: 1040)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !935, file: !499, line: 79, baseType: !295, size: 8, offset: 1048)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !935, file: !499, line: 81, baseType: !527, size: 64, offset: 1088)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !935, file: !499, line: 89, baseType: !530, size: 64, offset: 1152)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !935, file: !499, line: 91, baseType: !532, size: 64, offset: 1216)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !935, file: !499, line: 92, baseType: !535, size: 64, offset: 1280)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !935, file: !499, line: 93, baseType: !951, size: 64, offset: 1344)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !935, file: !499, line: 94, baseType: !138, size: 64, offset: 1408)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !935, file: !499, line: 95, baseType: !140, size: 64, offset: 1472)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !935, file: !499, line: 96, baseType: !43, size: 32, offset: 1536)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !935, file: !499, line: 98, baseType: !542, size: 160, offset: 1568)
!967 = distinct !DICompileUnit(language: DW_LANG_C11, file: !930, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !968, globals: !973, splitDebugInlining: false, nameTableKind: None)
!968 = !{!411, !142, !969, !140, !972, !145, !144}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !895, line: 26, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !106, line: 42, baseType: !7)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!973 = !{!927, !974, !976, !978, !980, !982, !987, !989, !991, !993, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1027, !1029}
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !930, line: 371, type: !179, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !930, line: 373, type: !428, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !930, line: 190, type: !184, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !930, line: 191, type: !653, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !930, line: 192, type: !984, isLocal: true, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 88, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 11)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !930, line: 195, type: !567, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !930, line: 195, type: !159, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !930, line: 195, type: !741, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !995, line: 68, type: !428, isLocal: true, isDefinition: true)
!995 = !DIFile(filename: "./lib/cpu-supports.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9be339edc1bd703a3f96b2a763524c18")
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !995, line: 68, type: !433, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !995, line: 69, type: !433, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !995, line: 69, type: !174, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !995, line: 70, type: !189, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !995, line: 71, type: !653, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !995, line: 72, type: !179, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !995, line: 72, type: !984, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !995, line: 73, type: !311, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !995, line: 75, type: !174, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !995, line: 75, type: !179, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !995, line: 76, type: !174, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !995, line: 76, type: !179, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !930, line: 172, type: !741, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !930, line: 172, type: !1024, isLocal: true, isDefinition: true)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 208, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 26)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !930, line: 149, type: !159, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !930, line: 149, type: !741, isLocal: true, isDefinition: true)
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1038}
!1032 = !DILocalVariable(name: "stream", arg: 1, scope: !929, file: !930, line: 282, type: !933)
!1033 = !DILocalVariable(name: "resstream", arg: 2, scope: !929, file: !930, line: 282, type: !138)
!1034 = !DILocalVariable(name: "length", arg: 3, scope: !929, file: !930, line: 282, type: !827)
!1035 = !DILocalVariable(name: "total_bytes", scope: !929, file: !930, line: 284, type: !828)
!1036 = !DILocalVariable(name: "crc", scope: !929, file: !930, line: 285, type: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !104, line: 74, baseType: !102)
!1038 = !DILocalVariable(name: "crc_out", scope: !929, file: !930, line: 308, type: !7)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "cksum_fp_t", file: !930, line: 140, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!411, !933, !1043, !827}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 3, type: !316, isLocal: true, isDefinition: true)
!1046 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "Version", scope: !1049, file: !1046, line: 3, type: !142, isLocal: false, isDefinition: true)
!1049 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1046, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1050, splitDebugInlining: false, nameTableKind: None)
!1050 = !{!1044, !1047}
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1053, file: !1054, line: 65, type: !1076, isLocal: false, isDefinition: true)
!1053 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1054, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1055, retainedTypes: !1056, globals: !1057, splitDebugInlining: false, nameTableKind: None)
!1054 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1055 = !{!76}
!1056 = !{!138, !142, !144}
!1057 = !{!1051, !1058, !1060, !1062, !1067, !1072, !1074}
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 141, type: !179, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 141, type: !618, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 142, type: !1064, isLocal: true, isDefinition: true)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 232, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 29)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 160, type: !1069, isLocal: true, isDefinition: true)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 168, elements: !1070)
!1070 = !{!1071}
!1071 = !DISubrange(count: 21)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 165, type: !184, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 170, type: !433, isLocal: true, isDefinition: true)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1077, line: 69, baseType: !1078)
!1077 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{null}
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "base64_to_int", scope: !1083, file: !1084, line: 243, type: !1090, isLocal: false, isDefinition: true)
!1083 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1084, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1085, globals: !1086, splitDebugInlining: false, nameTableKind: None)
!1084 = !DIFile(filename: "lib/base64.c", directory: "/src", checksumkind: CSK_MD5, checksum: "de7b87ba8809e6c9b8f3253a3b932105")
!1085 = !{!411, !417, !102, !138, !136}
!1086 = !{!1081, !1087}
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "b64c", scope: !1083, file: !1084, line: 62, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 512, elements: !223)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 2048, elements: !1092)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!1092 = !{!1093}
!1093 = !DISubrange(count: 256)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(name: "file_name", scope: !1096, file: !1097, line: 45, type: !142, isLocal: true, isDefinition: true)
!1096 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1097, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1098, splitDebugInlining: false, nameTableKind: None)
!1097 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1098 = !{!1099, !1101, !1103, !1105, !1094, !1107}
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !1097, line: 121, type: !179, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !1097, line: 121, type: !311, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1097, line: 123, type: !179, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !1097, line: 126, type: !567, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1096, file: !1097, line: 55, type: !411, isLocal: true, isDefinition: true)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !1111, file: !1112, line: 25, type: !411, isLocal: false, isDefinition: true)
!1111 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1112, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1113, splitDebugInlining: false, nameTableKind: None)
!1112 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!1113 = !{!1109, !1114, !1129, !1131, !1136}
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(name: "hwcaps", scope: !1116, file: !1112, line: 45, type: !142, isLocal: true, isDefinition: true)
!1116 = distinct !DISubprogram(name: "hwcap_allowed", scope: !1112, file: !1112, line: 28, type: !1117, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1111, retainedNodes: !1119)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!411, !142}
!1119 = !{!1120, !1121, !1126, !1127, !1128}
!1120 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !1116, file: !1112, line: 28, type: !142)
!1121 = !DILocalVariable(name: "tunables_start", scope: !1122, file: !1112, line: 50, type: !142)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !1112, line: 49, column: 9)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !1112, line: 48, column: 11)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !1112, line: 47, column: 5)
!1125 = distinct !DILexicalBlock(scope: !1116, file: !1112, line: 46, column: 7)
!1126 = !DILocalVariable(name: "last_hwcaps", scope: !1122, file: !1112, line: 51, type: !142)
!1127 = !DILocalVariable(name: "sentinel", scope: !1116, file: !1112, line: 67, type: !142)
!1128 = !DILocalVariable(name: "cap", scope: !1116, file: !1112, line: 70, type: !142)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !1112, line: 48, type: !316, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1112, line: 52, type: !1133, isLocal: true, isDefinition: true)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 144, elements: !1134)
!1134 = !{!1135}
!1135 = !DISubrange(count: 18)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !1112, line: 55, type: !295, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1139 = distinct !DIGlobalVariable(name: "pclmul_checked", scope: !1140, file: !1141, line: 28, type: !411, isLocal: true, isDefinition: true)
!1140 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1141, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1142, splitDebugInlining: false, nameTableKind: None)
!1141 = !DIFile(filename: "lib/crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b660508727a09332fc61bae8755ce0d9")
!1142 = !{!1143, !1145, !1147, !1148, !1150, !1152, !1154, !1156, !1158, !1160, !1162, !1164, !1166, !1168, !1170, !1172, !1174, !1176, !1178}
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !1141, line: 120, type: !179, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1141, line: 121, type: !428, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !995, line: 68, type: !433, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !995, line: 69, type: !433, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(scope: null, file: !995, line: 69, type: !174, isLocal: true, isDefinition: true)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(scope: null, file: !995, line: 70, type: !653, isLocal: true, isDefinition: true)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !995, line: 70, type: !189, isLocal: true, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !995, line: 71, type: !184, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !995, line: 71, type: !653, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !995, line: 72, type: !984, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(scope: null, file: !995, line: 73, type: !984, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(scope: null, file: !995, line: 73, type: !311, isLocal: true, isDefinition: true)
!1168 = !DIGlobalVariableExpression(var: !1169, expr: !DIExpression())
!1169 = distinct !DIGlobalVariable(scope: null, file: !995, line: 75, type: !174, isLocal: true, isDefinition: true)
!1170 = !DIGlobalVariableExpression(var: !1171, expr: !DIExpression())
!1171 = distinct !DIGlobalVariable(scope: null, file: !995, line: 75, type: !179, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !995, line: 76, type: !174, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !995, line: 76, type: !179, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(name: "pclmul_enabled", scope: !1140, file: !1141, line: 27, type: !411, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(name: "crc32_sliceby8_table", scope: !1140, file: !1180, line: 19, type: !1181, isLocal: true, isDefinition: true)
!1180 = !DIFile(filename: "./lib/crc-sliceby8.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75ea92a6339c8e06d620d2f884dd622b")
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 65536, elements: !1183)
!1182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1183 = !{!186, !1093}
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1186, file: !1187, line: 60, type: !1191, isLocal: true, isDefinition: true)
!1186 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1187, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1188, globals: !1190, splitDebugInlining: false, nameTableKind: None)
!1187 = !DIFile(filename: "lib/md5.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9a1fce7e7c2db2e106b191e5deaa23a2")
!1188 = !{!136, !142, !1189}
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !104, line: 90, baseType: !102)
!1190 = !{!1184}
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 512, elements: !223)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1194, file: !1195, line: 46, type: !1191, isLocal: true, isDefinition: true)
!1194 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1195, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1196, globals: !1197, splitDebugInlining: false, nameTableKind: None)
!1195 = !DIFile(filename: "lib/sha1.c", directory: "/src", checksumkind: CSK_MD5, checksum: "15f6407463c5c629a55eef1090757600")
!1196 = !{!136, !142, !1189, !970}
!1197 = !{!1192}
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1200, file: !1201, line: 45, type: !1191, isLocal: true, isDefinition: true)
!1200 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1201, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1188, globals: !1202, splitDebugInlining: false, nameTableKind: None)
!1201 = !DIFile(filename: "lib/sha256.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4bf00364acac5809a530ebfdf8076fa4")
!1202 = !{!1198, !1203}
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(name: "sha256_round_constants", scope: !1200, file: !1201, line: 268, type: !1205, isLocal: true, isDefinition: true)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 2048, elements: !223)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(name: "rc", scope: !1208, file: !1209, line: 37, type: !1225, isLocal: true, isDefinition: true)
!1208 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1209, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1210, retainedTypes: !1223, globals: !1224, splitDebugInlining: false, nameTableKind: None)
!1209 = !DIFile(filename: "lib/sha3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1fc4d6dcd92fa883821ca1644332995f")
!1210 = !{!120, !1211, !124, !1214, !127, !1217, !130, !1220}
!1211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 45, baseType: !7, size: 32, elements: !1212)
!1212 = !{!1213}
!1213 = !DIEnumerator(name: "SHA3_224_BLOCK_SIZE", value: 144)
!1214 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 46, baseType: !7, size: 32, elements: !1215)
!1215 = !{!1216}
!1216 = !DIEnumerator(name: "SHA3_256_BLOCK_SIZE", value: 136)
!1217 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 47, baseType: !7, size: 32, elements: !1218)
!1218 = !{!1219}
!1219 = !DIEnumerator(name: "SHA3_384_BLOCK_SIZE", value: 104)
!1220 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 48, baseType: !7, size: 32, elements: !1221)
!1221 = !{!1222}
!1222 = !DIEnumerator(name: "SHA3_512_BLOCK_SIZE", value: 72)
!1223 = !{!970}
!1224 = !{!1206}
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 1536, elements: !303)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !1228, line: 48, baseType: !897)
!1228 = !DIFile(filename: "./lib/u64.h", directory: "/src", checksumkind: CSK_MD5, checksum: "748affdcb7c6d173090c334d88398f00")
!1229 = !DIGlobalVariableExpression(var: !1230, expr: !DIExpression())
!1230 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1231, file: !1232, line: 45, type: !1240, isLocal: true, isDefinition: true)
!1231 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1232, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1233, globals: !1234, splitDebugInlining: false, nameTableKind: None)
!1232 = !DIFile(filename: "lib/sha512.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b40e2f4ee4a922821a4d571a1e99a94")
!1233 = !{!1227, !136, !142, !1189}
!1234 = !{!1229, !1235}
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(name: "sha512_round_constants", scope: !1231, file: !1232, line: 269, type: !1237, isLocal: true, isDefinition: true)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 5120, elements: !1238)
!1238 = !{!1239}
!1239 = !DISubrange(count: 80)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 1024, elements: !1241)
!1241 = !{!1242}
!1242 = !DISubrange(count: 128)
!1243 = !DIGlobalVariableExpression(var: !1244, expr: !DIExpression())
!1244 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1245, file: !1246, line: 58, type: !1191, isLocal: true, isDefinition: true)
!1245 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1246, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1188, globals: !1247, splitDebugInlining: false, nameTableKind: None)
!1246 = !DIFile(filename: "lib/sm3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1f78229a09b95249964fab4e8aefe8f9")
!1247 = !{!1243, !1248}
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(name: "sm3_round_constants", scope: !1245, file: !1246, line: 232, type: !1205, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1252, file: !1253, line: 66, type: !1078, isLocal: false, isDefinition: true)
!1252 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1253, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1254, globals: !1255, splitDebugInlining: false, nameTableKind: None)
!1253 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1254 = !{!138, !144}
!1255 = !{!1256, !1258, !1278, !1280, !1282, !1284, !1250, !1286, !1288, !1290, !1292, !1294}
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(scope: null, file: !1253, line: 272, type: !433, isLocal: true, isDefinition: true)
!1258 = !DIGlobalVariableExpression(var: !1259, expr: !DIExpression())
!1259 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1260, file: !1253, line: 304, type: !142, isLocal: true, isDefinition: true)
!1260 = distinct !DISubprogram(name: "verror_at_line", scope: !1253, file: !1253, line: 298, type: !1261, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1252, retainedNodes: !1271)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !43, !43, !142, !7, !142, !1263}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1265)
!1265 = !{!1266, !1268, !1269, !1270}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1264, file: !1267, baseType: !7, size: 32)
!1267 = !DIFile(filename: "lib/error.c", directory: "/src")
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1264, file: !1267, baseType: !7, size: 32, offset: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1264, file: !1267, baseType: !138, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1264, file: !1267, baseType: !138, size: 64, offset: 128)
!1271 = !{!1272, !1273, !1274, !1275, !1276, !1277}
!1272 = !DILocalVariable(name: "status", arg: 1, scope: !1260, file: !1253, line: 298, type: !43)
!1273 = !DILocalVariable(name: "errnum", arg: 2, scope: !1260, file: !1253, line: 298, type: !43)
!1274 = !DILocalVariable(name: "file_name", arg: 3, scope: !1260, file: !1253, line: 298, type: !142)
!1275 = !DILocalVariable(name: "line_number", arg: 4, scope: !1260, file: !1253, line: 298, type: !7)
!1276 = !DILocalVariable(name: "message", arg: 5, scope: !1260, file: !1253, line: 298, type: !142)
!1277 = !DILocalVariable(name: "args", arg: 6, scope: !1260, file: !1253, line: 298, type: !1263)
!1278 = !DIGlobalVariableExpression(var: !1279, expr: !DIExpression())
!1279 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1260, file: !1253, line: 305, type: !7, isLocal: true, isDefinition: true)
!1280 = !DIGlobalVariableExpression(var: !1281, expr: !DIExpression())
!1281 = distinct !DIGlobalVariable(scope: null, file: !1253, line: 338, type: !428, isLocal: true, isDefinition: true)
!1282 = !DIGlobalVariableExpression(var: !1283, expr: !DIExpression())
!1283 = distinct !DIGlobalVariable(scope: null, file: !1253, line: 346, type: !184, isLocal: true, isDefinition: true)
!1284 = !DIGlobalVariableExpression(var: !1285, expr: !DIExpression())
!1285 = distinct !DIGlobalVariable(scope: null, file: !1253, line: 346, type: !399, isLocal: true, isDefinition: true)
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1252, file: !1253, line: 69, type: !7, isLocal: false, isDefinition: true)
!1288 = !DIGlobalVariableExpression(var: !1289, expr: !DIExpression())
!1289 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1252, file: !1253, line: 295, type: !43, isLocal: false, isDefinition: true)
!1290 = !DIGlobalVariableExpression(var: !1291, expr: !DIExpression())
!1291 = distinct !DIGlobalVariable(scope: null, file: !1253, line: 208, type: !179, isLocal: true, isDefinition: true)
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(scope: null, file: !1253, line: 208, type: !1069, isLocal: true, isDefinition: true)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(scope: null, file: !1253, line: 214, type: !433, isLocal: true, isDefinition: true)
!1296 = !DIGlobalVariableExpression(var: !1297, expr: !DIExpression())
!1297 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 161, type: !399, isLocal: true, isDefinition: true)
!1298 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 163, type: !295, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 233, type: !174, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
!1304 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 251, type: !174, isLocal: true, isDefinition: true)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(name: "power_letter", scope: !1307, file: !1298, line: 36, type: !1342, isLocal: true, isDefinition: true)
!1307 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1298, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1308, retainedTypes: !1322, globals: !1323, splitDebugInlining: false, nameTableKind: None)
!1308 = !{!1309, !90}
!1309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1310, line: 47, baseType: !7, size: 32, elements: !1311)
!1310 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321}
!1312 = !DIEnumerator(name: "human_ceiling", value: 0)
!1313 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!1314 = !DIEnumerator(name: "human_floor", value: 2)
!1315 = !DIEnumerator(name: "human_group_digits", value: 4)
!1316 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!1317 = !DIEnumerator(name: "human_autoscale", value: 16)
!1318 = !DIEnumerator(name: "human_base_1024", value: 32)
!1319 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!1320 = !DIEnumerator(name: "human_SI", value: 128)
!1321 = !DIEnumerator(name: "human_B", value: 256)
!1322 = !{!134}
!1323 = !{!1296, !1299, !1301, !1303, !1305, !1324, !1326, !1328, !1330, !1332, !1334, !1337, !1340}
!1324 = !DIGlobalVariableExpression(var: !1325, expr: !DIExpression())
!1325 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 417, type: !984, isLocal: true, isDefinition: true)
!1326 = !DIGlobalVariableExpression(var: !1327, expr: !DIExpression())
!1327 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 418, type: !189, isLocal: true, isDefinition: true)
!1328 = !DIGlobalVariableExpression(var: !1329, expr: !DIExpression())
!1329 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 438, type: !1133, isLocal: true, isDefinition: true)
!1330 = !DIGlobalVariableExpression(var: !1331, expr: !DIExpression())
!1331 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 398, type: !316, isLocal: true, isDefinition: true)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 398, type: !567, isLocal: true, isDefinition: true)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(name: "block_size_args", scope: !1307, file: !1298, line: 398, type: !1336, isLocal: true, isDefinition: true)
!1336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 192, elements: !568)
!1337 = !DIGlobalVariableExpression(var: !1338, expr: !DIExpression())
!1338 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !1307, file: !1298, line: 399, type: !1339, isLocal: true, isDefinition: true)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 64, elements: !400)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(scope: null, file: !1298, line: 408, type: !602, isLocal: true, isDefinition: true)
!1342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 88, elements: !985)
!1343 = !DIGlobalVariableExpression(var: !1344, expr: !DIExpression())
!1344 = distinct !DIGlobalVariable(name: "program_name", scope: !1345, file: !1346, line: 31, type: !142, isLocal: false, isDefinition: true)
!1345 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1346, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1347, globals: !1348, splitDebugInlining: false, nameTableKind: None)
!1346 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1347 = !{!136}
!1348 = !{!1343, !1349, !1351}
!1349 = !DIGlobalVariableExpression(var: !1350, expr: !DIExpression())
!1350 = distinct !DIGlobalVariable(scope: null, file: !1346, line: 46, type: !184, isLocal: true, isDefinition: true)
!1351 = !DIGlobalVariableExpression(var: !1352, expr: !DIExpression())
!1352 = distinct !DIGlobalVariable(scope: null, file: !1346, line: 49, type: !428, isLocal: true, isDefinition: true)
!1353 = !DIGlobalVariableExpression(var: !1354, expr: !DIExpression())
!1354 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1355, file: !1356, line: 46, type: !1382, isLocal: true, isDefinition: true)
!1355 = distinct !DISubprogram(name: "proper_name_lite", scope: !1356, file: !1356, line: 38, type: !1357, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1359, retainedNodes: !1361)
!1356 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!142, !142, !142}
!1359 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1356, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1360, splitDebugInlining: false, nameTableKind: None)
!1360 = !{!1353}
!1361 = !{!1362, !1363, !1364, !1365, !1369}
!1362 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1355, file: !1356, line: 38, type: !142)
!1363 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1355, file: !1356, line: 38, type: !142)
!1364 = !DILocalVariable(name: "translation", scope: !1355, file: !1356, line: 40, type: !142)
!1365 = !DILocalVariable(name: "w", scope: !1355, file: !1356, line: 47, type: !1366)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1367, line: 37, baseType: !1368)
!1367 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !106, line: 57, baseType: !971)
!1369 = !DILocalVariable(name: "mbs", scope: !1355, file: !1356, line: 48, type: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1371, line: 6, baseType: !1372)
!1371 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1373, line: 21, baseType: !1374)
!1373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1373, line: 13, size: 64, elements: !1375)
!1375 = !{!1376, !1377}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1374, file: !1373, line: 15, baseType: !43, size: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1374, file: !1373, line: 20, baseType: !1378, size: 32, offset: 32)
!1378 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1374, file: !1373, line: 16, size: 32, elements: !1379)
!1379 = !{!1380, !1381}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1378, file: !1373, line: 18, baseType: !7, size: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1378, file: !1373, line: 19, baseType: !428, size: 32)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 16, elements: !400)
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 78, type: !184, isLocal: true, isDefinition: true)
!1385 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1386 = !DIGlobalVariableExpression(var: !1387, expr: !DIExpression())
!1387 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 79, type: !174, isLocal: true, isDefinition: true)
!1388 = !DIGlobalVariableExpression(var: !1389, expr: !DIExpression())
!1389 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 80, type: !330, isLocal: true, isDefinition: true)
!1390 = !DIGlobalVariableExpression(var: !1391, expr: !DIExpression())
!1391 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 81, type: !330, isLocal: true, isDefinition: true)
!1392 = !DIGlobalVariableExpression(var: !1393, expr: !DIExpression())
!1393 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 82, type: !542, isLocal: true, isDefinition: true)
!1394 = !DIGlobalVariableExpression(var: !1395, expr: !DIExpression())
!1395 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 83, type: !399, isLocal: true, isDefinition: true)
!1396 = !DIGlobalVariableExpression(var: !1397, expr: !DIExpression())
!1397 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 84, type: !184, isLocal: true, isDefinition: true)
!1398 = !DIGlobalVariableExpression(var: !1399, expr: !DIExpression())
!1399 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 85, type: !179, isLocal: true, isDefinition: true)
!1400 = !DIGlobalVariableExpression(var: !1401, expr: !DIExpression())
!1401 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 86, type: !179, isLocal: true, isDefinition: true)
!1402 = !DIGlobalVariableExpression(var: !1403, expr: !DIExpression())
!1403 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 87, type: !184, isLocal: true, isDefinition: true)
!1404 = !DIGlobalVariableExpression(var: !1405, expr: !DIExpression())
!1405 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1406, file: !1385, line: 76, type: !1476, isLocal: false, isDefinition: true)
!1406 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1385, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1407, retainedTypes: !1413, globals: !1414, splitDebugInlining: false, nameTableKind: None)
!1407 = !{!76, !1408, !61}
!1408 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !77, line: 254, baseType: !7, size: 32, elements: !1409)
!1409 = !{!1410, !1411, !1412}
!1410 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1411 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1412 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1413 = !{!43, !139, !140}
!1414 = !{!1383, !1386, !1388, !1390, !1392, !1394, !1396, !1398, !1400, !1402, !1404, !1415, !1419, !1429, !1431, !1434, !1436, !1438, !1440, !1442, !1465, !1472, !1474}
!1415 = !DIGlobalVariableExpression(var: !1416, expr: !DIExpression())
!1416 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1406, file: !1385, line: 92, type: !1417, isLocal: false, isDefinition: true)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1418, size: 320, elements: !190)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!1419 = !DIGlobalVariableExpression(var: !1420, expr: !DIExpression())
!1420 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1406, file: !1385, line: 1040, type: !1421, isLocal: false, isDefinition: true)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1385, line: 56, size: 448, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1427, !1428}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1421, file: !1385, line: 59, baseType: !76, size: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1421, file: !1385, line: 62, baseType: !43, size: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1421, file: !1385, line: 66, baseType: !1426, size: 256, offset: 64)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !185)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1421, file: !1385, line: 69, baseType: !142, size: 64, offset: 320)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1421, file: !1385, line: 72, baseType: !142, size: 64, offset: 384)
!1429 = !DIGlobalVariableExpression(var: !1430, expr: !DIExpression())
!1430 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1406, file: !1385, line: 107, type: !1421, isLocal: true, isDefinition: true)
!1431 = !DIGlobalVariableExpression(var: !1432, expr: !DIExpression())
!1432 = distinct !DIGlobalVariable(name: "slot0", scope: !1406, file: !1385, line: 831, type: !1433, isLocal: true, isDefinition: true)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2048, elements: !1092)
!1434 = !DIGlobalVariableExpression(var: !1435, expr: !DIExpression())
!1435 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 321, type: !399, isLocal: true, isDefinition: true)
!1436 = !DIGlobalVariableExpression(var: !1437, expr: !DIExpression())
!1437 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 357, type: !399, isLocal: true, isDefinition: true)
!1438 = !DIGlobalVariableExpression(var: !1439, expr: !DIExpression())
!1439 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 358, type: !399, isLocal: true, isDefinition: true)
!1440 = !DIGlobalVariableExpression(var: !1441, expr: !DIExpression())
!1441 = distinct !DIGlobalVariable(scope: null, file: !1385, line: 199, type: !179, isLocal: true, isDefinition: true)
!1442 = !DIGlobalVariableExpression(var: !1443, expr: !DIExpression())
!1443 = distinct !DIGlobalVariable(name: "quote", scope: !1444, file: !1385, line: 228, type: !1463, isLocal: true, isDefinition: true)
!1444 = distinct !DISubprogram(name: "gettext_quote", scope: !1385, file: !1385, line: 197, type: !1445, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1406, retainedNodes: !1447)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!142, !142, !76}
!1447 = !{!1448, !1449, !1450, !1451, !1452}
!1448 = !DILocalVariable(name: "msgid", arg: 1, scope: !1444, file: !1385, line: 197, type: !142)
!1449 = !DILocalVariable(name: "s", arg: 2, scope: !1444, file: !1385, line: 197, type: !76)
!1450 = !DILocalVariable(name: "translation", scope: !1444, file: !1385, line: 199, type: !142)
!1451 = !DILocalVariable(name: "w", scope: !1444, file: !1385, line: 229, type: !1366)
!1452 = !DILocalVariable(name: "mbs", scope: !1444, file: !1385, line: 230, type: !1453)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1371, line: 6, baseType: !1454)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1373, line: 21, baseType: !1455)
