; ModuleID = 'src/csplit.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.cstring = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, ptr }
%union.anon = type { ptr }
%struct.control = type { i64, i64, i64, i32, i8, i8, i8, %struct.re_pattern_buffer }
%struct.re_pattern_buffer = type { ptr, i64, i64, i64, ptr, ptr, i64, i8 }
%struct.buffer_record = type { i64, i64, i64, i64, i64, ptr, ptr, ptr, ptr }
%struct.line = type { i64, i64, i64, [80 x %struct.cstring], ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [17 x i8] c"memory exhausted\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !12
@.str.3 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !17

!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1288, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1289, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 10)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1289, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 24)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "global_argv", scope: !29, file: !2, line: 156, type: !45, isLocal: true, isDefinition: true)
!29 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !30, retainedTypes: !218, globals: !225, splitDebugInlining: false, nameTableKind: None)
!30 = !{!31, !35, !41, !177, !191, !195, !210}
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 182, baseType: !32, size: 32, elements: !33)
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34}
!34 = !DIEnumerator(name: "SUPPRESS_MATCHED_OPTION", value: 128)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 337, baseType: !37, size: 32, elements: !38)
!36 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{!39, !40}
!39 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!40 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !42, file: !2, line: 1362, baseType: !32, size: 32, elements: !175)
!42 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1282, type: !43, scopeLine: 1283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !47)
!43 = !DISubroutineType(types: !44)
!44 = !{!37, !37, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!47 = !{!48, !49, !50, !51, !57, !58, !59, !171, !173}
!48 = !DILocalVariable(name: "argc", arg: 1, scope: !42, file: !2, line: 1282, type: !37)
!49 = !DILocalVariable(name: "argv", arg: 2, scope: !42, file: !2, line: 1282, type: !45)
!50 = !DILocalVariable(name: "optc", scope: !42, file: !2, line: 1284, type: !37)
!51 = !DILocalVariable(name: "prefix_len", scope: !42, file: !2, line: 1347, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !53, line: 130, baseType: !54)
!53 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !55, line: 35, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DILocalVariable(name: "max_digit_string_len", scope: !42, file: !2, line: 1348, type: !52)
!58 = !DILocalVariable(name: "filename_size", scope: !42, file: !2, line: 1352, type: !52)
!59 = !DILocalVariable(name: "act", scope: !60, file: !2, line: 1364, type: !61)
!60 = distinct !DILexicalBlock(scope: !42, file: !2, line: 1361, column: 3)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !62, line: 27, size: 1216, elements: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!63 = !{!64, !156, !166, !167}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !61, file: !62, line: 38, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !62, line: 31, size: 64, elements: !66)
!66 = !{!67, !73}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !65, file: !62, line: 34, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !69, line: 72, baseType: !70)
!69 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !37}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !65, file: !62, line: 36, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !37, !77, !113}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !79, line: 124, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 36, size: 1024, elements: !81)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !80, file: !79, line: 38, baseType: !37, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !80, file: !79, line: 40, baseType: !37, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !80, file: !79, line: 42, baseType: !37, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !80, file: !79, line: 48, baseType: !37, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !80, file: !79, line: 123, baseType: !87, size: 896, offset: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !79, line: 51, size: 896, elements: !88)
!88 = !{!89, !93, !101, !114, !120, !129, !145, !150}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !87, file: !79, line: 53, baseType: !90, size: 896)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 896, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 28)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !87, file: !79, line: 60, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 56, size: 64, elements: !95)
!95 = !{!96, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !94, file: !79, line: 58, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !98, line: 154, baseType: !37)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!99 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !94, file: !79, line: 59, baseType: !100, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !98, line: 146, baseType: !32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !87, file: !79, line: 68, baseType: !102, size: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 63, size: 128, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !102, file: !79, line: 65, baseType: !37, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !102, file: !79, line: 66, baseType: !37, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !102, file: !79, line: 67, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !108, line: 30, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !108, line: 24, size: 64, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !109, file: !108, line: 26, baseType: !37, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !109, file: !108, line: 27, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !87, file: !79, line: 76, baseType: !115, size: 128)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 71, size: 128, elements: !116)
!116 = !{!117, !118, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !115, file: !79, line: 73, baseType: !97, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !115, file: !79, line: 74, baseType: !100, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !115, file: !79, line: 75, baseType: !107, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !87, file: !79, line: 86, baseType: !121, size: 256)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 79, size: 256, elements: !122)
!122 = !{!123, !124, !125, !126, !128}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !121, file: !79, line: 81, baseType: !97, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !121, file: !79, line: 82, baseType: !100, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !121, file: !79, line: 83, baseType: !37, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !121, file: !79, line: 84, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !98, line: 156, baseType: !56)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !121, file: !79, line: 85, baseType: !127, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !87, file: !79, line: 105, baseType: !130, size: 256)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 89, size: 256, elements: !131)
!131 = !{!132, !133, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !130, file: !79, line: 91, baseType: !113, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !130, file: !79, line: 93, baseType: !134, size: 16, offset: 64)
!134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !130, file: !79, line: 104, baseType: !136, size: 128, offset: 128)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !79, line: 94, size: 128, elements: !137)
!137 = !{!138, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !136, file: !79, line: 101, baseType: !139, size: 128)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !79, line: 97, size: 128, elements: !140)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !139, file: !79, line: 99, baseType: !113, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !139, file: !79, line: 100, baseType: !113, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !136, file: !79, line: 103, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !98, line: 42, baseType: !32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !87, file: !79, line: 112, baseType: !146, size: 128)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 108, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !146, file: !79, line: 110, baseType: !56, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !146, file: !79, line: 111, baseType: !37, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !87, file: !79, line: 121, baseType: !151, size: 128)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 116, size: 128, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !151, file: !79, line: 118, baseType: !113, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !151, file: !79, line: 119, baseType: !37, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !151, file: !79, line: 120, baseType: !32, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !61, file: !62, line: 46, baseType: !157, size: 1024, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !158, line: 8, baseType: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 5, size: 1024, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !159, file: !158, line: 7, baseType: !162, size: 1024)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 1024, elements: !164)
!163 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!164 = !{!165}
!165 = !DISubrange(count: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !61, file: !62, line: 49, baseType: !37, size: 32, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !61, file: !62, line: 52, baseType: !168, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null}
!171 = !DILocalVariable(name: "i", scope: !172, file: !2, line: 1367, type: !37)
!172 = distinct !DILexicalBlock(scope: !60, file: !2, line: 1367, column: 5)
!173 = !DILocalVariable(name: "i", scope: !174, file: !2, line: 1378, type: !37)
!174 = distinct !DILexicalBlock(scope: !60, file: !2, line: 1378, column: 5)
!175 = !{!176}
!176 = !DIEnumerator(name: "nsigs", value: 22)
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !178, line: 42, baseType: !32, size: 32, elements: !179)
!178 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!180 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!181 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!182 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!183 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!184 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!185 = !DIEnumerator(name: "c_quoting_style", value: 5)
!186 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!187 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!188 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!189 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!190 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1171, baseType: !32, size: 32, elements: !192)
!192 = !{!193, !194}
!193 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 1)
!194 = !DIEnumerator(name: "FLAG_ALTERNATIVE", value: 2)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !196, line: 46, baseType: !32, size: 32, elements: !197)
!196 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!198 = !DIEnumerator(name: "_ISupper", value: 256)
!199 = !DIEnumerator(name: "_ISlower", value: 512)
!200 = !DIEnumerator(name: "_ISalpha", value: 1024)
!201 = !DIEnumerator(name: "_ISdigit", value: 2048)
!202 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!203 = !DIEnumerator(name: "_ISspace", value: 8192)
!204 = !DIEnumerator(name: "_ISprint", value: 16384)
!205 = !DIEnumerator(name: "_ISgraph", value: 32768)
!206 = !DIEnumerator(name: "_ISblank", value: 1)
!207 = !DIEnumerator(name: "_IScntrl", value: 2)
!208 = !DIEnumerator(name: "_ISpunct", value: 4)
!209 = !DIEnumerator(name: "_ISalnum", value: 8)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !211, line: 30, baseType: !32, size: 32, elements: !212)
!211 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!212 = !{!213, !214, !215, !216, !217}
!213 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!214 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!215 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!216 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!217 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!218 = !{!46, !113, !37, !219, !68, !220, !221, !222, !224}
!219 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!220 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 46, baseType: !163)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!224 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !{!0, !7, !12, !17, !22, !226, !231, !236, !241, !246, !251, !254, !256, !261, !263, !268, !270, !275, !280, !285, !290, !295, !300, !305, !310, !315, !320, !325, !27, !330, !332, !334, !336, !340, !345, !350, !402, !404, !409, !412, !414, !416, !421, !423, !425, !430, !432, !434, !436, !438, !443, !455, !457, !460, !463, !466, !468, !473, !478, !480, !485, !487, !489, !491, !496, !501, !553, !555, !560, !565, !570, !572, !574, !579, !586, !588, !590, !595, !597, !604, !606, !635, !637, !639, !641, !643, !645, !647, !649, !651, !660, !665, !670, !672, !674, !704, !706, !708, !713, !715, !717, !719, !721, !723, !725, !727, !729, !731, !733, !735, !737, !739, !741, !743, !745, !747, !752, !754, !756, !758, !760, !762, !764, !766, !769, !771, !773, !775, !777, !782}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1296, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 11)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1314, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 15)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 7)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 14)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 12)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !164)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1341, type: !253, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1343, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 25)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1387, type: !228, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1398, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 39)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1401, type: !265, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1405, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1072, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 134)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 35)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1416, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 592, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 74)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1420, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 59)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1424, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 528, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 66)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1428, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 71)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1432, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 76)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1436, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 75)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1440, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 64)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1444, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 50)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1445, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 62)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1446, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3504, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 438)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "suppress_count", scope: !29, file: !2, line: 159, type: !219, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !29, file: !2, line: 165, type: !219, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "suppress_matched", scope: !29, file: !2, line: 168, type: !219, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "caught_signals", scope: !29, file: !2, line: 178, type: !338, isLocal: true, isDefinition: true)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !339, line: 7, baseType: !157)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 956, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 19)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 985, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 5)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "output_stream", scope: !29, file: !2, line: 150, type: !352, isLocal: true, isDefinition: true)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !354, line: 7, baseType: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !356, line: 49, size: 1728, elements: !357)
!356 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !373, !375, !376, !377, !379, !380, !382, !383, !386, !388, !391, !394, !395, !396, !397, !398}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !355, file: !356, line: 51, baseType: !37, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !355, file: !356, line: 54, baseType: !46, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !355, file: !356, line: 55, baseType: !46, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !355, file: !356, line: 56, baseType: !46, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !355, file: !356, line: 57, baseType: !46, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !355, file: !356, line: 58, baseType: !46, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !355, file: !356, line: 59, baseType: !46, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !355, file: !356, line: 60, baseType: !46, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !355, file: !356, line: 61, baseType: !46, size: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !355, file: !356, line: 64, baseType: !46, size: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !355, file: !356, line: 65, baseType: !46, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !355, file: !356, line: 66, baseType: !46, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !355, file: !356, line: 68, baseType: !371, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !356, line: 36, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !355, file: !356, line: 70, baseType: !374, size: 64, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !355, file: !356, line: 72, baseType: !37, size: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !355, file: !356, line: 73, baseType: !37, size: 32, offset: 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !355, file: !356, line: 74, baseType: !378, size: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 152, baseType: !56)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !355, file: !356, line: 77, baseType: !220, size: 16, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !355, file: !356, line: 78, baseType: !381, size: 8, offset: 1040)
!381 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !355, file: !356, line: 79, baseType: !14, size: 8, offset: 1048)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !355, file: !356, line: 81, baseType: !384, size: 64, offset: 1088)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !356, line: 43, baseType: null)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !355, file: !356, line: 89, baseType: !387, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 153, baseType: !56)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !355, file: !356, line: 91, baseType: !389, size: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !356, line: 37, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !355, file: !356, line: 92, baseType: !392, size: 64, offset: 1280)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !356, line: 38, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !355, file: !356, line: 93, baseType: !374, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !355, file: !356, line: 94, baseType: !113, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !355, file: !356, line: 95, baseType: !221, size: 64, offset: 1472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !355, file: !356, line: 96, baseType: !37, size: 32, offset: 1536)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !355, file: !356, line: 98, baseType: !399, size: 160, offset: 1568)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 20)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "output_filename", scope: !29, file: !2, line: 153, type: !46, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "bytes_written", scope: !29, file: !2, line: 147, type: !406, isLocal: true, isDefinition: true)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !407, line: 101, baseType: !408)
!407 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !98, line: 72, baseType: !56)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "files_created", scope: !29, file: !2, line: 144, type: !411, isLocal: true, isDefinition: true)
!411 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 887, type: !347, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !2, line: 189, type: !238, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !418, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 6)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !238, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !228, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 18)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 194, type: !238, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !243, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !9, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !347, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 198, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 8)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "longopts", scope: !29, file: !2, line: 187, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 2816, elements: !229)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !448, line: 50, size: 256, elements: !449)
!448 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!449 = !{!450, !451, !452, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !448, line: 52, baseType: !222, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !447, file: !448, line: 55, baseType: !37, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !448, line: 56, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !447, file: !448, line: 57, baseType: !37, size: 32, offset: 192)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 135, type: !3, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "prefix", scope: !29, file: !2, line: 135, type: !459, isLocal: true, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !222)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "suffix", scope: !29, file: !2, line: 138, type: !462, isLocal: true, isDefinition: true)
!462 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "remove_files", scope: !29, file: !2, line: 162, type: !465, isLocal: true, isDefinition: true)
!465 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !219)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "digits", scope: !29, file: !2, line: 141, type: !411, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1258, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 48)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1272, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 46)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1229, type: !265, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1233, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 43)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1236, type: !475, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1241, type: !317, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "filename_space", scope: !29, file: !2, line: 132, type: !462, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !2, line: 608, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 2)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !2, line: 609, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 27)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "last_val", scope: !503, file: !2, line: 1124, type: !406, isLocal: true, isDefinition: true)
!503 = distinct !DISubprogram(name: "parse_patterns", scope: !2, file: !2, line: 1121, type: !504, scopeLine: 1122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !37, !37, !45}
!506 = !{!507, !508, !509, !510, !544, !546}
!507 = !DILocalVariable(name: "argc", arg: 1, scope: !503, file: !2, line: 1121, type: !37)
!508 = !DILocalVariable(name: "start", arg: 2, scope: !503, file: !2, line: 1121, type: !37)
!509 = !DILocalVariable(name: "argv", arg: 3, scope: !503, file: !2, line: 1121, type: !45)
!510 = !DILocalVariable(name: "p", scope: !503, file: !2, line: 1123, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control", file: !2, line: 50, size: 768, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !512, file: !2, line: 52, baseType: !406, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lines_required", scope: !512, file: !2, line: 53, baseType: !406, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !512, file: !2, line: 54, baseType: !406, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "argnum", scope: !512, file: !2, line: 55, baseType: !37, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_forever", scope: !512, file: !2, line: 56, baseType: !219, size: 8, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !512, file: !2, line: 57, baseType: !219, size: 8, offset: 232)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "regexpr", scope: !512, file: !2, line: 58, baseType: !219, size: 8, offset: 240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "re_compiled", scope: !512, file: !2, line: 59, baseType: !522, size: 512, offset: 256)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !523, line: 413, size: 512, elements: !524)
!523 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!524 = !{!525, !528, !530, !531, !533, !534, !536, !537, !538, !539, !540, !541, !542, !543}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !522, file: !523, line: 417, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !523, line: 417, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !522, file: !523, line: 420, baseType: !529, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !523, line: 56, baseType: !163)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !522, file: !523, line: 423, baseType: !529, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !522, file: !523, line: 426, baseType: !532, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !523, line: 71, baseType: !163)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !522, file: !523, line: 431, baseType: !46, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !522, file: !523, line: 437, baseType: !535, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !522, file: !523, line: 440, baseType: !221, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !522, file: !523, line: 446, baseType: !32, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !522, file: !523, line: 457, baseType: !32, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !522, file: !523, line: 461, baseType: !32, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !522, file: !523, line: 465, baseType: !32, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !522, file: !523, line: 469, baseType: !32, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !522, file: !523, line: 472, baseType: !32, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !522, file: !523, line: 475, baseType: !32, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!544 = !DILocalVariable(name: "i", scope: !545, file: !2, line: 1126, type: !37)
!545 = distinct !DILexicalBlock(scope: !503, file: !2, line: 1126, column: 3)
!546 = !DILocalVariable(name: "val", scope: !547, file: !2, line: 1137, type: !551)
!547 = distinct !DILexicalBlock(scope: !548, file: !2, line: 1133, column: 9)
!548 = distinct !DILexicalBlock(scope: !549, file: !2, line: 1128, column: 11)
!549 = distinct !DILexicalBlock(scope: !550, file: !2, line: 1127, column: 5)
!550 = distinct !DILexicalBlock(scope: !545, file: !2, line: 1126, column: 3)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !407, line: 102, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !98, line: 73, baseType: !163)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1140, type: !399, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1142, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 42)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1145, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 58)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1150, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 61)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1089, type: !277, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1107, type: !277, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 37)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "control_allocated", scope: !581, file: !2, line: 1012, type: !52, isLocal: true, isDefinition: true)
!581 = distinct !DISubprogram(name: "new_control_record", scope: !2, file: !2, line: 1010, type: !582, scopeLine: 1011, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!511}
!584 = !{!585}
!585 = !DILocalVariable(name: "p", scope: !581, file: !2, line: 1013, type: !511)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "control_used", scope: !29, file: !2, line: 175, type: !52, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "controls", scope: !29, file: !2, line: 172, type: !511, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1051, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 36)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1063, type: !557, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "term_sig", scope: !29, file: !599, line: 6, type: !600, isLocal: true, isDefinition: true)
!599 = !DIFile(filename: "src/term-sig.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d5de988e1d621d74adbec0ff67a5bdb7")
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 704, elements: !602)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!602 = !{!603}
!603 = !DISubrange(count: 22)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !2, line: 784, type: !277, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "head", scope: !29, file: !2, line: 114, type: !608, isLocal: true, isDefinition: true)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_record", file: !2, line: 95, size: 576, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !633, !634}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloc", scope: !609, file: !2, line: 97, baseType: !52, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !609, file: !2, line: 98, baseType: !52, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !609, file: !2, line: 99, baseType: !406, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !609, file: !2, line: 100, baseType: !406, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "num_lines", scope: !609, file: !2, line: 101, baseType: !52, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !609, file: !2, line: 102, baseType: !46, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !609, file: !2, line: 103, baseType: !618, size: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !2, line: 83, size: 10496, elements: !620)
!620 = !{!621, !622, !623, !624, !632}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !619, file: !2, line: 85, baseType: !52, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "insert_index", scope: !619, file: !2, line: 86, baseType: !52, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_index", scope: !619, file: !2, line: 87, baseType: !52, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !619, file: !2, line: 88, baseType: !625, size: 10240, offset: 192)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 10240, elements: !630)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cstring", file: !2, line: 75, size: 128, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !626, file: !2, line: 77, baseType: !52, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !626, file: !2, line: 78, baseType: !46, size: 64, offset: 64)
!630 = !{!631}
!631 = !DISubrange(count: 80)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !2, line: 89, baseType: !618, size: 64, offset: 10432)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "curr_line", scope: !609, file: !2, line: 104, baseType: !618, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !609, file: !2, line: 105, baseType: !608, size: 64, offset: 512)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "have_read_eof", scope: !29, file: !2, line: 129, type: !219, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "hold_count", scope: !29, file: !2, line: 120, type: !52, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "last_line_number", scope: !29, file: !2, line: 123, type: !406, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "hold_area", scope: !29, file: !2, line: 117, type: !46, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "current_line", scope: !29, file: !2, line: 126, type: !406, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !2, line: 723, type: !24, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !2, line: 727, type: !399, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !2, line: 729, type: !493, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "prev_buf", scope: !653, file: !2, line: 518, type: !608, isLocal: true, isDefinition: true)
!653 = distinct !DISubprogram(name: "remove_line", scope: !2, file: !2, line: 513, type: !654, scopeLine: 514, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !657)
!654 = !DISubroutineType(types: !655)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!657 = !{!658, !659}
!658 = !DILocalVariable(name: "line", scope: !653, file: !2, line: 520, type: !656)
!659 = !DILocalVariable(name: "l", scope: !653, file: !2, line: 521, type: !618)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 629, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 29)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 669, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 33)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !2, line: 912, type: !493, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !36, line: 736, type: !307, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !676, file: !36, line: 575, type: !37, isLocal: true, isDefinition: true)
!676 = distinct !DISubprogram(name: "oputs_", scope: !36, file: !36, line: 573, type: !677, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !679)
!677 = !DISubroutineType(cc: DW_CC_nocall, types: !678)
!678 = !{null, !222, !222}
!679 = !{!680, !681, !682, !685, !686, !687, !688, !692, !693, !694, !695, !697, !698, !699, !700, !702, !703}
!680 = !DILocalVariable(name: "program", arg: 1, scope: !676, file: !36, line: 573, type: !222)
!681 = !DILocalVariable(name: "option", arg: 2, scope: !676, file: !36, line: 573, type: !222)
!682 = !DILocalVariable(name: "term", scope: !683, file: !36, line: 585, type: !222)
!683 = distinct !DILexicalBlock(scope: !684, file: !36, line: 582, column: 5)
!684 = distinct !DILexicalBlock(scope: !676, file: !36, line: 581, column: 7)
!685 = !DILocalVariable(name: "double_space", scope: !676, file: !36, line: 594, type: !219)
!686 = !DILocalVariable(name: "first_word", scope: !676, file: !36, line: 595, type: !222)
!687 = !DILocalVariable(name: "option_text", scope: !676, file: !36, line: 596, type: !222)
!688 = !DILocalVariable(name: "s", scope: !689, file: !36, line: 608, type: !222)
!689 = distinct !DILexicalBlock(scope: !690, file: !36, line: 605, column: 5)
!690 = distinct !DILexicalBlock(scope: !691, file: !36, line: 604, column: 12)
!691 = distinct !DILexicalBlock(scope: !676, file: !36, line: 597, column: 7)
!692 = !DILocalVariable(name: "spaces", scope: !689, file: !36, line: 609, type: !221)
!693 = !DILocalVariable(name: "anchor_len", scope: !676, file: !36, line: 620, type: !221)
!694 = !DILocalVariable(name: "desc_text", scope: !676, file: !36, line: 625, type: !222)
!695 = !DILocalVariable(name: "__ptr", scope: !696, file: !36, line: 644, type: !222)
!696 = distinct !DILexicalBlock(scope: !676, file: !36, line: 644, column: 3)
!697 = !DILocalVariable(name: "__stream", scope: !696, file: !36, line: 644, type: !352)
!698 = !DILocalVariable(name: "__cnt", scope: !696, file: !36, line: 644, type: !221)
!699 = !DILocalVariable(name: "url_program", scope: !676, file: !36, line: 648, type: !222)
!700 = !DILocalVariable(name: "__ptr", scope: !701, file: !36, line: 686, type: !222)
!701 = distinct !DILexicalBlock(scope: !676, file: !36, line: 686, column: 3)
!702 = !DILocalVariable(name: "__stream", scope: !701, file: !36, line: 686, type: !352)
!703 = !DILocalVariable(name: "__cnt", scope: !701, file: !36, line: 686, type: !221)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !36, line: 585, type: !347, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !36, line: 586, type: !347, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !36, line: 595, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 4)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !36, line: 620, type: !418, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !36, line: 648, type: !493, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !36, line: 648, type: !347, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !36, line: 649, type: !710, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !36, line: 649, type: !3, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !36, line: 650, type: !347, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !36, line: 651, type: !418, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !36, line: 651, type: !418, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !36, line: 652, type: !238, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !36, line: 653, type: !440, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !36, line: 654, type: !19, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !36, line: 655, type: !19, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !36, line: 656, type: !19, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !36, line: 657, type: !19, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !36, line: 663, type: !238, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !36, line: 664, type: !19, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !36, line: 669, type: !9, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !36, line: 669, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 40)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !36, line: 676, type: !233, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !36, line: 676, type: !567, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !36, line: 679, type: !3, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !36, line: 683, type: !347, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !36, line: 688, type: !347, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !36, line: 691, type: !440, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !36, line: 839, type: !253, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !36, line: 840, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !602)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !36, line: 841, type: !233, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !36, line: 862, type: !710, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !36, line: 868, type: !297, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !36, line: 875, type: !498, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !36, line: 877, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 51)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !36, line: 877, type: !248, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!785 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!786 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!787 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !790, line: 3, type: !233, isLocal: true, isDefinition: true)
!790 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "Version", scope: !793, file: !790, line: 3, type: !222, isLocal: false, isDefinition: true)
!793 = distinct !DICompileUnit(language: DW_LANG_C11, file: !790, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !794, splitDebugInlining: false, nameTableKind: None)
!794 = !{!788, !791}
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "file_name", scope: !797, file: !798, line: 45, type: !222, isLocal: true, isDefinition: true)
!797 = distinct !DICompileUnit(language: DW_LANG_C11, file: !798, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !799, splitDebugInlining: false, nameTableKind: None)
!798 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!799 = !{!800, !802, !804, !806, !795, !808}
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !798, line: 121, type: !238, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !798, line: 121, type: !248, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !798, line: 123, type: !238, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !798, line: 126, type: !3, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !797, file: !798, line: 55, type: !219, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !812, file: !813, line: 66, type: !168, isLocal: false, isDefinition: true)
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !814, globals: !815, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!814 = !{!113, !224}
!815 = !{!816, !818, !838, !840, !842, !844, !810, !846, !848, !850, !852, !857}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !813, line: 272, type: !347, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "old_file_name", scope: !820, file: !813, line: 304, type: !222, isLocal: true, isDefinition: true)
!820 = distinct !DISubprogram(name: "verror_at_line", scope: !813, file: !813, line: 298, type: !821, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !812, retainedNodes: !831)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !37, !37, !222, !32, !222, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !825)
!825 = !{!826, !828, !829, !830}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !824, file: !827, baseType: !32, size: 32)
!827 = !DIFile(filename: "lib/error.c", directory: "/src")
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !824, file: !827, baseType: !32, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !824, file: !827, baseType: !113, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !824, file: !827, baseType: !113, size: 64, offset: 128)
!831 = !{!832, !833, !834, !835, !836, !837}
!832 = !DILocalVariable(name: "status", arg: 1, scope: !820, file: !813, line: 298, type: !37)
!833 = !DILocalVariable(name: "errnum", arg: 2, scope: !820, file: !813, line: 298, type: !37)
!834 = !DILocalVariable(name: "file_name", arg: 3, scope: !820, file: !813, line: 298, type: !222)
!835 = !DILocalVariable(name: "line_number", arg: 4, scope: !820, file: !813, line: 298, type: !32)
!836 = !DILocalVariable(name: "message", arg: 5, scope: !820, file: !813, line: 298, type: !222)
!837 = !DILocalVariable(name: "args", arg: 6, scope: !820, file: !813, line: 298, type: !823)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "old_line_number", scope: !820, file: !813, line: 305, type: !32, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !813, line: 338, type: !710, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !813, line: 346, type: !440, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !813, line: 346, type: !493, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "error_message_count", scope: !812, file: !813, line: 69, type: !32, isLocal: false, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !812, file: !813, line: 295, type: !37, isLocal: false, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !813, line: 208, type: !238, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !813, line: 208, type: !854, isLocal: true, isDefinition: true)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 21)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !813, line: 214, type: !347, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "exit_failure", scope: !861, file: !862, line: 24, type: !411, isLocal: false, isDefinition: true)
!861 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !863, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!863 = !{!859}
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "program_name", scope: !866, file: !867, line: 31, type: !222, isLocal: false, isDefinition: true)
!866 = distinct !DICompileUnit(language: DW_LANG_C11, file: !867, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !868, globals: !869, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!868 = !{!46}
!869 = !{!864, !870, !872}
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !867, line: 46, type: !440, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !867, line: 49, type: !710, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "utf07FF", scope: !876, file: !877, line: 46, type: !903, isLocal: true, isDefinition: true)
!876 = distinct !DISubprogram(name: "proper_name_lite", scope: !877, file: !877, line: 38, type: !878, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !880, retainedNodes: !882)
!877 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!878 = !DISubroutineType(types: !879)
!879 = !{!222, !222, !222}
!880 = distinct !DICompileUnit(language: DW_LANG_C11, file: !877, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !881, splitDebugInlining: false, nameTableKind: None)
!881 = !{!874}
!882 = !{!883, !884, !885, !886, !890}
!883 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !876, file: !877, line: 38, type: !222)
!884 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !876, file: !877, line: 38, type: !222)
!885 = !DILocalVariable(name: "translation", scope: !876, file: !877, line: 40, type: !222)
!886 = !DILocalVariable(name: "w", scope: !876, file: !877, line: 47, type: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !888, line: 37, baseType: !889)
!888 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !98, line: 57, baseType: !144)
!890 = !DILocalVariable(name: "mbs", scope: !876, file: !877, line: 48, type: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !892, line: 6, baseType: !893)
!892 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !894, line: 21, baseType: !895)
!894 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !894, line: 13, size: 64, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !895, file: !894, line: 15, baseType: !37, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !895, file: !894, line: 20, baseType: !899, size: 32, offset: 32)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !895, file: !894, line: 16, size: 32, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !899, file: !894, line: 18, baseType: !32, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !899, file: !894, line: 19, baseType: !710, size: 32)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 16, elements: !494)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !906, line: 78, type: !440, isLocal: true, isDefinition: true)
!906 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !906, line: 79, type: !418, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !906, line: 80, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 13)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !906, line: 81, type: !911, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !906, line: 82, type: !399, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !906, line: 83, type: !493, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !906, line: 84, type: !440, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !906, line: 85, type: !238, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !906, line: 86, type: !238, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !906, line: 87, type: !440, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !930, file: !906, line: 76, type: !1002, isLocal: false, isDefinition: true)
!930 = distinct !DICompileUnit(language: DW_LANG_C11, file: !906, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !931, retainedTypes: !937, globals: !938, splitDebugInlining: false, nameTableKind: None)
!931 = !{!177, !932, !195}
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !178, line: 254, baseType: !32, size: 32, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!935 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!936 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!937 = !{!37, !220, !221}
!938 = !{!904, !907, !909, !914, !916, !918, !920, !922, !924, !926, !928, !939, !943, !953, !955, !960, !962, !964, !966, !968, !991, !998, !1000}
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !930, file: !906, line: 92, type: !941, isLocal: false, isDefinition: true)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 320, elements: !20)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !930, file: !906, line: 1040, type: !945, isLocal: false, isDefinition: true)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !906, line: 56, size: 448, elements: !946)
!946 = !{!947, !948, !949, !951, !952}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !945, file: !906, line: 59, baseType: !177, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !945, file: !906, line: 62, baseType: !37, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !945, file: !906, line: 66, baseType: !950, size: 256, offset: 64)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, elements: !441)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !945, file: !906, line: 69, baseType: !222, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !945, file: !906, line: 72, baseType: !222, size: 64, offset: 384)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !930, file: !906, line: 107, type: !945, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "slot0", scope: !930, file: !906, line: 831, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 256)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !906, line: 321, type: !493, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !906, line: 357, type: !493, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !906, line: 358, type: !493, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !906, line: 199, type: !238, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "quote", scope: !970, file: !906, line: 228, type: !989, isLocal: true, isDefinition: true)
!970 = distinct !DISubprogram(name: "gettext_quote", scope: !906, file: !906, line: 197, type: !971, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !930, retainedNodes: !973)
!971 = !DISubroutineType(types: !972)
!972 = !{!222, !222, !177}
!973 = !{!974, !975, !976, !977, !978}
!974 = !DILocalVariable(name: "msgid", arg: 1, scope: !970, file: !906, line: 197, type: !222)
!975 = !DILocalVariable(name: "s", arg: 2, scope: !970, file: !906, line: 197, type: !177)
!976 = !DILocalVariable(name: "translation", scope: !970, file: !906, line: 199, type: !222)
!977 = !DILocalVariable(name: "w", scope: !970, file: !906, line: 229, type: !887)
!978 = !DILocalVariable(name: "mbs", scope: !970, file: !906, line: 230, type: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !892, line: 6, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !894, line: 21, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !894, line: 13, size: 64, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !981, file: !894, line: 15, baseType: !37, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !981, file: !894, line: 20, baseType: !985, size: 32, offset: 32)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !981, file: !894, line: 16, size: 32, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !985, file: !894, line: 18, baseType: !32, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !985, file: !894, line: 19, baseType: !710, size: 32)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 64, elements: !990)
!990 = !{!495, !712}
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "slotvec", scope: !930, file: !906, line: 834, type: !993, isLocal: true, isDefinition: true)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !906, line: 823, size: 128, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !994, file: !906, line: 825, baseType: !221, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !994, file: !906, line: 826, baseType: !46, size: 64, offset: 64)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "nslots", scope: !930, file: !906, line: 832, type: !37, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "slotvec0", scope: !930, file: !906, line: 833, type: !994, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 704, elements: !229)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 67, type: !248, isLocal: true, isDefinition: true)
!1006 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 69, type: !238, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 83, type: !238, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 83, type: !710, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 85, type: !493, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 88, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 171)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 88, type: !1022, isLocal: true, isDefinition: true)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 34)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 105, type: !253, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 109, type: !1029, isLocal: true, isDefinition: true)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 23)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 113, type: !1034, isLocal: true, isDefinition: true)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !91)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 120, type: !1037, isLocal: true, isDefinition: true)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 32)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 127, type: !592, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 134, type: !749, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 142, type: !1046, isLocal: true, isDefinition: true)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 44)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 150, type: !470, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 159, type: !1053, isLocal: true, isDefinition: true)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1054)
!1054 = !{!1055}
!1055 = !DISubrange(count: 52)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 170, type: !1058, isLocal: true, isDefinition: true)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 60)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 248, type: !399, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 248, type: !768, isLocal: true, isDefinition: true)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 254, type: !399, isLocal: true, isDefinition: true)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 254, type: !243, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 254, type: !749, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 259, type: !265, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 259, type: !662, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1077, file: !1078, line: 26, type: !1080, isLocal: false, isDefinition: true)
!1077 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1078, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1079, splitDebugInlining: false, nameTableKind: None)
!1078 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1079 = !{!1075}
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 376, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 47)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !1085, line: 80, type: !238, isLocal: true, isDefinition: true)
!1085 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1088, file: !1089, line: 506, type: !37, isLocal: true, isDefinition: true)
!1088 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1089, file: !1089, line: 485, type: !1090, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1092, retainedNodes: !1094)
!1089 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!37, !37, !37}
!1092 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1089, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1093, splitDebugInlining: false, nameTableKind: None)
