; ModuleID = 'src/du.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.duinfo = type { i64, i64, %struct.timespec }
%struct.timespec = type { i64, i64 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.pattern_buffer = type { ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.di_ent = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.mount_entry = type { ptr, ptr, ptr, ptr, i64, i8, ptr }
%struct.dulevel = type { %struct.duinfo, %struct.duinfo }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 4)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !344, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1078, type: !152, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1078, type: !152, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1079, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 27)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "temp_argv", scope: !366, file: !2, line: 1113, type: !374, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !429, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 40)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !361, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 184, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 23)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1141, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 72)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1158, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 30)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1165, type: !354, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1187, type: !436, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1190, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 6)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "di_files", scope: !172, file: !2, line: 58, type: !492, isLocal: true, isDefinition: true)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !494, line: 35, flags: DIFlagFwdDecl)
!494 = !DIFile(filename: "./lib/di-set.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6799d6331104f29afec5973dd8498fc3")
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "di_mnt", scope: !172, file: !2, line: 61, type: !492, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "hash_all", scope: !172, file: !2, line: 132, type: !376, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !172, file: !2, line: 153, type: !225, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "localtz", scope: !172, file: !2, line: 179, type: !503, isLocal: true, isDefinition: true)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !504, line: 1039, baseType: !505)
!504 = !DIFile(filename: "./lib/time.h", directory: "/src")
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !504, line: 1039, flags: DIFlagFwdDecl)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "output_block_size", scope: !172, file: !2, line: 182, type: !268, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "tot_dui", scope: !172, file: !2, line: 188, type: !511, isLocal: true, isDefinition: true)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "duinfo", file: !2, line: 68, size: 256, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !2, line: 71, baseType: !268, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !511, file: !2, line: 74, baseType: !268, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tmax", scope: !511, file: !2, line: 78, baseType: !516, size: 128, offset: 128)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !517, line: 11, size: 128, elements: !518)
!517 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !516, file: !517, line: 16, baseType: !274, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !516, file: !517, line: 21, baseType: !521, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !271, line: 197, baseType: !275)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !224, line: 736, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 75)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !529, file: !224, line: 575, type: !225, isLocal: true, isDefinition: true)
!529 = distinct !DISubprogram(name: "oputs_", scope: !224, file: !224, line: 573, type: !530, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !532)
!530 = !DISubroutineType(cc: DW_CC_nocall, types: !531)
!531 = !{null, !261, !261}
!532 = !{!533, !534, !535, !538, !539, !540, !541, !545, !546, !547, !548, !550, !601, !602, !603, !605, !606}
!533 = !DILocalVariable(name: "program", arg: 1, scope: !529, file: !224, line: 573, type: !261)
!534 = !DILocalVariable(name: "option", arg: 2, scope: !529, file: !224, line: 573, type: !261)
!535 = !DILocalVariable(name: "term", scope: !536, file: !224, line: 585, type: !261)
!536 = distinct !DILexicalBlock(scope: !537, file: !224, line: 582, column: 5)
!537 = distinct !DILexicalBlock(scope: !529, file: !224, line: 581, column: 7)
!538 = !DILocalVariable(name: "double_space", scope: !529, file: !224, line: 594, type: !376)
!539 = !DILocalVariable(name: "first_word", scope: !529, file: !224, line: 595, type: !261)
!540 = !DILocalVariable(name: "option_text", scope: !529, file: !224, line: 596, type: !261)
!541 = !DILocalVariable(name: "s", scope: !542, file: !224, line: 608, type: !261)
!542 = distinct !DILexicalBlock(scope: !543, file: !224, line: 605, column: 5)
!543 = distinct !DILexicalBlock(scope: !544, file: !224, line: 604, column: 12)
!544 = distinct !DILexicalBlock(scope: !529, file: !224, line: 597, column: 7)
!545 = !DILocalVariable(name: "spaces", scope: !542, file: !224, line: 609, type: !264)
!546 = !DILocalVariable(name: "anchor_len", scope: !529, file: !224, line: 620, type: !264)
!547 = !DILocalVariable(name: "desc_text", scope: !529, file: !224, line: 625, type: !261)
!548 = !DILocalVariable(name: "__ptr", scope: !549, file: !224, line: 644, type: !261)
!549 = distinct !DILexicalBlock(scope: !529, file: !224, line: 644, column: 3)
!550 = !DILocalVariable(name: "__stream", scope: !549, file: !224, line: 644, type: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !553, line: 7, baseType: !554)
!553 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !555, line: 49, size: 1728, elements: !556)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !572, !574, !575, !576, !578, !579, !581, !582, !585, !587, !590, !593, !594, !595, !596, !597}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !554, file: !555, line: 51, baseType: !225, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !554, file: !555, line: 54, baseType: !259, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !554, file: !555, line: 55, baseType: !259, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !554, file: !555, line: 56, baseType: !259, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !554, file: !555, line: 57, baseType: !259, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !554, file: !555, line: 58, baseType: !259, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !554, file: !555, line: 59, baseType: !259, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !554, file: !555, line: 60, baseType: !259, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !554, file: !555, line: 61, baseType: !259, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !554, file: !555, line: 64, baseType: !259, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !554, file: !555, line: 65, baseType: !259, size: 64, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !554, file: !555, line: 66, baseType: !259, size: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !554, file: !555, line: 68, baseType: !570, size: 64, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !555, line: 36, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !554, file: !555, line: 70, baseType: !573, size: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !554, file: !555, line: 72, baseType: !225, size: 32, offset: 896)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !554, file: !555, line: 73, baseType: !225, size: 32, offset: 928)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !554, file: !555, line: 74, baseType: !577, size: 64, offset: 960)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !271, line: 152, baseType: !275)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !554, file: !555, line: 77, baseType: !263, size: 16, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !554, file: !555, line: 78, baseType: !580, size: 8, offset: 1040)
!580 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !554, file: !555, line: 79, baseType: !157, size: 8, offset: 1048)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !554, file: !555, line: 81, baseType: !583, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !555, line: 43, baseType: null)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !554, file: !555, line: 89, baseType: !586, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !271, line: 153, baseType: !275)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !554, file: !555, line: 91, baseType: !588, size: 64, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !555, line: 37, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !554, file: !555, line: 92, baseType: !591, size: 64, offset: 1280)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !555, line: 38, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !554, file: !555, line: 93, baseType: !573, size: 64, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !554, file: !555, line: 94, baseType: !260, size: 64, offset: 1408)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !554, file: !555, line: 95, baseType: !264, size: 64, offset: 1472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !554, file: !555, line: 96, baseType: !225, size: 32, offset: 1536)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !554, file: !555, line: 98, baseType: !598, size: 160, offset: 1568)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 20)
!601 = !DILocalVariable(name: "__cnt", scope: !549, file: !224, line: 644, type: !264)
!602 = !DILocalVariable(name: "url_program", scope: !529, file: !224, line: 648, type: !261)
!603 = !DILocalVariable(name: "__ptr", scope: !604, file: !224, line: 686, type: !261)
!604 = distinct !DILexicalBlock(scope: !529, file: !224, line: 686, column: 3)
!605 = !DILocalVariable(name: "__stream", scope: !604, file: !224, line: 686, type: !551)
!606 = !DILocalVariable(name: "__cnt", scope: !604, file: !224, line: 686, type: !264)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !224, line: 585, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 5)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !224, line: 586, type: !609, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !224, line: 595, type: !441, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !224, line: 620, type: !487, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !224, line: 648, type: !152, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !224, line: 648, type: !609, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !224, line: 649, type: !441, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !224, line: 649, type: !19, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !224, line: 650, type: !609, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !224, line: 651, type: !487, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !224, line: 651, type: !487, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !224, line: 652, type: !300, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !224, line: 653, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 8)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !224, line: 654, type: !162, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !224, line: 655, type: !162, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !224, line: 656, type: !162, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !224, line: 657, type: !162, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !224, line: 663, type: !300, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !224, line: 664, type: !162, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !224, line: 669, type: !436, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !224, line: 669, type: !461, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !224, line: 676, type: !429, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !224, line: 676, type: !80, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !224, line: 679, type: !19, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !224, line: 683, type: !609, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !224, line: 688, type: !609, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !224, line: 691, type: !636, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !224, line: 754, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1784, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 223)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !224, line: 744, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 216)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !224, line: 839, type: !319, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !224, line: 840, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 22)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !224, line: 841, type: !429, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !224, line: 862, type: !441, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !224, line: 868, type: !9, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !224, line: 875, type: !452, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !224, line: 877, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 51)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !224, line: 877, type: !324, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !441, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !279, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !354, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 214, type: !487, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !324, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !2, line: 219, type: !324, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !2, line: 220, type: !436, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 221, type: !636, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !329, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !324, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !2, line: 224, type: !429, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 225, type: !300, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !19, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !162, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !609, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !429, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !319, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !279, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !162, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !162, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !609, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !354, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !609, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !636, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "long_options", scope: !172, file: !2, line: 209, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 6656, elements: !759)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !752, line: 50, size: 256, elements: !753)
!752 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!753 = !{!754, !755, !756, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !751, file: !752, line: 52, baseType: !261, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !751, file: !752, line: 55, baseType: !225, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !751, file: !752, line: 56, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !751, file: !752, line: 57, baseType: !225, size: 32, offset: 192)
!759 = !{!760}
!760 = !DISubrange(count: 26)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "opt_nul_terminate_output", scope: !172, file: !2, line: 135, type: !376, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "opt_all", scope: !172, file: !2, line: 122, type: !376, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "apparent_size", scope: !172, file: !2, line: 126, type: !376, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !172, file: !2, line: 138, type: !376, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "max_depth", scope: !172, file: !2, line: 146, type: !417, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "opt_count_all", scope: !172, file: !2, line: 129, type: !376, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "opt_threshold", scope: !172, file: !2, line: 150, type: !388, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "opt_separate_dirs", scope: !172, file: !2, line: 141, type: !376, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "opt_inodes", scope: !172, file: !2, line: 156, type: !376, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "opt_time", scope: !172, file: !2, line: 159, type: !376, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "time_types", scope: !172, file: !2, line: 246, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 160, elements: !610)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !487, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !300, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !441, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !487, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !300, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "time_args", scope: !172, file: !2, line: 242, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 384, elements: !488)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "time_type", scope: !172, file: !2, line: 170, type: !218, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "time_style", scope: !172, file: !2, line: 173, type: !261, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "time_format", scope: !172, file: !2, line: 176, type: !261, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1015, type: !354, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1022, type: !681, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1024, type: !361, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1026, type: !162, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1027, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 54)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !361, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !441, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "time_style_args", scope: !172, file: !2, line: 262, type: !824, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 256, elements: !442)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "time_style_types", scope: !172, file: !2, line: 266, type: !827, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 96, elements: !20)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 742, type: !598, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 764, type: !436, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "prev_level", scope: !172, file: !2, line: 65, type: !417, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "n_alloc", scope: !837, file: !2, line: 543, type: !417, isLocal: true, isDefinition: true)
!837 = distinct !DISubprogram(name: "process_file", scope: !2, file: !2, line: 538, type: !838, scopeLine: 539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !945)
!838 = !DISubroutineType(types: !839)
!839 = !{!376, !840, !943}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !842, line: 233, baseType: !843)
!842 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !842, line: 115, size: 1024, elements: !844)
!844 = !{!845, !903, !904, !906, !909, !910, !911, !912, !913, !914, !921, !922, !925, !932}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !843, file: !842, line: 116, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !842, line: 235, size: 2048, elements: !848)
!848 = !{!849, !850, !851, !852, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !899}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !847, file: !842, line: 236, baseType: !846, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !847, file: !842, line: 237, baseType: !846, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !847, file: !842, line: 238, baseType: !846, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !847, file: !842, line: 239, baseType: !853, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !855, line: 127, baseType: !856)
!855 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !855, line: 127, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !847, file: !842, line: 242, baseType: !275, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !847, file: !842, line: 243, baseType: !260, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !847, file: !842, line: 244, baseType: !259, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !847, file: !842, line: 245, baseType: !259, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !847, file: !842, line: 246, baseType: !225, size: 32, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !847, file: !842, line: 247, baseType: !225, size: 32, offset: 544)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !847, file: !842, line: 248, baseType: !264, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !847, file: !842, line: 250, baseType: !840, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !847, file: !842, line: 254, baseType: !419, size: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !847, file: !842, line: 256, baseType: !264, size: 64, offset: 768)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !847, file: !842, line: 272, baseType: !263, size: 16, offset: 832)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !847, file: !842, line: 276, baseType: !263, size: 16, offset: 848)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !847, file: !842, line: 282, baseType: !263, size: 16, offset: 864)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !847, file: !842, line: 284, baseType: !871, size: 1152, offset: 896)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 1152, elements: !158)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !873, line: 26, size: 1152, elements: !874)
!873 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!874 = !{!875, !877, !879, !881, !883, !885, !887, !888, !889, !890, !892, !894, !895, !896, !897}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !872, file: !873, line: 31, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !271, line: 145, baseType: !266)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !872, file: !873, line: 36, baseType: !878, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !271, line: 148, baseType: !266)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !872, file: !873, line: 44, baseType: !880, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !271, line: 151, baseType: !266)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !872, file: !873, line: 45, baseType: !882, size: 32, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !271, line: 150, baseType: !176)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !872, file: !873, line: 47, baseType: !884, size: 32, offset: 224)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !271, line: 146, baseType: !176)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !872, file: !873, line: 48, baseType: !886, size: 32, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !271, line: 147, baseType: !176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !872, file: !873, line: 50, baseType: !225, size: 32, offset: 288)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !872, file: !873, line: 52, baseType: !876, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !872, file: !873, line: 57, baseType: !577, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !872, file: !873, line: 61, baseType: !891, size: 64, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !271, line: 175, baseType: !275)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !872, file: !873, line: 63, baseType: !893, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !271, line: 180, baseType: !275)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !872, file: !873, line: 74, baseType: !516, size: 128, offset: 576)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !872, file: !873, line: 75, baseType: !516, size: 128, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !872, file: !873, line: 76, baseType: !516, size: 128, offset: 832)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !872, file: !873, line: 89, baseType: !898, size: 192, offset: 960)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 192, elements: !20)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !847, file: !842, line: 285, baseType: !900, offset: 2048)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: -1)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !843, file: !842, line: 117, baseType: !846, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !843, file: !842, line: 118, baseType: !905, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !843, file: !842, line: 119, baseType: !907, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !908, line: 59, baseType: !876)
!908 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !843, file: !842, line: 120, baseType: !259, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !843, file: !842, line: 121, baseType: !225, size: 32, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !843, file: !842, line: 122, baseType: !225, size: 32, offset: 352)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !843, file: !842, line: 124, baseType: !264, size: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !843, file: !842, line: 125, baseType: !264, size: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !843, file: !842, line: 126, baseType: !915, size: 64, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!225, !918, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !843, file: !842, line: 196, baseType: !225, size: 32, offset: 576)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !843, file: !842, line: 205, baseType: !923, size: 64, offset: 640)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !842, line: 205, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !843, file: !842, line: 227, baseType: !926, size: 64, offset: 704)
!926 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !843, file: !842, line: 207, size: 64, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !926, file: !842, line: 220, baseType: !923, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !926, file: !842, line: 226, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !842, line: 226, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !843, file: !842, line: 232, baseType: !933, size: 256, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !934, line: 47, baseType: !935)
!934 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !934, line: 39, size: 256, elements: !936)
!936 = !{!937, !939, !940, !941, !942}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !935, file: !934, line: 41, baseType: !938, size: 128)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !442)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !935, file: !934, line: 42, baseType: !225, size: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !935, file: !934, line: 43, baseType: !176, size: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !935, file: !934, line: 44, baseType: !176, size: 32, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !935, file: !934, line: 45, baseType: !376, size: 8, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !842, line: 286, baseType: !847)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !955, !956, !960, !967, !972, !973, !980}
!946 = !DILocalVariable(name: "fts", arg: 1, scope: !837, file: !2, line: 538, type: !840)
!947 = !DILocalVariable(name: "ent", arg: 2, scope: !837, file: !2, line: 538, type: !943)
!948 = !DILocalVariable(name: "ok", scope: !837, file: !2, line: 540, type: !376)
!949 = !DILocalVariable(name: "dui", scope: !837, file: !2, line: 541, type: !511)
!950 = !DILocalVariable(name: "dui_to_print", scope: !837, file: !2, line: 542, type: !511)
!951 = !DILocalVariable(name: "file", scope: !837, file: !2, line: 554, type: !261)
!952 = !DILocalVariable(name: "sb", scope: !837, file: !2, line: 555, type: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!955 = !DILocalVariable(name: "info", scope: !837, file: !2, line: 556, type: !225)
!956 = !DILocalVariable(name: "excluded", scope: !957, file: !2, line: 566, type: !376)
!957 = distinct !DILexicalBlock(scope: !958, file: !2, line: 565, column: 5)
!958 = distinct !DILexicalBlock(scope: !959, file: !2, line: 564, column: 12)
!959 = distinct !DILexicalBlock(scope: !837, file: !2, line: 558, column: 7)
!960 = !DILocalVariable(name: "e", scope: !961, file: !2, line: 574, type: !965)
!961 = distinct !DILexicalBlock(scope: !962, file: !2, line: 572, column: 13)
!962 = distinct !DILexicalBlock(scope: !963, file: !2, line: 571, column: 15)
!963 = distinct !DILexicalBlock(scope: !964, file: !2, line: 568, column: 9)
!964 = distinct !DILexicalBlock(scope: !957, file: !2, line: 567, column: 11)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!967 = !DILocalVariable(name: "e", scope: !968, file: !2, line: 607, type: !965)
!968 = distinct !DILexicalBlock(scope: !969, file: !2, line: 605, column: 13)
!969 = distinct !DILexicalBlock(scope: !970, file: !2, line: 604, column: 15)
!970 = distinct !DILexicalBlock(scope: !971, file: !2, line: 600, column: 9)
!971 = distinct !DILexicalBlock(scope: !957, file: !2, line: 596, column: 11)
!972 = !DILocalVariable(name: "level", scope: !837, file: !2, line: 645, type: !417)
!973 = !DILocalVariable(name: "i", scope: !974, file: !2, line: 670, type: !417)
!974 = distinct !DILexicalBlock(scope: !975, file: !2, line: 670, column: 11)
!975 = distinct !DILexicalBlock(scope: !976, file: !2, line: 660, column: 9)
!976 = distinct !DILexicalBlock(scope: !977, file: !2, line: 659, column: 16)
!977 = distinct !DILexicalBlock(scope: !978, file: !2, line: 655, column: 11)
!978 = distinct !DILexicalBlock(scope: !979, file: !2, line: 654, column: 5)
!979 = distinct !DILexicalBlock(scope: !837, file: !2, line: 648, column: 7)
!980 = !DILocalVariable(name: "v", scope: !981, file: !2, line: 709, type: !268)
!981 = distinct !DILexicalBlock(scope: !982, file: !2, line: 707, column: 5)
!982 = distinct !DILexicalBlock(scope: !837, file: !2, line: 704, column: 7)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "dulvl", scope: !837, file: !2, line: 552, type: !985, isLocal: true, isDefinition: true)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dulevel", file: !2, line: 112, size: 512, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !986, file: !2, line: 115, baseType: !511, size: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "subdir", scope: !986, file: !2, line: 118, baseType: !511, size: 256, offset: 256)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !284, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !2, line: 575, type: !361, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 575, type: !996, isLocal: true, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 288, elements: !76)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !436, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !2, line: 630, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 186)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 684, type: !167, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !361, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !224, line: 952, type: !324, isLocal: true, isDefinition: true)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !1012, line: 57, flags: DIFlagFwdDecl)
!1012 = !DIFile(filename: "./lib/exclude.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9923a67d64662c8e3bb6144e4abd8844")
!1013 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1014 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1015 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1016 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1017 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1018 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1019 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1020 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !1023, line: 27, type: !167, isLocal: true, isDefinition: true)
!1023 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !1023, line: 35, type: !309, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 3, type: !429, isLocal: true, isDefinition: true)
!1028 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "Version", scope: !1031, file: !1028, line: 3, type: !261, isLocal: false, isDefinition: true)
!1031 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1028, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1032, splitDebugInlining: false, nameTableKind: None)
!1032 = !{!1026, !1029}
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1035, file: !1036, line: 65, type: !1058, isLocal: false, isDefinition: true)
!1035 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1036, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1037, retainedTypes: !1038, globals: !1039, splitDebugInlining: false, nameTableKind: None)
!1036 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1037 = !{!204}
!1038 = !{!260, !261, !267}
!1039 = !{!1033, !1040, !1042, !1044, !1049, !1054, !1056}
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 141, type: !300, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 141, type: !452, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 142, type: !1046, isLocal: true, isDefinition: true)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 29)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 160, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 21)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 165, type: !636, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 170, type: !609, isLocal: true, isDefinition: true)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1059, line: 69, baseType: !1060)
!1059 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null}
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "file_name", scope: !1065, file: !1066, line: 45, type: !261, isLocal: true, isDefinition: true)
!1065 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1066, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1067, splitDebugInlining: false, nameTableKind: None)
!1066 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1067 = !{!1068, !1070, !1072, !1074, !1063, !1076}
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !1066, line: 121, type: !300, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(scope: null, file: !1066, line: 121, type: !324, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(scope: null, file: !1066, line: 123, type: !300, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !1066, line: 126, type: !19, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1065, file: !1066, line: 55, type: !376, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1080, file: !1081, line: 66, type: !1060, isLocal: false, isDefinition: true)
!1080 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1081, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1082, globals: !1083, splitDebugInlining: false, nameTableKind: None)
!1081 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1082 = !{!260, !267}
!1083 = !{!1084, !1086, !1106, !1108, !1110, !1112, !1078, !1114, !1116, !1118, !1120, !1122}
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1081, line: 272, type: !609, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1088, file: !1081, line: 304, type: !261, isLocal: true, isDefinition: true)
!1088 = distinct !DISubprogram(name: "verror_at_line", scope: !1081, file: !1081, line: 298, type: !1089, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1080, retainedNodes: !1099)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !225, !225, !261, !176, !261, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1093)
!1093 = !{!1094, !1096, !1097, !1098}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1092, file: !1095, baseType: !176, size: 32)
!1095 = !DIFile(filename: "lib/error.c", directory: "/src")
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1092, file: !1095, baseType: !176, size: 32, offset: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1092, file: !1095, baseType: !260, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1092, file: !1095, baseType: !260, size: 64, offset: 128)
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1105}
!1100 = !DILocalVariable(name: "status", arg: 1, scope: !1088, file: !1081, line: 298, type: !225)
!1101 = !DILocalVariable(name: "errnum", arg: 2, scope: !1088, file: !1081, line: 298, type: !225)
!1102 = !DILocalVariable(name: "file_name", arg: 3, scope: !1088, file: !1081, line: 298, type: !261)
!1103 = !DILocalVariable(name: "line_number", arg: 4, scope: !1088, file: !1081, line: 298, type: !176)
!1104 = !DILocalVariable(name: "message", arg: 5, scope: !1088, file: !1081, line: 298, type: !261)
!1105 = !DILocalVariable(name: "args", arg: 6, scope: !1088, file: !1081, line: 298, type: !1091)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1088, file: !1081, line: 305, type: !176, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !1081, line: 338, type: !441, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !1081, line: 346, type: !636, isLocal: true, isDefinition: true)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !1081, line: 346, type: !152, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1080, file: !1081, line: 69, type: !176, isLocal: false, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1080, file: !1081, line: 295, type: !225, isLocal: false, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !1081, line: 208, type: !300, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1081, line: 208, type: !1051, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !1081, line: 214, type: !609, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "patsuffix", scope: !1126, file: !1127, line: 543, type: !421, isLocal: true, isDefinition: true)
!1126 = distinct !DISubprogram(name: "add_exclude", scope: !1127, file: !1127, line: 508, type: !1128, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1196, retainedNodes: !1214)
!1127 = !DIFile(filename: "lib/exclude.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa512123465487c1fb7947405d851ab7")
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !1130, !261, !225}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !1127, line: 123, size: 128, elements: !1132)
!1132 = !{!1133, !1190}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1131, file: !1127, line: 125, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_segment", file: !1127, line: 103, size: 320, elements: !1136)
!1136 = !{!1137, !1138, !1143, !1144}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1135, file: !1127, line: 105, baseType: !1134, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1135, file: !1127, line: 106, baseType: !1139, size: 32, offset: 64)
!1139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exclude_type", file: !1127, line: 97, baseType: !176, size: 32, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIEnumerator(name: "exclude_hash", value: 0)
!1142 = !DIEnumerator(name: "exclude_pattern", value: 1)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1135, file: !1127, line: 107, baseType: !225, size: 32, offset: 96)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1135, file: !1127, line: 112, baseType: !1145, size: 192, offset: 128)
!1145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1135, file: !1127, line: 108, size: 192, elements: !1146)
!1146 = !{!1147, !1152}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1145, file: !1127, line: 110, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1150, line: 56, baseType: !1151)
!1150 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1150, line: 54, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pat", scope: !1145, file: !1127, line: 111, baseType: !1153, size: 192)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_pattern", file: !1127, line: 90, size: 192, elements: !1154)
!1154 = !{!1155, !1188, !1189}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "exclude", scope: !1153, file: !1127, line: 92, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "patopts", file: !1127, line: 78, size: 576, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1157, file: !1127, line: 80, baseType: !225, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1157, file: !1127, line: 85, baseType: !1161, size: 512, offset: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1157, file: !1127, line: 81, size: 512, elements: !1162)
!1162 = !{!1163, !1164}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !1161, file: !1127, line: 83, baseType: !261, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1161, file: !1127, line: 84, baseType: !1165, size: 512)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !1166, line: 478, baseType: !1167)
!1166 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !1166, line: 413, size: 512, elements: !1168)
!1168 = !{!1169, !1172, !1174, !1175, !1177, !1178, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1167, file: !1166, line: 417, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !1166, line: 417, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1167, file: !1166, line: 420, baseType: !1173, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !1166, line: 56, baseType: !266)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1167, file: !1166, line: 423, baseType: !1173, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !1167, file: !1166, line: 426, baseType: !1176, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !1166, line: 71, baseType: !266)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !1167, file: !1166, line: 431, baseType: !259, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !1167, file: !1166, line: 437, baseType: !1179, size: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !1167, file: !1166, line: 440, baseType: !264, size: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !1167, file: !1166, line: 446, baseType: !176, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !1167, file: !1166, line: 457, baseType: !176, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !1167, file: !1166, line: 461, baseType: !176, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !1167, file: !1166, line: 465, baseType: !176, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !1167, file: !1166, line: 469, baseType: !176, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !1167, file: !1166, line: 472, baseType: !176, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !1167, file: !1166, line: 475, baseType: !176, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_alloc", scope: !1153, file: !1127, line: 93, baseType: !417, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_count", scope: !1153, file: !1127, line: 94, baseType: !417, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "patbuf", scope: !1131, file: !1127, line: 126, baseType: !1191, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pattern_buffer", file: !1127, line: 115, size: 128, elements: !1193)
!1193 = !{!1194, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1192, file: !1127, line: 117, baseType: !1191, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1192, file: !1127, line: 118, baseType: !259, size: 64, offset: 64)
!1196 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1127, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1197, retainedTypes: !1208, globals: !1209, splitDebugInlining: false, nameTableKind: None)
!1197 = !{!1139, !241, !1198, !1202, !1205}
!1198 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1199, line: 127, baseType: !176, size: 32, elements: !1200)
!1199 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!1200 = !{!1201}
!1201 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!1202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1199, line: 131, baseType: !176, size: 32, elements: !1203)
!1203 = !{!1204}
!1204 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!1205 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1199, line: 130, baseType: !176, size: 32, elements: !1206)
!1206 = !{!1207}
!1207 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!1208 = !{!225, !267, !263, !264, !1179}
!1209 = !{!1124, !1210, !1212}
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 662, type: !152, isLocal: true, isDefinition: true)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 665, type: !19, isLocal: true, isDefinition: true)
!1214 = !{!1215, !1216, !1217, !1218, !1222, !1223, !1226, !1227, !1230, !1235, !1239, !1241}
!1215 = !DILocalVariable(name: "ex", arg: 1, scope: !1126, file: !1127, line: 508, type: !1130)
!1216 = !DILocalVariable(name: "pattern", arg: 2, scope: !1126, file: !1127, line: 508, type: !261)
!1217 = !DILocalVariable(name: "options", arg: 3, scope: !1126, file: !1127, line: 508, type: !225)
!1218 = !DILocalVariable(name: "pat", scope: !1219, file: !1127, line: 518, type: !1221)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !1127, line: 512, column: 5)
!1220 = distinct !DILexicalBlock(scope: !1126, file: !1127, line: 510, column: 7)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1222 = !DILocalVariable(name: "patopts", scope: !1219, file: !1127, line: 522, type: !1156)
!1223 = !DILocalVariable(name: "cflags", scope: !1224, file: !1127, line: 527, type: !225)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !1127, line: 526, column: 9)
!1225 = distinct !DILexicalBlock(scope: !1219, file: !1127, line: 525, column: 11)
!1226 = !DILocalVariable(name: "rc", scope: !1224, file: !1127, line: 530, type: !225)
!1227 = !DILocalVariable(name: "len", scope: !1228, file: !1127, line: 534, type: !417)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !1127, line: 534, column: 13)
!1229 = distinct !DILexicalBlock(scope: !1224, file: !1127, line: 531, column: 15)
!1230 = !DILocalVariable(name: "tmp", scope: !1231, file: !1127, line: 544, type: !259)
!1231 = distinct !DILexicalBlock(scope: !1232, file: !1127, line: 542, column: 19)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !1127, line: 541, column: 21)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !1127, line: 535, column: 15)
!1234 = distinct !DILexicalBlock(scope: !1228, file: !1127, line: 534, column: 13)
!1235 = !DILocalVariable(name: "dup", scope: !1236, file: !1127, line: 563, type: !259)
!1236 = distinct !DILexicalBlock(scope: !1237, file: !1127, line: 562, column: 13)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !1127, line: 561, column: 15)
!1238 = distinct !DILexicalBlock(scope: !1225, file: !1127, line: 560, column: 9)
!1239 = !DILocalVariable(name: "exclude_hash_flags", scope: !1240, file: !1127, line: 572, type: !225)
!1240 = distinct !DILexicalBlock(scope: !1220, file: !1127, line: 571, column: 5)
!1241 = !DILocalVariable(name: "str", scope: !1240, file: !1127, line: 579, type: !259)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 1143, type: !487, isLocal: true, isDefinition: true)
!1244 = !DIFile(filename: "./lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!1245 = !DIGlobalVariableExpression(var: !1246, expr: !DIExpression())
!1246 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 1146, type: !636, isLocal: true, isDefinition: true)
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 1149, type: !487, isLocal: true, isDefinition: true)
!1249 = !DIGlobalVariableExpression(var: !1250, expr: !DIExpression())
!1250 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !1251, file: !1277, line: 75, type: !1346, isLocal: true, isDefinition: true)
!1251 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1252, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1253, retainedTypes: !1261, globals: !1270, splitDebugInlining: false, nameTableKind: None)
!1252 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!1253 = !{!1254}
!1254 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !1244, line: 163, baseType: !176, size: 32, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260}
!1256 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!1257 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!1258 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!1259 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!1260 = !DIEnumerator(name: "NO_PAD", value: 4)
!1261 = !{!260, !376, !176, !275, !266, !225, !267, !1262}
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !504, line: 1039, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1265, line: 24, size: 128, elements: !1266)
!1265 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!1266 = !{!1267, !1268, !1269}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1264, file: !1265, line: 28, baseType: !1263, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1264, file: !1265, line: 33, baseType: !4, size: 8, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1264, file: !1265, line: 45, baseType: !900, offset: 72)
!1270 = !{!1242, !1245, !1247, !1271, !1273, !1275, !1249, !1278, !1280, !1282, !1287, !1289, !1291, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1315, !1317, !1319, !1321, !1326, !1328, !1330, !1332, !1341, !1344, !1363, !1365, !1367, !1369, !1371, !1373, !1375, !1377, !1379, !1381, !1383, !1385, !1387, !1390, !1393, !1395, !1397, !1399, !1401, !1403, !1405, !1407, !1409, !1411, !1413, !1415, !1417, !1419, !1421, !1423, !1425, !1427, !1429, !1431, !1433, !1435, !1437, !1439, !1441, !1444, !1446, !1448, !1450}
!1271 = !DIGlobalVariableExpression(var: !1272, expr: !DIExpression())
!1272 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 1151, type: !487, isLocal: true, isDefinition: true)
!1273 = !DIGlobalVariableExpression(var: !1274, expr: !DIExpression())
!1274 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 1153, type: !487, isLocal: true, isDefinition: true)
!1275 = !DIGlobalVariableExpression(var: !1276, expr: !DIExpression())
!1276 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 78, type: !361, isLocal: true, isDefinition: true)
!1277 = !DIFile(filename: "./lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!1278 = !DIGlobalVariableExpression(var: !1279, expr: !DIExpression())
!1279 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 26, type: !314, isLocal: true, isDefinition: true)
!1280 = !DIGlobalVariableExpression(var: !1281, expr: !DIExpression())
!1281 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 26, type: !361, isLocal: true, isDefinition: true)
!1282 = !DIGlobalVariableExpression(var: !1283, expr: !DIExpression())
!1283 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 27, type: !1284, isLocal: true, isDefinition: true)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1285)
!1285 = !{!1286}
!1286 = !DISubrange(count: 31)
!1287 = !DIGlobalVariableExpression(var: !1288, expr: !DIExpression())
!1288 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 27, type: !361, isLocal: true, isDefinition: true)
!1289 = !DIGlobalVariableExpression(var: !1290, expr: !DIExpression())
!1290 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 28, type: !314, isLocal: true, isDefinition: true)
!1291 = !DIGlobalVariableExpression(var: !1292, expr: !DIExpression())
!1292 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 28, type: !324, isLocal: true, isDefinition: true)
!1293 = !DIGlobalVariableExpression(var: !1294, expr: !DIExpression())
!1294 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 29, type: !314, isLocal: true, isDefinition: true)
!1295 = !DIGlobalVariableExpression(var: !1296, expr: !DIExpression())
!1296 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 29, type: !324, isLocal: true, isDefinition: true)
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 30, type: !681, isLocal: true, isDefinition: true)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 30, type: !361, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 31, type: !284, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
!1304 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 31, type: !324, isLocal: true, isDefinition: true)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 32, type: !681, isLocal: true, isDefinition: true)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 32, type: !361, isLocal: true, isDefinition: true)
!1309 = !DIGlobalVariableExpression(var: !1310, expr: !DIExpression())
!1310 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 33, type: !681, isLocal: true, isDefinition: true)
!1311 = !DIGlobalVariableExpression(var: !1312, expr: !DIExpression())
!1312 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 33, type: !361, isLocal: true, isDefinition: true)
!1313 = !DIGlobalVariableExpression(var: !1314, expr: !DIExpression())
!1314 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 34, type: !681, isLocal: true, isDefinition: true)
!1315 = !DIGlobalVariableExpression(var: !1316, expr: !DIExpression())
!1316 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 34, type: !361, isLocal: true, isDefinition: true)
!1317 = !DIGlobalVariableExpression(var: !1318, expr: !DIExpression())
!1318 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 35, type: !314, isLocal: true, isDefinition: true)
!1319 = !DIGlobalVariableExpression(var: !1320, expr: !DIExpression())
!1320 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 35, type: !361, isLocal: true, isDefinition: true)
!1321 = !DIGlobalVariableExpression(var: !1322, expr: !DIExpression())
!1322 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 36, type: !1323, isLocal: true, isDefinition: true)
!1323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1324)
!1324 = !{!1325}
!1325 = !DISubrange(count: 28)
!1326 = !DIGlobalVariableExpression(var: !1327, expr: !DIExpression())
!1327 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 36, type: !361, isLocal: true, isDefinition: true)
!1328 = !DIGlobalVariableExpression(var: !1329, expr: !DIExpression())
!1329 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 37, type: !681, isLocal: true, isDefinition: true)
!1330 = !DIGlobalVariableExpression(var: !1331, expr: !DIExpression())
!1331 = distinct !DIGlobalVariable(scope: null, file: !1277, line: 37, type: !361, isLocal: true, isDefinition: true)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !1251, file: !1277, line: 21, type: !1334, isLocal: true, isDefinition: true)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1335, size: 1920, elements: !430)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !1337, line: 19, size: 128, elements: !1338)
!1337 = !DIFile(filename: "./lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!1338 = !{!1339, !1340}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1336, file: !1337, line: 21, baseType: !261, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !1336, file: !1337, line: 22, baseType: !261, size: 64, offset: 64)
!1341 = !DIGlobalVariableExpression(var: !1342, expr: !DIExpression())
!1342 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 134, type: !324, isLocal: true, isDefinition: true)
!1343 = !DIFile(filename: "./lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!1344 = !DIGlobalVariableExpression(var: !1345, expr: !DIExpression())
!1345 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !1251, file: !1343, line: 131, type: !1346, isLocal: true, isDefinition: true)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !1337, line: 33, size: 192, elements: !1348)
!1348 = !{!1349, !1361, !1362}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !1347, file: !1337, line: 39, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!225, !1353, !225, !225, !225}
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !1337, line: 25, size: 192, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1354, file: !1337, line: 27, baseType: !225, size: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1354, file: !1337, line: 28, baseType: !225, size: 32, offset: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1354, file: !1337, line: 29, baseType: !225, size: 32, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !1354, file: !1337, line: 30, baseType: !1360, size: 64, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !1347, file: !1337, line: 42, baseType: !261, size: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !1347, file: !1337, line: 44, baseType: !176, size: 32, offset: 128)
!1363 = !DIGlobalVariableExpression(var: !1364, expr: !DIExpression())
!1364 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 39, type: !429, isLocal: true, isDefinition: true)
!1365 = !DIGlobalVariableExpression(var: !1366, expr: !DIExpression())
!1366 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 40, type: !436, isLocal: true, isDefinition: true)
!1367 = !DIGlobalVariableExpression(var: !1368, expr: !DIExpression())
!1368 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 41, type: !354, isLocal: true, isDefinition: true)
!1369 = !DIGlobalVariableExpression(var: !1370, expr: !DIExpression())
!1370 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 42, type: !300, isLocal: true, isDefinition: true)
!1371 = !DIGlobalVariableExpression(var: !1372, expr: !DIExpression())
!1372 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 43, type: !354, isLocal: true, isDefinition: true)
!1373 = !DIGlobalVariableExpression(var: !1374, expr: !DIExpression())
!1374 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 44, type: !329, isLocal: true, isDefinition: true)
!1375 = !DIGlobalVariableExpression(var: !1376, expr: !DIExpression())
!1376 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 45, type: !300, isLocal: true, isDefinition: true)
!1377 = !DIGlobalVariableExpression(var: !1378, expr: !DIExpression())
!1378 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 46, type: !361, isLocal: true, isDefinition: true)
!1379 = !DIGlobalVariableExpression(var: !1380, expr: !DIExpression())
!1380 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 47, type: !300, isLocal: true, isDefinition: true)
!1381 = !DIGlobalVariableExpression(var: !1382, expr: !DIExpression())
!1382 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 48, type: !609, isLocal: true, isDefinition: true)
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 49, type: !361, isLocal: true, isDefinition: true)
!1385 = !DIGlobalVariableExpression(var: !1386, expr: !DIExpression())
!1386 = distinct !DIGlobalVariable(scope: null, file: !1343, line: 50, type: !354, isLocal: true, isDefinition: true)
!1387 = !DIGlobalVariableExpression(var: !1388, expr: !DIExpression())
!1388 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !1251, file: !1343, line: 37, type: !1389, isLocal: true, isDefinition: true)
!1389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1335, size: 1536, elements: !325)
!1390 = !DIGlobalVariableExpression(var: !1391, expr: !DIExpression())
!1391 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !1251, file: !1392, line: 76, type: !1346, isLocal: true, isDefinition: true)
!1392 = !DIFile(filename: "./lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!1393 = !DIGlobalVariableExpression(var: !1394, expr: !DIExpression())
!1394 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 23, type: !319, isLocal: true, isDefinition: true)
!1395 = !DIGlobalVariableExpression(var: !1396, expr: !DIExpression())
!1396 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 23, type: !300, isLocal: true, isDefinition: true)
!1397 = !DIGlobalVariableExpression(var: !1398, expr: !DIExpression())
!1398 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 24, type: !329, isLocal: true, isDefinition: true)
!1399 = !DIGlobalVariableExpression(var: !1400, expr: !DIExpression())
!1400 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 24, type: !300, isLocal: true, isDefinition: true)
!1401 = !DIGlobalVariableExpression(var: !1402, expr: !DIExpression())
!1402 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 25, type: !162, isLocal: true, isDefinition: true)
!1403 = !DIGlobalVariableExpression(var: !1404, expr: !DIExpression())
!1404 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 25, type: !300, isLocal: true, isDefinition: true)
!1405 = !DIGlobalVariableExpression(var: !1406, expr: !DIExpression())
!1406 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 26, type: !329, isLocal: true, isDefinition: true)
!1407 = !DIGlobalVariableExpression(var: !1408, expr: !DIExpression())
!1408 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 26, type: !300, isLocal: true, isDefinition: true)
!1409 = !DIGlobalVariableExpression(var: !1410, expr: !DIExpression())
!1410 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 27, type: !300, isLocal: true, isDefinition: true)
!1411 = !DIGlobalVariableExpression(var: !1412, expr: !DIExpression())
!1412 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 28, type: !329, isLocal: true, isDefinition: true)
!1413 = !DIGlobalVariableExpression(var: !1414, expr: !DIExpression())
!1414 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 28, type: !300, isLocal: true, isDefinition: true)
!1415 = !DIGlobalVariableExpression(var: !1416, expr: !DIExpression())
!1416 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 29, type: !329, isLocal: true, isDefinition: true)
!1417 = !DIGlobalVariableExpression(var: !1418, expr: !DIExpression())
!1418 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 29, type: !300, isLocal: true, isDefinition: true)
!1419 = !DIGlobalVariableExpression(var: !1420, expr: !DIExpression())
!1420 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 30, type: !329, isLocal: true, isDefinition: true)
!1421 = !DIGlobalVariableExpression(var: !1422, expr: !DIExpression())
!1422 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 30, type: !300, isLocal: true, isDefinition: true)
!1423 = !DIGlobalVariableExpression(var: !1424, expr: !DIExpression())
!1424 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 31, type: !329, isLocal: true, isDefinition: true)
!1425 = !DIGlobalVariableExpression(var: !1426, expr: !DIExpression())
!1426 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 31, type: !300, isLocal: true, isDefinition: true)
!1427 = !DIGlobalVariableExpression(var: !1428, expr: !DIExpression())
!1428 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 32, type: !300, isLocal: true, isDefinition: true)
!1429 = !DIGlobalVariableExpression(var: !1430, expr: !DIExpression())
!1430 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 33, type: !162, isLocal: true, isDefinition: true)
!1431 = !DIGlobalVariableExpression(var: !1432, expr: !DIExpression())
!1432 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 33, type: !300, isLocal: true, isDefinition: true)
!1433 = !DIGlobalVariableExpression(var: !1434, expr: !DIExpression())
!1434 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 34, type: !162, isLocal: true, isDefinition: true)
!1435 = !DIGlobalVariableExpression(var: !1436, expr: !DIExpression())
!1436 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 34, type: !300, isLocal: true, isDefinition: true)
!1437 = !DIGlobalVariableExpression(var: !1438, expr: !DIExpression())
!1438 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 35, type: !329, isLocal: true, isDefinition: true)
!1439 = !DIGlobalVariableExpression(var: !1440, expr: !DIExpression())
!1440 = distinct !DIGlobalVariable(scope: null, file: !1392, line: 35, type: !300, isLocal: true, isDefinition: true)
!1441 = !DIGlobalVariableExpression(var: !1442, expr: !DIExpression())
!1442 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !1251, file: !1392, line: 21, type: !1443, isLocal: true, isDefinition: true)
!1443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1335, size: 1664, elements: !330)
!1444 = !DIGlobalVariableExpression(var: !1445, expr: !DIExpression())
!1445 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 1802, type: !361, isLocal: true, isDefinition: true)
!1446 = !DIGlobalVariableExpression(var: !1447, expr: !DIExpression())
