; ModuleID = 'src/echo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [12 x i8] c"status == 0\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [11 x i8] c"src/echo.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.usage = private unnamed_addr constant [16 x i8] c"void usage(int)\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [63 x i8] c"Usage: %s [SHORT-OPTION]... [STRING]...\0A  or:  %s LONG-OPTION\0A\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [41 x i8] c"Echo the STRING(s) to standard output.\0A\0A\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [5 x i8] c"echo\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [45 x i8] c"  -n     do not output the trailing newline\0A\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [53 x i8] c"  -e     enable interpretation of backslash escapes\0A\00", align 1, !dbg !38

!214 = distinct !DIGlobalVariable(scope: null, file: !122, line: 676, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 15)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !122, line: 676, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 61)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !122, line: 679, type: !85, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !122, line: 683, type: !30, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !122, line: 688, type: !30, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !122, line: 691, type: !192, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !122, line: 839, type: !82, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !122, line: 840, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 22)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !122, line: 841, type: !215, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !122, line: 862, type: !163, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !122, line: 868, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 71)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !122, line: 875, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 27)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !122, line: 877, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 51)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !122, line: 877, type: !3, isLocal: true, isDefinition: true)
!259 = !{!260, !261, !262, !265, !267, !268, !269, !273, !274, !275, !276, !278, !331, !332, !333, !335, !336}
!260 = !DILocalVariable(name: "program", arg: 1, scope: !121, file: !122, line: 573, type: !125)
!261 = !DILocalVariable(name: "option", arg: 2, scope: !121, file: !122, line: 573, type: !125)
!262 = !DILocalVariable(name: "term", scope: !263, file: !122, line: 585, type: !125)
!263 = distinct !DILexicalBlock(scope: !264, file: !122, line: 582, column: 5)
!264 = distinct !DILexicalBlock(scope: !121, file: !122, line: 581, column: 7)
!265 = !DILocalVariable(name: "double_space", scope: !121, file: !122, line: 594, type: !266)
!266 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!267 = !DILocalVariable(name: "first_word", scope: !121, file: !122, line: 595, type: !125)
!268 = !DILocalVariable(name: "option_text", scope: !121, file: !122, line: 596, type: !125)
!269 = !DILocalVariable(name: "s", scope: !270, file: !122, line: 608, type: !125)
!270 = distinct !DILexicalBlock(scope: !271, file: !122, line: 605, column: 5)
!271 = distinct !DILexicalBlock(scope: !272, file: !122, line: 604, column: 12)
!272 = distinct !DILexicalBlock(scope: !121, file: !122, line: 597, column: 7)
!273 = !DILocalVariable(name: "spaces", scope: !270, file: !122, line: 609, type: !152)
!274 = !DILocalVariable(name: "anchor_len", scope: !121, file: !122, line: 620, type: !152)
!275 = !DILocalVariable(name: "desc_text", scope: !121, file: !122, line: 625, type: !125)
!276 = !DILocalVariable(name: "__ptr", scope: !277, file: !122, line: 644, type: !125)
!277 = distinct !DILexicalBlock(scope: !121, file: !122, line: 644, column: 3)
!278 = !DILocalVariable(name: "__stream", scope: !277, file: !122, line: 644, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !281, line: 7, baseType: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !283, line: 49, size: 1728, elements: !284)
!283 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !300, !302, !303, !304, !308, !309, !311, !312, !315, !317, !320, !323, !324, !325, !326, !327}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !282, file: !283, line: 51, baseType: !150, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !282, file: !283, line: 54, baseType: !148, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !282, file: !283, line: 55, baseType: !148, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !282, file: !283, line: 56, baseType: !148, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !282, file: !283, line: 57, baseType: !148, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !282, file: !283, line: 58, baseType: !148, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !282, file: !283, line: 59, baseType: !148, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !282, file: !283, line: 60, baseType: !148, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !282, file: !283, line: 61, baseType: !148, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !282, file: !283, line: 64, baseType: !148, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !282, file: !283, line: 65, baseType: !148, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !282, file: !283, line: 66, baseType: !148, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !282, file: !283, line: 68, baseType: !298, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !283, line: 36, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !282, file: !283, line: 70, baseType: !301, size: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !282, file: !283, line: 72, baseType: !150, size: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !282, file: !283, line: 73, baseType: !150, size: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !282, file: !283, line: 74, baseType: !305, size: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !306, line: 152, baseType: !307)
!306 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!307 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !282, file: !283, line: 77, baseType: !151, size: 16, offset: 1024)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !282, file: !283, line: 78, baseType: !310, size: 8, offset: 1040)
!310 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !282, file: !283, line: 79, baseType: !90, size: 8, offset: 1048)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !282, file: !283, line: 81, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !283, line: 43, baseType: null)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !282, file: !283, line: 89, baseType: !316, size: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !306, line: 153, baseType: !307)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !282, file: !283, line: 91, baseType: !318, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !283, line: 37, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !282, file: !283, line: 92, baseType: !321, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !283, line: 38, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !282, file: !283, line: 93, baseType: !301, size: 64, offset: 1344)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !282, file: !283, line: 94, baseType: !149, size: 64, offset: 1408)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !282, file: !283, line: 95, baseType: !152, size: 64, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !282, file: !283, line: 96, baseType: !150, size: 32, offset: 1536)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !282, file: !283, line: 98, baseType: !328, size: 160, offset: 1568)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 20)
!331 = !DILocalVariable(name: "__cnt", scope: !277, file: !122, line: 644, type: !152)
!332 = !DILocalVariable(name: "url_program", scope: !121, file: !122, line: 648, type: !125)
!333 = !DILocalVariable(name: "__ptr", scope: !334, file: !122, line: 686, type: !125)
!334 = distinct !DILexicalBlock(scope: !121, file: !122, line: 686, column: 3)
!335 = !DILocalVariable(name: "__stream", scope: !334, file: !122, line: 686, type: !279)
!336 = !DILocalVariable(name: "__cnt", scope: !334, file: !122, line: 686, type: !152)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !339, line: 3, type: !215, isLocal: true, isDefinition: true)
!339 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "Version", scope: !342, file: !339, line: 3, type: !125, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C11, file: !339, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !343, splitDebugInlining: false, nameTableKind: None)
!343 = !{!337, !340}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "file_name", scope: !346, file: !347, line: 45, type: !125, isLocal: true, isDefinition: true)
!346 = distinct !DICompileUnit(language: DW_LANG_C11, file: !347, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !348, splitDebugInlining: false, nameTableKind: None)
!347 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!348 = !{!349, !351, !353, !355, !344, !357}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !347, line: 121, type: !105, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !347, line: 121, type: !3, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !347, line: 123, type: !105, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !347, line: 126, type: !85, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !346, file: !347, line: 55, type: !266, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !361, file: !362, line: 66, type: !408, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C11, file: !362, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, globals: !364, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!363 = !{!149, !155}
!364 = !{!365, !367, !387, !389, !391, !393, !359, !395, !397, !399, !401, !406}
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !362, line: 272, type: !30, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "old_file_name", scope: !369, file: !362, line: 304, type: !125, isLocal: true, isDefinition: true)
!369 = distinct !DISubprogram(name: "verror_at_line", scope: !362, file: !362, line: 298, type: !370, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !380)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !150, !150, !125, !129, !125, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !374)
!374 = !{!375, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !373, file: !376, baseType: !129, size: 32)
!376 = !DIFile(filename: "lib/error.c", directory: "/src")
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !373, file: !376, baseType: !129, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !373, file: !376, baseType: !149, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !373, file: !376, baseType: !149, size: 64, offset: 128)
!380 = !{!381, !382, !383, !384, !385, !386}
!381 = !DILocalVariable(name: "status", arg: 1, scope: !369, file: !362, line: 298, type: !150)
!382 = !DILocalVariable(name: "errnum", arg: 2, scope: !369, file: !362, line: 298, type: !150)
!383 = !DILocalVariable(name: "file_name", arg: 3, scope: !369, file: !362, line: 298, type: !125)
!384 = !DILocalVariable(name: "line_number", arg: 4, scope: !369, file: !362, line: 298, type: !129)
!385 = !DILocalVariable(name: "message", arg: 5, scope: !369, file: !362, line: 298, type: !125)
!386 = !DILocalVariable(name: "args", arg: 6, scope: !369, file: !362, line: 298, type: !372)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "old_line_number", scope: !369, file: !362, line: 305, type: !129, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !362, line: 338, type: !163, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !362, line: 346, type: !192, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !362, line: 346, type: !173, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "error_message_count", scope: !361, file: !362, line: 69, type: !129, isLocal: false, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !361, file: !362, line: 295, type: !150, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !362, line: 208, type: !105, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !362, line: 208, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 21)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !362, line: 214, type: !30, isLocal: true, isDefinition: true)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "program_name", scope: !413, file: !414, line: 31, type: !125, isLocal: false, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C11, file: !414, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !415, globals: !416, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!415 = !{!148}
!416 = !{!411, !417, !419}
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !414, line: 46, type: !192, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !414, line: 49, type: !163, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "utf07FF", scope: !423, file: !424, line: 46, type: !451, isLocal: true, isDefinition: true)
!423 = distinct !DISubprogram(name: "proper_name_lite", scope: !424, file: !424, line: 38, type: !425, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !427, retainedNodes: !429)
!424 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!425 = !DISubroutineType(types: !426)
!426 = !{!125, !125, !125}
!427 = distinct !DICompileUnit(language: DW_LANG_C11, file: !424, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !428, splitDebugInlining: false, nameTableKind: None)
!428 = !{!421}
!429 = !{!430, !431, !432, !433, !438}
!430 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !423, file: !424, line: 38, type: !125)
!431 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !423, file: !424, line: 38, type: !125)
!432 = !DILocalVariable(name: "translation", scope: !423, file: !424, line: 40, type: !125)
!433 = !DILocalVariable(name: "w", scope: !423, file: !424, line: 47, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !435, line: 37, baseType: !436)
!435 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !306, line: 57, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !306, line: 42, baseType: !129)
!438 = !DILocalVariable(name: "mbs", scope: !423, file: !424, line: 48, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !440, line: 6, baseType: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !442, line: 21, baseType: !443)
!442 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 13, size: 64, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !443, file: !442, line: 15, baseType: !150, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !443, file: !442, line: 20, baseType: !447, size: 32, offset: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !442, line: 16, size: 32, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !447, file: !442, line: 18, baseType: !129, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !447, file: !442, line: 19, baseType: !163, size: 32)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16, elements: !174)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !454, line: 78, type: !192, isLocal: true, isDefinition: true)
!454 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !454, line: 79, type: !168, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !454, line: 80, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 13)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !454, line: 81, type: !459, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !454, line: 82, type: !328, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !454, line: 83, type: !173, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !454, line: 84, type: !192, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !454, line: 85, type: !105, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !454, line: 86, type: !105, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !454, line: 87, type: !192, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !478, file: !454, line: 76, type: !564, isLocal: false, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C11, file: !454, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !479, retainedTypes: !499, globals: !500, splitDebugInlining: false, nameTableKind: None)
!479 = !{!480, !494, !132}
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !481, line: 42, baseType: !129, size: 32, elements: !482)
!481 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!483 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!484 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!485 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!486 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!487 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!488 = !DIEnumerator(name: "c_quoting_style", value: 5)
!489 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!490 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!491 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!492 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!493 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !481, line: 254, baseType: !129, size: 32, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!497 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!498 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!499 = !{!150, !151, !152}
!500 = !{!452, !455, !457, !462, !464, !466, !468, !470, !472, !474, !476, !501, !505, !515, !517, !522, !524, !526, !528, !530, !553, !560, !562}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !478, file: !454, line: 92, type: !503, isLocal: false, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !96)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !478, file: !454, line: 1040, type: !507, isLocal: false, isDefinition: true)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !454, line: 56, size: 448, elements: !508)
!508 = !{!509, !510, !511, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !507, file: !454, line: 59, baseType: !480, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !507, file: !454, line: 62, baseType: !150, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !507, file: !454, line: 66, baseType: !512, size: 256, offset: 64)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 256, elements: !193)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !507, file: !454, line: 69, baseType: !125, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !507, file: !454, line: 72, baseType: !125, size: 64, offset: 384)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !478, file: !454, line: 107, type: !507, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "slot0", scope: !478, file: !454, line: 831, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 256)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !454, line: 321, type: !173, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !454, line: 357, type: !173, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !454, line: 358, type: !173, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !454, line: 199, type: !105, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "quote", scope: !532, file: !454, line: 228, type: !551, isLocal: true, isDefinition: true)
!532 = distinct !DISubprogram(name: "gettext_quote", scope: !454, file: !454, line: 197, type: !533, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !478, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!125, !125, !480}
!535 = !{!536, !537, !538, !539, !540}
!536 = !DILocalVariable(name: "msgid", arg: 1, scope: !532, file: !454, line: 197, type: !125)
!537 = !DILocalVariable(name: "s", arg: 2, scope: !532, file: !454, line: 197, type: !480)
!538 = !DILocalVariable(name: "translation", scope: !532, file: !454, line: 199, type: !125)
!539 = !DILocalVariable(name: "w", scope: !532, file: !454, line: 229, type: !434)
!540 = !DILocalVariable(name: "mbs", scope: !532, file: !454, line: 230, type: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !440, line: 6, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !442, line: 21, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 13, size: 64, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !543, file: !442, line: 15, baseType: !150, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !543, file: !442, line: 20, baseType: !547, size: 32, offset: 32)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !543, file: !442, line: 16, size: 32, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !547, file: !442, line: 18, baseType: !129, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !547, file: !442, line: 19, baseType: !163, size: 32)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !552)
!552 = !{!175, !165}
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "slotvec", scope: !478, file: !454, line: 834, type: !555, isLocal: true, isDefinition: true)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !454, line: 823, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !454, line: 825, baseType: !152, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !556, file: !454, line: 826, baseType: !148, size: 64, offset: 64)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "nslots", scope: !478, file: !454, line: 832, type: !150, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "slotvec0", scope: !478, file: !454, line: 833, type: !556, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 704, elements: !10)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !568, line: 67, type: !3, isLocal: true, isDefinition: true)
!568 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !568, line: 69, type: !105, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !568, line: 83, type: !105, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !568, line: 83, type: !163, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !568, line: 85, type: !173, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !568, line: 88, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 171)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !568, line: 88, type: !584, isLocal: true, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 34)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !568, line: 105, type: !82, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !568, line: 109, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 23)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !568, line: 113, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 28)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !568, line: 120, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 32)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !568, line: 127, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 36)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !568, line: 134, type: !210, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !568, line: 142, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 44)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !568, line: 150, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 48)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !568, line: 159, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 52)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !568, line: 170, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 60)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !568, line: 248, type: !328, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !568, line: 248, type: !235, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !568, line: 254, type: !328, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !568, line: 254, type: !112, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !568, line: 254, type: !210, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !568, line: 259, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 39)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !568, line: 259, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 29)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !653, file: !654, line: 26, type: !656, isLocal: false, isDefinition: true)
!653 = distinct !DICompileUnit(language: DW_LANG_C11, file: !654, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !655, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!655 = !{!651}
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 376, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 47)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "exit_failure", scope: !661, file: !662, line: 24, type: !664, isLocal: false, isDefinition: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C11, file: !662, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !663, splitDebugInlining: false, nameTableKind: None)
!662 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!663 = !{!659}
!664 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !667, line: 34, type: !85, isLocal: true, isDefinition: true)
!667 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !667, line: 34, type: !105, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !667, line: 34, type: !205, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !674, line: 108, type: !90, isLocal: true, isDefinition: true)
!674 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "internal_state", scope: !677, file: !674, line: 97, type: !680, isLocal: true, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C11, file: !674, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !678, globals: !679, splitDebugInlining: false, nameTableKind: None)
!678 = !{!149, !152, !155}
!679 = !{!672, !675}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !440, line: 6, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !442, line: 21, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 13, size: 64, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !682, file: !442, line: 15, baseType: !150, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !682, file: !442, line: 20, baseType: !686, size: 32, offset: 32)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !682, file: !442, line: 16, size: 32, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !686, file: !442, line: 18, baseType: !129, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !686, file: !442, line: 19, baseType: !163, size: 32)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !692, line: 35, type: !168, isLocal: true, isDefinition: true)
!692 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !694, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!695 = distinct !DICompileUnit(language: DW_LANG_C11, file: !568, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !696, retainedTypes: !700, globals: !701, splitDebugInlining: false, nameTableKind: None)
!696 = !{!697}
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 40, baseType: !129, size: 32, elements: !698)
!698 = !{!699}
!699 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!700 = !{!149}
!701 = !{!566, !569, !571, !573, !575, !577, !582, !587, !589, !594, !599, !604, !609, !611, !616, !621, !626, !631, !633, !635, !637, !639, !641, !646}
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !703, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !704, retainedTypes: !735, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!704 = !{!705, !717}
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !706, file: !703, line: 188, baseType: !129, size: 32, elements: !715)
!706 = distinct !DISubprogram(name: "x2nrealloc", scope: !703, file: !703, line: 176, type: !707, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !702, retainedNodes: !710)
!707 = !DISubroutineType(types: !708)
!708 = !{!149, !149, !709, !152}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!710 = !{!711, !712, !713, !714}
!711 = !DILocalVariable(name: "p", arg: 1, scope: !706, file: !703, line: 176, type: !149)
!712 = !DILocalVariable(name: "pn", arg: 2, scope: !706, file: !703, line: 176, type: !709)
!713 = !DILocalVariable(name: "s", arg: 3, scope: !706, file: !703, line: 176, type: !152)
!714 = !DILocalVariable(name: "n", scope: !706, file: !703, line: 178, type: !152)
!715 = !{!716}
!716 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !718, file: !703, line: 228, baseType: !129, size: 32, elements: !715)
!718 = distinct !DISubprogram(name: "xpalloc", scope: !703, file: !703, line: 223, type: !719, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !702, retainedNodes: !725)
!719 = !DISubroutineType(types: !720)
!720 = !{!149, !149, !721, !722, !724, !722}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !723, line: 130, baseType: !724)
!723 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !153, line: 35, baseType: !307)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734}
!726 = !DILocalVariable(name: "pa", arg: 1, scope: !718, file: !703, line: 223, type: !149)
!727 = !DILocalVariable(name: "pn", arg: 2, scope: !718, file: !703, line: 223, type: !721)
!728 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !718, file: !703, line: 223, type: !722)
!729 = !DILocalVariable(name: "n_max", arg: 4, scope: !718, file: !703, line: 223, type: !724)
!730 = !DILocalVariable(name: "s", arg: 5, scope: !718, file: !703, line: 223, type: !722)
!731 = !DILocalVariable(name: "n0", scope: !718, file: !703, line: 230, type: !722)
!732 = !DILocalVariable(name: "n", scope: !718, file: !703, line: 237, type: !722)
!733 = !DILocalVariable(name: "nbytes", scope: !718, file: !703, line: 248, type: !722)
!734 = !DILocalVariable(name: "adjusted_nbytes", scope: !718, file: !703, line: 252, type: !722)
!735 = !{!148, !149, !266, !307, !154}
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !667, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !737, splitDebugInlining: false, nameTableKind: None)
!737 = !{!665, !668, !670}
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !739, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !741, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!742 = distinct !DICompileUnit(language: DW_LANG_C11, file: !743, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !700, splitDebugInlining: false, nameTableKind: None)
!743 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!744 = distinct !DICompileUnit(language: DW_LANG_C11, file: !745, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !700, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!746 = distinct !DICompileUnit(language: DW_LANG_C11, file: !747, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!747 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!748 = !{!266, !154, !149}
!749 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !750, splitDebugInlining: false, nameTableKind: None)
!750 = !{!751, !690}
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !692, line: 35, type: !173, isLocal: true, isDefinition: true)
!753 = distinct !DICompileUnit(language: DW_LANG_C11, file: !754, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !700, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!757 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!758 = !{i32 7, !"Dwarf Version", i32 5}
!759 = !{i32 2, !"Debug Info Version", i32 3}
!760 = !{i32 1, !"wchar_size", i32 4}
!761 = !{i32 8, !"PIC Level", i32 2}
!762 = !{i32 7, !"PIE Level", i32 2}
!763 = !{i32 7, !"uwtable", i32 2}
!764 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !765, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !150}
!767 = !{!768}
!768 = !DILocalVariable(name: "status", arg: 1, scope: !764, file: !2, line: 37, type: !150)
!769 = !DILocation(line: 0, scope: !764)
!770 = !DILocation(line: 41, column: 3, scope: !771)
!771 = distinct !DILexicalBlock(scope: !772, file: !2, line: 41, column: 3)
!772 = distinct !DILexicalBlock(scope: !764, file: !2, line: 41, column: 3)
!773 = !DILocation(line: 41, column: 3, scope: !772)
!774 = !DILocation(line: 43, column: 3, scope: !764)
!775 = !{!776, !776, i64 0}
!776 = !{!"any pointer", !777, i64 0}
!777 = !{!"omnipotent char", !778, i64 0}
!778 = !{!"Simple C/C++ TBAA"}
!779 = !DILocation(line: 47, column: 3, scope: !764)
!780 = !DILocation(line: 51, column: 3, scope: !764)
!781 = !DILocation(line: 54, column: 3, scope: !764)
!782 = !DILocation(line: 61, column: 3, scope: !764)
!783 = !DILocation(line: 68, column: 3, scope: !764)
!784 = !DILocation(line: 69, column: 3, scope: !764)
!785 = !DILocation(line: 70, column: 3, scope: !764)
!786 = !DILocation(line: 75, column: 3, scope: !764)
!787 = !DILocation(line: 87, column: 3, scope: !764)
!788 = !DILocation(line: 91, column: 3, scope: !764)
!789 = !DILocation(line: 92, column: 3, scope: !764)
!790 = !DILocation(line: 96, column: 3, scope: !764)
!791 = !DILocation(line: 97, column: 3, scope: !764)
!792 = !DISubprogram(name: "__assert_fail", scope: !793, file: !793, line: 69, type: !794, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !796)
!793 = !DIFile(filename: "/usr/include/assert.h", directory: "", checksumkind: CSK_MD5, checksum: "ab7dc6991d501750085448b20099a5a0")
!794 = !DISubroutineType(types: !795)
!795 = !{null, !125, !125, !129, !125}
!796 = !{}
!797 = !DISubprogram(name: "dcgettext", scope: !798, file: !798, line: 51, type: !799, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!798 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!799 = !DISubroutineType(types: !800)
!800 = !{!148, !125, !125, !150}
!801 = !DISubprogram(name: "__printf_chk", scope: !802, file: !802, line: 95, type: !803, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!802 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!803 = !DISubroutineType(types: !804)
!804 = !{!150, !150, !805, null}
!805 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !125)
!806 = !DISubprogram(name: "fputs_unlocked", scope: !807, file: !807, line: 691, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!807 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!808 = !DISubroutineType(types: !809)
!809 = !{!150, !805, !810}
!810 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !279)
!811 = !DILocation(line: 0, scope: !121)
!812 = !DILocation(line: 581, column: 7, scope: !264)
!813 = !{!814, !814, i64 0}
!814 = !{!"int", !777, i64 0}
!815 = !DILocation(line: 581, column: 19, scope: !264)
!816 = !DILocation(line: 581, column: 7, scope: !121)
!817 = !DILocation(line: 585, column: 26, scope: !263)
!818 = !DILocation(line: 0, scope: !263)
!819 = !DILocation(line: 586, column: 23, scope: !263)
!820 = !DILocation(line: 586, column: 28, scope: !263)
!821 = !DILocation(line: 586, column: 32, scope: !263)
!822 = !{!777, !777, i64 0}
!823 = !DILocation(line: 586, column: 38, scope: !263)
!824 = !DILocalVariable(name: "__s1", arg: 1, scope: !825, file: !826, line: 1359, type: !125)
!825 = distinct !DISubprogram(name: "streq", scope: !826, file: !826, line: 1359, type: !827, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !829)
!826 = !DIFile(filename: "./lib/string.h", directory: "/src")
!827 = !DISubroutineType(types: !828)
!828 = !{!266, !125, !125}
!829 = !{!824, !830}
!830 = !DILocalVariable(name: "__s2", arg: 2, scope: !825, file: !826, line: 1359, type: !125)
!831 = !DILocation(line: 0, scope: !825, inlinedAt: !832)
!832 = distinct !DILocation(line: 586, column: 41, scope: !263)
!833 = !DILocation(line: 1361, column: 11, scope: !825, inlinedAt: !832)
!834 = !DILocation(line: 1361, column: 10, scope: !825, inlinedAt: !832)
!835 = !DILocation(line: 586, column: 19, scope: !263)
!836 = !DILocation(line: 587, column: 5, scope: !263)
!837 = !DILocation(line: 588, column: 7, scope: !838)
!838 = distinct !DILexicalBlock(scope: !121, file: !122, line: 588, column: 7)
!839 = !DILocation(line: 588, column: 7, scope: !121)
!840 = !DILocation(line: 590, column: 7, scope: !841)
!841 = distinct !DILexicalBlock(scope: !838, file: !122, line: 589, column: 5)
!842 = !DILocation(line: 591, column: 7, scope: !841)
!843 = !DILocation(line: 595, column: 37, scope: !121)
!844 = !DILocation(line: 595, column: 35, scope: !121)
!845 = !DILocation(line: 596, column: 29, scope: !121)
!846 = !DILocation(line: 597, column: 8, scope: !272)
!847 = !DILocation(line: 597, column: 7, scope: !121)
!848 = !DILocation(line: 604, column: 24, scope: !271)
!849 = !DILocation(line: 604, column: 12, scope: !272)
!850 = !DILocation(line: 0, scope: !270)
!851 = !DILocation(line: 610, column: 16, scope: !270)
!852 = !DILocation(line: 610, column: 7, scope: !270)
!853 = !DILocation(line: 611, column: 21, scope: !270)
!854 = !{!855, !855, i64 0}
!855 = !{!"short", !777, i64 0}
!856 = !DILocation(line: 611, column: 19, scope: !270)
!857 = !DILocation(line: 611, column: 16, scope: !270)
!858 = !DILocation(line: 610, column: 30, scope: !270)
!859 = distinct !{!859, !852, !853, !860}
!860 = !{!"llvm.loop.mustprogress"}
!861 = !DILocation(line: 612, column: 18, scope: !862)
!862 = distinct !DILexicalBlock(scope: !270, file: !122, line: 612, column: 11)
!863 = !DILocation(line: 612, column: 11, scope: !270)
!864 = !DILocation(line: 618, column: 5, scope: !270)
!865 = !DILocation(line: 620, column: 23, scope: !121)
!866 = !DILocation(line: 625, column: 39, scope: !121)
!867 = !DILocation(line: 626, column: 3, scope: !121)
!868 = !DILocation(line: 626, column: 10, scope: !121)
!869 = !DILocation(line: 626, column: 21, scope: !121)
!870 = !DILocation(line: 628, column: 44, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !122, line: 628, column: 11)
!872 = distinct !DILexicalBlock(scope: !121, file: !122, line: 627, column: 5)
!873 = !DILocation(line: 628, column: 32, scope: !871)
!874 = !DILocation(line: 628, column: 49, scope: !871)
!875 = !DILocation(line: 628, column: 11, scope: !872)
!876 = !DILocation(line: 630, column: 11, scope: !877)
!877 = distinct !DILexicalBlock(scope: !872, file: !122, line: 630, column: 11)
!878 = !DILocation(line: 630, column: 11, scope: !872)
!879 = !DILocation(line: 632, column: 26, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !122, line: 632, column: 15)
!881 = distinct !DILexicalBlock(scope: !877, file: !122, line: 631, column: 9)
!882 = !DILocation(line: 632, column: 34, scope: !880)
!883 = !DILocation(line: 632, column: 37, scope: !880)
!884 = !DILocation(line: 632, column: 15, scope: !881)
!885 = !DILocation(line: 636, column: 16, scope: !886)
!886 = distinct !DILexicalBlock(scope: !881, file: !122, line: 636, column: 15)
!887 = !DILocation(line: 636, column: 29, scope: !886)
!888 = !DILocation(line: 640, column: 16, scope: !872)
!889 = distinct !{!889, !867, !890, !860}
!890 = !DILocation(line: 641, column: 5, scope: !121)
!891 = !DILocation(line: 644, column: 3, scope: !121)
!892 = !DILocation(line: 0, scope: !825, inlinedAt: !893)
!893 = distinct !DILocation(line: 648, column: 31, scope: !121)
!894 = !DILocation(line: 0, scope: !825, inlinedAt: !895)
!895 = distinct !DILocation(line: 649, column: 31, scope: !121)
!896 = !DILocation(line: 0, scope: !825, inlinedAt: !897)
!897 = distinct !DILocation(line: 650, column: 31, scope: !121)
!898 = !DILocation(line: 0, scope: !825, inlinedAt: !899)
!899 = distinct !DILocation(line: 651, column: 31, scope: !121)
!900 = !DILocation(line: 0, scope: !825, inlinedAt: !901)
!901 = distinct !DILocation(line: 652, column: 31, scope: !121)
!902 = !DILocation(line: 0, scope: !825, inlinedAt: !903)
!903 = distinct !DILocation(line: 653, column: 31, scope: !121)
!904 = !DILocation(line: 0, scope: !825, inlinedAt: !905)
!905 = distinct !DILocation(line: 654, column: 31, scope: !121)
!906 = !DILocation(line: 0, scope: !825, inlinedAt: !907)
!907 = distinct !DILocation(line: 655, column: 31, scope: !121)
!908 = !DILocation(line: 0, scope: !825, inlinedAt: !909)
!909 = distinct !DILocation(line: 656, column: 31, scope: !121)
!910 = !DILocation(line: 0, scope: !825, inlinedAt: !911)
!911 = distinct !DILocation(line: 657, column: 31, scope: !121)
!912 = !DILocation(line: 663, column: 7, scope: !913)
!913 = distinct !DILexicalBlock(scope: !121, file: !122, line: 663, column: 7)
!914 = !DILocation(line: 664, column: 7, scope: !913)
!915 = !DILocation(line: 664, column: 10, scope: !913)
!916 = !DILocation(line: 663, column: 7, scope: !121)
!917 = !DILocation(line: 669, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !913, file: !122, line: 665, column: 5)
!919 = !DILocation(line: 671, column: 5, scope: !918)
!920 = !DILocation(line: 676, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !913, file: !122, line: 673, column: 5)
!922 = !DILocation(line: 679, column: 3, scope: !121)
!923 = !DILocation(line: 683, column: 3, scope: !121)
!924 = !DILocation(line: 686, column: 3, scope: !121)
!925 = !DILocation(line: 688, column: 3, scope: !121)
!926 = !DILocation(line: 691, column: 3, scope: !121)
!927 = !DILocation(line: 695, column: 3, scope: !121)
!928 = !DILocation(line: 696, column: 1, scope: !121)
!929 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !122, file: !122, line: 836, type: !930, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !932)
!930 = !DISubroutineType(cc: DW_CC_nocall, types: !931)
!931 = !{null, !125}
!932 = !{!933, !934, !941, !942, !944, !945}
!933 = !DILocalVariable(name: "program", arg: 1, scope: !929, file: !122, line: 836, type: !125)
!934 = !DILocalVariable(name: "infomap", scope: !929, file: !122, line: 838, type: !935)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 896, elements: !106)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !929, file: !122, line: 838, size: 128, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !937, file: !122, line: 838, baseType: !125, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !937, file: !122, line: 838, baseType: !125, size: 64, offset: 64)
!941 = !DILocalVariable(name: "node", scope: !929, file: !122, line: 848, type: !125)
!942 = !DILocalVariable(name: "map_prog", scope: !929, file: !122, line: 849, type: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!944 = !DILocalVariable(name: "lc_messages", scope: !929, file: !122, line: 861, type: !125)
!945 = !DILocalVariable(name: "url_program", scope: !929, file: !122, line: 874, type: !125)
!946 = !DILocation(line: 0, scope: !929)
!947 = !DILocation(line: 857, column: 3, scope: !929)
!948 = !DILocation(line: 861, column: 29, scope: !929)
!949 = !DILocation(line: 862, column: 7, scope: !950)
!950 = distinct !DILexicalBlock(scope: !929, file: !122, line: 862, column: 7)
!951 = !DILocation(line: 862, column: 19, scope: !950)
!952 = !DILocation(line: 862, column: 22, scope: !950)
!953 = !DILocation(line: 862, column: 7, scope: !929)
!954 = !DILocation(line: 868, column: 7, scope: !955)
!955 = distinct !DILexicalBlock(scope: !950, file: !122, line: 863, column: 5)
!956 = !DILocation(line: 870, column: 5, scope: !955)
!957 = !DILocation(line: 875, column: 3, scope: !929)
!958 = !DILocation(line: 877, column: 3, scope: !929)
!959 = !DILocation(line: 879, column: 1, scope: !929)
!960 = !DISubprogram(name: "exit", scope: !961, file: !961, line: 624, type: !765, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !796)
!961 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!962 = !DISubprogram(name: "setlocale", scope: !963, file: !963, line: 122, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!963 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!964 = !DISubroutineType(types: !965)
!965 = !{!148, !150, !125}
!966 = !DISubprogram(name: "strncmp", scope: !967, file: !967, line: 159, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!967 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!968 = !DISubroutineType(types: !969)
!969 = !{!150, !125, !125, !152}
!970 = !DISubprogram(name: "getenv", scope: !961, file: !961, line: 641, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!971 = !DISubroutineType(types: !972)
!972 = !{!148, !125}
!973 = !DISubprogram(name: "strcmp", scope: !967, file: !967, line: 156, type: !974, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!974 = !DISubroutineType(types: !975)
!975 = !{!150, !125, !125}
!976 = !DISubprogram(name: "strspn", scope: !967, file: !967, line: 297, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!977 = !DISubroutineType(types: !978)
!978 = !{!154, !125, !125}
!979 = !DISubprogram(name: "strchr", scope: !967, file: !967, line: 246, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!980 = !DISubroutineType(types: !981)
!981 = !{!148, !125, !150}
!982 = !DISubprogram(name: "__ctype_b_loc", scope: !133, file: !133, line: 79, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!983 = !DISubroutineType(types: !984)
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!988 = !DISubprogram(name: "strcspn", scope: !967, file: !967, line: 293, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!989 = !DISubprogram(name: "fwrite_unlocked", scope: !807, file: !807, line: 704, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!990 = !DISubroutineType(types: !991)
!991 = !{!152, !992, !152, !152, !810}
!992 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!995 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 121, type: !996, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !999)
!996 = !DISubroutineType(types: !997)
!997 = !{!150, !150, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1009, !1010, !1014, !1015, !1021, !1022}
!1000 = !DILocalVariable(name: "argc", arg: 1, scope: !995, file: !2, line: 121, type: !150)
!1001 = !DILocalVariable(name: "argv", arg: 2, scope: !995, file: !2, line: 121, type: !998)
!1002 = !DILocalVariable(name: "display_return", scope: !995, file: !2, line: 123, type: !266)
!1003 = !DILocalVariable(name: "posixly_correct", scope: !995, file: !2, line: 124, type: !266)
!1004 = !DILocalVariable(name: "allow_options", scope: !995, file: !2, line: 125, type: !266)
!1005 = !DILocalVariable(name: "do_v9", scope: !995, file: !2, line: 132, type: !266)
!1006 = !DILocalVariable(name: "temp", scope: !1007, file: !2, line: 163, type: !125)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 162, column: 7)
!1008 = distinct !DILexicalBlock(scope: !995, file: !2, line: 160, column: 7)
!1009 = !DILocalVariable(name: "i", scope: !1007, file: !2, line: 164, type: !152)
!1010 = !DILocalVariable(name: "s", scope: !1011, file: !2, line: 210, type: !125)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 209, column: 9)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 207, column: 5)
!1013 = distinct !DILexicalBlock(scope: !995, file: !2, line: 206, column: 7)
!1014 = !DILocalVariable(name: "c", scope: !1011, file: !2, line: 211, type: !155)
!1015 = !DILocalVariable(name: "ch", scope: !1016, file: !2, line: 230, type: !155)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 229, column: 23)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 218, column: 21)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 216, column: 17)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !2, line: 215, column: 19)
!1020 = distinct !DILexicalBlock(scope: !1011, file: !2, line: 214, column: 13)
!1021 = !DILabel(scope: !995, name: "just_echo", file: !2, line: 204)
!1022 = !DILabel(scope: !1017, name: "not_an_escape", file: !2, line: 259)
!1023 = !DILocation(line: 0, scope: !995)
!1024 = !DILocation(line: 124, column: 28, scope: !995)
!1025 = !DILocation(line: 124, column: 27, scope: !995)
!1026 = !DILocation(line: 127, column: 6, scope: !995)
!1027 = !DILocation(line: 127, column: 37, scope: !995)
!1028 = !DILocation(line: 127, column: 44, scope: !995)
!1029 = !DILocation(line: 127, column: 54, scope: !995)
!1030 = !DILocation(line: 0, scope: !825, inlinedAt: !1031)
!1031 = distinct !DILocation(line: 127, column: 47, scope: !995)
!1032 = !DILocation(line: 1361, column: 11, scope: !825, inlinedAt: !1031)
!1033 = !DILocation(line: 1361, column: 10, scope: !825, inlinedAt: !1031)
!1034 = !DILocation(line: 135, column: 21, scope: !995)
!1035 = !DILocation(line: 135, column: 3, scope: !995)
!1036 = !DILocation(line: 136, column: 3, scope: !995)
!1037 = !DILocation(line: 137, column: 3, scope: !995)
!1038 = !DILocation(line: 138, column: 3, scope: !995)
!1039 = !DILocation(line: 140, column: 3, scope: !995)
!1040 = !DILocation(line: 144, column: 21, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !995, file: !2, line: 144, column: 7)
!1042 = !DILocation(line: 146, column: 18, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 146, column: 11)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 145, column: 5)
!1045 = !DILocation(line: 0, scope: !825, inlinedAt: !1046)
!1046 = distinct !DILocation(line: 146, column: 11, scope: !1043)
!1047 = !DILocation(line: 1361, column: 11, scope: !825, inlinedAt: !1046)
!1048 = !DILocation(line: 1361, column: 10, scope: !825, inlinedAt: !1046)
!1049 = !DILocation(line: 146, column: 11, scope: !1044)
!1050 = !DILocation(line: 147, column: 9, scope: !1043)
!1051 = !DILocation(line: 0, scope: !825, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 149, column: 11, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 149, column: 11)
!1054 = !DILocation(line: 1361, column: 11, scope: !825, inlinedAt: !1052)
!1055 = !DILocation(line: 1361, column: 10, scope: !825, inlinedAt: !1052)
!1056 = !DILocation(line: 149, column: 11, scope: !1044)
!1057 = !DILocation(line: 151, column: 24, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1053, file: !2, line: 150, column: 9)
!1059 = !DILocation(line: 151, column: 60, scope: !1058)
!1060 = !DILocation(line: 151, column: 69, scope: !1058)
!1061 = !DILocation(line: 151, column: 11, scope: !1058)
!1062 = !DILocation(line: 153, column: 11, scope: !1058)
!1063 = !DILocation(line: 157, column: 3, scope: !995)
!1064 = !DILocation(line: 158, column: 3, scope: !995)
!1065 = !DILocation(line: 160, column: 7, scope: !995)
!1066 = !DILocation(line: 123, column: 8, scope: !995)
!1067 = !DILocation(line: 132, column: 8, scope: !995)
!1068 = !DILocation(line: 200, column: 13, scope: !1007)
!1069 = !DILocation(line: 201, column: 13, scope: !1007)
!1070 = !DILocation(line: 161, column: 17, scope: !1008)
!1071 = !DILocation(line: 161, column: 21, scope: !1008)
!1072 = !DILocation(line: 161, column: 25, scope: !1008)
!1073 = !DILocation(line: 161, column: 24, scope: !1008)
!1074 = !DILocation(line: 161, column: 33, scope: !1008)
!1075 = !DILocation(line: 161, column: 5, scope: !1008)
!1076 = !DILocation(line: 163, column: 36, scope: !1007)
!1077 = !DILocation(line: 0, scope: !1007)
!1078 = !DILocation(line: 170, column: 21, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !2, line: 170, column: 9)
!1080 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 170, column: 9)
!1081 = !DILocation(line: 170, column: 9, scope: !1080)
!1082 = !DILocation(line: 171, column: 19, scope: !1079)
!1083 = !DILocation(line: 171, column: 11, scope: !1079)
!1084 = !DILocation(line: 170, column: 31, scope: !1079)
!1085 = distinct !{!1085, !1081, !1086, !860}
!1086 = !DILocation(line: 177, column: 13, scope: !1080)
!1087 = !DILocation(line: 179, column: 15, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 179, column: 13)
!1089 = !DILocation(line: 179, column: 13, scope: !1007)
!1090 = !DILocation(line: 184, column: 9, scope: !1007)
!1091 = !DILocation(line: 185, column: 24, scope: !1007)
!1092 = !DILocation(line: 185, column: 19, scope: !1007)
!1093 = !DILocation(line: 185, column: 11, scope: !1007)
!1094 = !DILocation(line: 189, column: 15, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 186, column: 13)
!1096 = !DILocation(line: 193, column: 15, scope: !1095)
!1097 = !DILocation(line: 197, column: 15, scope: !1095)
!1098 = !DILocation(line: 184, column: 16, scope: !1007)
!1099 = distinct !{!1099, !1090, !1100, !860}
!1100 = !DILocation(line: 198, column: 13, scope: !1007)
!1101 = !DILocation(line: 204, column: 1, scope: !995)
!1102 = !DILocation(line: 206, column: 7, scope: !1013)
!1103 = !DILocation(line: 206, column: 13, scope: !1013)
!1104 = !DILocation(line: 0, scope: !1013)
!1105 = !DILocation(line: 273, column: 7, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 272, column: 5)
!1107 = !DILocation(line: 275, column: 11, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1106, file: !2, line: 274, column: 9)
!1109 = !DILocation(line: 278, column: 20, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1108, file: !2, line: 278, column: 15)
!1111 = !DILocation(line: 278, column: 15, scope: !1108)
!1112 = !DILocation(line: 208, column: 7, scope: !1012)
!1113 = !DILocation(line: 210, column: 27, scope: !1011)
!1114 = !DILocation(line: 0, scope: !1011)
!1115 = !DILocation(line: 213, column: 11, scope: !1011)
!1116 = !DILocation(line: 213, column: 25, scope: !1011)
!1117 = !DILocation(line: 213, column: 23, scope: !1011)
!1118 = !DILocation(line: 215, column: 32, scope: !1019)
!1119 = !DILocation(line: 215, column: 19, scope: !1020)
!1120 = !DILocation(line: 217, column: 33, scope: !1018)
!1121 = !DILocation(line: 217, column: 19, scope: !1018)
!1122 = !DILocation(line: 219, column: 41, scope: !1017)
!1123 = !DILocation(line: 220, column: 41, scope: !1017)
!1124 = !DILocation(line: 222, column: 43, scope: !1017)
!1125 = !DILocation(line: 223, column: 41, scope: !1017)
!1126 = !DILocation(line: 224, column: 41, scope: !1017)
!1127 = !DILocation(line: 225, column: 41, scope: !1017)
!1128 = !DILocation(line: 226, column: 41, scope: !1017)
!1129 = !DILocation(line: 227, column: 41, scope: !1017)
!1130 = !DILocation(line: 230, column: 44, scope: !1016)
!1131 = !DILocation(line: 0, scope: !1016)
!1132 = !DILocation(line: 231, column: 43, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1016, file: !2, line: 231, column: 29)
!1134 = !DILocalVariable(name: "c", arg: 1, scope: !1135, file: !1136, line: 324, type: !150)
!1135 = distinct !DISubprogram(name: "c_isxdigit", scope: !1136, file: !1136, line: 324, type: !1137, scopeLine: 325, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !1139)
!1136 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!266, !150}
!1139 = !{!1134}
!1140 = !DILocation(line: 0, scope: !1135, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 231, column: 31, scope: !1133)
!1142 = !DILocation(line: 326, column: 3, scope: !1135, inlinedAt: !1141)
!1143 = !DILocation(line: 233, column: 26, scope: !1016)
!1144 = !DILocalVariable(name: "c", arg: 1, scope: !1145, file: !2, line: 102, type: !155)
!1145 = distinct !DISubprogram(name: "hextobin", scope: !2, file: !2, line: 102, type: !1146, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !1148)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!150, !155}
!1148 = !{!1144}
!1149 = !DILocation(line: 0, scope: !1145, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 234, column: 29, scope: !1016)
!1151 = !DILocation(line: 104, column: 3, scope: !1145, inlinedAt: !1150)
!1152 = !DILocation(line: 106, column: 23, scope: !1153, inlinedAt: !1150)
!1153 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 105, column: 5)
!1154 = !DILocation(line: 106, column: 14, scope: !1153, inlinedAt: !1150)
!1155 = !DILocation(line: 108, column: 25, scope: !1153, inlinedAt: !1150)
!1156 = !DILocation(line: 109, column: 25, scope: !1153, inlinedAt: !1150)
!1157 = !DILocation(line: 110, column: 25, scope: !1153, inlinedAt: !1150)
!1158 = !DILocation(line: 111, column: 25, scope: !1153, inlinedAt: !1150)
!1159 = !DILocation(line: 112, column: 25, scope: !1153, inlinedAt: !1150)
!1160 = !DILocation(line: 0, scope: !1153, inlinedAt: !1150)
!1161 = !DILocation(line: 235, column: 30, scope: !1016)
!1162 = !DILocation(line: 236, column: 41, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1016, file: !2, line: 236, column: 29)
!1164 = !DILocation(line: 0, scope: !1135, inlinedAt: !1165)
!1165 = distinct !DILocation(line: 236, column: 29, scope: !1163)
!1166 = !DILocation(line: 326, column: 3, scope: !1135, inlinedAt: !1165)
!1167 = !DILocation(line: 238, column: 30, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1163, file: !2, line: 237, column: 27)
!1169 = !DILocation(line: 239, column: 35, scope: !1168)
!1170 = !DILocation(line: 0, scope: !1145, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 239, column: 42, scope: !1168)
!1172 = !DILocation(line: 104, column: 3, scope: !1145, inlinedAt: !1171)
!1173 = !DILocation(line: 106, column: 23, scope: !1153, inlinedAt: !1171)
!1174 = !DILocation(line: 106, column: 14, scope: !1153, inlinedAt: !1171)
!1175 = !DILocation(line: 108, column: 25, scope: !1153, inlinedAt: !1171)
!1176 = !DILocation(line: 109, column: 25, scope: !1153, inlinedAt: !1171)
!1177 = !DILocation(line: 110, column: 25, scope: !1153, inlinedAt: !1171)
!1178 = !DILocation(line: 111, column: 25, scope: !1153, inlinedAt: !1171)
!1179 = !DILocation(line: 112, column: 25, scope: !1153, inlinedAt: !1171)
!1180 = !DILocation(line: 0, scope: !1153, inlinedAt: !1171)
!1181 = !DILocation(line: 239, column: 40, scope: !1168)
!1182 = !DILocation(line: 240, column: 27, scope: !1168)
!1183 = !DILocation(line: 245, column: 37, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 245, column: 27)
!1185 = !DILocation(line: 245, column: 40, scope: !1184)
!1186 = !DILocation(line: 247, column: 29, scope: !1017)
!1187 = !DILocation(line: 247, column: 23, scope: !1017)
!1188 = !DILocation(line: 0, scope: !1018)
!1189 = !DILocation(line: 251, column: 25, scope: !1017)
!1190 = !DILocation(line: 252, column: 34, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 252, column: 27)
!1192 = !DILocation(line: 252, column: 37, scope: !1191)
!1193 = !DILocation(line: 254, column: 34, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 254, column: 27)
!1195 = !DILocation(line: 254, column: 37, scope: !1194)
!1196 = !DILocation(line: 255, column: 31, scope: !1194)
!1197 = !DILocation(line: 255, column: 40, scope: !1194)
!1198 = !DILocation(line: 255, column: 43, scope: !1194)
!1199 = !DILocation(line: 255, column: 35, scope: !1194)
!1200 = !DILocation(line: 255, column: 25, scope: !1194)
!1201 = !DILocalVariable(name: "__c", arg: 1, scope: !1202, file: !1203, line: 108, type: !150)
!1202 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1203, file: !1203, line: 108, type: !1204, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !1206)
!1203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!150, !150}
!1206 = !{!1201}
!1207 = !DILocation(line: 0, scope: !1202, inlinedAt: !1208)
!1208 = distinct !DILocation(line: 260, column: 31, scope: !1017)
!1209 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1208)
!1210 = !{!1211, !776, i64 40}
!1211 = !{!"_IO_FILE", !814, i64 0, !776, i64 8, !776, i64 16, !776, i64 24, !776, i64 32, !776, i64 40, !776, i64 48, !776, i64 56, !776, i64 64, !776, i64 72, !776, i64 80, !776, i64 88, !776, i64 96, !776, i64 104, !814, i64 112, !814, i64 116, !1212, i64 120, !855, i64 128, !777, i64 130, !777, i64 131, !776, i64 136, !1212, i64 144, !776, i64 152, !776, i64 160, !776, i64 168, !776, i64 176, !1212, i64 184, !814, i64 192, !777, i64 196}
!1212 = !{!"long", !777, i64 0}
!1213 = !{!1211, !776, i64 48}
!1214 = !{!"branch_weights", i32 2000, i32 1}
!1215 = !DILocation(line: 0, scope: !1202, inlinedAt: !1216)
!1216 = distinct !DILocation(line: 263, column: 15, scope: !1020)
!1217 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1216)
!1218 = !DILocation(line: 263, column: 15, scope: !1020)
!1219 = distinct !{!1219, !1115, !1220, !860}
!1220 = !DILocation(line: 264, column: 13, scope: !1011)
!1221 = !DILocation(line: 265, column: 15, scope: !1011)
!1222 = !DILocation(line: 266, column: 15, scope: !1011)
!1223 = !DILocation(line: 267, column: 20, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1011, file: !2, line: 267, column: 15)
!1225 = !DILocation(line: 267, column: 15, scope: !1011)
!1226 = !DILocation(line: 0, scope: !1202, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 268, column: 13, scope: !1224)
!1228 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1227)
!1229 = distinct !{!1229, !1112, !1230, !860}
!1230 = !DILocation(line: 269, column: 9, scope: !1012)
!1231 = !DILocation(line: 276, column: 15, scope: !1108)
!1232 = !DILocation(line: 277, column: 15, scope: !1108)
!1233 = !DILocation(line: 0, scope: !1202, inlinedAt: !1234)
!1234 = distinct !DILocation(line: 279, column: 13, scope: !1110)
!1235 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1234)
!1236 = distinct !{!1236, !1105, !1237, !860}
!1237 = !DILocation(line: 280, column: 9, scope: !1106)
!1238 = !DILocation(line: 283, column: 7, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !995, file: !2, line: 283, column: 7)
!1240 = !DILocation(line: 283, column: 7, scope: !995)
!1241 = !DILocation(line: 0, scope: !1202, inlinedAt: !1242)
!1242 = distinct !DILocation(line: 284, column: 5, scope: !1239)
!1243 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1242)
!1244 = !DILocation(line: 286, column: 1, scope: !995)
!1245 = !DISubprogram(name: "bindtextdomain", scope: !798, file: !798, line: 86, type: !1246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!148, !125, !125}
!1248 = !DISubprogram(name: "textdomain", scope: !798, file: !798, line: 82, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!1249 = !DISubprogram(name: "atexit", scope: !961, file: !961, line: 602, type: !1250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!150, !408}
!1252 = !DISubprogram(name: "__overflow", scope: !807, file: !807, line: 886, type: !1253, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!150, !279, !150}
!1255 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !347, file: !347, line: 50, type: !1256, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !346, retainedNodes: !1257)
!1256 = !DISubroutineType(types: !931)
!1257 = !{!1258}
!1258 = !DILocalVariable(name: "file", arg: 1, scope: !1255, file: !347, line: 50, type: !125)
!1259 = !DILocation(line: 0, scope: !1255)
!1260 = !DILocation(line: 52, column: 13, scope: !1255)
!1261 = !DILocation(line: 53, column: 1, scope: !1255)
!1262 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !347, file: !347, line: 87, type: !1263, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !346, retainedNodes: !1265)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !266}
!1265 = !{!1266}
!1266 = !DILocalVariable(name: "ignore", arg: 1, scope: !1262, file: !347, line: 87, type: !266)
!1267 = !DILocation(line: 0, scope: !1262)
!1268 = !DILocation(line: 89, column: 16, scope: !1262)
!1269 = !{!1270, !1270, i64 0}
!1270 = !{!"_Bool", !777, i64 0}
!1271 = !DILocation(line: 90, column: 1, scope: !1262)
!1272 = distinct !DISubprogram(name: "close_stdout", scope: !347, file: !347, line: 116, type: !409, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !346, retainedNodes: !1273)
!1273 = !{!1274}
!1274 = !DILocalVariable(name: "write_error", scope: !1275, file: !347, line: 121, type: !125)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !347, line: 120, column: 5)
!1276 = distinct !DILexicalBlock(scope: !1272, file: !347, line: 118, column: 7)
!1277 = !DILocation(line: 118, column: 21, scope: !1276)
!1278 = !DILocation(line: 118, column: 7, scope: !1276)
!1279 = !DILocation(line: 118, column: 29, scope: !1276)
!1280 = !DILocation(line: 119, column: 7, scope: !1276)
!1281 = !DILocation(line: 119, column: 12, scope: !1276)
!1282 = !{i8 0, i8 2}
!1283 = !DILocation(line: 119, column: 25, scope: !1276)
!1284 = !DILocation(line: 119, column: 28, scope: !1276)
!1285 = !DILocation(line: 119, column: 34, scope: !1276)
!1286 = !DILocation(line: 118, column: 7, scope: !1272)
!1287 = !DILocation(line: 121, column: 33, scope: !1275)
!1288 = !DILocation(line: 0, scope: !1275)
!1289 = !DILocation(line: 122, column: 11, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1275, file: !347, line: 122, column: 11)
!1291 = !DILocation(line: 0, scope: !1290)
!1292 = !DILocation(line: 122, column: 11, scope: !1275)
!1293 = !DILocation(line: 123, column: 9, scope: !1290)
!1294 = !DILocation(line: 126, column: 9, scope: !1290)
!1295 = !DILocation(line: 128, column: 14, scope: !1275)
!1296 = !DILocation(line: 128, column: 7, scope: !1275)
!1297 = !DILocation(line: 133, column: 42, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1272, file: !347, line: 133, column: 7)
!1299 = !DILocation(line: 133, column: 28, scope: !1298)
!1300 = !DILocation(line: 133, column: 50, scope: !1298)
!1301 = !DILocation(line: 133, column: 7, scope: !1272)
!1302 = !DILocation(line: 134, column: 12, scope: !1298)
!1303 = !DILocation(line: 134, column: 5, scope: !1298)
!1304 = !DILocation(line: 135, column: 1, scope: !1272)
!1305 = !DISubprogram(name: "__errno_location", scope: !1306, file: !1306, line: 37, type: !1307, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!1306 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!1309}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!1310 = !DISubprogram(name: "_exit", scope: !1311, file: !1311, line: 624, type: !765, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !796)
!1311 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1312 = distinct !DISubprogram(name: "verror", scope: !362, file: !362, line: 251, type: !1313, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1315)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !150, !150, !125, !372}
!1315 = !{!1316, !1317, !1318, !1319}
!1316 = !DILocalVariable(name: "status", arg: 1, scope: !1312, file: !362, line: 251, type: !150)
!1317 = !DILocalVariable(name: "errnum", arg: 2, scope: !1312, file: !362, line: 251, type: !150)
!1318 = !DILocalVariable(name: "message", arg: 3, scope: !1312, file: !362, line: 251, type: !125)
!1319 = !DILocalVariable(name: "args", arg: 4, scope: !1312, file: !362, line: 251, type: !372)
!1320 = !DILocation(line: 0, scope: !1312)
!1321 = !DILocation(line: 261, column: 3, scope: !1312)
!1322 = !DILocation(line: 265, column: 7, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1312, file: !362, line: 265, column: 7)
!1324 = !DILocation(line: 265, column: 7, scope: !1312)
!1325 = !DILocation(line: 266, column: 5, scope: !1323)
!1326 = !DILocation(line: 272, column: 7, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1323, file: !362, line: 268, column: 5)
!1328 = !DILocation(line: 276, column: 3, scope: !1312)
!1329 = !DILocation(line: 282, column: 1, scope: !1312)
!1330 = distinct !DISubprogram(name: "flush_stdout", scope: !362, file: !362, line: 163, type: !409, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1331)
!1331 = !{!1332}
!1332 = !DILocalVariable(name: "stdout_fd", scope: !1330, file: !362, line: 166, type: !150)
!1333 = !DILocation(line: 0, scope: !1330)
!1334 = !DILocalVariable(name: "fd", arg: 1, scope: !1335, file: !362, line: 145, type: !150)
!1335 = distinct !DISubprogram(name: "is_open", scope: !362, file: !362, line: 145, type: !1204, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1336)
!1336 = !{!1334}
!1337 = !DILocation(line: 0, scope: !1335, inlinedAt: !1338)
!1338 = distinct !DILocation(line: 182, column: 25, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1330, file: !362, line: 182, column: 7)
!1340 = !DILocation(line: 157, column: 15, scope: !1335, inlinedAt: !1338)
!1341 = !DILocation(line: 157, column: 12, scope: !1335, inlinedAt: !1338)
!1342 = !DILocation(line: 182, column: 7, scope: !1330)
!1343 = !DILocation(line: 184, column: 5, scope: !1339)
!1344 = !DILocation(line: 185, column: 1, scope: !1330)
!1345 = !DISubprogram(name: "__fprintf_chk", scope: !802, file: !802, line: 93, type: !1346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !796)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!150, !1348, !150, !805, null}
!1348 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !281, line: 7, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !283, line: 49, size: 1728, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1351, file: !283, line: 51, baseType: !150, size: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1351, file: !283, line: 54, baseType: !148, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1351, file: !283, line: 55, baseType: !148, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1351, file: !283, line: 56, baseType: !148, size: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1351, file: !283, line: 57, baseType: !148, size: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1351, file: !283, line: 58, baseType: !148, size: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1351, file: !283, line: 59, baseType: !148, size: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1351, file: !283, line: 60, baseType: !148, size: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1351, file: !283, line: 61, baseType: !148, size: 64, offset: 512)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1351, file: !283, line: 64, baseType: !148, size: 64, offset: 576)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1351, file: !283, line: 65, baseType: !148, size: 64, offset: 640)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1351, file: !283, line: 66, baseType: !148, size: 64, offset: 704)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1351, file: !283, line: 68, baseType: !298, size: 64, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1351, file: !283, line: 70, baseType: !1367, size: 64, offset: 832)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1351, file: !283, line: 72, baseType: !150, size: 32, offset: 896)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1351, file: !283, line: 73, baseType: !150, size: 32, offset: 928)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1351, file: !283, line: 74, baseType: !305, size: 64, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1351, file: !283, line: 77, baseType: !151, size: 16, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1351, file: !283, line: 78, baseType: !310, size: 8, offset: 1040)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1351, file: !283, line: 79, baseType: !90, size: 8, offset: 1048)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1351, file: !283, line: 81, baseType: !313, size: 64, offset: 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1351, file: !283, line: 89, baseType: !316, size: 64, offset: 1152)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1351, file: !283, line: 91, baseType: !318, size: 64, offset: 1216)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1351, file: !283, line: 92, baseType: !321, size: 64, offset: 1280)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1351, file: !283, line: 93, baseType: !1367, size: 64, offset: 1344)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1351, file: !283, line: 94, baseType: !149, size: 64, offset: 1408)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1351, file: !283, line: 95, baseType: !152, size: 64, offset: 1472)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1351, file: !283, line: 96, baseType: !150, size: 32, offset: 1536)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1351, file: !283, line: 98, baseType: !328, size: 160, offset: 1568)
!1383 = distinct !DISubprogram(name: "error_tail", scope: !362, file: !362, line: 219, type: !1313, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1384)
!1384 = !{!1385, !1386, !1387, !1388}
!1385 = !DILocalVariable(name: "status", arg: 1, scope: !1383, file: !362, line: 219, type: !150)
!1386 = !DILocalVariable(name: "errnum", arg: 2, scope: !1383, file: !362, line: 219, type: !150)
!1387 = !DILocalVariable(name: "message", arg: 3, scope: !1383, file: !362, line: 219, type: !125)
