; ModuleID = 'src/false.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating failure.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"false\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!163 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !3, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !72, line: 679, type: !128, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !72, line: 683, type: !9, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !72, line: 688, type: !9, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !72, line: 691, type: !141, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !72, line: 839, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 16)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !72, line: 840, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 22)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !72, line: 841, type: !164, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !72, line: 862, type: !112, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !72, line: 868, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 71)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !72, line: 875, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 27)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 51)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 12)
!211 = !{!212, !213, !214, !217, !219, !220, !221, !225, !226, !227, !228, !230, !283, !284, !285, !287, !288}
!212 = !DILocalVariable(name: "program", arg: 1, scope: !71, file: !72, line: 573, type: !75)
!213 = !DILocalVariable(name: "option", arg: 2, scope: !71, file: !72, line: 573, type: !75)
!214 = !DILocalVariable(name: "term", scope: !215, file: !72, line: 585, type: !75)
!215 = distinct !DILexicalBlock(scope: !216, file: !72, line: 582, column: 5)
!216 = distinct !DILexicalBlock(scope: !71, file: !72, line: 581, column: 7)
!217 = !DILocalVariable(name: "double_space", scope: !71, file: !72, line: 594, type: !218)
!218 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!219 = !DILocalVariable(name: "first_word", scope: !71, file: !72, line: 595, type: !75)
!220 = !DILocalVariable(name: "option_text", scope: !71, file: !72, line: 596, type: !75)
!221 = !DILocalVariable(name: "s", scope: !222, file: !72, line: 608, type: !75)
!222 = distinct !DILexicalBlock(scope: !223, file: !72, line: 605, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !72, line: 604, column: 12)
!224 = distinct !DILexicalBlock(scope: !71, file: !72, line: 597, column: 7)
!225 = !DILocalVariable(name: "spaces", scope: !222, file: !72, line: 609, type: !101)
!226 = !DILocalVariable(name: "anchor_len", scope: !71, file: !72, line: 620, type: !101)
!227 = !DILocalVariable(name: "desc_text", scope: !71, file: !72, line: 625, type: !75)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !72, line: 644, type: !75)
!229 = distinct !DILexicalBlock(scope: !71, file: !72, line: 644, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !72, line: 644, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !252, !254, !255, !256, !260, !261, !263, !264, !267, !269, !272, !275, !276, !277, !278, !279}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 51, baseType: !99, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 36, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 70, baseType: !253, size: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !258, line: 152, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!259 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 43, baseType: null)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !258, line: 153, baseType: !259)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !235, line: 37, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !235, line: 38, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !235, line: 93, baseType: !253, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 20)
!283 = !DILocalVariable(name: "__cnt", scope: !229, file: !72, line: 644, type: !101)
!284 = !DILocalVariable(name: "url_program", scope: !71, file: !72, line: 648, type: !75)
!285 = !DILocalVariable(name: "__ptr", scope: !286, file: !72, line: 686, type: !75)
!286 = distinct !DILexicalBlock(scope: !71, file: !72, line: 686, column: 3)
!287 = !DILocalVariable(name: "__stream", scope: !286, file: !72, line: 686, type: !231)
!288 = !DILocalVariable(name: "__cnt", scope: !286, file: !72, line: 686, type: !101)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !291, line: 3, type: !164, isLocal: true, isDefinition: true)
!291 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "Version", scope: !294, file: !291, line: 3, type: !75, isLocal: false, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C11, file: !291, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !295, splitDebugInlining: false, nameTableKind: None)
!295 = !{!289, !292}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "file_name", scope: !298, file: !299, line: 45, type: !75, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C11, file: !299, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !300, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!300 = !{!301, !303, !305, !307, !296, !309}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !54, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !208, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !299, line: 123, type: !54, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !299, line: 126, type: !128, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !298, file: !299, line: 55, type: !218, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !313, file: !314, line: 66, type: !360, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C11, file: !314, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !315, globals: !316, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!315 = !{!98, !104}
!316 = !{!317, !319, !339, !341, !343, !345, !311, !347, !349, !351, !353, !358}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !314, line: 272, type: !9, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "old_file_name", scope: !321, file: !314, line: 304, type: !75, isLocal: true, isDefinition: true)
!321 = distinct !DISubprogram(name: "verror_at_line", scope: !314, file: !314, line: 298, type: !322, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !332)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !99, !99, !75, !82, !75, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !326)
!326 = !{!327, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !325, file: !328, baseType: !82, size: 32)
!328 = !DIFile(filename: "lib/error.c", directory: "/src")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !325, file: !328, baseType: !82, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !325, file: !328, baseType: !98, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !325, file: !328, baseType: !98, size: 64, offset: 128)
!332 = !{!333, !334, !335, !336, !337, !338}
!333 = !DILocalVariable(name: "status", arg: 1, scope: !321, file: !314, line: 298, type: !99)
!334 = !DILocalVariable(name: "errnum", arg: 2, scope: !321, file: !314, line: 298, type: !99)
!335 = !DILocalVariable(name: "file_name", arg: 3, scope: !321, file: !314, line: 298, type: !75)
!336 = !DILocalVariable(name: "line_number", arg: 4, scope: !321, file: !314, line: 298, type: !82)
!337 = !DILocalVariable(name: "message", arg: 5, scope: !321, file: !314, line: 298, type: !75)
!338 = !DILocalVariable(name: "args", arg: 6, scope: !321, file: !314, line: 298, type: !324)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "old_line_number", scope: !321, file: !314, line: 305, type: !82, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !314, line: 338, type: !112, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !141, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !119, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "error_message_count", scope: !313, file: !314, line: 69, type: !82, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !313, file: !314, line: 295, type: !99, isLocal: false, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !54, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 21)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !314, line: 214, type: !9, isLocal: true, isDefinition: true)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null}
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "program_name", scope: !365, file: !366, line: 31, type: !75, isLocal: false, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C11, file: !366, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, globals: !368, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!367 = !{!97}
!368 = !{!363, !369, !371}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !366, line: 46, type: !141, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !366, line: 49, type: !112, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "utf07FF", scope: !375, file: !376, line: 46, type: !403, isLocal: true, isDefinition: true)
!375 = distinct !DISubprogram(name: "proper_name_lite", scope: !376, file: !376, line: 38, type: !377, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !381)
!376 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!377 = !DISubroutineType(types: !378)
!378 = !{!75, !75, !75}
!379 = distinct !DICompileUnit(language: DW_LANG_C11, file: !376, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !380, splitDebugInlining: false, nameTableKind: None)
!380 = !{!373}
!381 = !{!382, !383, !384, !385, !390}
!382 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !375, file: !376, line: 38, type: !75)
!383 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !375, file: !376, line: 38, type: !75)
!384 = !DILocalVariable(name: "translation", scope: !375, file: !376, line: 40, type: !75)
!385 = !DILocalVariable(name: "w", scope: !375, file: !376, line: 47, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !387, line: 37, baseType: !388)
!387 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !258, line: 57, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !258, line: 42, baseType: !82)
!390 = !DILocalVariable(name: "mbs", scope: !375, file: !376, line: 48, type: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !392, line: 6, baseType: !393)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !394, line: 21, baseType: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 13, size: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !395, file: !394, line: 15, baseType: !99, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !395, file: !394, line: 20, baseType: !399, size: 32, offset: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !394, line: 16, size: 32, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !399, file: !394, line: 18, baseType: !82, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !399, file: !394, line: 19, baseType: !112, size: 32)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, elements: !120)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !406, line: 78, type: !141, isLocal: true, isDefinition: true)
!406 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !406, line: 79, type: !19, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !406, line: 80, type: !66, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !406, line: 81, type: !66, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !406, line: 82, type: !280, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !406, line: 83, type: !119, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !406, line: 84, type: !141, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !406, line: 85, type: !54, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !406, line: 86, type: !54, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !406, line: 87, type: !141, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !427, file: !406, line: 76, type: !513, isLocal: false, isDefinition: true)
!427 = distinct !DICompileUnit(language: DW_LANG_C11, file: !406, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !448, globals: !449, splitDebugInlining: false, nameTableKind: None)
!428 = !{!429, !443, !80}
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !430, line: 42, baseType: !82, size: 32, elements: !431)
!430 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!432 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!433 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!434 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!435 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!436 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!437 = !DIEnumerator(name: "c_quoting_style", value: 5)
!438 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!439 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!440 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!441 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!442 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !430, line: 254, baseType: !82, size: 32, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!446 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!447 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!448 = !{!99, !100, !101}
!449 = !{!404, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !450, !454, !464, !466, !471, !473, !475, !477, !479, !502, !509, !511}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !427, file: !406, line: 92, type: !452, isLocal: false, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 320, elements: !45)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !427, file: !406, line: 1040, type: !456, isLocal: false, isDefinition: true)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !406, line: 56, size: 448, elements: !457)
!457 = !{!458, !459, !460, !462, !463}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !456, file: !406, line: 59, baseType: !429, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !456, file: !406, line: 62, baseType: !99, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !456, file: !406, line: 66, baseType: !461, size: 256, offset: 64)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, elements: !142)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !456, file: !406, line: 69, baseType: !75, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !456, file: !406, line: 72, baseType: !75, size: 64, offset: 384)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !427, file: !406, line: 107, type: !456, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "slot0", scope: !427, file: !406, line: 831, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 256)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !406, line: 321, type: !119, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !406, line: 357, type: !119, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !406, line: 358, type: !119, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !406, line: 199, type: !54, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "quote", scope: !481, file: !406, line: 228, type: !500, isLocal: true, isDefinition: true)
!481 = distinct !DISubprogram(name: "gettext_quote", scope: !406, file: !406, line: 197, type: !482, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !427, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{!75, !75, !429}
!484 = !{!485, !486, !487, !488, !489}
!485 = !DILocalVariable(name: "msgid", arg: 1, scope: !481, file: !406, line: 197, type: !75)
!486 = !DILocalVariable(name: "s", arg: 2, scope: !481, file: !406, line: 197, type: !429)
!487 = !DILocalVariable(name: "translation", scope: !481, file: !406, line: 199, type: !75)
!488 = !DILocalVariable(name: "w", scope: !481, file: !406, line: 229, type: !386)
!489 = !DILocalVariable(name: "mbs", scope: !481, file: !406, line: 230, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !392, line: 6, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !394, line: 21, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 13, size: 64, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !492, file: !394, line: 15, baseType: !99, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !492, file: !394, line: 20, baseType: !496, size: 32, offset: 32)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !492, file: !394, line: 16, size: 32, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !496, file: !394, line: 18, baseType: !82, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !496, file: !394, line: 19, baseType: !112, size: 32)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !501)
!501 = !{!121, !114}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "slotvec", scope: !427, file: !406, line: 834, type: !504, isLocal: true, isDefinition: true)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !406, line: 823, size: 128, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !505, file: !406, line: 825, baseType: !101, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !505, file: !406, line: 826, baseType: !97, size: 64, offset: 64)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "nslots", scope: !427, file: !406, line: 832, type: !99, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "slotvec0", scope: !427, file: !406, line: 833, type: !505, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 704, elements: !515)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!515 = !{!516}
!516 = !DISubrange(count: 11)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !519, line: 67, type: !208, isLocal: true, isDefinition: true)
!519 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !519, line: 69, type: !54, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !519, line: 83, type: !54, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !519, line: 83, type: !112, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !519, line: 85, type: !119, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !519, line: 88, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 171)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !519, line: 88, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 34)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !519, line: 105, type: !179, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !519, line: 109, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 23)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !519, line: 113, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 28)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !519, line: 120, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 32)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !519, line: 127, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 36)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !519, line: 134, type: !159, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !519, line: 142, type: !14, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !519, line: 150, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 48)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !519, line: 159, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 52)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !519, line: 170, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 60)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !519, line: 248, type: !280, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !519, line: 248, type: !184, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !519, line: 254, type: !280, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !519, line: 254, type: !61, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !519, line: 254, type: !159, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !519, line: 259, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 39)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !519, line: 259, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 29)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !601, file: !602, line: 26, type: !604, isLocal: false, isDefinition: true)
!601 = distinct !DICompileUnit(language: DW_LANG_C11, file: !602, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !603, splitDebugInlining: false, nameTableKind: None)
!602 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!603 = !{!599}
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 376, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 47)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "exit_failure", scope: !609, file: !610, line: 24, type: !612, isLocal: false, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C11, file: !610, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !611, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!611 = !{!607}
!612 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !615, line: 34, type: !128, isLocal: true, isDefinition: true)
!615 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !615, line: 34, type: !54, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !615, line: 34, type: !154, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !622, line: 108, type: !39, isLocal: true, isDefinition: true)
!622 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "internal_state", scope: !625, file: !622, line: 97, type: !628, isLocal: true, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C11, file: !622, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !626, globals: !627, splitDebugInlining: false, nameTableKind: None)
!626 = !{!98, !101, !104}
!627 = !{!620, !623}
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !392, line: 6, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !394, line: 21, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 13, size: 64, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !630, file: !394, line: 15, baseType: !99, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !630, file: !394, line: 20, baseType: !634, size: 32, offset: 32)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !630, file: !394, line: 16, size: 32, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !634, file: !394, line: 18, baseType: !82, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !634, file: !394, line: 19, baseType: !112, size: 32)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !640, line: 35, type: !19, isLocal: true, isDefinition: true)
!640 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!641 = distinct !DICompileUnit(language: DW_LANG_C11, file: !642, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!643 = distinct !DICompileUnit(language: DW_LANG_C11, file: !519, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !644, retainedTypes: !648, globals: !649, splitDebugInlining: false, nameTableKind: None)
!644 = !{!645}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !519, line: 40, baseType: !82, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!648 = !{!98}
!649 = !{!517, !520, !522, !524, !526, !528, !533, !538, !540, !545, !550, !555, !560, !562, !564, !569, !574, !579, !581, !583, !585, !587, !589, !594}
!650 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !683, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!652 = !{!653, !665}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !654, file: !651, line: 188, baseType: !82, size: 32, elements: !663)
!654 = distinct !DISubprogram(name: "x2nrealloc", scope: !651, file: !651, line: 176, type: !655, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !658)
!655 = !DISubroutineType(types: !656)
!656 = !{!98, !98, !657, !101}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(name: "p", arg: 1, scope: !654, file: !651, line: 176, type: !98)
!660 = !DILocalVariable(name: "pn", arg: 2, scope: !654, file: !651, line: 176, type: !657)
!661 = !DILocalVariable(name: "s", arg: 3, scope: !654, file: !651, line: 176, type: !101)
!662 = !DILocalVariable(name: "n", scope: !654, file: !651, line: 178, type: !101)
!663 = !{!664}
!664 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !666, file: !651, line: 228, baseType: !82, size: 32, elements: !663)
!666 = distinct !DISubprogram(name: "xpalloc", scope: !651, file: !651, line: 223, type: !667, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !673)
!667 = !DISubroutineType(types: !668)
!668 = !{!98, !98, !669, !670, !672, !670}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !671, line: 130, baseType: !672)
!671 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !102, line: 35, baseType: !259)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682}
!674 = !DILocalVariable(name: "pa", arg: 1, scope: !666, file: !651, line: 223, type: !98)
!675 = !DILocalVariable(name: "pn", arg: 2, scope: !666, file: !651, line: 223, type: !669)
!676 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !666, file: !651, line: 223, type: !670)
!677 = !DILocalVariable(name: "n_max", arg: 4, scope: !666, file: !651, line: 223, type: !672)
!678 = !DILocalVariable(name: "s", arg: 5, scope: !666, file: !651, line: 223, type: !670)
!679 = !DILocalVariable(name: "n0", scope: !666, file: !651, line: 230, type: !670)
!680 = !DILocalVariable(name: "n", scope: !666, file: !651, line: 237, type: !670)
!681 = !DILocalVariable(name: "nbytes", scope: !666, file: !651, line: 248, type: !670)
!682 = !DILocalVariable(name: "adjusted_nbytes", scope: !666, file: !651, line: 252, type: !670)
!683 = !{!97, !98, !218, !259, !103}
!684 = distinct !DICompileUnit(language: DW_LANG_C11, file: !615, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !685, splitDebugInlining: false, nameTableKind: None)
!685 = !{!613, !616, !618}
!686 = distinct !DICompileUnit(language: DW_LANG_C11, file: !687, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!688 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!692 = distinct !DICompileUnit(language: DW_LANG_C11, file: !693, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!694 = distinct !DICompileUnit(language: DW_LANG_C11, file: !695, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !696, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!696 = !{!218, !103, !98}
!697 = distinct !DICompileUnit(language: DW_LANG_C11, file: !640, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !698, splitDebugInlining: false, nameTableKind: None)
!698 = !{!699, !638}
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !640, line: 35, type: !119, isLocal: true, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !704, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!705 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!706 = !{i32 7, !"Dwarf Version", i32 5}
!707 = !{i32 2, !"Debug Info Version", i32 3}
!708 = !{i32 1, !"wchar_size", i32 4}
!709 = !{i32 8, !"PIC Level", i32 2}
!710 = !{i32 7, !"PIE Level", i32 2}
!711 = !{i32 7, !"uwtable", i32 2}
!712 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !713, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !715)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !99}
!715 = !{!716}
!716 = !DILocalVariable(name: "status", arg: 1, scope: !712, file: !2, line: 36, type: !99)
!717 = !DILocation(line: 0, scope: !712)
!718 = !DILocation(line: 38, column: 3, scope: !712)
!719 = !{!720, !720, i64 0}
!720 = !{!"any pointer", !721, i64 0}
!721 = !{!"omnipotent char", !722, i64 0}
!722 = !{!"Simple C/C++ TBAA"}
!723 = !DILocation(line: 43, column: 3, scope: !712)
!724 = !DILocation(line: 47, column: 3, scope: !712)
!725 = !DILocation(line: 48, column: 3, scope: !712)
!726 = !DILocation(line: 49, column: 3, scope: !712)
!727 = !DILocation(line: 50, column: 3, scope: !712)
!728 = !DILocation(line: 51, column: 3, scope: !712)
!729 = !DISubprogram(name: "dcgettext", scope: !730, file: !730, line: 51, type: !731, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!730 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!731 = !DISubroutineType(types: !732)
!732 = !{!97, !75, !75, !99}
!733 = !{}
!734 = !DISubprogram(name: "__printf_chk", scope: !735, file: !735, line: 95, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!735 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!736 = !DISubroutineType(types: !737)
!737 = !{!99, !99, !738, null}
!738 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!739 = !DILocation(line: 0, scope: !71)
!740 = !DILocation(line: 581, column: 7, scope: !216)
!741 = !{!742, !742, i64 0}
!742 = !{!"int", !721, i64 0}
!743 = !DILocation(line: 581, column: 19, scope: !216)
!744 = !DILocation(line: 581, column: 7, scope: !71)
!745 = !DILocation(line: 585, column: 26, scope: !215)
!746 = !DILocation(line: 0, scope: !215)
!747 = !DILocation(line: 586, column: 23, scope: !215)
!748 = !DILocation(line: 586, column: 28, scope: !215)
!749 = !DILocation(line: 586, column: 32, scope: !215)
!750 = !{!721, !721, i64 0}
!751 = !DILocation(line: 586, column: 38, scope: !215)
!752 = !DILocalVariable(name: "__s1", arg: 1, scope: !753, file: !754, line: 1359, type: !75)
!753 = distinct !DISubprogram(name: "streq", scope: !754, file: !754, line: 1359, type: !755, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !757)
!754 = !DIFile(filename: "./lib/string.h", directory: "/src")
!755 = !DISubroutineType(types: !756)
!756 = !{!218, !75, !75}
!757 = !{!752, !758}
!758 = !DILocalVariable(name: "__s2", arg: 2, scope: !753, file: !754, line: 1359, type: !75)
!759 = !DILocation(line: 0, scope: !753, inlinedAt: !760)
!760 = distinct !DILocation(line: 586, column: 41, scope: !215)
!761 = !DILocation(line: 1361, column: 11, scope: !753, inlinedAt: !760)
!762 = !DILocation(line: 1361, column: 10, scope: !753, inlinedAt: !760)
!763 = !DILocation(line: 586, column: 19, scope: !215)
!764 = !DILocation(line: 587, column: 5, scope: !215)
!765 = !DILocation(line: 588, column: 7, scope: !766)
!766 = distinct !DILexicalBlock(scope: !71, file: !72, line: 588, column: 7)
!767 = !DILocation(line: 588, column: 7, scope: !71)
!768 = !DILocation(line: 590, column: 7, scope: !769)
!769 = distinct !DILexicalBlock(scope: !766, file: !72, line: 589, column: 5)
!770 = !DILocation(line: 591, column: 7, scope: !769)
!771 = !DILocation(line: 595, column: 37, scope: !71)
!772 = !DILocation(line: 595, column: 35, scope: !71)
!773 = !DILocation(line: 596, column: 29, scope: !71)
!774 = !DILocation(line: 597, column: 8, scope: !224)
!775 = !DILocation(line: 597, column: 7, scope: !71)
!776 = !DILocation(line: 604, column: 24, scope: !223)
!777 = !DILocation(line: 604, column: 12, scope: !224)
!778 = !DILocation(line: 0, scope: !222)
!779 = !DILocation(line: 610, column: 16, scope: !222)
!780 = !DILocation(line: 610, column: 7, scope: !222)
!781 = !DILocation(line: 611, column: 21, scope: !222)
!782 = !{!783, !783, i64 0}
!783 = !{!"short", !721, i64 0}
!784 = !DILocation(line: 611, column: 19, scope: !222)
!785 = !DILocation(line: 611, column: 16, scope: !222)
!786 = !DILocation(line: 610, column: 30, scope: !222)
!787 = distinct !{!787, !780, !781, !788}
!788 = !{!"llvm.loop.mustprogress"}
!789 = !DILocation(line: 612, column: 18, scope: !790)
!790 = distinct !DILexicalBlock(scope: !222, file: !72, line: 612, column: 11)
!791 = !DILocation(line: 612, column: 11, scope: !222)
!792 = !DILocation(line: 618, column: 5, scope: !222)
!793 = !DILocation(line: 620, column: 23, scope: !71)
!794 = !DILocation(line: 625, column: 39, scope: !71)
!795 = !DILocation(line: 626, column: 3, scope: !71)
!796 = !DILocation(line: 626, column: 10, scope: !71)
!797 = !DILocation(line: 626, column: 21, scope: !71)
!798 = !DILocation(line: 628, column: 44, scope: !799)
!799 = distinct !DILexicalBlock(scope: !800, file: !72, line: 628, column: 11)
!800 = distinct !DILexicalBlock(scope: !71, file: !72, line: 627, column: 5)
!801 = !DILocation(line: 628, column: 32, scope: !799)
!802 = !DILocation(line: 628, column: 49, scope: !799)
!803 = !DILocation(line: 628, column: 11, scope: !800)
!804 = !DILocation(line: 630, column: 11, scope: !805)
!805 = distinct !DILexicalBlock(scope: !800, file: !72, line: 630, column: 11)
!806 = !DILocation(line: 630, column: 11, scope: !800)
!807 = !DILocation(line: 632, column: 26, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !72, line: 632, column: 15)
!809 = distinct !DILexicalBlock(scope: !805, file: !72, line: 631, column: 9)
!810 = !DILocation(line: 632, column: 34, scope: !808)
!811 = !DILocation(line: 632, column: 37, scope: !808)
!812 = !DILocation(line: 632, column: 15, scope: !809)
!813 = !DILocation(line: 636, column: 16, scope: !814)
!814 = distinct !DILexicalBlock(scope: !809, file: !72, line: 636, column: 15)
!815 = !DILocation(line: 636, column: 29, scope: !814)
!816 = !DILocation(line: 640, column: 16, scope: !800)
!817 = distinct !{!817, !795, !818, !788}
!818 = !DILocation(line: 641, column: 5, scope: !71)
!819 = !DILocation(line: 644, column: 3, scope: !71)
!820 = !DILocation(line: 0, scope: !753, inlinedAt: !821)
!821 = distinct !DILocation(line: 648, column: 31, scope: !71)
!822 = !DILocation(line: 0, scope: !753, inlinedAt: !823)
!823 = distinct !DILocation(line: 649, column: 31, scope: !71)
!824 = !DILocation(line: 0, scope: !753, inlinedAt: !825)
!825 = distinct !DILocation(line: 650, column: 31, scope: !71)
!826 = !DILocation(line: 0, scope: !753, inlinedAt: !827)
!827 = distinct !DILocation(line: 651, column: 31, scope: !71)
!828 = !DILocation(line: 0, scope: !753, inlinedAt: !829)
!829 = distinct !DILocation(line: 652, column: 31, scope: !71)
!830 = !DILocation(line: 0, scope: !753, inlinedAt: !831)
!831 = distinct !DILocation(line: 653, column: 31, scope: !71)
!832 = !DILocation(line: 0, scope: !753, inlinedAt: !833)
!833 = distinct !DILocation(line: 654, column: 31, scope: !71)
!834 = !DILocation(line: 0, scope: !753, inlinedAt: !835)
!835 = distinct !DILocation(line: 655, column: 31, scope: !71)
!836 = !DILocation(line: 0, scope: !753, inlinedAt: !837)
!837 = distinct !DILocation(line: 656, column: 31, scope: !71)
!838 = !DILocation(line: 0, scope: !753, inlinedAt: !839)
!839 = distinct !DILocation(line: 657, column: 31, scope: !71)
!840 = !DILocation(line: 663, column: 7, scope: !841)
!841 = distinct !DILexicalBlock(scope: !71, file: !72, line: 663, column: 7)
!842 = !DILocation(line: 664, column: 7, scope: !841)
!843 = !DILocation(line: 664, column: 10, scope: !841)
!844 = !DILocation(line: 663, column: 7, scope: !71)
!845 = !DILocation(line: 669, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !841, file: !72, line: 665, column: 5)
!847 = !DILocation(line: 671, column: 5, scope: !846)
!848 = !DILocation(line: 676, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !841, file: !72, line: 673, column: 5)
!850 = !DILocation(line: 679, column: 3, scope: !71)
!851 = !DILocation(line: 683, column: 3, scope: !71)
!852 = !DILocation(line: 686, column: 3, scope: !71)
!853 = !DILocation(line: 688, column: 3, scope: !71)
!854 = !DILocation(line: 691, column: 3, scope: !71)
!855 = !DILocation(line: 695, column: 3, scope: !71)
!856 = !DILocation(line: 696, column: 1, scope: !71)
!857 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !72, file: !72, line: 836, type: !858, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !860)
!858 = !DISubroutineType(cc: DW_CC_nocall, types: !859)
!859 = !{null, !75}
!860 = !{!861, !862, !869, !870, !872, !873}
!861 = !DILocalVariable(name: "program", arg: 1, scope: !857, file: !72, line: 836, type: !75)
!862 = !DILocalVariable(name: "infomap", scope: !857, file: !72, line: 838, type: !863)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 896, elements: !55)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !857, file: !72, line: 838, size: 128, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !865, file: !72, line: 838, baseType: !75, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !865, file: !72, line: 838, baseType: !75, size: 64, offset: 64)
!869 = !DILocalVariable(name: "node", scope: !857, file: !72, line: 848, type: !75)
!870 = !DILocalVariable(name: "map_prog", scope: !857, file: !72, line: 849, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!872 = !DILocalVariable(name: "lc_messages", scope: !857, file: !72, line: 861, type: !75)
!873 = !DILocalVariable(name: "url_program", scope: !857, file: !72, line: 874, type: !75)
!874 = !DILocation(line: 0, scope: !857)
!875 = !DILocation(line: 857, column: 3, scope: !857)
!876 = !DILocation(line: 861, column: 29, scope: !857)
!877 = !DILocation(line: 862, column: 7, scope: !878)
!878 = distinct !DILexicalBlock(scope: !857, file: !72, line: 862, column: 7)
!879 = !DILocation(line: 862, column: 19, scope: !878)
!880 = !DILocation(line: 862, column: 22, scope: !878)
!881 = !DILocation(line: 862, column: 7, scope: !857)
!882 = !DILocation(line: 868, column: 7, scope: !883)
!883 = distinct !DILexicalBlock(scope: !878, file: !72, line: 863, column: 5)
!884 = !DILocation(line: 870, column: 5, scope: !883)
!885 = !DILocation(line: 875, column: 3, scope: !857)
!886 = !DILocation(line: 877, column: 3, scope: !857)
!887 = !DILocation(line: 879, column: 1, scope: !857)
!888 = !DISubprogram(name: "exit", scope: !889, file: !889, line: 624, type: !713, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !733)
!889 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!890 = !DISubprogram(name: "setlocale", scope: !891, file: !891, line: 122, type: !892, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!891 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!892 = !DISubroutineType(types: !893)
!893 = !{!97, !99, !75}
!894 = !DISubprogram(name: "strncmp", scope: !895, file: !895, line: 159, type: !896, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!895 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!896 = !DISubroutineType(types: !897)
!897 = !{!99, !75, !75, !101}
!898 = !DISubprogram(name: "fputs_unlocked", scope: !899, file: !899, line: 691, type: !900, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!899 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!900 = !DISubroutineType(types: !901)
!901 = !{!99, !738, !902}
!902 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!903 = !DISubprogram(name: "getenv", scope: !889, file: !889, line: 641, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!904 = !DISubroutineType(types: !905)
!905 = !{!97, !75}
!906 = !DISubprogram(name: "strcmp", scope: !895, file: !895, line: 156, type: !907, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!907 = !DISubroutineType(types: !908)
!908 = !{!99, !75, !75}
!909 = !DISubprogram(name: "strspn", scope: !895, file: !895, line: 297, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!910 = !DISubroutineType(types: !911)
!911 = !{!103, !75, !75}
!912 = !DISubprogram(name: "strchr", scope: !895, file: !895, line: 246, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!913 = !DISubroutineType(types: !914)
!914 = !{!97, !75, !99}
!915 = !DISubprogram(name: "__ctype_b_loc", scope: !81, file: !81, line: 79, type: !916, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!916 = !DISubroutineType(types: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!921 = !DISubprogram(name: "strcspn", scope: !895, file: !895, line: 293, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!922 = !DISubprogram(name: "fwrite_unlocked", scope: !899, file: !899, line: 704, type: !923, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!923 = !DISubroutineType(types: !924)
!924 = !{!101, !925, !101, !101, !902}
!925 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!928 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !929, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !932)
!929 = !DISubroutineType(types: !930)
!930 = !{!99, !99, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!932 = !{!933, !934}
!933 = !DILocalVariable(name: "argc", arg: 1, scope: !928, file: !2, line: 55, type: !99)
!934 = !DILocalVariable(name: "argv", arg: 2, scope: !928, file: !2, line: 55, type: !931)
!935 = !DILocation(line: 0, scope: !928)
!936 = !DILocation(line: 59, column: 12, scope: !937)
!937 = distinct !DILexicalBlock(scope: !928, file: !2, line: 59, column: 7)
!938 = !DILocation(line: 59, column: 7, scope: !928)
!939 = !DILocation(line: 62, column: 25, scope: !940)
!940 = distinct !DILexicalBlock(scope: !937, file: !2, line: 60, column: 5)
!941 = !DILocation(line: 62, column: 7, scope: !940)
!942 = !DILocation(line: 63, column: 7, scope: !940)
!943 = !DILocation(line: 64, column: 7, scope: !940)
!944 = !DILocation(line: 65, column: 7, scope: !940)
!945 = !DILocation(line: 69, column: 7, scope: !940)
!946 = !DILocation(line: 71, column: 18, scope: !947)
!947 = distinct !DILexicalBlock(scope: !940, file: !2, line: 71, column: 11)
!948 = !DILocation(line: 0, scope: !753, inlinedAt: !949)
!949 = distinct !DILocation(line: 71, column: 11, scope: !947)
!950 = !DILocation(line: 1361, column: 11, scope: !753, inlinedAt: !949)
!951 = !DILocation(line: 1361, column: 10, scope: !753, inlinedAt: !949)
!952 = !DILocation(line: 71, column: 11, scope: !940)
!953 = !DILocation(line: 72, column: 9, scope: !947)
!954 = !DILocation(line: 0, scope: !753, inlinedAt: !955)
!955 = distinct !DILocation(line: 74, column: 11, scope: !956)
!956 = distinct !DILexicalBlock(scope: !940, file: !2, line: 74, column: 11)
!957 = !DILocation(line: 1361, column: 11, scope: !753, inlinedAt: !955)
!958 = !DILocation(line: 1361, column: 10, scope: !753, inlinedAt: !955)
!959 = !DILocation(line: 74, column: 11, scope: !940)
!960 = !DILocation(line: 75, column: 22, scope: !956)
!961 = !DILocation(line: 75, column: 58, scope: !956)
!962 = !DILocation(line: 75, column: 67, scope: !956)
!963 = !DILocation(line: 75, column: 9, scope: !956)
!964 = !DILocation(line: 79, column: 3, scope: !928)
!965 = !DISubprogram(name: "bindtextdomain", scope: !730, file: !730, line: 86, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!966 = !DISubroutineType(types: !967)
!967 = !{!97, !75, !75}
!968 = !DISubprogram(name: "textdomain", scope: !730, file: !730, line: 82, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!969 = !DISubprogram(name: "atexit", scope: !889, file: !889, line: 602, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!970 = !DISubroutineType(types: !971)
!971 = !{!99, !360}
!972 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !299, file: !299, line: 50, type: !973, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !974)
!973 = !DISubroutineType(types: !859)
!974 = !{!975}
!975 = !DILocalVariable(name: "file", arg: 1, scope: !972, file: !299, line: 50, type: !75)
!976 = !DILocation(line: 0, scope: !972)
!977 = !DILocation(line: 52, column: 13, scope: !972)
!978 = !DILocation(line: 53, column: 1, scope: !972)
!979 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !299, file: !299, line: 87, type: !980, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !218}
!982 = !{!983}
!983 = !DILocalVariable(name: "ignore", arg: 1, scope: !979, file: !299, line: 87, type: !218)
!984 = !DILocation(line: 0, scope: !979)
!985 = !DILocation(line: 89, column: 16, scope: !979)
!986 = !{!987, !987, i64 0}
!987 = !{!"_Bool", !721, i64 0}
!988 = !DILocation(line: 90, column: 1, scope: !979)
!989 = distinct !DISubprogram(name: "close_stdout", scope: !299, file: !299, line: 116, type: !361, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !990)
!990 = !{!991}
!991 = !DILocalVariable(name: "write_error", scope: !992, file: !299, line: 121, type: !75)
!992 = distinct !DILexicalBlock(scope: !993, file: !299, line: 120, column: 5)
!993 = distinct !DILexicalBlock(scope: !989, file: !299, line: 118, column: 7)
!994 = !DILocation(line: 118, column: 21, scope: !993)
!995 = !DILocation(line: 118, column: 7, scope: !993)
!996 = !DILocation(line: 118, column: 29, scope: !993)
!997 = !DILocation(line: 119, column: 7, scope: !993)
!998 = !DILocation(line: 119, column: 12, scope: !993)
!999 = !{i8 0, i8 2}
!1000 = !DILocation(line: 119, column: 25, scope: !993)
!1001 = !DILocation(line: 119, column: 28, scope: !993)
!1002 = !DILocation(line: 119, column: 34, scope: !993)
!1003 = !DILocation(line: 118, column: 7, scope: !989)
!1004 = !DILocation(line: 121, column: 33, scope: !992)
!1005 = !DILocation(line: 0, scope: !992)
!1006 = !DILocation(line: 122, column: 11, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !992, file: !299, line: 122, column: 11)
!1008 = !DILocation(line: 0, scope: !1007)
!1009 = !DILocation(line: 122, column: 11, scope: !992)
!1010 = !DILocation(line: 123, column: 9, scope: !1007)
!1011 = !DILocation(line: 126, column: 9, scope: !1007)
!1012 = !DILocation(line: 128, column: 14, scope: !992)
!1013 = !DILocation(line: 128, column: 7, scope: !992)
!1014 = !DILocation(line: 133, column: 42, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !989, file: !299, line: 133, column: 7)
!1016 = !DILocation(line: 133, column: 28, scope: !1015)
!1017 = !DILocation(line: 133, column: 50, scope: !1015)
!1018 = !DILocation(line: 133, column: 7, scope: !989)
!1019 = !DILocation(line: 134, column: 12, scope: !1015)
!1020 = !DILocation(line: 134, column: 5, scope: !1015)
!1021 = !DILocation(line: 135, column: 1, scope: !989)
!1022 = !DISubprogram(name: "__errno_location", scope: !1023, file: !1023, line: 37, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1023 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!1027 = !DISubprogram(name: "_exit", scope: !1028, file: !1028, line: 624, type: !713, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1028 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1029 = distinct !DISubprogram(name: "verror", scope: !314, file: !314, line: 251, type: !1030, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1032)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !99, !99, !75, !324}
!1032 = !{!1033, !1034, !1035, !1036}
!1033 = !DILocalVariable(name: "status", arg: 1, scope: !1029, file: !314, line: 251, type: !99)
!1034 = !DILocalVariable(name: "errnum", arg: 2, scope: !1029, file: !314, line: 251, type: !99)
!1035 = !DILocalVariable(name: "message", arg: 3, scope: !1029, file: !314, line: 251, type: !75)
!1036 = !DILocalVariable(name: "args", arg: 4, scope: !1029, file: !314, line: 251, type: !324)
!1037 = !DILocation(line: 0, scope: !1029)
!1038 = !DILocation(line: 261, column: 3, scope: !1029)
!1039 = !DILocation(line: 265, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1029, file: !314, line: 265, column: 7)
!1041 = !DILocation(line: 265, column: 7, scope: !1029)
!1042 = !DILocation(line: 266, column: 5, scope: !1040)
!1043 = !DILocation(line: 272, column: 7, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !314, line: 268, column: 5)
!1045 = !DILocation(line: 276, column: 3, scope: !1029)
!1046 = !DILocation(line: 282, column: 1, scope: !1029)
!1047 = distinct !DISubprogram(name: "flush_stdout", scope: !314, file: !314, line: 163, type: !361, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1048)
!1048 = !{!1049}
!1049 = !DILocalVariable(name: "stdout_fd", scope: !1047, file: !314, line: 166, type: !99)
!1050 = !DILocation(line: 0, scope: !1047)
!1051 = !DILocalVariable(name: "fd", arg: 1, scope: !1052, file: !314, line: 145, type: !99)
!1052 = distinct !DISubprogram(name: "is_open", scope: !314, file: !314, line: 145, type: !1053, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!99, !99}
!1055 = !{!1051}
!1056 = !DILocation(line: 0, scope: !1052, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 182, column: 25, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1047, file: !314, line: 182, column: 7)
!1059 = !DILocation(line: 157, column: 15, scope: !1052, inlinedAt: !1057)
!1060 = !DILocation(line: 157, column: 12, scope: !1052, inlinedAt: !1057)
!1061 = !DILocation(line: 182, column: 7, scope: !1047)
!1062 = !DILocation(line: 184, column: 5, scope: !1058)
!1063 = !DILocation(line: 185, column: 1, scope: !1047)
!1064 = !DISubprogram(name: "__fprintf_chk", scope: !735, file: !735, line: 93, type: !1065, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!99, !1067, !99, !738, null}
!1067 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1070, file: !235, line: 51, baseType: !99, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1070, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1070, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1070, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1070, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1070, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1070, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1070, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1070, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1070, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1070, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1070, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1070, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1070, file: !235, line: 70, baseType: !1086, size: 64, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1070, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1070, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1070, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1070, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1070, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1070, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1070, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1070, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1070, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1070, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1070, file: !235, line: 93, baseType: !1086, size: 64, offset: 1344)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1070, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1070, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1070, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1070, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!1102 = distinct !DISubprogram(name: "error_tail", scope: !314, file: !314, line: 219, type: !1030, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1103)
!1103 = !{!1104, !1105, !1106, !1107}
!1104 = !DILocalVariable(name: "status", arg: 1, scope: !1102, file: !314, line: 219, type: !99)
!1105 = !DILocalVariable(name: "errnum", arg: 2, scope: !1102, file: !314, line: 219, type: !99)
!1106 = !DILocalVariable(name: "message", arg: 3, scope: !1102, file: !314, line: 219, type: !75)
!1107 = !DILocalVariable(name: "args", arg: 4, scope: !1102, file: !314, line: 219, type: !324)
!1108 = !DILocation(line: 0, scope: !1102)
!1109 = !DILocation(line: 229, column: 13, scope: !1102)
!1110 = !DILocalVariable(name: "__stream", arg: 1, scope: !1111, file: !735, line: 132, type: !1067)
!1111 = distinct !DISubprogram(name: "vfprintf", scope: !735, file: !735, line: 132, type: !1112, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1114)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!99, !1067, !738, !324}
!1114 = !{!1110, !1115, !1116}
!1115 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1111, file: !735, line: 133, type: !738)
!1116 = !DILocalVariable(name: "__ap", arg: 3, scope: !1111, file: !735, line: 133, type: !324)
!1117 = !DILocation(line: 0, scope: !1111, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 229, column: 3, scope: !1102)
!1119 = !DILocation(line: 135, column: 10, scope: !1111, inlinedAt: !1118)
!1120 = !DILocation(line: 232, column: 3, scope: !1102)
!1121 = !DILocation(line: 233, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1102, file: !314, line: 233, column: 7)
!1123 = !DILocation(line: 233, column: 7, scope: !1102)
!1124 = !DILocalVariable(name: "errnum", arg: 1, scope: !1125, file: !314, line: 188, type: !99)
!1125 = distinct !DISubprogram(name: "print_errno_message", scope: !314, file: !314, line: 188, type: !713, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1126)
!1126 = !{!1124, !1127, !1128}
!1127 = !DILocalVariable(name: "s", scope: !1125, file: !314, line: 190, type: !75)
!1128 = !DILocalVariable(name: "errbuf", scope: !1125, file: !314, line: 193, type: !1129)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1130)
!1130 = !{!1131}
!1131 = !DISubrange(count: 1024)
!1132 = !DILocation(line: 0, scope: !1125, inlinedAt: !1133)
!1133 = distinct !DILocation(line: 234, column: 5, scope: !1122)
!1134 = !DILocation(line: 193, column: 3, scope: !1125, inlinedAt: !1133)
!1135 = !DILocation(line: 193, column: 8, scope: !1125, inlinedAt: !1133)
!1136 = !DILocation(line: 195, column: 7, scope: !1125, inlinedAt: !1133)
!1137 = !DILocation(line: 207, column: 9, scope: !1138, inlinedAt: !1133)
!1138 = distinct !DILexicalBlock(scope: !1125, file: !314, line: 207, column: 7)
!1139 = !DILocation(line: 207, column: 7, scope: !1125, inlinedAt: !1133)
!1140 = !DILocation(line: 208, column: 9, scope: !1138, inlinedAt: !1133)
!1141 = !DILocation(line: 208, column: 5, scope: !1138, inlinedAt: !1133)
!1142 = !DILocation(line: 214, column: 3, scope: !1125, inlinedAt: !1133)
!1143 = !DILocation(line: 216, column: 1, scope: !1125, inlinedAt: !1133)
!1144 = !DILocation(line: 234, column: 5, scope: !1122)
!1145 = !DILocation(line: 238, column: 3, scope: !1102)
!1146 = !DILocalVariable(name: "__c", arg: 1, scope: !1147, file: !1148, line: 101, type: !99)
!1147 = distinct !DISubprogram(name: "putc_unlocked", scope: !1148, file: !1148, line: 101, type: !1149, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1151)
!1148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!99, !99, !1068}
!1151 = !{!1146, !1152}
!1152 = !DILocalVariable(name: "__stream", arg: 2, scope: !1147, file: !1148, line: 101, type: !1068)
!1153 = !DILocation(line: 0, scope: !1147, inlinedAt: !1154)
!1154 = distinct !DILocation(line: 238, column: 3, scope: !1102)
!1155 = !DILocation(line: 103, column: 10, scope: !1147, inlinedAt: !1154)
!1156 = !{!1157, !720, i64 40}
!1157 = !{!"_IO_FILE", !742, i64 0, !720, i64 8, !720, i64 16, !720, i64 24, !720, i64 32, !720, i64 40, !720, i64 48, !720, i64 56, !720, i64 64, !720, i64 72, !720, i64 80, !720, i64 88, !720, i64 96, !720, i64 104, !742, i64 112, !742, i64 116, !1158, i64 120, !783, i64 128, !721, i64 130, !721, i64 131, !720, i64 136, !1158, i64 144, !720, i64 152, !720, i64 160, !720, i64 168, !720, i64 176, !1158, i64 184, !742, i64 192, !721, i64 196}
!1158 = !{!"long", !721, i64 0}
!1159 = !{!1157, !720, i64 48}
!1160 = !{!"branch_weights", i32 2000, i32 1}
!1161 = !DILocation(line: 240, column: 3, scope: !1102)
!1162 = !DILocation(line: 241, column: 7, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1102, file: !314, line: 241, column: 7)
!1164 = !DILocation(line: 241, column: 7, scope: !1102)
!1165 = !DILocation(line: 242, column: 5, scope: !1163)
!1166 = !DILocation(line: 243, column: 1, scope: !1102)
!1167 = !DISubprogram(name: "__vfprintf_chk", scope: !735, file: !735, line: 96, type: !1168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!99, !1067, !99, !738, !324}
!1170 = !DISubprogram(name: "strerror_r", scope: !895, file: !895, line: 444, type: !1171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!97, !99, !97, !101}
!1173 = !DISubprogram(name: "__overflow", scope: !899, file: !899, line: 886, type: !1174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!99, !1068, !99}
!1176 = !DISubprogram(name: "fflush_unlocked", scope: !899, file: !899, line: 239, type: !1177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!99, !1068}
!1179 = !DISubprogram(name: "fcntl", scope: !1180, file: !1180, line: 149, type: !1181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1180 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!99, !99, !99, null}
!1183 = distinct !DISubprogram(name: "error", scope: !314, file: !314, line: 285, type: !1184, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1186)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{null, !99, !99, !75, null}
!1186 = !{!1187, !1188, !1189, !1190}
!1187 = !DILocalVariable(name: "status", arg: 1, scope: !1183, file: !314, line: 285, type: !99)
!1188 = !DILocalVariable(name: "errnum", arg: 2, scope: !1183, file: !314, line: 285, type: !99)
!1189 = !DILocalVariable(name: "message", arg: 3, scope: !1183, file: !314, line: 285, type: !75)
!1190 = !DILocalVariable(name: "ap", scope: !1183, file: !314, line: 287, type: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !899, line: 52, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1193, line: 14, baseType: !1194)
!1193 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !328, baseType: !1195)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 192, elements: !40)
!1196 = !DILocation(line: 0, scope: !1183)
!1197 = !DILocation(line: 287, column: 3, scope: !1183)
!1198 = !DILocation(line: 287, column: 11, scope: !1183)
!1199 = !DILocation(line: 288, column: 3, scope: !1183)
!1200 = !DILocation(line: 289, column: 3, scope: !1183)
!1201 = !DILocation(line: 290, column: 3, scope: !1183)
!1202 = !DILocation(line: 291, column: 1, scope: !1183)
!1203 = !DILocation(line: 0, scope: !321)
!1204 = !DILocation(line: 302, column: 7, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !321, file: !314, line: 302, column: 7)
!1206 = !DILocation(line: 302, column: 7, scope: !321)
!1207 = !DILocation(line: 307, column: 11, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !314, line: 307, column: 11)
!1209 = distinct !DILexicalBlock(scope: !1205, file: !314, line: 303, column: 5)
!1210 = !DILocation(line: 307, column: 27, scope: !1208)
!1211 = !DILocation(line: 308, column: 11, scope: !1208)
!1212 = !DILocation(line: 308, column: 28, scope: !1208)
!1213 = !DILocation(line: 308, column: 25, scope: !1208)
!1214 = !DILocation(line: 309, column: 15, scope: !1208)
!1215 = !DILocation(line: 309, column: 33, scope: !1208)
!1216 = !DILocation(line: 310, column: 19, scope: !1208)
!1217 = !DILocation(line: 311, column: 22, scope: !1208)
!1218 = !DILocation(line: 311, column: 56, scope: !1208)
!1219 = !DILocation(line: 307, column: 11, scope: !1209)
!1220 = !DILocation(line: 316, column: 21, scope: !1209)
!1221 = !DILocation(line: 317, column: 23, scope: !1209)
!1222 = !DILocation(line: 318, column: 5, scope: !1209)
!1223 = !DILocation(line: 327, column: 3, scope: !321)
!1224 = !DILocation(line: 331, column: 7, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !321, file: !314, line: 331, column: 7)
!1226 = !DILocation(line: 331, column: 7, scope: !321)
!1227 = !DILocation(line: 332, column: 5, scope: !1225)
!1228 = !DILocation(line: 338, column: 7, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1225, file: !314, line: 334, column: 5)
!1230 = !DILocation(line: 346, column: 3, scope: !321)
!1231 = !DILocation(line: 350, column: 3, scope: !321)
!1232 = !DILocation(line: 356, column: 1, scope: !321)
!1233 = distinct !DISubprogram(name: "error_at_line", scope: !314, file: !314, line: 359, type: !1234, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1236)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{null, !99, !99, !75, !82, !75, null}
!1236 = !{!1237, !1238, !1239, !1240, !1241, !1242}
!1237 = !DILocalVariable(name: "status", arg: 1, scope: !1233, file: !314, line: 359, type: !99)
!1238 = !DILocalVariable(name: "errnum", arg: 2, scope: !1233, file: !314, line: 359, type: !99)
!1239 = !DILocalVariable(name: "file_name", arg: 3, scope: !1233, file: !314, line: 359, type: !75)
!1240 = !DILocalVariable(name: "line_number", arg: 4, scope: !1233, file: !314, line: 360, type: !82)
!1241 = !DILocalVariable(name: "message", arg: 5, scope: !1233, file: !314, line: 360, type: !75)
!1242 = !DILocalVariable(name: "ap", scope: !1233, file: !314, line: 362, type: !1191)
!1243 = !DILocation(line: 0, scope: !1233)
!1244 = !DILocation(line: 362, column: 3, scope: !1233)
!1245 = !DILocation(line: 362, column: 11, scope: !1233)
!1246 = !DILocation(line: 363, column: 3, scope: !1233)
!1247 = !DILocation(line: 364, column: 3, scope: !1233)
!1248 = !DILocation(line: 366, column: 3, scope: !1233)
!1249 = !DILocation(line: 367, column: 1, scope: !1233)
!1250 = distinct !DISubprogram(name: "getprogname", scope: !642, file: !642, line: 54, type: !1251, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !641, retainedNodes: !733)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!75}
!1253 = !DILocation(line: 58, column: 10, scope: !1250)
!1254 = !DILocation(line: 58, column: 3, scope: !1250)
!1255 = distinct !DISubprogram(name: "set_program_name", scope: !366, file: !366, line: 37, type: !973, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !365, retainedNodes: !1256)
!1256 = !{!1257, !1258, !1259}
!1257 = !DILocalVariable(name: "argv0", arg: 1, scope: !1255, file: !366, line: 37, type: !75)
!1258 = !DILocalVariable(name: "slash", scope: !1255, file: !366, line: 44, type: !75)
!1259 = !DILocalVariable(name: "base", scope: !1255, file: !366, line: 45, type: !75)
!1260 = !DILocation(line: 0, scope: !1255)
!1261 = !DILocation(line: 44, column: 23, scope: !1255)
!1262 = !DILocation(line: 45, column: 22, scope: !1255)
!1263 = !DILocation(line: 46, column: 17, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1255, file: !366, line: 46, column: 7)
!1265 = !DILocation(line: 46, column: 9, scope: !1264)
!1266 = !DILocation(line: 46, column: 25, scope: !1264)
!1267 = !DILocation(line: 46, column: 40, scope: !1264)
!1268 = !DILocalVariable(name: "__s1", arg: 1, scope: !1269, file: !754, line: 974, type: !926)
!1269 = distinct !DISubprogram(name: "memeq", scope: !754, file: !754, line: 974, type: !1270, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !365, retainedNodes: !1272)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!218, !926, !926, !101}
!1272 = !{!1268, !1273, !1274}
!1273 = !DILocalVariable(name: "__s2", arg: 2, scope: !1269, file: !754, line: 974, type: !926)
!1274 = !DILocalVariable(name: "__n", arg: 3, scope: !1269, file: !754, line: 974, type: !101)
!1275 = !DILocation(line: 0, scope: !1269, inlinedAt: !1276)
!1276 = distinct !DILocation(line: 46, column: 28, scope: !1264)
!1277 = !DILocation(line: 976, column: 11, scope: !1269, inlinedAt: !1276)
!1278 = !DILocation(line: 976, column: 10, scope: !1269, inlinedAt: !1276)
!1279 = !DILocation(line: 46, column: 7, scope: !1255)
!1280 = !DILocation(line: 49, column: 11, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1282, file: !366, line: 49, column: 11)
!1282 = distinct !DILexicalBlock(scope: !1264, file: !366, line: 47, column: 5)
!1283 = !DILocation(line: 49, column: 36, scope: !1281)
!1284 = !DILocation(line: 49, column: 11, scope: !1282)
!1285 = !DILocation(line: 65, column: 16, scope: !1255)
!1286 = !DILocation(line: 71, column: 27, scope: !1255)
!1287 = !DILocation(line: 74, column: 33, scope: !1255)
!1288 = !DILocation(line: 76, column: 1, scope: !1255)
!1289 = !DISubprogram(name: "strrchr", scope: !895, file: !895, line: 273, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !733)
!1290 = !DILocation(line: 0, scope: !375)
!1291 = !DILocation(line: 40, column: 29, scope: !375)
!1292 = !DILocation(line: 41, column: 19, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !375, file: !376, line: 41, column: 7)
!1294 = !DILocation(line: 41, column: 7, scope: !375)
!1295 = !DILocation(line: 47, column: 3, scope: !375)
!1296 = !DILocation(line: 48, column: 3, scope: !375)
!1297 = !DILocation(line: 48, column: 13, scope: !375)
!1298 = !DILocalVariable(name: "ps", arg: 1, scope: !1299, file: !1300, line: 1135, type: !1303)
!1299 = distinct !DISubprogram(name: "mbszero", scope: !1300, file: !1300, line: 1135, type: !1301, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !1304)
!1300 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1301 = !DISubroutineType(types: !1302)
!1302 = !{null, !1303}
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!1304 = !{!1298}
!1305 = !DILocation(line: 0, scope: !1299, inlinedAt: !1306)
!1306 = distinct !DILocation(line: 48, column: 18, scope: !375)
!1307 = !DILocalVariable(name: "__dest", arg: 1, scope: !1308, file: !1309, line: 57, type: !98)
!1308 = distinct !DISubprogram(name: "memset", scope: !1309, file: !1309, line: 57, type: !1310, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !1312)
!1309 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!98, !98, !99, !101}
!1312 = !{!1307, !1313, !1314}
!1313 = !DILocalVariable(name: "__ch", arg: 2, scope: !1308, file: !1309, line: 57, type: !99)
!1314 = !DILocalVariable(name: "__len", arg: 3, scope: !1308, file: !1309, line: 57, type: !101)
!1315 = !DILocation(line: 0, scope: !1308, inlinedAt: !1316)
!1316 = distinct !DILocation(line: 1137, column: 3, scope: !1299, inlinedAt: !1306)
!1317 = !DILocation(line: 59, column: 10, scope: !1308, inlinedAt: !1316)
!1318 = !DILocation(line: 49, column: 7, scope: !1319)
