; ModuleID = 'src/fmt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.Word = type { ptr, i32, i32, i8, i32, i64, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [42 x i8] c"Usage: %s [-WIDTH] [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [129 x i8] c"Reformat each paragraph in the FILE(s), writing to standard output.\0AThe option -WIDTH is an abbreviated form of --width=DIGITS.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"fmt\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [71 x i8] c"  -c, --crown-margin\0A         preserve indentation of first two lines\0A\00", align 1, !dbg !22

!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !2, line: 445, type: !173, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 450, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 27)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 23)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "crown", scope: !89, file: !2, line: 173, type: !195, isLocal: true, isDefinition: true)
!195 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "tagged", scope: !89, file: !2, line: 176, type: !195, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "split", scope: !89, file: !2, line: 179, type: !195, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "uniform", scope: !89, file: !2, line: 182, type: !195, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "goal_width", scope: !89, file: !2, line: 203, type: !93, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !92, line: 729, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 56)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !92, line: 736, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 75)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !216, file: !92, line: 575, type: !93, isLocal: true, isDefinition: true)
!216 = distinct !DISubprogram(name: "oputs_", scope: !92, file: !92, line: 573, type: !217, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !219)
!217 = !DISubroutineType(cc: DW_CC_nocall, types: !218)
!218 = !{null, !150, !150}
!219 = !{!220, !221, !222, !225, !226, !227, !228, !232, !233, !234, !235, !237, !289, !290, !291, !293, !294}
!220 = !DILocalVariable(name: "program", arg: 1, scope: !216, file: !92, line: 573, type: !150)
!221 = !DILocalVariable(name: "option", arg: 2, scope: !216, file: !92, line: 573, type: !150)
!222 = !DILocalVariable(name: "term", scope: !223, file: !92, line: 585, type: !150)
!223 = distinct !DILexicalBlock(scope: !224, file: !92, line: 582, column: 5)
!224 = distinct !DILexicalBlock(scope: !216, file: !92, line: 581, column: 7)
!225 = !DILocalVariable(name: "double_space", scope: !216, file: !92, line: 594, type: !195)
!226 = !DILocalVariable(name: "first_word", scope: !216, file: !92, line: 595, type: !150)
!227 = !DILocalVariable(name: "option_text", scope: !216, file: !92, line: 596, type: !150)
!228 = !DILocalVariable(name: "s", scope: !229, file: !92, line: 608, type: !150)
!229 = distinct !DILexicalBlock(scope: !230, file: !92, line: 605, column: 5)
!230 = distinct !DILexicalBlock(scope: !231, file: !92, line: 604, column: 12)
!231 = distinct !DILexicalBlock(scope: !216, file: !92, line: 597, column: 7)
!232 = !DILocalVariable(name: "spaces", scope: !229, file: !92, line: 609, type: !147)
!233 = !DILocalVariable(name: "anchor_len", scope: !216, file: !92, line: 620, type: !147)
!234 = !DILocalVariable(name: "desc_text", scope: !216, file: !92, line: 625, type: !150)
!235 = !DILocalVariable(name: "__ptr", scope: !236, file: !92, line: 644, type: !150)
!236 = distinct !DILexicalBlock(scope: !216, file: !92, line: 644, column: 3)
!237 = !DILocalVariable(name: "__stream", scope: !236, file: !92, line: 644, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !259, !261, !262, !263, !266, !267, !269, !270, !273, !275, !278, !281, !282, !283, !284, !285}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !242, line: 51, baseType: !93, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !241, file: !242, line: 54, baseType: !144, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !241, file: !242, line: 55, baseType: !144, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !241, file: !242, line: 56, baseType: !144, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !241, file: !242, line: 57, baseType: !144, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !241, file: !242, line: 58, baseType: !144, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !241, file: !242, line: 59, baseType: !144, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !241, file: !242, line: 60, baseType: !144, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !241, file: !242, line: 61, baseType: !144, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !241, file: !242, line: 64, baseType: !144, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !241, file: !242, line: 65, baseType: !144, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !241, file: !242, line: 66, baseType: !144, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !241, file: !242, line: 68, baseType: !257, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !242, line: 36, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !241, file: !242, line: 70, baseType: !260, size: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !241, file: !242, line: 72, baseType: !93, size: 32, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !242, line: 73, baseType: !93, size: 32, offset: 928)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !241, file: !242, line: 74, baseType: !264, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !265, line: 152, baseType: !155)
!265 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !241, file: !242, line: 77, baseType: !146, size: 16, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !241, file: !242, line: 78, baseType: !268, size: 8, offset: 1040)
!268 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !241, file: !242, line: 79, baseType: !69, size: 8, offset: 1048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !242, line: 81, baseType: !271, size: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !242, line: 43, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !242, line: 89, baseType: !274, size: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !265, line: 153, baseType: !155)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !241, file: !242, line: 91, baseType: !276, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !242, line: 37, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !241, file: !242, line: 92, baseType: !279, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !242, line: 38, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !241, file: !242, line: 93, baseType: !260, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !241, file: !242, line: 94, baseType: !145, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !241, file: !242, line: 95, baseType: !147, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !241, file: !242, line: 96, baseType: !93, size: 32, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !241, file: !242, line: 98, baseType: !286, size: 160, offset: 1568)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 20)
!289 = !DILocalVariable(name: "__cnt", scope: !236, file: !92, line: 644, type: !147)
!290 = !DILocalVariable(name: "url_program", scope: !216, file: !92, line: 648, type: !150)
!291 = !DILocalVariable(name: "__ptr", scope: !292, file: !92, line: 686, type: !150)
!292 = distinct !DILexicalBlock(scope: !216, file: !92, line: 686, column: 3)
!293 = !DILocalVariable(name: "__stream", scope: !292, file: !92, line: 686, type: !238)
!294 = !DILocalVariable(name: "__cnt", scope: !292, file: !92, line: 686, type: !147)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !92, line: 585, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !92, line: 586, type: !297, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !92, line: 595, type: !19, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !92, line: 620, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 6)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !173, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !297, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !19, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !185, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !92, line: 650, type: !297, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !306, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !306, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !92, line: 652, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 7)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !92, line: 653, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !92, line: 654, type: !74, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !92, line: 655, type: !74, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !92, line: 656, type: !74, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !92, line: 657, type: !74, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !92, line: 663, type: !325, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !92, line: 664, type: !74, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 17)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 40)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 15)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 61)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !92, line: 679, type: !185, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !92, line: 683, type: !297, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !92, line: 688, type: !297, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !92, line: 691, type: !330, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !92, line: 839, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 16)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !92, line: 840, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 22)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !92, line: 841, type: !357, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !92, line: 862, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !92, line: 868, type: !24, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !92, line: 875, type: !180, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 51)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 12)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 13)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !325, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 11)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !347, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 323, type: !375, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !306, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !297, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !297, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !330, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "max_width", scope: !89, file: !2, line: 189, type: !93, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "prefix_lead_space", scope: !89, file: !2, line: 197, type: !93, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "prefix", scope: !89, file: !2, line: 185, type: !150, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "prefix_full_length", scope: !89, file: !2, line: 194, type: !93, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "prefix_length", scope: !89, file: !2, line: 200, type: !93, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 514, type: !410, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 516, type: !347, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "tabs", scope: !89, file: !2, line: 231, type: !195, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "other_indent", scope: !89, file: !2, line: 240, type: !93, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "in_column", scope: !89, file: !2, line: 208, type: !93, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "next_prefix_indent", scope: !89, file: !2, line: 254, type: !93, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "next_char", scope: !89, file: !2, line: 250, type: !93, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "last_line_length", scope: !89, file: !2, line: 259, type: !93, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "out_column", scope: !89, file: !2, line: 211, type: !93, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "prefix_indent", scope: !89, file: !2, line: 234, type: !93, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "first_indent", scope: !89, file: !2, line: 237, type: !93, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "parabuf", scope: !89, file: !2, line: 215, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40000, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 5000)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "wptr", scope: !89, file: !2, line: 218, type: !144, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "unused_word_type", scope: !89, file: !2, line: 222, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 320000, elements: !481)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !2, line: 128, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Word", file: !2, line: 130, size: 320, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !468, file: !2, line: 135, baseType: !150, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !2, line: 136, baseType: !93, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !468, file: !2, line: 137, baseType: !93, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "paren", scope: !468, file: !2, line: 138, baseType: !99, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !468, file: !2, line: 139, baseType: !99, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "punct", scope: !468, file: !2, line: 140, baseType: !99, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !468, file: !2, line: 141, baseType: !99, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !468, file: !2, line: 145, baseType: !93, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "best_cost", scope: !468, file: !2, line: 146, baseType: !154, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_break", scope: !468, file: !2, line: 147, baseType: !480, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!481 = !{!482}
!482 = !DISubrange(count: 1000)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !92, line: 952, type: !398, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 798, type: !306, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 800, type: !297, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 802, type: !19, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "word_limit", scope: !89, file: !2, line: 227, type: !480, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 2560, elements: !75)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !496, line: 50, size: 256, elements: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!497 = !{!498, !499, !500, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !496, line: 52, baseType: !150, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !495, file: !496, line: 55, baseType: !93, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !496, line: 56, baseType: !501, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !495, file: !496, line: 57, baseType: !93, size: 32, offset: 192)
!503 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!504 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!505 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!506 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!507 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !510, line: 3, type: !357, isLocal: true, isDefinition: true)
!510 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "Version", scope: !513, file: !510, line: 3, type: !150, isLocal: false, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C11, file: !510, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !514, splitDebugInlining: false, nameTableKind: None)
!514 = !{!508, !511}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "file_name", scope: !517, file: !518, line: 45, type: !150, isLocal: true, isDefinition: true)
!517 = distinct !DICompileUnit(language: DW_LANG_C11, file: !518, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !519, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!519 = !{!520, !522, !524, !526, !515, !528}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !518, line: 121, type: !325, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !518, line: 121, type: !398, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !518, line: 123, type: !325, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !518, line: 126, type: !185, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !517, file: !518, line: 55, type: !195, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !532, file: !533, line: 66, type: !576, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C11, file: !533, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !534, globals: !535, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!534 = !{!145, !152}
!535 = !{!536, !538, !558, !560, !562, !564, !530, !566, !568, !570, !572, !574}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !533, line: 272, type: !297, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "old_file_name", scope: !540, file: !533, line: 304, type: !150, isLocal: true, isDefinition: true)
!540 = distinct !DISubprogram(name: "verror_at_line", scope: !533, file: !533, line: 298, type: !541, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !532, retainedNodes: !551)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !93, !93, !150, !99, !150, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !545)
!545 = !{!546, !548, !549, !550}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !544, file: !547, baseType: !99, size: 32)
!547 = !DIFile(filename: "lib/error.c", directory: "/src")
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !544, file: !547, baseType: !99, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !544, file: !547, baseType: !145, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !544, file: !547, baseType: !145, size: 64, offset: 128)
!551 = !{!552, !553, !554, !555, !556, !557}
!552 = !DILocalVariable(name: "status", arg: 1, scope: !540, file: !533, line: 298, type: !93)
!553 = !DILocalVariable(name: "errnum", arg: 2, scope: !540, file: !533, line: 298, type: !93)
!554 = !DILocalVariable(name: "file_name", arg: 3, scope: !540, file: !533, line: 298, type: !150)
!555 = !DILocalVariable(name: "line_number", arg: 4, scope: !540, file: !533, line: 298, type: !99)
!556 = !DILocalVariable(name: "message", arg: 5, scope: !540, file: !533, line: 298, type: !150)
!557 = !DILocalVariable(name: "args", arg: 6, scope: !540, file: !533, line: 298, type: !543)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "old_line_number", scope: !540, file: !533, line: 305, type: !99, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !533, line: 338, type: !19, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !533, line: 346, type: !330, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !533, line: 346, type: !173, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "error_message_count", scope: !532, file: !533, line: 69, type: !99, isLocal: false, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !532, file: !533, line: 295, type: !93, isLocal: false, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !533, line: 208, type: !325, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !533, line: 208, type: !84, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !533, line: 214, type: !297, isLocal: true, isDefinition: true)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null}
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "program_name", scope: !581, file: !582, line: 31, type: !150, isLocal: false, isDefinition: true)
!581 = distinct !DICompileUnit(language: DW_LANG_C11, file: !582, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !583, globals: !584, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!583 = !{!144}
!584 = !{!579, !585, !587}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !582, line: 46, type: !330, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !582, line: 49, type: !19, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "utf07FF", scope: !591, file: !592, line: 46, type: !619, isLocal: true, isDefinition: true)
!591 = distinct !DISubprogram(name: "proper_name_lite", scope: !592, file: !592, line: 38, type: !593, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !595, retainedNodes: !597)
!592 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!593 = !DISubroutineType(types: !594)
!594 = !{!150, !150, !150}
!595 = distinct !DICompileUnit(language: DW_LANG_C11, file: !592, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !596, splitDebugInlining: false, nameTableKind: None)
!596 = !{!589}
!597 = !{!598, !599, !600, !601, !606}
!598 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !591, file: !592, line: 38, type: !150)
!599 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !591, file: !592, line: 38, type: !150)
!600 = !DILocalVariable(name: "translation", scope: !591, file: !592, line: 40, type: !150)
!601 = !DILocalVariable(name: "w", scope: !591, file: !592, line: 47, type: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !603, line: 37, baseType: !604)
!603 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !265, line: 57, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !265, line: 42, baseType: !99)
!606 = !DILocalVariable(name: "mbs", scope: !591, file: !592, line: 48, type: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !608, line: 6, baseType: !609)
!608 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !610, line: 21, baseType: !611)
!610 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 13, size: 64, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !611, file: !610, line: 15, baseType: !93, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !611, file: !610, line: 20, baseType: !615, size: 32, offset: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !611, file: !610, line: 16, size: 32, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !615, file: !610, line: 18, baseType: !99, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !615, file: !610, line: 19, baseType: !19, size: 32)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 16, elements: !174)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !622, line: 78, type: !330, isLocal: true, isDefinition: true)
!622 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !622, line: 79, type: !306, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !622, line: 80, type: !403, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !622, line: 81, type: !403, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !622, line: 82, type: !286, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !622, line: 83, type: !173, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !622, line: 84, type: !330, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !622, line: 85, type: !325, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !622, line: 86, type: !325, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !622, line: 87, type: !330, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !643, file: !622, line: 76, type: !715, isLocal: false, isDefinition: true)
!643 = distinct !DICompileUnit(language: DW_LANG_C11, file: !622, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !644, retainedTypes: !650, globals: !651, splitDebugInlining: false, nameTableKind: None)
!644 = !{!105, !645, !119}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !106, line: 254, baseType: !99, size: 32, elements: !646)
!646 = !{!647, !648, !649}
!647 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!648 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!649 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!650 = !{!93, !146, !147}
!651 = !{!620, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !652, !656, !666, !668, !673, !675, !677, !679, !681, !704, !711, !713}
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !643, file: !622, line: 92, type: !654, isLocal: false, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 320, elements: !75)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !643, file: !622, line: 1040, type: !658, isLocal: false, isDefinition: true)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !622, line: 56, size: 448, elements: !659)
!659 = !{!660, !661, !662, !664, !665}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !658, file: !622, line: 59, baseType: !105, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !658, file: !622, line: 62, baseType: !93, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !658, file: !622, line: 66, baseType: !663, size: 256, offset: 64)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !331)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !658, file: !622, line: 69, baseType: !150, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !658, file: !622, line: 72, baseType: !150, size: 64, offset: 384)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !643, file: !622, line: 107, type: !658, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "slot0", scope: !643, file: !622, line: 831, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 256)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !622, line: 321, type: !173, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !622, line: 357, type: !173, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !622, line: 358, type: !173, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !622, line: 199, type: !325, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "quote", scope: !683, file: !622, line: 228, type: !702, isLocal: true, isDefinition: true)
!683 = distinct !DISubprogram(name: "gettext_quote", scope: !622, file: !622, line: 197, type: !684, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !643, retainedNodes: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{!150, !150, !105}
!686 = !{!687, !688, !689, !690, !691}
!687 = !DILocalVariable(name: "msgid", arg: 1, scope: !683, file: !622, line: 197, type: !150)
!688 = !DILocalVariable(name: "s", arg: 2, scope: !683, file: !622, line: 197, type: !105)
!689 = !DILocalVariable(name: "translation", scope: !683, file: !622, line: 199, type: !150)
!690 = !DILocalVariable(name: "w", scope: !683, file: !622, line: 229, type: !602)
!691 = !DILocalVariable(name: "mbs", scope: !683, file: !622, line: 230, type: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !608, line: 6, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !610, line: 21, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 13, size: 64, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !694, file: !610, line: 15, baseType: !93, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !694, file: !610, line: 20, baseType: !698, size: 32, offset: 32)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !694, file: !610, line: 16, size: 32, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !698, file: !610, line: 18, baseType: !99, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !698, file: !610, line: 19, baseType: !19, size: 32)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !703)
!703 = !{!175, !21}
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "slotvec", scope: !643, file: !622, line: 834, type: !706, isLocal: true, isDefinition: true)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !622, line: 823, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !707, file: !622, line: 825, baseType: !147, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !707, file: !622, line: 826, baseType: !144, size: 64, offset: 64)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "nslots", scope: !643, file: !622, line: 832, type: !93, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "slotvec0", scope: !643, file: !622, line: 833, type: !707, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 704, elements: !411)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !719, line: 67, type: !398, isLocal: true, isDefinition: true)
!719 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !719, line: 69, type: !325, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !719, line: 83, type: !325, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !719, line: 83, type: !19, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !719, line: 85, type: !173, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !719, line: 88, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 171)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !719, line: 88, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 34)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !719, line: 105, type: !375, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !719, line: 109, type: !190, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !719, line: 113, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 28)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !719, line: 120, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 32)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !719, line: 127, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 36)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !719, line: 134, type: !352, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !719, line: 142, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 44)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !719, line: 150, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 48)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !719, line: 159, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 52)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !719, line: 170, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 60)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !719, line: 248, type: !286, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !719, line: 248, type: !380, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !719, line: 254, type: !286, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !719, line: 254, type: !164, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !719, line: 254, type: !352, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !719, line: 259, type: !3, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !719, line: 259, type: !793, isLocal: true, isDefinition: true)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 29)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !798, file: !799, line: 26, type: !801, isLocal: false, isDefinition: true)
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !800, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!800 = !{!796}
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 376, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 47)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "exit_failure", scope: !806, file: !807, line: 24, type: !809, isLocal: false, isDefinition: true)
!806 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !808, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!808 = !{!804}
!809 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !93)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !812, line: 34, type: !185, isLocal: true, isDefinition: true)
!812 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !812, line: 34, type: !325, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !812, line: 34, type: !347, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !819, line: 80, type: !325, isLocal: true, isDefinition: true)
!819 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !822, line: 108, type: !69, isLocal: true, isDefinition: true)
!822 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "internal_state", scope: !825, file: !822, line: 97, type: !828, isLocal: true, isDefinition: true)
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !822, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !826, globals: !827, splitDebugInlining: false, nameTableKind: None)
!826 = !{!145, !147, !152}
!827 = !{!820, !823}
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !608, line: 6, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !610, line: 21, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 13, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !830, file: !610, line: 15, baseType: !93, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !830, file: !610, line: 20, baseType: !834, size: 32, offset: 32)
!834 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !830, file: !610, line: 16, size: 32, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !834, file: !610, line: 18, baseType: !99, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !834, file: !610, line: 19, baseType: !19, size: 32)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !840, line: 35, type: !306, isLocal: true, isDefinition: true)
!840 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!841 = distinct !DICompileUnit(language: DW_LANG_C11, file: !842, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !843, splitDebugInlining: false, nameTableKind: None)
!842 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!843 = !{!134}
!844 = distinct !DICompileUnit(language: DW_LANG_C11, file: !845, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!846 = distinct !DICompileUnit(language: DW_LANG_C11, file: !847, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !848, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!848 = !{!145}
!849 = distinct !DICompileUnit(language: DW_LANG_C11, file: !850, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!850 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!851 = distinct !DICompileUnit(language: DW_LANG_C11, file: !852, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !848, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!853 = distinct !DICompileUnit(language: DW_LANG_C11, file: !854, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !719, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !856, retainedTypes: !848, globals: !860, splitDebugInlining: false, nameTableKind: None)
!856 = !{!857}
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 40, baseType: !99, size: 32, elements: !858)
!858 = !{!859}
!859 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!860 = !{!717, !720, !722, !724, !726, !728, !733, !738, !740, !742, !747, !752, !757, !759, !764, !769, !774, !779, !781, !783, !785, !787, !789, !791}
!861 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !863, retainedTypes: !894, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!863 = !{!864, !876}
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !865, file: !862, line: 188, baseType: !99, size: 32, elements: !874)
!865 = distinct !DISubprogram(name: "x2nrealloc", scope: !862, file: !862, line: 176, type: !866, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !861, retainedNodes: !869)
!866 = !DISubroutineType(types: !867)
!867 = !{!145, !145, !868, !147}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!869 = !{!870, !871, !872, !873}
!870 = !DILocalVariable(name: "p", arg: 1, scope: !865, file: !862, line: 176, type: !145)
!871 = !DILocalVariable(name: "pn", arg: 2, scope: !865, file: !862, line: 176, type: !868)
!872 = !DILocalVariable(name: "s", arg: 3, scope: !865, file: !862, line: 176, type: !147)
!873 = !DILocalVariable(name: "n", scope: !865, file: !862, line: 178, type: !147)
!874 = !{!875}
!875 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !877, file: !862, line: 228, baseType: !99, size: 32, elements: !874)
!877 = distinct !DISubprogram(name: "xpalloc", scope: !862, file: !862, line: 223, type: !878, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !861, retainedNodes: !884)
!878 = !DISubroutineType(types: !879)
!879 = !{!145, !145, !880, !881, !883, !881}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !882, line: 130, baseType: !883)
!882 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !148, line: 35, baseType: !155)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893}
!885 = !DILocalVariable(name: "pa", arg: 1, scope: !877, file: !862, line: 223, type: !145)
!886 = !DILocalVariable(name: "pn", arg: 2, scope: !877, file: !862, line: 223, type: !880)
!887 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !877, file: !862, line: 223, type: !881)
!888 = !DILocalVariable(name: "n_max", arg: 4, scope: !877, file: !862, line: 223, type: !883)
!889 = !DILocalVariable(name: "s", arg: 5, scope: !877, file: !862, line: 223, type: !881)
!890 = !DILocalVariable(name: "n0", scope: !877, file: !862, line: 230, type: !881)
!891 = !DILocalVariable(name: "n", scope: !877, file: !862, line: 237, type: !881)
!892 = !DILocalVariable(name: "nbytes", scope: !877, file: !862, line: 248, type: !881)
!893 = !DILocalVariable(name: "adjusted_nbytes", scope: !877, file: !862, line: 252, type: !881)
!894 = !{!144, !145, !195, !155, !149}
!895 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !896, splitDebugInlining: false, nameTableKind: None)
!896 = !{!810, !813, !815}
!897 = distinct !DICompileUnit(language: DW_LANG_C11, file: !898, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !899, globals: !908, splitDebugInlining: false, nameTableKind: None)
!898 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!899 = !{!900, !97}
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !901, line: 30, baseType: !99, size: 32, elements: !902)
!901 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!902 = !{!903, !904, !905, !906, !907}
!903 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!904 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!905 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!906 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!907 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!908 = !{!817}
!909 = distinct !DICompileUnit(language: DW_LANG_C11, file: !910, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !911, retainedTypes: !912, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!911 = !{!900, !119}
!912 = !{!93, !146, !144, !195, !149, !913}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !914, line: 102, baseType: !915)
!914 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !265, line: 73, baseType: !149)
!916 = distinct !DICompileUnit(language: DW_LANG_C11, file: !917, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !848, splitDebugInlining: false, nameTableKind: None)
!917 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!918 = distinct !DICompileUnit(language: DW_LANG_C11, file: !919, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!920 = distinct !DICompileUnit(language: DW_LANG_C11, file: !921, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !922, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!922 = !{!195, !149, !145}
!923 = distinct !DICompileUnit(language: DW_LANG_C11, file: !840, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !924, splitDebugInlining: false, nameTableKind: None)
!924 = !{!925, !838}
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !840, line: 35, type: !173, isLocal: true, isDefinition: true)
!927 = distinct !DICompileUnit(language: DW_LANG_C11, file: !928, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!929 = distinct !DICompileUnit(language: DW_LANG_C11, file: !930, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !848, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!931 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!932 = !{i32 7, !"Dwarf Version", i32 5}
!933 = !{i32 2, !"Debug Info Version", i32 3}
!934 = !{i32 1, !"wchar_size", i32 4}
!935 = !{i32 8, !"PIC Level", i32 2}
!936 = !{i32 7, !"PIE Level", i32 2}
!937 = !{i32 7, !"uwtable", i32 2}
!938 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 262, type: !939, scopeLine: 263, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !941)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !93}
!941 = !{!942}
!942 = !DILocalVariable(name: "status", arg: 1, scope: !938, file: !2, line: 262, type: !93)
!943 = !DILocation(line: 0, scope: !938)
!944 = !DILocation(line: 264, column: 14, scope: !945)
!945 = distinct !DILexicalBlock(scope: !938, file: !2, line: 264, column: 7)
!946 = !DILocation(line: 264, column: 7, scope: !938)
!947 = !DILocation(line: 265, column: 5, scope: !948)
!948 = distinct !DILexicalBlock(scope: !945, file: !2, line: 265, column: 5)
!949 = !{!950, !950, i64 0}
!950 = !{!"any pointer", !951, i64 0}
!951 = !{!"omnipotent char", !952, i64 0}
!952 = !{!"Simple C/C++ TBAA"}
!953 = !DILocation(line: 268, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !945, file: !2, line: 267, column: 5)
!955 = !DILocation(line: 269, column: 7, scope: !954)
!956 = !DILocation(line: 729, column: 3, scope: !957, inlinedAt: !959)
!957 = distinct !DISubprogram(name: "emit_stdin_note", scope: !92, file: !92, line: 727, type: !577, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !958)
!958 = !{}
!959 = distinct !DILocation(line: 274, column: 7, scope: !954)
!960 = !DILocation(line: 736, column: 3, scope: !961, inlinedAt: !962)
!961 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !92, file: !92, line: 734, type: !577, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !958)
!962 = distinct !DILocation(line: 275, column: 7, scope: !954)
!963 = !DILocation(line: 277, column: 7, scope: !954)
!964 = !DILocation(line: 281, column: 7, scope: !954)
!965 = !DILocation(line: 286, column: 7, scope: !954)
!966 = !DILocation(line: 290, column: 7, scope: !954)
!967 = !DILocation(line: 294, column: 7, scope: !954)
!968 = !DILocation(line: 298, column: 7, scope: !954)
!969 = !DILocation(line: 304, column: 7, scope: !954)
!970 = !DILocation(line: 308, column: 7, scope: !954)
!971 = !DILocation(line: 309, column: 7, scope: !954)
!972 = !DILocalVariable(name: "program", arg: 1, scope: !973, file: !92, line: 836, type: !150)
!973 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !92, file: !92, line: 836, type: !974, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !976)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !150}
!976 = !{!972, !977, !984, !985, !987, !988}
!977 = !DILocalVariable(name: "infomap", scope: !973, file: !92, line: 838, type: !978)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 896, elements: !326)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !973, file: !92, line: 838, size: 128, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !980, file: !92, line: 838, baseType: !150, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !980, file: !92, line: 838, baseType: !150, size: 64, offset: 64)
!984 = !DILocalVariable(name: "node", scope: !973, file: !92, line: 848, type: !150)
!985 = !DILocalVariable(name: "map_prog", scope: !973, file: !92, line: 849, type: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!987 = !DILocalVariable(name: "lc_messages", scope: !973, file: !92, line: 861, type: !150)
!988 = !DILocalVariable(name: "url_program", scope: !973, file: !92, line: 874, type: !150)
!989 = !DILocation(line: 0, scope: !973, inlinedAt: !990)
!990 = distinct !DILocation(line: 310, column: 7, scope: !954)
!991 = !DILocation(line: 857, column: 3, scope: !973, inlinedAt: !990)
!992 = !DILocation(line: 861, column: 29, scope: !973, inlinedAt: !990)
!993 = !DILocation(line: 862, column: 7, scope: !994, inlinedAt: !990)
!994 = distinct !DILexicalBlock(scope: !973, file: !92, line: 862, column: 7)
!995 = !DILocation(line: 862, column: 19, scope: !994, inlinedAt: !990)
!996 = !DILocation(line: 862, column: 22, scope: !994, inlinedAt: !990)
!997 = !DILocation(line: 862, column: 7, scope: !973, inlinedAt: !990)
!998 = !DILocation(line: 868, column: 7, scope: !999, inlinedAt: !990)
!999 = distinct !DILexicalBlock(scope: !994, file: !92, line: 863, column: 5)
!1000 = !DILocation(line: 870, column: 5, scope: !999, inlinedAt: !990)
!1001 = !DILocation(line: 875, column: 3, scope: !973, inlinedAt: !990)
!1002 = !DILocation(line: 877, column: 3, scope: !973, inlinedAt: !990)
!1003 = !DILocation(line: 312, column: 3, scope: !938)
!1004 = !DISubprogram(name: "dcgettext", scope: !1005, file: !1005, line: 51, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1005 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!144, !150, !150, !93}
!1008 = !DISubprogram(name: "__fprintf_chk", scope: !1009, file: !1009, line: 93, type: !1010, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1009 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!93, !1012, !93, !1013, null}
!1012 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!1013 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!1014 = !DISubprogram(name: "__printf_chk", scope: !1009, file: !1009, line: 95, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!93, !93, !1013, null}
!1017 = !DISubprogram(name: "fputs_unlocked", scope: !1018, file: !1018, line: 691, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1018 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!93, !1013, !1012}
!1021 = !DILocation(line: 0, scope: !216)
!1022 = !DILocation(line: 581, column: 7, scope: !224)
!1023 = !{!1024, !1024, i64 0}
!1024 = !{!"int", !951, i64 0}
!1025 = !DILocation(line: 581, column: 19, scope: !224)
!1026 = !DILocation(line: 581, column: 7, scope: !216)
!1027 = !DILocation(line: 585, column: 26, scope: !223)
!1028 = !DILocation(line: 0, scope: !223)
!1029 = !DILocation(line: 586, column: 23, scope: !223)
!1030 = !DILocation(line: 586, column: 28, scope: !223)
!1031 = !DILocation(line: 586, column: 32, scope: !223)
!1032 = !{!951, !951, i64 0}
!1033 = !DILocation(line: 586, column: 38, scope: !223)
!1034 = !DILocalVariable(name: "__s1", arg: 1, scope: !1035, file: !1036, line: 1359, type: !150)
!1035 = distinct !DISubprogram(name: "streq", scope: !1036, file: !1036, line: 1359, type: !1037, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1039)
!1036 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!195, !150, !150}
!1039 = !{!1034, !1040}
!1040 = !DILocalVariable(name: "__s2", arg: 2, scope: !1035, file: !1036, line: 1359, type: !150)
!1041 = !DILocation(line: 0, scope: !1035, inlinedAt: !1042)
!1042 = distinct !DILocation(line: 586, column: 41, scope: !223)
!1043 = !DILocation(line: 1361, column: 11, scope: !1035, inlinedAt: !1042)
!1044 = !DILocation(line: 1361, column: 10, scope: !1035, inlinedAt: !1042)
!1045 = !DILocation(line: 586, column: 19, scope: !223)
!1046 = !DILocation(line: 587, column: 5, scope: !223)
!1047 = !DILocation(line: 588, column: 7, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !216, file: !92, line: 588, column: 7)
!1049 = !DILocation(line: 588, column: 7, scope: !216)
!1050 = !DILocation(line: 590, column: 7, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1048, file: !92, line: 589, column: 5)
!1052 = !DILocation(line: 591, column: 7, scope: !1051)
!1053 = !DILocation(line: 595, column: 37, scope: !216)
!1054 = !DILocation(line: 595, column: 35, scope: !216)
!1055 = !DILocation(line: 596, column: 29, scope: !216)
!1056 = !DILocation(line: 597, column: 8, scope: !231)
!1057 = !DILocation(line: 597, column: 7, scope: !216)
!1058 = !DILocation(line: 604, column: 24, scope: !230)
!1059 = !DILocation(line: 604, column: 12, scope: !231)
!1060 = !DILocation(line: 0, scope: !229)
!1061 = !DILocation(line: 610, column: 16, scope: !229)
!1062 = !DILocation(line: 610, column: 7, scope: !229)
!1063 = !DILocation(line: 611, column: 21, scope: !229)
!1064 = !{!1065, !1065, i64 0}
!1065 = !{!"short", !951, i64 0}
!1066 = !DILocation(line: 611, column: 19, scope: !229)
!1067 = !DILocation(line: 611, column: 16, scope: !229)
!1068 = !DILocation(line: 610, column: 30, scope: !229)
!1069 = distinct !{!1069, !1062, !1063, !1070}
!1070 = !{!"llvm.loop.mustprogress"}
!1071 = !DILocation(line: 612, column: 18, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !229, file: !92, line: 612, column: 11)
!1073 = !DILocation(line: 612, column: 11, scope: !229)
!1074 = !DILocation(line: 618, column: 5, scope: !229)
!1075 = !DILocation(line: 620, column: 23, scope: !216)
!1076 = !DILocation(line: 625, column: 39, scope: !216)
!1077 = !DILocation(line: 626, column: 3, scope: !216)
!1078 = !DILocation(line: 626, column: 10, scope: !216)
!1079 = !DILocation(line: 626, column: 21, scope: !216)
!1080 = !DILocation(line: 628, column: 44, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !92, line: 628, column: 11)
!1082 = distinct !DILexicalBlock(scope: !216, file: !92, line: 627, column: 5)
!1083 = !DILocation(line: 628, column: 32, scope: !1081)
!1084 = !DILocation(line: 628, column: 49, scope: !1081)
!1085 = !DILocation(line: 628, column: 11, scope: !1082)
!1086 = !DILocation(line: 630, column: 11, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1082, file: !92, line: 630, column: 11)
!1088 = !DILocation(line: 630, column: 11, scope: !1082)
!1089 = !DILocation(line: 632, column: 26, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !92, line: 632, column: 15)
!1091 = distinct !DILexicalBlock(scope: !1087, file: !92, line: 631, column: 9)
!1092 = !DILocation(line: 632, column: 34, scope: !1090)
!1093 = !DILocation(line: 632, column: 37, scope: !1090)
!1094 = !DILocation(line: 632, column: 15, scope: !1091)
!1095 = !DILocation(line: 636, column: 16, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1091, file: !92, line: 636, column: 15)
!1097 = !DILocation(line: 636, column: 29, scope: !1096)
!1098 = !DILocation(line: 640, column: 16, scope: !1082)
!1099 = distinct !{!1099, !1077, !1100, !1070}
!1100 = !DILocation(line: 641, column: 5, scope: !216)
!1101 = !DILocation(line: 644, column: 3, scope: !216)
!1102 = !DILocation(line: 0, scope: !1035, inlinedAt: !1103)
!1103 = distinct !DILocation(line: 648, column: 31, scope: !216)
!1104 = !DILocation(line: 0, scope: !1035, inlinedAt: !1105)
!1105 = distinct !DILocation(line: 649, column: 31, scope: !216)
!1106 = !DILocation(line: 0, scope: !1035, inlinedAt: !1107)
!1107 = distinct !DILocation(line: 650, column: 31, scope: !216)
!1108 = !DILocation(line: 0, scope: !1035, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 651, column: 31, scope: !216)
!1110 = !DILocation(line: 0, scope: !1035, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 652, column: 31, scope: !216)
!1112 = !DILocation(line: 0, scope: !1035, inlinedAt: !1113)
!1113 = distinct !DILocation(line: 653, column: 31, scope: !216)
!1114 = !DILocation(line: 0, scope: !1035, inlinedAt: !1115)
!1115 = distinct !DILocation(line: 654, column: 31, scope: !216)
!1116 = !DILocation(line: 0, scope: !1035, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 655, column: 31, scope: !216)
!1118 = !DILocation(line: 0, scope: !1035, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 656, column: 31, scope: !216)
!1120 = !DILocation(line: 0, scope: !1035, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 657, column: 31, scope: !216)
!1122 = !DILocation(line: 663, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !216, file: !92, line: 663, column: 7)
!1124 = !DILocation(line: 664, column: 7, scope: !1123)
!1125 = !DILocation(line: 664, column: 10, scope: !1123)
!1126 = !DILocation(line: 663, column: 7, scope: !216)
!1127 = !DILocation(line: 669, column: 7, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1123, file: !92, line: 665, column: 5)
!1129 = !DILocation(line: 671, column: 5, scope: !1128)
!1130 = !DILocation(line: 676, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1123, file: !92, line: 673, column: 5)
!1132 = !DILocation(line: 679, column: 3, scope: !216)
!1133 = !DILocation(line: 683, column: 3, scope: !216)
!1134 = !DILocation(line: 686, column: 3, scope: !216)
!1135 = !DILocation(line: 688, column: 3, scope: !216)
!1136 = !DILocation(line: 691, column: 3, scope: !216)
!1137 = !DILocation(line: 695, column: 3, scope: !216)
!1138 = !DILocation(line: 696, column: 1, scope: !216)
!1139 = !DISubprogram(name: "setlocale", scope: !1140, file: !1140, line: 122, type: !1141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1140 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!144, !93, !150}
!1143 = !DISubprogram(name: "strncmp", scope: !1144, file: !1144, line: 159, type: !1145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1144 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!93, !150, !150, !147}
!1147 = !DISubprogram(name: "exit", scope: !1148, file: !1148, line: 624, type: !939, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1148 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1149 = !DISubprogram(name: "getenv", scope: !1148, file: !1148, line: 641, type: !1150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!144, !150}
!1152 = !DISubprogram(name: "strcmp", scope: !1144, file: !1144, line: 156, type: !1153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!93, !150, !150}
!1155 = !DISubprogram(name: "strspn", scope: !1144, file: !1144, line: 297, type: !1156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!149, !150, !150}
!1158 = !DISubprogram(name: "strchr", scope: !1144, file: !1144, line: 246, type: !1159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!144, !150, !93}
!1161 = !DISubprogram(name: "__ctype_b_loc", scope: !120, file: !120, line: 79, type: !1162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!1167 = !DISubprogram(name: "strcspn", scope: !1144, file: !1144, line: 293, type: !1156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1168 = !DISubprogram(name: "fwrite_unlocked", scope: !1018, file: !1018, line: 704, type: !1169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !958)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!147, !1171, !147, !147, !1012}
!1171 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1174 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 332, type: !1175, scopeLine: 333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1178)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!93, !93, !1177}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1192}
!1179 = !DILocalVariable(name: "argc", arg: 1, scope: !1174, file: !2, line: 332, type: !93)
!1180 = !DILocalVariable(name: "argv", arg: 2, scope: !1174, file: !2, line: 332, type: !1177)
!1181 = !DILocalVariable(name: "optchar", scope: !1174, file: !2, line: 334, type: !93)
!1182 = !DILocalVariable(name: "ok", scope: !1174, file: !2, line: 335, type: !195)
!1183 = !DILocalVariable(name: "max_width_option", scope: !1174, file: !2, line: 336, type: !150)
!1184 = !DILocalVariable(name: "goal_width_option", scope: !1174, file: !2, line: 337, type: !150)
!1185 = !DILocalVariable(name: "have_read_stdin", scope: !1174, file: !2, line: 425, type: !195)
!1186 = !DILocalVariable(name: "file", scope: !1187, file: !2, line: 436, type: !144)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !2, line: 435, column: 9)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 434, column: 7)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 434, column: 7)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !2, line: 433, column: 5)
!1191 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 427, column: 7)
!1192 = !DILocalVariable(name: "in_stream", scope: !1193, file: !2, line: 444, type: !238)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !2, line: 443, column: 13)
!1194 = distinct !DILexicalBlock(scope: !1187, file: !2, line: 437, column: 15)
!1195 = !DILocation(line: 0, scope: !1174)
!1196 = !DILocation(line: 340, column: 21, scope: !1174)
!1197 = !DILocation(line: 340, column: 3, scope: !1174)
!1198 = !DILocation(line: 341, column: 3, scope: !1174)
!1199 = !DILocation(line: 342, column: 3, scope: !1174)
!1200 = !DILocation(line: 343, column: 3, scope: !1174)
!1201 = !DILocation(line: 345, column: 3, scope: !1174)
!1202 = !DILocation(line: 347, column: 12, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 347, column: 7)
!1204 = !DILocation(line: 347, column: 16, scope: !1203)
!1205 = !DILocation(line: 347, column: 19, scope: !1203)
!1206 = !DILocation(line: 347, column: 30, scope: !1203)
!1207 = !DILocation(line: 347, column: 37, scope: !1203)
!1208 = !DILocation(line: 347, column: 51, scope: !1203)
!1209 = !DILocalVariable(name: "c", arg: 1, scope: !1210, file: !1211, line: 233, type: !93)
!1210 = distinct !DISubprogram(name: "c_isdigit", scope: !1211, file: !1211, line: 233, type: !1212, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1214)
!1211 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!195, !93}
!1214 = !{!1209}
!1215 = !DILocation(line: 0, scope: !1210, inlinedAt: !1216)
!1216 = distinct !DILocation(line: 347, column: 40, scope: !1203)
!1217 = !DILocation(line: 235, column: 3, scope: !1210, inlinedAt: !1216)
!1218 = !DILocation(line: 347, column: 7, scope: !1174)
!1219 = !DILocation(line: 353, column: 17, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1203, file: !2, line: 348, column: 5)
!1221 = !DILocation(line: 353, column: 15, scope: !1220)
!1222 = !DILocation(line: 355, column: 11, scope: !1220)
!1223 = !DILocation(line: 356, column: 5, scope: !1220)
!1224 = !DILocation(line: 358, column: 3, scope: !1174)
!1225 = !DILocation(line: 358, column: 21, scope: !1174)
!1226 = !DILocation(line: 0, scope: !1210, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 364, column: 13, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !2, line: 364, column: 13)
!1229 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 362, column: 7)
!1230 = !DILocation(line: 235, column: 3, scope: !1210, inlinedAt: !1227)
!1231 = !DILocation(line: 364, column: 13, scope: !1229)
!1232 = !DILocation(line: 365, column: 11, scope: !1228)
!1233 = !DILocation(line: 368, column: 9, scope: !1229)
!1234 = !DILocation(line: 371, column: 15, scope: !1229)
!1235 = !DILocation(line: 372, column: 9, scope: !1229)
!1236 = !DILocation(line: 375, column: 15, scope: !1229)
!1237 = !DILocation(line: 376, column: 9, scope: !1229)
!1238 = !DILocation(line: 379, column: 16, scope: !1229)
!1239 = !DILocation(line: 380, column: 9, scope: !1229)
!1240 = !DILocation(line: 383, column: 17, scope: !1229)
!1241 = !DILocation(line: 384, column: 9, scope: !1229)
!1242 = !DILocation(line: 387, column: 28, scope: !1229)
!1243 = !DILocation(line: 388, column: 9, scope: !1229)
!1244 = distinct !{!1244, !1224, !1245, !1070}
!1245 = !DILocation(line: 402, column: 7, scope: !1174)
!1246 = !DILocation(line: 391, column: 29, scope: !1229)
!1247 = !DILocation(line: 392, column: 9, scope: !1229)
!1248 = !DILocation(line: 395, column: 21, scope: !1229)
!1249 = !DILocalVariable(name: "p", arg: 1, scope: !1250, file: !2, line: 468, type: !144)
!1250 = distinct !DISubprogram(name: "set_prefix", scope: !2, file: !2, line: 468, type: !1251, scopeLine: 469, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1253)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{null, !144}
!1253 = !{!1249, !1254}
!1254 = !DILocalVariable(name: "s", scope: !1250, file: !2, line: 470, type: !144)
!1255 = !DILocation(line: 0, scope: !1250, inlinedAt: !1256)
!1256 = distinct !DILocation(line: 395, column: 9, scope: !1229)
!1257 = !DILocation(line: 472, column: 21, scope: !1250, inlinedAt: !1256)
!1258 = !DILocation(line: 473, column: 10, scope: !1250, inlinedAt: !1256)
!1259 = !DILocation(line: 473, column: 13, scope: !1250, inlinedAt: !1256)
!1260 = !DILocation(line: 473, column: 3, scope: !1250, inlinedAt: !1256)
!1261 = !DILocation(line: 475, column: 24, scope: !1262, inlinedAt: !1256)
!1262 = distinct !DILexicalBlock(scope: !1250, file: !2, line: 474, column: 5)
!1263 = !DILocation(line: 476, column: 8, scope: !1262, inlinedAt: !1256)
!1264 = distinct !{!1264, !1260, !1265, !1070}
!1265 = !DILocation(line: 477, column: 5, scope: !1250, inlinedAt: !1256)
!1266 = !DILocation(line: 478, column: 10, scope: !1250, inlinedAt: !1256)
!1267 = !DILocation(line: 479, column: 24, scope: !1250, inlinedAt: !1256)
!1268 = !DILocation(line: 479, column: 22, scope: !1250, inlinedAt: !1256)
!1269 = !DILocation(line: 480, column: 9, scope: !1250, inlinedAt: !1256)
!1270 = !DILocation(line: 481, column: 3, scope: !1250, inlinedAt: !1256)
!1271 = !DILocation(line: 481, column: 12, scope: !1250, inlinedAt: !1256)
!1272 = !DILocation(line: 481, column: 16, scope: !1250, inlinedAt: !1256)
!1273 = !DILocation(line: 481, column: 19, scope: !1250, inlinedAt: !1256)
!1274 = !DILocation(line: 481, column: 25, scope: !1250, inlinedAt: !1256)
!1275 = distinct !{!1275, !1270, !1276, !1070}
!1276 = !DILocation(line: 482, column: 6, scope: !1250, inlinedAt: !1256)
!1277 = !DILocation(line: 483, column: 6, scope: !1250, inlinedAt: !1256)
!1278 = !DILocation(line: 484, column: 21, scope: !1250, inlinedAt: !1256)
!1279 = !DILocation(line: 484, column: 19, scope: !1250, inlinedAt: !1256)
!1280 = !DILocation(line: 484, column: 17, scope: !1250, inlinedAt: !1256)
!1281 = !DILocation(line: 396, column: 9, scope: !1229)
!1282 = !DILocation(line: 398, column: 7, scope: !1229)
!1283 = !DILocation(line: 400, column: 7, scope: !1229)
!1284 = !DILocation(line: 404, column: 7, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 404, column: 7)
!1286 = !DILocation(line: 404, column: 7, scope: !1174)
!1287 = !DILocation(line: 409, column: 31, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1285, file: !2, line: 405, column: 5)
!1289 = !DILocation(line: 408, column: 19, scope: !1288)
!1290 = !DILocation(line: 408, column: 17, scope: !1288)
!1291 = !DILocation(line: 410, column: 5, scope: !1288)
!1292 = !DILocation(line: 412, column: 7, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 412, column: 7)
!1294 = !DILocation(line: 0, scope: !1293)
