; ModuleID = 'src/hostid.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [89 x i8] c"Usage: %s [OPTION]\0APrint the numeric identifier (in hexadecimal) for the current host.\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [7 x i8] c"hostid\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !27
@.str.6 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !32

!161 = !DISubrange(count: 15)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !65, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 61)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !65, line: 679, type: !122, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !65, line: 683, type: !99, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !65, line: 688, type: !99, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !65, line: 691, type: !135, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !65, line: 839, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 16)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !65, line: 840, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 22)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !65, line: 841, type: !159, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !65, line: 862, type: !106, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !65, line: 868, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 71)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !65, line: 875, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 27)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !65, line: 877, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 51)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !65, line: 877, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 12)
!209 = !{!210, !211, !212, !215, !217, !218, !219, !223, !224, !225, !226, !228, !282, !283, !284, !286, !287}
!210 = !DILocalVariable(name: "program", arg: 1, scope: !64, file: !65, line: 573, type: !68)
!211 = !DILocalVariable(name: "option", arg: 2, scope: !64, file: !65, line: 573, type: !68)
!212 = !DILocalVariable(name: "term", scope: !213, file: !65, line: 585, type: !68)
!213 = distinct !DILexicalBlock(scope: !214, file: !65, line: 582, column: 5)
!214 = distinct !DILexicalBlock(scope: !64, file: !65, line: 581, column: 7)
!215 = !DILocalVariable(name: "double_space", scope: !64, file: !65, line: 594, type: !216)
!216 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!217 = !DILocalVariable(name: "first_word", scope: !64, file: !65, line: 595, type: !68)
!218 = !DILocalVariable(name: "option_text", scope: !64, file: !65, line: 596, type: !68)
!219 = !DILocalVariable(name: "s", scope: !220, file: !65, line: 608, type: !68)
!220 = distinct !DILexicalBlock(scope: !221, file: !65, line: 605, column: 5)
!221 = distinct !DILexicalBlock(scope: !222, file: !65, line: 604, column: 12)
!222 = distinct !DILexicalBlock(scope: !64, file: !65, line: 597, column: 7)
!223 = !DILocalVariable(name: "spaces", scope: !220, file: !65, line: 609, type: !92)
!224 = !DILocalVariable(name: "anchor_len", scope: !64, file: !65, line: 620, type: !92)
!225 = !DILocalVariable(name: "desc_text", scope: !64, file: !65, line: 625, type: !68)
!226 = !DILocalVariable(name: "__ptr", scope: !227, file: !65, line: 644, type: !68)
!227 = distinct !DILexicalBlock(scope: !64, file: !65, line: 644, column: 3)
!228 = !DILocalVariable(name: "__stream", scope: !227, file: !65, line: 644, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !232)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !233, line: 49, size: 1728, elements: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!234 = !{!235, !236, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !251, !253, !254, !255, !259, !260, !262, !263, !266, !268, !271, !274, !275, !276, !277, !278}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !232, file: !233, line: 51, baseType: !90, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !232, file: !233, line: 54, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !232, file: !233, line: 55, baseType: !237, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !232, file: !233, line: 56, baseType: !237, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !232, file: !233, line: 57, baseType: !237, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !232, file: !233, line: 58, baseType: !237, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !232, file: !233, line: 59, baseType: !237, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !232, file: !233, line: 60, baseType: !237, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !232, file: !233, line: 61, baseType: !237, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !232, file: !233, line: 64, baseType: !237, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !232, file: !233, line: 65, baseType: !237, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !232, file: !233, line: 66, baseType: !237, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !232, file: !233, line: 68, baseType: !249, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !233, line: 36, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !232, file: !233, line: 70, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !232, file: !233, line: 72, baseType: !90, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !232, file: !233, line: 73, baseType: !90, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !232, file: !233, line: 74, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 152, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!258 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !232, file: !233, line: 77, baseType: !91, size: 16, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !232, file: !233, line: 78, baseType: !261, size: 8, offset: 1040)
!261 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !232, file: !233, line: 79, baseType: !29, size: 8, offset: 1048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !232, file: !233, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !233, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !232, file: !233, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 153, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !232, file: !233, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !233, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !232, file: !233, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !233, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !232, file: !233, line: 93, baseType: !252, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !232, file: !233, line: 94, baseType: !89, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !232, file: !233, line: 95, baseType: !92, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !232, file: !233, line: 96, baseType: !90, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !232, file: !233, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocalVariable(name: "__cnt", scope: !227, file: !65, line: 644, type: !92)
!283 = !DILocalVariable(name: "url_program", scope: !64, file: !65, line: 648, type: !68)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !65, line: 686, type: !68)
!285 = distinct !DILexicalBlock(scope: !64, file: !65, line: 686, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !65, line: 686, type: !229)
!287 = !DILocalVariable(name: "__cnt", scope: !285, file: !65, line: 686, type: !92)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !290, line: 3, type: !159, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !290, line: 3, type: !68, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !290, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !294, splitDebugInlining: false, nameTableKind: None)
!294 = !{!288, !291}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 45, type: !68, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!299 = !{!300, !302, !304, !306, !295, !308}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !14, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !206, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !298, line: 123, type: !14, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !298, line: 126, type: !122, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 55, type: !216, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !312, file: !313, line: 66, type: !359, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !315, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!314 = !{!89, !95}
!315 = !{!316, !318, !338, !340, !342, !344, !310, !346, !348, !350, !352, !357}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !313, line: 272, type: !99, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "old_file_name", scope: !320, file: !313, line: 304, type: !68, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "verror_at_line", scope: !313, file: !313, line: 298, type: !321, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !331)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !90, !90, !68, !74, !68, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !325)
!325 = !{!326, !328, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !324, file: !327, baseType: !74, size: 32)
!327 = !DIFile(filename: "lib/error.c", directory: "/src")
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !324, file: !327, baseType: !74, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !324, file: !327, baseType: !89, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !324, file: !327, baseType: !89, size: 64, offset: 128)
!331 = !{!332, !333, !334, !335, !336, !337}
!332 = !DILocalVariable(name: "status", arg: 1, scope: !320, file: !313, line: 298, type: !90)
!333 = !DILocalVariable(name: "errnum", arg: 2, scope: !320, file: !313, line: 298, type: !90)
!334 = !DILocalVariable(name: "file_name", arg: 3, scope: !320, file: !313, line: 298, type: !68)
!335 = !DILocalVariable(name: "line_number", arg: 4, scope: !320, file: !313, line: 298, type: !74)
!336 = !DILocalVariable(name: "message", arg: 5, scope: !320, file: !313, line: 298, type: !68)
!337 = !DILocalVariable(name: "args", arg: 6, scope: !320, file: !313, line: 298, type: !323)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "old_line_number", scope: !320, file: !313, line: 305, type: !74, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !313, line: 338, type: !106, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !135, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !113, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "error_message_count", scope: !312, file: !313, line: 69, type: !74, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !312, file: !313, line: 295, type: !90, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !14, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 21)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !313, line: 214, type: !99, isLocal: true, isDefinition: true)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !364, line: 60, type: !113, isLocal: true, isDefinition: true)
!364 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "long_options", scope: !367, file: !364, line: 34, type: !375, isLocal: true, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C11, file: !364, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !368, splitDebugInlining: false, nameTableKind: None)
!368 = !{!362, !369, !371, !373, !365}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !364, line: 112, type: !29, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !364, line: 36, type: !99, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !364, line: 37, type: !135, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 768, elements: !123)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !378, line: 50, size: 256, elements: !379)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!379 = !{!380, !381, !382, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !378, line: 52, baseType: !68, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !377, file: !378, line: 55, baseType: !90, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !377, file: !378, line: 56, baseType: !383, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !377, file: !378, line: 57, baseType: !90, size: 32, offset: 192)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "program_name", scope: !387, file: !388, line: 31, type: !68, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C11, file: !388, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, globals: !390, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!389 = !{!237}
!390 = !{!385, !391, !393}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !388, line: 46, type: !135, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !388, line: 49, type: !106, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "utf07FF", scope: !397, file: !398, line: 46, type: !425, isLocal: true, isDefinition: true)
!397 = distinct !DISubprogram(name: "proper_name_lite", scope: !398, file: !398, line: 38, type: !399, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !403)
!398 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!399 = !DISubroutineType(types: !400)
!400 = !{!68, !68, !68}
!401 = distinct !DICompileUnit(language: DW_LANG_C11, file: !398, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !402, splitDebugInlining: false, nameTableKind: None)
!402 = !{!395}
!403 = !{!404, !405, !406, !407, !412}
!404 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !397, file: !398, line: 38, type: !68)
!405 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !397, file: !398, line: 38, type: !68)
!406 = !DILocalVariable(name: "translation", scope: !397, file: !398, line: 40, type: !68)
!407 = !DILocalVariable(name: "w", scope: !397, file: !398, line: 47, type: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !409, line: 37, baseType: !410)
!409 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !257, line: 57, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !257, line: 42, baseType: !74)
!412 = !DILocalVariable(name: "mbs", scope: !397, file: !398, line: 48, type: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !414, line: 6, baseType: !415)
!414 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !416, line: 21, baseType: !417)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 13, size: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !417, file: !416, line: 15, baseType: !90, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !417, file: !416, line: 20, baseType: !421, size: 32, offset: 32)
!421 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !417, file: !416, line: 16, size: 32, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !421, file: !416, line: 18, baseType: !74, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !421, file: !416, line: 19, baseType: !106, size: 32)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !114)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !428, line: 78, type: !135, isLocal: true, isDefinition: true)
!428 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !428, line: 79, type: !59, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !428, line: 80, type: !49, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !428, line: 81, type: !49, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !428, line: 82, type: !279, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !428, line: 83, type: !113, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !428, line: 84, type: !135, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !428, line: 85, type: !14, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !428, line: 86, type: !14, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !428, line: 87, type: !135, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !449, file: !428, line: 76, type: !535, isLocal: false, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C11, file: !428, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !450, retainedTypes: !470, globals: !471, splitDebugInlining: false, nameTableKind: None)
!450 = !{!451, !465, !72}
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !452, line: 42, baseType: !74, size: 32, elements: !453)
!452 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!454 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!455 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!456 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!457 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!458 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!459 = !DIEnumerator(name: "c_quoting_style", value: 5)
!460 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!461 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!462 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!463 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!464 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !452, line: 254, baseType: !74, size: 32, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!468 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!469 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!470 = !{!90, !91, !92}
!471 = !{!426, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !472, !476, !486, !488, !493, !495, !497, !499, !501, !524, !531, !533}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !449, file: !428, line: 92, type: !474, isLocal: false, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 320, elements: !35)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !449, file: !428, line: 1040, type: !478, isLocal: false, isDefinition: true)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !428, line: 56, size: 448, elements: !479)
!479 = !{!480, !481, !482, !484, !485}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !478, file: !428, line: 59, baseType: !451, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !428, line: 62, baseType: !90, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !478, file: !428, line: 66, baseType: !483, size: 256, offset: 64)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !136)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !478, file: !428, line: 69, baseType: !68, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !478, file: !428, line: 72, baseType: !68, size: 64, offset: 384)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !449, file: !428, line: 107, type: !478, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "slot0", scope: !449, file: !428, line: 831, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 256)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !428, line: 321, type: !113, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !428, line: 357, type: !113, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !428, line: 358, type: !113, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !428, line: 199, type: !14, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "quote", scope: !503, file: !428, line: 228, type: !522, isLocal: true, isDefinition: true)
!503 = distinct !DISubprogram(name: "gettext_quote", scope: !428, file: !428, line: 197, type: !504, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !449, retainedNodes: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{!68, !68, !451}
!506 = !{!507, !508, !509, !510, !511}
!507 = !DILocalVariable(name: "msgid", arg: 1, scope: !503, file: !428, line: 197, type: !68)
!508 = !DILocalVariable(name: "s", arg: 2, scope: !503, file: !428, line: 197, type: !451)
!509 = !DILocalVariable(name: "translation", scope: !503, file: !428, line: 199, type: !68)
!510 = !DILocalVariable(name: "w", scope: !503, file: !428, line: 229, type: !408)
!511 = !DILocalVariable(name: "mbs", scope: !503, file: !428, line: 230, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !414, line: 6, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !416, line: 21, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 13, size: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !514, file: !416, line: 15, baseType: !90, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !514, file: !416, line: 20, baseType: !518, size: 32, offset: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !416, line: 16, size: 32, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !518, file: !416, line: 18, baseType: !74, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !518, file: !416, line: 19, baseType: !106, size: 32)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !523)
!523 = !{!115, !108}
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "slotvec", scope: !449, file: !428, line: 834, type: !526, isLocal: true, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !428, line: 823, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !527, file: !428, line: 825, baseType: !92, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !527, file: !428, line: 826, baseType: !237, size: 64, offset: 64)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "nslots", scope: !449, file: !428, line: 832, type: !90, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "slotvec0", scope: !449, file: !428, line: 833, type: !527, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 704, elements: !537)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!537 = !{!538}
!538 = !DISubrange(count: 11)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !541, line: 67, type: !206, isLocal: true, isDefinition: true)
!541 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !541, line: 69, type: !14, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !541, line: 83, type: !14, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !541, line: 83, type: !106, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !541, line: 85, type: !113, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !541, line: 88, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 171)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !541, line: 88, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 34)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !541, line: 105, type: !177, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !541, line: 109, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 23)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !541, line: 113, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 28)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !541, line: 120, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 32)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !541, line: 127, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 36)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !541, line: 134, type: !154, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !541, line: 142, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 44)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !541, line: 150, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 48)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !541, line: 159, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 52)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !541, line: 170, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 60)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !541, line: 248, type: !279, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !541, line: 248, type: !182, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !541, line: 254, type: !279, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !541, line: 254, type: !44, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !541, line: 254, type: !154, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !541, line: 259, type: !3, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !541, line: 259, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 29)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !623, file: !624, line: 26, type: !626, isLocal: false, isDefinition: true)
!623 = distinct !DICompileUnit(language: DW_LANG_C11, file: !624, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !625, splitDebugInlining: false, nameTableKind: None)
!624 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!625 = !{!621}
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 376, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 47)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "exit_failure", scope: !631, file: !632, line: 24, type: !634, isLocal: false, isDefinition: true)
!631 = distinct !DICompileUnit(language: DW_LANG_C11, file: !632, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !633, splitDebugInlining: false, nameTableKind: None)
!632 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!633 = !{!629}
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !90)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !637, line: 34, type: !122, isLocal: true, isDefinition: true)
!637 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !637, line: 34, type: !14, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !637, line: 34, type: !54, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 108, type: !29, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "internal_state", scope: !647, file: !644, line: 97, type: !650, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !648, globals: !649, splitDebugInlining: false, nameTableKind: None)
!648 = !{!89, !92, !95}
!649 = !{!642, !645}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !414, line: 6, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !416, line: 21, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 13, size: 64, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !652, file: !416, line: 15, baseType: !90, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !652, file: !416, line: 20, baseType: !656, size: 32, offset: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !652, file: !416, line: 16, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !656, file: !416, line: 18, baseType: !74, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !656, file: !416, line: 19, baseType: !106, size: 32)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !662, line: 35, type: !59, isLocal: true, isDefinition: true)
!662 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!663 = distinct !DICompileUnit(language: DW_LANG_C11, file: !664, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!665 = distinct !DICompileUnit(language: DW_LANG_C11, file: !541, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, retainedTypes: !670, globals: !671, splitDebugInlining: false, nameTableKind: None)
!666 = !{!667}
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !541, line: 40, baseType: !74, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!670 = !{!89}
!671 = !{!539, !542, !544, !546, !548, !550, !555, !560, !562, !567, !572, !577, !582, !584, !589, !594, !599, !604, !606, !608, !610, !612, !614, !616}
!672 = distinct !DICompileUnit(language: DW_LANG_C11, file: !673, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, retainedTypes: !705, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!674 = !{!675, !687}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !676, file: !673, line: 188, baseType: !74, size: 32, elements: !685)
!676 = distinct !DISubprogram(name: "x2nrealloc", scope: !673, file: !673, line: 176, type: !677, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !672, retainedNodes: !680)
!677 = !DISubroutineType(types: !678)
!678 = !{!89, !89, !679, !92}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!680 = !{!681, !682, !683, !684}
!681 = !DILocalVariable(name: "p", arg: 1, scope: !676, file: !673, line: 176, type: !89)
!682 = !DILocalVariable(name: "pn", arg: 2, scope: !676, file: !673, line: 176, type: !679)
!683 = !DILocalVariable(name: "s", arg: 3, scope: !676, file: !673, line: 176, type: !92)
!684 = !DILocalVariable(name: "n", scope: !676, file: !673, line: 178, type: !92)
!685 = !{!686}
!686 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !688, file: !673, line: 228, baseType: !74, size: 32, elements: !685)
!688 = distinct !DISubprogram(name: "xpalloc", scope: !673, file: !673, line: 223, type: !689, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !672, retainedNodes: !695)
!689 = !DISubroutineType(types: !690)
!690 = !{!89, !89, !691, !692, !694, !692}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !693, line: 130, baseType: !694)
!693 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !93, line: 35, baseType: !258)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704}
!696 = !DILocalVariable(name: "pa", arg: 1, scope: !688, file: !673, line: 223, type: !89)
!697 = !DILocalVariable(name: "pn", arg: 2, scope: !688, file: !673, line: 223, type: !691)
!698 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !688, file: !673, line: 223, type: !692)
!699 = !DILocalVariable(name: "n_max", arg: 4, scope: !688, file: !673, line: 223, type: !694)
!700 = !DILocalVariable(name: "s", arg: 5, scope: !688, file: !673, line: 223, type: !692)
!701 = !DILocalVariable(name: "n0", scope: !688, file: !673, line: 230, type: !692)
!702 = !DILocalVariable(name: "n", scope: !688, file: !673, line: 237, type: !692)
!703 = !DILocalVariable(name: "nbytes", scope: !688, file: !673, line: 248, type: !692)
!704 = !DILocalVariable(name: "adjusted_nbytes", scope: !688, file: !673, line: 252, type: !692)
!705 = !{!237, !89, !216, !258, !94}
!706 = distinct !DICompileUnit(language: DW_LANG_C11, file: !637, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !707, splitDebugInlining: false, nameTableKind: None)
!707 = !{!635, !638, !640}
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !670, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !670, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!718 = !{!216, !94, !89}
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !662, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !720, splitDebugInlining: false, nameTableKind: None)
!720 = !{!721, !660}
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !662, line: 35, type: !113, isLocal: true, isDefinition: true)
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !670, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!727 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!728 = !{i32 7, !"Dwarf Version", i32 5}
!729 = !{i32 2, !"Debug Info Version", i32 3}
!730 = !{i32 1, !"wchar_size", i32 4}
!731 = !{i32 8, !"PIC Level", i32 2}
!732 = !{i32 7, !"PIE Level", i32 2}
!733 = !{i32 7, !"uwtable", i32 2}
!734 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 34, type: !735, scopeLine: 35, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !90}
!737 = !{!738}
!738 = !DILocalVariable(name: "status", arg: 1, scope: !734, file: !2, line: 34, type: !90)
!739 = !DILocation(line: 0, scope: !734)
!740 = !DILocation(line: 36, column: 14, scope: !741)
!741 = distinct !DILexicalBlock(scope: !734, file: !2, line: 36, column: 7)
!742 = !DILocation(line: 36, column: 7, scope: !734)
!743 = !DILocation(line: 37, column: 5, scope: !744)
!744 = distinct !DILexicalBlock(scope: !741, file: !2, line: 37, column: 5)
!745 = !{!746, !746, i64 0}
!746 = !{!"any pointer", !747, i64 0}
!747 = !{!"omnipotent char", !748, i64 0}
!748 = !{!"Simple C/C++ TBAA"}
!749 = !DILocation(line: 40, column: 7, scope: !750)
!750 = distinct !DILexicalBlock(scope: !741, file: !2, line: 39, column: 5)
!751 = !DILocation(line: 45, column: 7, scope: !750)
!752 = !DILocation(line: 46, column: 7, scope: !750)
!753 = !DILocalVariable(name: "program", arg: 1, scope: !754, file: !65, line: 836, type: !68)
!754 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !65, file: !65, line: 836, type: !755, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !68}
!757 = !{!753, !758, !765, !766, !768, !769}
!758 = !DILocalVariable(name: "infomap", scope: !754, file: !65, line: 838, type: !759)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 896, elements: !15)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !754, file: !65, line: 838, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !761, file: !65, line: 838, baseType: !68, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !761, file: !65, line: 838, baseType: !68, size: 64, offset: 64)
!765 = !DILocalVariable(name: "node", scope: !754, file: !65, line: 848, type: !68)
!766 = !DILocalVariable(name: "map_prog", scope: !754, file: !65, line: 849, type: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!768 = !DILocalVariable(name: "lc_messages", scope: !754, file: !65, line: 861, type: !68)
!769 = !DILocalVariable(name: "url_program", scope: !754, file: !65, line: 874, type: !68)
!770 = !DILocation(line: 0, scope: !754, inlinedAt: !771)
!771 = distinct !DILocation(line: 47, column: 7, scope: !750)
!772 = !DILocation(line: 857, column: 3, scope: !754, inlinedAt: !771)
!773 = !DILocation(line: 861, column: 29, scope: !754, inlinedAt: !771)
!774 = !DILocation(line: 862, column: 7, scope: !775, inlinedAt: !771)
!775 = distinct !DILexicalBlock(scope: !754, file: !65, line: 862, column: 7)
!776 = !DILocation(line: 862, column: 19, scope: !775, inlinedAt: !771)
!777 = !DILocation(line: 862, column: 22, scope: !775, inlinedAt: !771)
!778 = !DILocation(line: 862, column: 7, scope: !754, inlinedAt: !771)
!779 = !DILocation(line: 868, column: 7, scope: !780, inlinedAt: !771)
!780 = distinct !DILexicalBlock(scope: !775, file: !65, line: 863, column: 5)
!781 = !DILocation(line: 870, column: 5, scope: !780, inlinedAt: !771)
!782 = !DILocation(line: 875, column: 3, scope: !754, inlinedAt: !771)
!783 = !DILocation(line: 877, column: 3, scope: !754, inlinedAt: !771)
!784 = !DILocation(line: 49, column: 3, scope: !734)
!785 = !DISubprogram(name: "dcgettext", scope: !786, file: !786, line: 51, type: !787, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!786 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!787 = !DISubroutineType(types: !788)
!788 = !{!237, !68, !68, !90}
!789 = !{}
!790 = !DISubprogram(name: "__fprintf_chk", scope: !791, file: !791, line: 93, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!791 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!792 = !DISubroutineType(types: !793)
!793 = !{!90, !794, !90, !795, null}
!794 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !229)
!795 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!796 = !DISubprogram(name: "__printf_chk", scope: !791, file: !791, line: 95, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!797 = !DISubroutineType(types: !798)
!798 = !{!90, !90, !795, null}
!799 = !DILocation(line: 0, scope: !64)
!800 = !DILocation(line: 581, column: 7, scope: !214)
!801 = !{!802, !802, i64 0}
!802 = !{!"int", !747, i64 0}
!803 = !DILocation(line: 581, column: 19, scope: !214)
!804 = !DILocation(line: 581, column: 7, scope: !64)
!805 = !DILocation(line: 585, column: 26, scope: !213)
!806 = !DILocation(line: 0, scope: !213)
!807 = !DILocation(line: 586, column: 23, scope: !213)
!808 = !DILocation(line: 586, column: 28, scope: !213)
!809 = !DILocation(line: 586, column: 32, scope: !213)
!810 = !{!747, !747, i64 0}
!811 = !DILocation(line: 586, column: 38, scope: !213)
!812 = !DILocalVariable(name: "__s1", arg: 1, scope: !813, file: !814, line: 1359, type: !68)
!813 = distinct !DISubprogram(name: "streq", scope: !814, file: !814, line: 1359, type: !815, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !817)
!814 = !DIFile(filename: "./lib/string.h", directory: "/src")
!815 = !DISubroutineType(types: !816)
!816 = !{!216, !68, !68}
!817 = !{!812, !818}
!818 = !DILocalVariable(name: "__s2", arg: 2, scope: !813, file: !814, line: 1359, type: !68)
!819 = !DILocation(line: 0, scope: !813, inlinedAt: !820)
!820 = distinct !DILocation(line: 586, column: 41, scope: !213)
!821 = !DILocation(line: 1361, column: 11, scope: !813, inlinedAt: !820)
!822 = !DILocation(line: 1361, column: 10, scope: !813, inlinedAt: !820)
!823 = !DILocation(line: 586, column: 19, scope: !213)
!824 = !DILocation(line: 587, column: 5, scope: !213)
!825 = !DILocation(line: 588, column: 7, scope: !826)
!826 = distinct !DILexicalBlock(scope: !64, file: !65, line: 588, column: 7)
!827 = !DILocation(line: 588, column: 7, scope: !64)
!828 = !DILocation(line: 590, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !826, file: !65, line: 589, column: 5)
!830 = !DILocation(line: 591, column: 7, scope: !829)
!831 = !DILocation(line: 595, column: 37, scope: !64)
!832 = !DILocation(line: 595, column: 35, scope: !64)
!833 = !DILocation(line: 596, column: 29, scope: !64)
!834 = !DILocation(line: 597, column: 8, scope: !222)
!835 = !DILocation(line: 597, column: 7, scope: !64)
!836 = !DILocation(line: 604, column: 24, scope: !221)
!837 = !DILocation(line: 604, column: 12, scope: !222)
!838 = !DILocation(line: 0, scope: !220)
!839 = !DILocation(line: 610, column: 16, scope: !220)
!840 = !DILocation(line: 610, column: 7, scope: !220)
!841 = !DILocation(line: 611, column: 21, scope: !220)
!842 = !{!843, !843, i64 0}
!843 = !{!"short", !747, i64 0}
!844 = !DILocation(line: 611, column: 19, scope: !220)
!845 = !DILocation(line: 611, column: 16, scope: !220)
!846 = !DILocation(line: 610, column: 30, scope: !220)
!847 = distinct !{!847, !840, !841, !848}
!848 = !{!"llvm.loop.mustprogress"}
!849 = !DILocation(line: 612, column: 18, scope: !850)
!850 = distinct !DILexicalBlock(scope: !220, file: !65, line: 612, column: 11)
!851 = !DILocation(line: 612, column: 11, scope: !220)
!852 = !DILocation(line: 618, column: 5, scope: !220)
!853 = !DILocation(line: 620, column: 23, scope: !64)
!854 = !DILocation(line: 625, column: 39, scope: !64)
!855 = !DILocation(line: 626, column: 3, scope: !64)
!856 = !DILocation(line: 626, column: 10, scope: !64)
!857 = !DILocation(line: 626, column: 21, scope: !64)
!858 = !DILocation(line: 628, column: 44, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !65, line: 628, column: 11)
!860 = distinct !DILexicalBlock(scope: !64, file: !65, line: 627, column: 5)
!861 = !DILocation(line: 628, column: 32, scope: !859)
!862 = !DILocation(line: 628, column: 49, scope: !859)
!863 = !DILocation(line: 628, column: 11, scope: !860)
!864 = !DILocation(line: 630, column: 11, scope: !865)
!865 = distinct !DILexicalBlock(scope: !860, file: !65, line: 630, column: 11)
!866 = !DILocation(line: 630, column: 11, scope: !860)
!867 = !DILocation(line: 632, column: 26, scope: !868)
!868 = distinct !DILexicalBlock(scope: !869, file: !65, line: 632, column: 15)
!869 = distinct !DILexicalBlock(scope: !865, file: !65, line: 631, column: 9)
!870 = !DILocation(line: 632, column: 34, scope: !868)
!871 = !DILocation(line: 632, column: 37, scope: !868)
!872 = !DILocation(line: 632, column: 15, scope: !869)
!873 = !DILocation(line: 636, column: 16, scope: !874)
!874 = distinct !DILexicalBlock(scope: !869, file: !65, line: 636, column: 15)
!875 = !DILocation(line: 636, column: 29, scope: !874)
!876 = !DILocation(line: 640, column: 16, scope: !860)
!877 = distinct !{!877, !855, !878, !848}
!878 = !DILocation(line: 641, column: 5, scope: !64)
!879 = !DILocation(line: 644, column: 3, scope: !64)
!880 = !DILocation(line: 0, scope: !813, inlinedAt: !881)
!881 = distinct !DILocation(line: 648, column: 31, scope: !64)
!882 = !DILocation(line: 0, scope: !813, inlinedAt: !883)
!883 = distinct !DILocation(line: 649, column: 31, scope: !64)
!884 = !DILocation(line: 0, scope: !813, inlinedAt: !885)
!885 = distinct !DILocation(line: 650, column: 31, scope: !64)
!886 = !DILocation(line: 0, scope: !813, inlinedAt: !887)
!887 = distinct !DILocation(line: 651, column: 31, scope: !64)
!888 = !DILocation(line: 0, scope: !813, inlinedAt: !889)
!889 = distinct !DILocation(line: 652, column: 31, scope: !64)
!890 = !DILocation(line: 0, scope: !813, inlinedAt: !891)
!891 = distinct !DILocation(line: 653, column: 31, scope: !64)
!892 = !DILocation(line: 0, scope: !813, inlinedAt: !893)
!893 = distinct !DILocation(line: 654, column: 31, scope: !64)
!894 = !DILocation(line: 0, scope: !813, inlinedAt: !895)
!895 = distinct !DILocation(line: 655, column: 31, scope: !64)
!896 = !DILocation(line: 0, scope: !813, inlinedAt: !897)
!897 = distinct !DILocation(line: 656, column: 31, scope: !64)
!898 = !DILocation(line: 0, scope: !813, inlinedAt: !899)
!899 = distinct !DILocation(line: 657, column: 31, scope: !64)
!900 = !DILocation(line: 663, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !64, file: !65, line: 663, column: 7)
!902 = !DILocation(line: 664, column: 7, scope: !901)
!903 = !DILocation(line: 664, column: 10, scope: !901)
!904 = !DILocation(line: 663, column: 7, scope: !64)
!905 = !DILocation(line: 669, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !901, file: !65, line: 665, column: 5)
!907 = !DILocation(line: 671, column: 5, scope: !906)
!908 = !DILocation(line: 676, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !901, file: !65, line: 673, column: 5)
!910 = !DILocation(line: 679, column: 3, scope: !64)
!911 = !DILocation(line: 683, column: 3, scope: !64)
!912 = !DILocation(line: 686, column: 3, scope: !64)
!913 = !DILocation(line: 688, column: 3, scope: !64)
!914 = !DILocation(line: 691, column: 3, scope: !64)
!915 = !DILocation(line: 695, column: 3, scope: !64)
!916 = !DILocation(line: 696, column: 1, scope: !64)
!917 = !DISubprogram(name: "setlocale", scope: !918, file: !918, line: 122, type: !919, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!918 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!919 = !DISubroutineType(types: !920)
!920 = !{!237, !90, !68}
!921 = !DISubprogram(name: "strncmp", scope: !922, file: !922, line: 159, type: !923, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!922 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!923 = !DISubroutineType(types: !924)
!924 = !{!90, !68, !68, !92}
!925 = !DISubprogram(name: "fputs_unlocked", scope: !926, file: !926, line: 691, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!926 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!927 = !DISubroutineType(types: !928)
!928 = !{!90, !795, !794}
!929 = !DISubprogram(name: "exit", scope: !930, file: !930, line: 624, type: !735, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !789)
!930 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!931 = !DISubprogram(name: "getenv", scope: !930, file: !930, line: 641, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!932 = !DISubroutineType(types: !933)
!933 = !{!237, !68}
!934 = !DISubprogram(name: "strcmp", scope: !922, file: !922, line: 156, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!935 = !DISubroutineType(types: !936)
!936 = !{!90, !68, !68}
!937 = !DISubprogram(name: "strspn", scope: !922, file: !922, line: 297, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!938 = !DISubroutineType(types: !939)
!939 = !{!94, !68, !68}
!940 = !DISubprogram(name: "strchr", scope: !922, file: !922, line: 246, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!941 = !DISubroutineType(types: !942)
!942 = !{!237, !68, !90}
!943 = !DISubprogram(name: "__ctype_b_loc", scope: !73, file: !73, line: 79, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!944 = !DISubroutineType(types: !945)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!949 = !DISubprogram(name: "strcspn", scope: !922, file: !922, line: 293, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!950 = !DISubprogram(name: "fwrite_unlocked", scope: !926, file: !926, line: 704, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!951 = !DISubroutineType(types: !952)
!952 = !{!92, !953, !92, !92, !794}
!953 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!956 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 53, type: !957, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !960)
!957 = !DISubroutineType(types: !958)
!958 = !{!90, !90, !959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!960 = !{!961, !962, !963}
!961 = !DILocalVariable(name: "argc", arg: 1, scope: !956, file: !2, line: 53, type: !90)
!962 = !DILocalVariable(name: "argv", arg: 2, scope: !956, file: !2, line: 53, type: !959)
!963 = !DILocalVariable(name: "id", scope: !956, file: !2, line: 76, type: !74)
!964 = !DILocation(line: 0, scope: !956)
!965 = !DILocation(line: 56, column: 21, scope: !956)
!966 = !DILocation(line: 56, column: 3, scope: !956)
!967 = !DILocation(line: 57, column: 3, scope: !956)
!968 = !DILocation(line: 58, column: 3, scope: !956)
!969 = !DILocation(line: 59, column: 3, scope: !956)
!970 = !DILocation(line: 61, column: 3, scope: !956)
!971 = !DILocation(line: 64, column: 36, scope: !956)
!972 = !DILocation(line: 64, column: 58, scope: !956)
!973 = !DILocation(line: 63, column: 3, scope: !956)
!974 = !DILocation(line: 67, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !956, file: !2, line: 67, column: 7)
!976 = !DILocation(line: 67, column: 14, scope: !975)
!977 = !DILocation(line: 67, column: 7, scope: !956)
!978 = !DILocation(line: 69, column: 7, scope: !979)
!979 = distinct !DILexicalBlock(scope: !975, file: !2, line: 68, column: 5)
!980 = !DILocation(line: 70, column: 7, scope: !979)
!981 = !DILocation(line: 76, column: 21, scope: !956)
!982 = !DILocation(line: 78, column: 3, scope: !956)
!983 = !DILocation(line: 80, column: 3, scope: !956)
!984 = !DISubprogram(name: "bindtextdomain", scope: !786, file: !786, line: 86, type: !985, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!985 = !DISubroutineType(types: !986)
!986 = !{!237, !68, !68}
!987 = !DISubprogram(name: "textdomain", scope: !786, file: !786, line: 82, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!988 = !DISubprogram(name: "atexit", scope: !930, file: !930, line: 602, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!989 = !DISubroutineType(types: !990)
!990 = !{!90, !359}
!991 = !DISubprogram(name: "gethostid", scope: !992, file: !992, line: 1002, type: !993, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!992 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!993 = !DISubroutineType(types: !994)
!994 = !{!258}
!995 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !298, file: !298, line: 50, type: !755, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !996)
!996 = !{!997}
!997 = !DILocalVariable(name: "file", arg: 1, scope: !995, file: !298, line: 50, type: !68)
!998 = !DILocation(line: 0, scope: !995)
!999 = !DILocation(line: 52, column: 13, scope: !995)
!1000 = !DILocation(line: 53, column: 1, scope: !995)
!1001 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !298, file: !298, line: 87, type: !1002, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !1004)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !216}
!1004 = !{!1005}
!1005 = !DILocalVariable(name: "ignore", arg: 1, scope: !1001, file: !298, line: 87, type: !216)
!1006 = !DILocation(line: 0, scope: !1001)
!1007 = !DILocation(line: 89, column: 16, scope: !1001)
!1008 = !{!1009, !1009, i64 0}
!1009 = !{!"_Bool", !747, i64 0}
!1010 = !DILocation(line: 90, column: 1, scope: !1001)
!1011 = distinct !DISubprogram(name: "close_stdout", scope: !298, file: !298, line: 116, type: !360, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !1012)
!1012 = !{!1013}
!1013 = !DILocalVariable(name: "write_error", scope: !1014, file: !298, line: 121, type: !68)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !298, line: 120, column: 5)
!1015 = distinct !DILexicalBlock(scope: !1011, file: !298, line: 118, column: 7)
!1016 = !DILocation(line: 118, column: 21, scope: !1015)
!1017 = !DILocation(line: 118, column: 7, scope: !1015)
!1018 = !DILocation(line: 118, column: 29, scope: !1015)
!1019 = !DILocation(line: 119, column: 7, scope: !1015)
!1020 = !DILocation(line: 119, column: 12, scope: !1015)
!1021 = !{i8 0, i8 2}
!1022 = !DILocation(line: 119, column: 25, scope: !1015)
!1023 = !DILocation(line: 119, column: 28, scope: !1015)
!1024 = !DILocation(line: 119, column: 34, scope: !1015)
!1025 = !DILocation(line: 118, column: 7, scope: !1011)
!1026 = !DILocation(line: 121, column: 33, scope: !1014)
!1027 = !DILocation(line: 0, scope: !1014)
!1028 = !DILocation(line: 122, column: 11, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1014, file: !298, line: 122, column: 11)
!1030 = !DILocation(line: 0, scope: !1029)
!1031 = !DILocation(line: 122, column: 11, scope: !1014)
!1032 = !DILocation(line: 123, column: 9, scope: !1029)
!1033 = !DILocation(line: 126, column: 9, scope: !1029)
!1034 = !DILocation(line: 128, column: 14, scope: !1014)
!1035 = !DILocation(line: 128, column: 7, scope: !1014)
!1036 = !DILocation(line: 133, column: 42, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1011, file: !298, line: 133, column: 7)
!1038 = !DILocation(line: 133, column: 28, scope: !1037)
!1039 = !DILocation(line: 133, column: 50, scope: !1037)
!1040 = !DILocation(line: 133, column: 7, scope: !1011)
!1041 = !DILocation(line: 134, column: 12, scope: !1037)
!1042 = !DILocation(line: 134, column: 5, scope: !1037)
!1043 = !DILocation(line: 135, column: 1, scope: !1011)
!1044 = !DISubprogram(name: "__errno_location", scope: !1045, file: !1045, line: 37, type: !1046, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!1045 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!383}
!1048 = !DISubprogram(name: "_exit", scope: !992, file: !992, line: 624, type: !735, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !789)
!1049 = distinct !DISubprogram(name: "verror", scope: !313, file: !313, line: 251, type: !1050, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1052)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{null, !90, !90, !68, !323}
!1052 = !{!1053, !1054, !1055, !1056}
!1053 = !DILocalVariable(name: "status", arg: 1, scope: !1049, file: !313, line: 251, type: !90)
!1054 = !DILocalVariable(name: "errnum", arg: 2, scope: !1049, file: !313, line: 251, type: !90)
!1055 = !DILocalVariable(name: "message", arg: 3, scope: !1049, file: !313, line: 251, type: !68)
!1056 = !DILocalVariable(name: "args", arg: 4, scope: !1049, file: !313, line: 251, type: !323)
!1057 = !DILocation(line: 0, scope: !1049)
!1058 = !DILocation(line: 261, column: 3, scope: !1049)
!1059 = !DILocation(line: 265, column: 7, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1049, file: !313, line: 265, column: 7)
!1061 = !DILocation(line: 265, column: 7, scope: !1049)
!1062 = !DILocation(line: 266, column: 5, scope: !1060)
!1063 = !DILocation(line: 272, column: 7, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !313, line: 268, column: 5)
!1065 = !DILocation(line: 276, column: 3, scope: !1049)
!1066 = !DILocation(line: 282, column: 1, scope: !1049)
!1067 = distinct !DISubprogram(name: "flush_stdout", scope: !313, file: !313, line: 163, type: !360, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1068)
!1068 = !{!1069}
!1069 = !DILocalVariable(name: "stdout_fd", scope: !1067, file: !313, line: 166, type: !90)
!1070 = !DILocation(line: 0, scope: !1067)
!1071 = !DILocalVariable(name: "fd", arg: 1, scope: !1072, file: !313, line: 145, type: !90)
!1072 = distinct !DISubprogram(name: "is_open", scope: !313, file: !313, line: 145, type: !1073, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1075)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!90, !90}
!1075 = !{!1071}
!1076 = !DILocation(line: 0, scope: !1072, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 182, column: 25, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1067, file: !313, line: 182, column: 7)
!1079 = !DILocation(line: 157, column: 15, scope: !1072, inlinedAt: !1077)
!1080 = !DILocation(line: 157, column: 12, scope: !1072, inlinedAt: !1077)
!1081 = !DILocation(line: 182, column: 7, scope: !1067)
!1082 = !DILocation(line: 184, column: 5, scope: !1078)
!1083 = !DILocation(line: 185, column: 1, scope: !1067)
!1084 = distinct !DISubprogram(name: "error_tail", scope: !313, file: !313, line: 219, type: !1050, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1085)
!1085 = !{!1086, !1087, !1088, !1089}
!1086 = !DILocalVariable(name: "status", arg: 1, scope: !1084, file: !313, line: 219, type: !90)
!1087 = !DILocalVariable(name: "errnum", arg: 2, scope: !1084, file: !313, line: 219, type: !90)
!1088 = !DILocalVariable(name: "message", arg: 3, scope: !1084, file: !313, line: 219, type: !68)
!1089 = !DILocalVariable(name: "args", arg: 4, scope: !1084, file: !313, line: 219, type: !323)
!1090 = !DILocation(line: 0, scope: !1084)
!1091 = !DILocation(line: 229, column: 13, scope: !1084)
!1092 = !DILocalVariable(name: "__stream", arg: 1, scope: !1093, file: !791, line: 132, type: !1096)
!1093 = distinct !DISubprogram(name: "vfprintf", scope: !791, file: !791, line: 132, type: !1094, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1131)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!90, !1096, !795, !323}
!1096 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !233, line: 49, size: 1728, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1099, file: !233, line: 51, baseType: !90, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1099, file: !233, line: 54, baseType: !237, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1099, file: !233, line: 55, baseType: !237, size: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1099, file: !233, line: 56, baseType: !237, size: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1099, file: !233, line: 57, baseType: !237, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1099, file: !233, line: 58, baseType: !237, size: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1099, file: !233, line: 59, baseType: !237, size: 64, offset: 384)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1099, file: !233, line: 60, baseType: !237, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1099, file: !233, line: 61, baseType: !237, size: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1099, file: !233, line: 64, baseType: !237, size: 64, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1099, file: !233, line: 65, baseType: !237, size: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1099, file: !233, line: 66, baseType: !237, size: 64, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1099, file: !233, line: 68, baseType: !249, size: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1099, file: !233, line: 70, baseType: !1115, size: 64, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1099, file: !233, line: 72, baseType: !90, size: 32, offset: 896)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1099, file: !233, line: 73, baseType: !90, size: 32, offset: 928)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1099, file: !233, line: 74, baseType: !256, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1099, file: !233, line: 77, baseType: !91, size: 16, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1099, file: !233, line: 78, baseType: !261, size: 8, offset: 1040)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1099, file: !233, line: 79, baseType: !29, size: 8, offset: 1048)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1099, file: !233, line: 81, baseType: !264, size: 64, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1099, file: !233, line: 89, baseType: !267, size: 64, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1099, file: !233, line: 91, baseType: !269, size: 64, offset: 1216)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1099, file: !233, line: 92, baseType: !272, size: 64, offset: 1280)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1099, file: !233, line: 93, baseType: !1115, size: 64, offset: 1344)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1099, file: !233, line: 94, baseType: !89, size: 64, offset: 1408)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1099, file: !233, line: 95, baseType: !92, size: 64, offset: 1472)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1099, file: !233, line: 96, baseType: !90, size: 32, offset: 1536)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1099, file: !233, line: 98, baseType: !279, size: 160, offset: 1568)
!1131 = !{!1092, !1132, !1133}
!1132 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1093, file: !791, line: 133, type: !795)
!1133 = !DILocalVariable(name: "__ap", arg: 3, scope: !1093, file: !791, line: 133, type: !323)
!1134 = !DILocation(line: 0, scope: !1093, inlinedAt: !1135)
!1135 = distinct !DILocation(line: 229, column: 3, scope: !1084)
!1136 = !DILocation(line: 135, column: 10, scope: !1093, inlinedAt: !1135)
!1137 = !DILocation(line: 232, column: 3, scope: !1084)
!1138 = !DILocation(line: 233, column: 7, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1084, file: !313, line: 233, column: 7)
!1140 = !DILocation(line: 233, column: 7, scope: !1084)
!1141 = !DILocalVariable(name: "errnum", arg: 1, scope: !1142, file: !313, line: 188, type: !90)
!1142 = distinct !DISubprogram(name: "print_errno_message", scope: !313, file: !313, line: 188, type: !735, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1143)
!1143 = !{!1141, !1144, !1145}
!1144 = !DILocalVariable(name: "s", scope: !1142, file: !313, line: 190, type: !68)
!1145 = !DILocalVariable(name: "errbuf", scope: !1142, file: !313, line: 193, type: !1146)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 1024)
!1149 = !DILocation(line: 0, scope: !1142, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 234, column: 5, scope: !1139)
!1151 = !DILocation(line: 193, column: 3, scope: !1142, inlinedAt: !1150)
!1152 = !DILocation(line: 193, column: 8, scope: !1142, inlinedAt: !1150)
!1153 = !DILocation(line: 195, column: 7, scope: !1142, inlinedAt: !1150)
!1154 = !DILocation(line: 207, column: 9, scope: !1155, inlinedAt: !1150)
!1155 = distinct !DILexicalBlock(scope: !1142, file: !313, line: 207, column: 7)
!1156 = !DILocation(line: 207, column: 7, scope: !1142, inlinedAt: !1150)
!1157 = !DILocation(line: 208, column: 9, scope: !1155, inlinedAt: !1150)
!1158 = !DILocation(line: 208, column: 5, scope: !1155, inlinedAt: !1150)
!1159 = !DILocation(line: 214, column: 3, scope: !1142, inlinedAt: !1150)
!1160 = !DILocation(line: 216, column: 1, scope: !1142, inlinedAt: !1150)
!1161 = !DILocation(line: 234, column: 5, scope: !1139)
!1162 = !DILocation(line: 238, column: 3, scope: !1084)
!1163 = !DILocalVariable(name: "__c", arg: 1, scope: !1164, file: !1165, line: 101, type: !90)
!1164 = distinct !DISubprogram(name: "putc_unlocked", scope: !1165, file: !1165, line: 101, type: !1166, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1168)
!1165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!90, !90, !1097}
!1168 = !{!1163, !1169}
!1169 = !DILocalVariable(name: "__stream", arg: 2, scope: !1164, file: !1165, line: 101, type: !1097)
!1170 = !DILocation(line: 0, scope: !1164, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 238, column: 3, scope: !1084)
!1172 = !DILocation(line: 103, column: 10, scope: !1164, inlinedAt: !1171)
!1173 = !{!1174, !746, i64 40}
!1174 = !{!"_IO_FILE", !802, i64 0, !746, i64 8, !746, i64 16, !746, i64 24, !746, i64 32, !746, i64 40, !746, i64 48, !746, i64 56, !746, i64 64, !746, i64 72, !746, i64 80, !746, i64 88, !746, i64 96, !746, i64 104, !802, i64 112, !802, i64 116, !1175, i64 120, !843, i64 128, !747, i64 130, !747, i64 131, !746, i64 136, !1175, i64 144, !746, i64 152, !746, i64 160, !746, i64 168, !746, i64 176, !1175, i64 184, !802, i64 192, !747, i64 196}
!1175 = !{!"long", !747, i64 0}
!1176 = !{!1174, !746, i64 48}
!1177 = !{!"branch_weights", i32 2000, i32 1}
!1178 = !DILocation(line: 240, column: 3, scope: !1084)
!1179 = !DILocation(line: 241, column: 7, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1084, file: !313, line: 241, column: 7)
!1181 = !DILocation(line: 241, column: 7, scope: !1084)
!1182 = !DILocation(line: 242, column: 5, scope: !1180)
!1183 = !DILocation(line: 243, column: 1, scope: !1084)
!1184 = !DISubprogram(name: "__vfprintf_chk", scope: !791, file: !791, line: 96, type: !1185, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!90, !1096, !90, !795, !323}
!1187 = !DISubprogram(name: "strerror_r", scope: !922, file: !922, line: 444, type: !1188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!237, !90, !237, !92}
!1190 = !DISubprogram(name: "__overflow", scope: !926, file: !926, line: 886, type: !1191, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!90, !1097, !90}
!1193 = !DISubprogram(name: "fflush_unlocked", scope: !926, file: !926, line: 239, type: !1194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!90, !1097}
!1196 = !DISubprogram(name: "fcntl", scope: !1197, file: !1197, line: 149, type: !1198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!1197 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!90, !90, !90, null}
!1200 = distinct !DISubprogram(name: "error", scope: !313, file: !313, line: 285, type: !1201, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1203)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{null, !90, !90, !68, null}
!1203 = !{!1204, !1205, !1206, !1207}
!1204 = !DILocalVariable(name: "status", arg: 1, scope: !1200, file: !313, line: 285, type: !90)
!1205 = !DILocalVariable(name: "errnum", arg: 2, scope: !1200, file: !313, line: 285, type: !90)
!1206 = !DILocalVariable(name: "message", arg: 3, scope: !1200, file: !313, line: 285, type: !68)
!1207 = !DILocalVariable(name: "ap", scope: !1200, file: !313, line: 287, type: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !926, line: 52, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1210, line: 14, baseType: !1211)
!1210 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !327, baseType: !1212)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 192, elements: !30)
!1213 = !DILocation(line: 0, scope: !1200)
!1214 = !DILocation(line: 287, column: 3, scope: !1200)
!1215 = !DILocation(line: 287, column: 11, scope: !1200)
!1216 = !DILocation(line: 288, column: 3, scope: !1200)
!1217 = !DILocation(line: 289, column: 3, scope: !1200)
!1218 = !DILocation(line: 290, column: 3, scope: !1200)
!1219 = !DILocation(line: 291, column: 1, scope: !1200)
!1220 = !DILocation(line: 0, scope: !320)
!1221 = !DILocation(line: 302, column: 7, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !320, file: !313, line: 302, column: 7)
!1223 = !DILocation(line: 302, column: 7, scope: !320)
!1224 = !DILocation(line: 307, column: 11, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1226, file: !313, line: 307, column: 11)
!1226 = distinct !DILexicalBlock(scope: !1222, file: !313, line: 303, column: 5)
!1227 = !DILocation(line: 307, column: 27, scope: !1225)
!1228 = !DILocation(line: 308, column: 11, scope: !1225)
!1229 = !DILocation(line: 308, column: 28, scope: !1225)
!1230 = !DILocation(line: 308, column: 25, scope: !1225)
!1231 = !DILocation(line: 309, column: 15, scope: !1225)
!1232 = !DILocation(line: 309, column: 33, scope: !1225)
!1233 = !DILocation(line: 310, column: 19, scope: !1225)
!1234 = !DILocation(line: 311, column: 22, scope: !1225)
!1235 = !DILocation(line: 311, column: 56, scope: !1225)
!1236 = !DILocation(line: 307, column: 11, scope: !1226)
!1237 = !DILocation(line: 316, column: 21, scope: !1226)
!1238 = !DILocation(line: 317, column: 23, scope: !1226)
!1239 = !DILocation(line: 318, column: 5, scope: !1226)
!1240 = !DILocation(line: 327, column: 3, scope: !320)
!1241 = !DILocation(line: 331, column: 7, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !320, file: !313, line: 331, column: 7)
!1243 = !DILocation(line: 331, column: 7, scope: !320)
!1244 = !DILocation(line: 332, column: 5, scope: !1242)
!1245 = !DILocation(line: 338, column: 7, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1242, file: !313, line: 334, column: 5)
!1247 = !DILocation(line: 346, column: 3, scope: !320)
!1248 = !DILocation(line: 350, column: 3, scope: !320)
!1249 = !DILocation(line: 356, column: 1, scope: !320)
!1250 = distinct !DISubprogram(name: "error_at_line", scope: !313, file: !313, line: 359, type: !1251, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1253)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{null, !90, !90, !68, !74, !68, null}
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259}
!1254 = !DILocalVariable(name: "status", arg: 1, scope: !1250, file: !313, line: 359, type: !90)
!1255 = !DILocalVariable(name: "errnum", arg: 2, scope: !1250, file: !313, line: 359, type: !90)
!1256 = !DILocalVariable(name: "file_name", arg: 3, scope: !1250, file: !313, line: 359, type: !68)
!1257 = !DILocalVariable(name: "line_number", arg: 4, scope: !1250, file: !313, line: 360, type: !74)
!1258 = !DILocalVariable(name: "message", arg: 5, scope: !1250, file: !313, line: 360, type: !68)
!1259 = !DILocalVariable(name: "ap", scope: !1250, file: !313, line: 362, type: !1208)
!1260 = !DILocation(line: 0, scope: !1250)
!1261 = !DILocation(line: 362, column: 3, scope: !1250)
!1262 = !DILocation(line: 362, column: 11, scope: !1250)
!1263 = !DILocation(line: 363, column: 3, scope: !1250)
!1264 = !DILocation(line: 364, column: 3, scope: !1250)
!1265 = !DILocation(line: 366, column: 3, scope: !1250)
!1266 = !DILocation(line: 367, column: 1, scope: !1250)
!1267 = distinct !DISubprogram(name: "getprogname", scope: !664, file: !664, line: 54, type: !1268, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !663, retainedNodes: !789)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!68}
!1270 = !DILocation(line: 58, column: 10, scope: !1267)
!1271 = !DILocation(line: 58, column: 3, scope: !1267)
!1272 = distinct !DISubprogram(name: "parse_long_options", scope: !364, file: !364, line: 45, type: !1273, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !367, retainedNodes: !1276)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{null, !90, !959, !68, !68, !68, !1275, null}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1287}
!1277 = !DILocalVariable(name: "argc", arg: 1, scope: !1272, file: !364, line: 45, type: !90)
!1278 = !DILocalVariable(name: "argv", arg: 2, scope: !1272, file: !364, line: 46, type: !959)
!1279 = !DILocalVariable(name: "command_name", arg: 3, scope: !1272, file: !364, line: 47, type: !68)
!1280 = !DILocalVariable(name: "package", arg: 4, scope: !1272, file: !364, line: 48, type: !68)
!1281 = !DILocalVariable(name: "version", arg: 5, scope: !1272, file: !364, line: 49, type: !68)
!1282 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1272, file: !364, line: 50, type: !1275)
!1283 = !DILocalVariable(name: "saved_opterr", scope: !1272, file: !364, line: 53, type: !90)
!1284 = !DILocalVariable(name: "c", scope: !1285, file: !364, line: 60, type: !90)
!1285 = distinct !DILexicalBlock(scope: !1286, file: !364, line: 59, column: 5)
!1286 = distinct !DILexicalBlock(scope: !1272, file: !364, line: 58, column: 7)
!1287 = !DILocalVariable(name: "authors", scope: !1288, file: !364, line: 71, type: !1292)
!1288 = distinct !DILexicalBlock(scope: !1289, file: !364, line: 70, column: 15)
!1289 = distinct !DILexicalBlock(scope: !1290, file: !364, line: 64, column: 13)
!1290 = distinct !DILexicalBlock(scope: !1291, file: !364, line: 62, column: 9)
!1291 = distinct !DILexicalBlock(scope: !1285, file: !364, line: 61, column: 11)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !926, line: 52, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1210, line: 14, baseType: !1294)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1295, baseType: !1296)
!1295 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1297, size: 192, elements: !30)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1298)
