; ModuleID = 'src/join.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.mcel_t = type { i32, i8, i8 }
%struct.outlist = type { i32, i64, ptr }
%struct.line = type { %struct.seq, i64, i64, ptr }
%struct.seq = type { i64, i64, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.field = type { ptr, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"Usage: %s [OPTION]... FILE1 FILE2\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [150 x i8] c"For each pair of input lines with identical join fields, write a line to\0Astandard output.  The default join field is the first, delimited by blanks.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [60 x i8] c"\0AWhen FILE1 or FILE2 (not both) is -, read standard input.\0A\00", align 1, !dbg !17

!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1138, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 23)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1143, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 18)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1172, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 14)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1172, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 13)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1190, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 16)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1192, type: !256, isLocal: true, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 25)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1210, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 2)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1210, type: !261, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1212, type: !226, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1217, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 36)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1226, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 29)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "g_names", scope: !115, file: !2, line: 96, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, elements: !262)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "print_unpairables_1", scope: !115, file: !2, line: 107, type: !283, isLocal: true, isDefinition: true)
!283 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "print_unpairables_2", scope: !115, file: !2, line: 107, type: !283, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "issued_disorder_warning", scope: !115, file: !2, line: 116, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 16, elements: !262)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "empty_filler", scope: !115, file: !2, line: 119, type: !206, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "autoformat", scope: !115, file: !2, line: 122, type: !283, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "tab", scope: !115, file: !2, line: 141, type: !295, isLocal: true, isDefinition: true)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !178, line: 143, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 138, size: 64, elements: !297)
!297 = !{!298, !304, !305}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !296, file: !178, line: 140, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !300, line: 37, baseType: !301)
!300 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !302, line: 57, baseType: !303)
!302 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !302, line: 42, baseType: !118)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !296, file: !178, line: 141, baseType: !208, size: 8, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !296, file: !178, line: 142, baseType: !208, size: 8, offset: 40)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "check_input_order", scope: !115, file: !2, line: 153, type: !137, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_case", scope: !115, file: !2, line: 179, type: !283, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "join_header_lines", scope: !115, file: !2, line: 183, type: !283, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !314, file: !143, line: 575, type: !144, isLocal: true, isDefinition: true)
!314 = distinct !DISubprogram(name: "oputs_", scope: !143, file: !143, line: 573, type: !315, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !317)
!315 = !DISubroutineType(cc: DW_CC_nocall, types: !316)
!316 = !{null, !206, !206}
!317 = !{!318, !319, !320, !323, !324, !325, !326, !330, !331, !332, !333, !335, !384, !385, !386, !388, !389}
!318 = !DILocalVariable(name: "program", arg: 1, scope: !314, file: !143, line: 573, type: !206)
!319 = !DILocalVariable(name: "option", arg: 2, scope: !314, file: !143, line: 573, type: !206)
!320 = !DILocalVariable(name: "term", scope: !321, file: !143, line: 585, type: !206)
!321 = distinct !DILexicalBlock(scope: !322, file: !143, line: 582, column: 5)
!322 = distinct !DILexicalBlock(scope: !314, file: !143, line: 581, column: 7)
!323 = !DILocalVariable(name: "double_space", scope: !314, file: !143, line: 594, type: !283)
!324 = !DILocalVariable(name: "first_word", scope: !314, file: !143, line: 595, type: !206)
!325 = !DILocalVariable(name: "option_text", scope: !314, file: !143, line: 596, type: !206)
!326 = !DILocalVariable(name: "s", scope: !327, file: !143, line: 608, type: !206)
!327 = distinct !DILexicalBlock(scope: !328, file: !143, line: 605, column: 5)
!328 = distinct !DILexicalBlock(scope: !329, file: !143, line: 604, column: 12)
!329 = distinct !DILexicalBlock(scope: !314, file: !143, line: 597, column: 7)
!330 = !DILocalVariable(name: "spaces", scope: !327, file: !143, line: 609, type: !203)
!331 = !DILocalVariable(name: "anchor_len", scope: !314, file: !143, line: 620, type: !203)
!332 = !DILocalVariable(name: "desc_text", scope: !314, file: !143, line: 625, type: !206)
!333 = !DILocalVariable(name: "__ptr", scope: !334, file: !143, line: 644, type: !206)
!334 = distinct !DILexicalBlock(scope: !314, file: !143, line: 644, column: 3)
!335 = !DILocalVariable(name: "__stream", scope: !334, file: !143, line: 644, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !338, line: 7, baseType: !339)
!338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !340, line: 49, size: 1728, elements: !341)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !357, !359, !360, !361, !364, !365, !367, !368, !371, !373, !376, !379, !380, !381, !382, !383}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !339, file: !340, line: 51, baseType: !144, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !339, file: !340, line: 54, baseType: !200, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !339, file: !340, line: 55, baseType: !200, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !339, file: !340, line: 56, baseType: !200, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !339, file: !340, line: 57, baseType: !200, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !339, file: !340, line: 58, baseType: !200, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !339, file: !340, line: 59, baseType: !200, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !339, file: !340, line: 60, baseType: !200, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !339, file: !340, line: 61, baseType: !200, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !339, file: !340, line: 64, baseType: !200, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !339, file: !340, line: 65, baseType: !200, size: 64, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !339, file: !340, line: 66, baseType: !200, size: 64, offset: 704)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !339, file: !340, line: 68, baseType: !355, size: 64, offset: 768)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !340, line: 36, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !339, file: !340, line: 70, baseType: !358, size: 64, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !339, file: !340, line: 72, baseType: !144, size: 32, offset: 896)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !339, file: !340, line: 73, baseType: !144, size: 32, offset: 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !339, file: !340, line: 74, baseType: !362, size: 64, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !302, line: 152, baseType: !363)
!363 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !339, file: !340, line: 77, baseType: !202, size: 16, offset: 1024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !339, file: !340, line: 78, baseType: !366, size: 8, offset: 1040)
!366 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !339, file: !340, line: 79, baseType: !100, size: 8, offset: 1048)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !339, file: !340, line: 81, baseType: !369, size: 64, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !340, line: 43, baseType: null)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !339, file: !340, line: 89, baseType: !372, size: 64, offset: 1152)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !302, line: 153, baseType: !363)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !339, file: !340, line: 91, baseType: !374, size: 64, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !340, line: 37, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !339, file: !340, line: 92, baseType: !377, size: 64, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !340, line: 38, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !339, file: !340, line: 93, baseType: !358, size: 64, offset: 1344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !339, file: !340, line: 94, baseType: !201, size: 64, offset: 1408)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !339, file: !340, line: 95, baseType: !203, size: 64, offset: 1472)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !339, file: !340, line: 96, baseType: !144, size: 32, offset: 1536)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !339, file: !340, line: 98, baseType: !212, size: 160, offset: 1568)
!384 = !DILocalVariable(name: "__cnt", scope: !334, file: !143, line: 644, type: !203)
!385 = !DILocalVariable(name: "url_program", scope: !314, file: !143, line: 648, type: !206)
!386 = !DILocalVariable(name: "__ptr", scope: !387, file: !143, line: 686, type: !206)
!387 = distinct !DILexicalBlock(scope: !314, file: !143, line: 686, column: 3)
!388 = !DILocalVariable(name: "__stream", scope: !387, file: !143, line: 686, type: !336)
!389 = !DILocalVariable(name: "__cnt", scope: !387, file: !143, line: 686, type: !203)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !143, line: 585, type: !24, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !143, line: 586, type: !24, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !143, line: 595, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !143, line: 620, type: !401, isLocal: true, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 6)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !143, line: 648, type: !261, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !143, line: 648, type: !24, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !143, line: 649, type: !396, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !143, line: 649, type: !226, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !143, line: 650, type: !24, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !143, line: 651, type: !401, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !143, line: 651, type: !401, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !143, line: 652, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 7)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !143, line: 653, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 8)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !143, line: 654, type: !105, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !143, line: 655, type: !105, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !143, line: 656, type: !105, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !143, line: 657, type: !105, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !143, line: 663, type: !420, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !143, line: 664, type: !105, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !143, line: 669, type: !442, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 17)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !143, line: 669, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 40)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !143, line: 676, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 15)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !143, line: 676, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 61)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !143, line: 679, type: !226, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !143, line: 683, type: !24, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !143, line: 688, type: !24, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !143, line: 691, type: !425, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !143, line: 839, type: !251, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !143, line: 840, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 22)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !143, line: 841, type: !452, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !143, line: 862, type: !396, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !143, line: 868, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 71)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !143, line: 875, type: !486, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 27)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !143, line: 877, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 51)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !143, line: 877, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 12)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "spareline", scope: !115, file: !2, line: 101, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 128, elements: !262)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !2, line: 72, size: 384, elements: !504)
!504 = !{!505, !515, !516, !517}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !503, file: !2, line: 74, baseType: !506, size: 192)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !507, line: 32, size: 192, elements: !508)
!507 = !DIFile(filename: "./lib/linebuffer.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a0b4e97fdade8fc6fdf94c5a34c83419")
!508 = !{!509, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !507, line: 34, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !511, line: 130, baseType: !512)
!511 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !204, line: 35, baseType: !363)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !506, file: !507, line: 35, baseType: !510, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !506, file: !507, line: 36, baseType: !200, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nfields", scope: !503, file: !2, line: 75, baseType: !510, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nfields_allocated", scope: !503, file: !2, line: 76, baseType: !510, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !503, file: !2, line: 77, baseType: !518, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field", file: !2, line: 65, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "beg", scope: !519, file: !2, line: 67, baseType: !200, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !519, file: !2, line: 68, baseType: !510, size: 64, offset: 64)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !496, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !496, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 167, type: !241, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !251, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !420, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !24, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !425, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "longopts", scope: !115, file: !2, line: 163, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 2048, elements: !426)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !542, line: 50, size: 256, elements: !543)
!542 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!543 = !{!544, !545, !546, !548}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !541, file: !542, line: 52, baseType: !206, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !541, file: !542, line: 55, baseType: !144, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !542, line: 56, baseType: !547, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !541, file: !542, line: 57, baseType: !144, size: 32, offset: 192)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "print_pairables", scope: !115, file: !2, line: 110, type: !283, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 956, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 34)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "join_field_1", scope: !115, file: !2, line: 129, type: !512, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 879, type: !256, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "join_field_2", scope: !115, file: !2, line: 130, type: !512, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 898, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 28)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 913, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 38)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 851, type: !270, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 851, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 11)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 851, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 216, elements: !487)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !2, line: 852, type: !110, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "outlist_end", scope: !115, file: !2, line: 136, type: !586, isLocal: true, isDefinition: true)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outlist", file: !2, line: 52, size: 192, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !587, file: !2, line: 56, baseType: !144, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !587, file: !2, line: 59, baseType: !510, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !2, line: 61, baseType: !586, size: 64, offset: 128)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "outlist_head", scope: !115, file: !2, line: 133, type: !587, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !261, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "output_separator", scope: !115, file: !2, line: 144, type: !206, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "output_seplen", scope: !115, file: !2, line: 145, type: !510, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "eolchar", scope: !115, file: !2, line: 186, type: !4, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 996, type: !442, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "autocount_1", scope: !115, file: !2, line: 125, type: !510, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "autocount_2", scope: !115, file: !2, line: 126, type: !510, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "uni_blank", scope: !115, file: !2, line: 176, type: !503, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !143, line: 952, type: !496, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "prevline", scope: !115, file: !2, line: 90, type: !501, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "seen_unpairable", scope: !115, file: !2, line: 113, type: !283, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 500, type: !576, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "line_no", scope: !115, file: !2, line: 93, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 128, elements: !262)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !622, line: 102, baseType: !623)
!622 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !302, line: 73, baseType: !205)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 450, type: !564, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!627 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!628 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!629 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!630 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!631 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!632 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!633 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !636, line: 3, type: !452, isLocal: true, isDefinition: true)
!636 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "Version", scope: !639, file: !636, line: 3, type: !206, isLocal: false, isDefinition: true)
!639 = distinct !DICompileUnit(language: DW_LANG_C11, file: !636, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !640, splitDebugInlining: false, nameTableKind: None)
!640 = !{!634, !637}
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "file_name", scope: !643, file: !644, line: 45, type: !206, isLocal: true, isDefinition: true)
!643 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !645, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!645 = !{!646, !648, !650, !652, !641, !654}
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !644, line: 121, type: !420, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !644, line: 121, type: !496, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !644, line: 123, type: !420, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !644, line: 126, type: !226, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !643, file: !644, line: 55, type: !283, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !658, file: !659, line: 66, type: !705, isLocal: false, isDefinition: true)
!658 = distinct !DICompileUnit(language: DW_LANG_C11, file: !659, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !660, globals: !661, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!660 = !{!201, !208}
!661 = !{!662, !664, !684, !686, !688, !690, !656, !692, !694, !696, !698, !703}
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !659, line: 272, type: !24, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "old_file_name", scope: !666, file: !659, line: 304, type: !206, isLocal: true, isDefinition: true)
!666 = distinct !DISubprogram(name: "verror_at_line", scope: !659, file: !659, line: 298, type: !667, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !658, retainedNodes: !677)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !144, !144, !206, !118, !206, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !671)
!671 = !{!672, !674, !675, !676}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !670, file: !673, baseType: !118, size: 32)
!673 = !DIFile(filename: "lib/error.c", directory: "/src")
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !670, file: !673, baseType: !118, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !670, file: !673, baseType: !201, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !670, file: !673, baseType: !201, size: 64, offset: 128)
!677 = !{!678, !679, !680, !681, !682, !683}
!678 = !DILocalVariable(name: "status", arg: 1, scope: !666, file: !659, line: 298, type: !144)
!679 = !DILocalVariable(name: "errnum", arg: 2, scope: !666, file: !659, line: 298, type: !144)
!680 = !DILocalVariable(name: "file_name", arg: 3, scope: !666, file: !659, line: 298, type: !206)
!681 = !DILocalVariable(name: "line_number", arg: 4, scope: !666, file: !659, line: 298, type: !118)
!682 = !DILocalVariable(name: "message", arg: 5, scope: !666, file: !659, line: 298, type: !206)
!683 = !DILocalVariable(name: "args", arg: 6, scope: !666, file: !659, line: 298, type: !669)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "old_line_number", scope: !666, file: !659, line: 305, type: !118, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !659, line: 338, type: !396, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !659, line: 346, type: !425, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !659, line: 346, type: !261, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "error_message_count", scope: !658, file: !659, line: 69, type: !118, isLocal: false, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !658, file: !659, line: 295, type: !144, isLocal: false, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !659, line: 208, type: !420, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !659, line: 208, type: !700, isLocal: true, isDefinition: true)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 21)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !659, line: 214, type: !24, isLocal: true, isDefinition: true)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null}
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !710, line: 35, type: !401, isLocal: true, isDefinition: true)
!710 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "program_name", scope: !713, file: !714, line: 31, type: !206, isLocal: false, isDefinition: true)
!713 = distinct !DICompileUnit(language: DW_LANG_C11, file: !714, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !715, globals: !716, splitDebugInlining: false, nameTableKind: None)
!714 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!715 = !{!200}
!716 = !{!711, !717, !719}
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !714, line: 46, type: !425, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !714, line: 49, type: !396, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "utf07FF", scope: !723, file: !724, line: 46, type: !747, isLocal: true, isDefinition: true)
!723 = distinct !DISubprogram(name: "proper_name_lite", scope: !724, file: !724, line: 38, type: !725, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !727, retainedNodes: !729)
!724 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!725 = !DISubroutineType(types: !726)
!726 = !{!206, !206, !206}
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !728, splitDebugInlining: false, nameTableKind: None)
!728 = !{!721}
!729 = !{!730, !731, !732, !733, !734}
!730 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !723, file: !724, line: 38, type: !206)
!731 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !723, file: !724, line: 38, type: !206)
!732 = !DILocalVariable(name: "translation", scope: !723, file: !724, line: 40, type: !206)
!733 = !DILocalVariable(name: "w", scope: !723, file: !724, line: 47, type: !299)
!734 = !DILocalVariable(name: "mbs", scope: !723, file: !724, line: 48, type: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !736, line: 6, baseType: !737)
!736 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !738, line: 21, baseType: !739)
!738 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !738, line: 13, size: 64, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !739, file: !738, line: 15, baseType: !144, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !739, file: !738, line: 20, baseType: !743, size: 32, offset: 32)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !739, file: !738, line: 16, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !743, file: !738, line: 18, baseType: !118, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !743, file: !738, line: 19, baseType: !396, size: 32)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 16, elements: !262)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !750, line: 78, type: !425, isLocal: true, isDefinition: true)
!750 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !750, line: 79, type: !401, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !750, line: 80, type: !246, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !750, line: 81, type: !246, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !750, line: 82, type: !212, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !750, line: 83, type: !261, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !750, line: 84, type: !425, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !750, line: 85, type: !420, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !750, line: 86, type: !420, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !750, line: 87, type: !425, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !771, file: !750, line: 76, type: !843, isLocal: false, isDefinition: true)
!771 = distinct !DICompileUnit(language: DW_LANG_C11, file: !750, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !772, retainedTypes: !778, globals: !779, splitDebugInlining: false, nameTableKind: None)
!772 = !{!148, !773, !162}
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !149, line: 254, baseType: !118, size: 32, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!776 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!777 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!778 = !{!144, !202, !203}
!779 = !{!748, !751, !753, !755, !757, !759, !761, !763, !765, !767, !769, !780, !784, !794, !796, !801, !803, !805, !807, !809, !832, !839, !841}
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !771, file: !750, line: 92, type: !782, isLocal: false, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 320, elements: !106)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !771, file: !750, line: 1040, type: !786, isLocal: false, isDefinition: true)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !750, line: 56, size: 448, elements: !787)
!787 = !{!788, !789, !790, !792, !793}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !786, file: !750, line: 59, baseType: !148, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !786, file: !750, line: 62, baseType: !144, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !786, file: !750, line: 66, baseType: !791, size: 256, offset: 64)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 256, elements: !426)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !786, file: !750, line: 69, baseType: !206, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !786, file: !750, line: 72, baseType: !206, size: 64, offset: 384)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !771, file: !750, line: 107, type: !786, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "slot0", scope: !771, file: !750, line: 831, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 256)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !750, line: 321, type: !261, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !750, line: 357, type: !261, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !750, line: 358, type: !261, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !750, line: 199, type: !420, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "quote", scope: !811, file: !750, line: 228, type: !830, isLocal: true, isDefinition: true)
!811 = distinct !DISubprogram(name: "gettext_quote", scope: !750, file: !750, line: 197, type: !812, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !771, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{!206, !206, !148}
!814 = !{!815, !816, !817, !818, !819}
!815 = !DILocalVariable(name: "msgid", arg: 1, scope: !811, file: !750, line: 197, type: !206)
!816 = !DILocalVariable(name: "s", arg: 2, scope: !811, file: !750, line: 197, type: !148)
!817 = !DILocalVariable(name: "translation", scope: !811, file: !750, line: 199, type: !206)
!818 = !DILocalVariable(name: "w", scope: !811, file: !750, line: 229, type: !299)
!819 = !DILocalVariable(name: "mbs", scope: !811, file: !750, line: 230, type: !820)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !736, line: 6, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !738, line: 21, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !738, line: 13, size: 64, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !822, file: !738, line: 15, baseType: !144, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !822, file: !738, line: 20, baseType: !826, size: 32, offset: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !738, line: 16, size: 32, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !826, file: !738, line: 18, baseType: !118, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !826, file: !738, line: 19, baseType: !396, size: 32)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !831)
!831 = !{!263, !398}
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "slotvec", scope: !771, file: !750, line: 834, type: !834, isLocal: true, isDefinition: true)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !750, line: 823, size: 128, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !835, file: !750, line: 825, baseType: !203, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !835, file: !750, line: 826, baseType: !200, size: 64, offset: 64)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "nslots", scope: !771, file: !750, line: 832, type: !144, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "slotvec0", scope: !771, file: !750, line: 833, type: !835, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 704, elements: !577)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !847, line: 67, type: !496, isLocal: true, isDefinition: true)
!847 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !847, line: 69, type: !420, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !847, line: 83, type: !420, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !847, line: 83, type: !396, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !847, line: 85, type: !261, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !847, line: 88, type: !858, isLocal: true, isDefinition: true)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 171)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !847, line: 88, type: !553, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !847, line: 105, type: !251, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !847, line: 109, type: !231, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !847, line: 113, type: !564, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !847, line: 120, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 32)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !847, line: 127, type: !270, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !847, line: 134, type: !447, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !847, line: 142, type: !219, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !847, line: 150, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 48)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !847, line: 159, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 52)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !847, line: 170, type: !19, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !847, line: 248, type: !212, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !847, line: 248, type: !472, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !847, line: 254, type: !212, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !847, line: 254, type: !241, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !847, line: 254, type: !447, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !847, line: 259, type: !3, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !847, line: 259, type: !275, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !908, file: !909, line: 26, type: !911, isLocal: false, isDefinition: true)
!908 = distinct !DICompileUnit(language: DW_LANG_C11, file: !909, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !910, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!910 = !{!906}
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 376, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 47)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !916, line: 34, type: !226, isLocal: true, isDefinition: true)
!916 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !916, line: 34, type: !420, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !916, line: 34, type: !442, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !923, line: 39, type: !420, isLocal: true, isDefinition: true)
!923 = !DIFile(filename: "lib/xmemcoll.c", directory: "/src", checksumkind: CSK_MD5, checksum: "77ad181911e918137a808414fb759bea")
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !923, line: 39, type: !256, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !923, line: 40, type: !928, isLocal: true, isDefinition: true)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 43)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "exit_failure", scope: !933, file: !934, line: 24, type: !936, isLocal: false, isDefinition: true)
!933 = distinct !DICompileUnit(language: DW_LANG_C11, file: !934, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !935, splitDebugInlining: false, nameTableKind: None)
!934 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!935 = !{!931}
!936 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !144)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !923, line: 41, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 37)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !944, file: !945, line: 506, type: !144, isLocal: true, isDefinition: true)
!944 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !945, file: !945, line: 485, type: !946, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !948, retainedNodes: !950)
!945 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!946 = !DISubroutineType(types: !947)
!947 = !{!144, !144, !144}
!948 = distinct !DICompileUnit(language: DW_LANG_C11, file: !945, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !949, splitDebugInlining: false, nameTableKind: None)
!949 = !{!942}
!950 = !{!951, !952, !953, !954, !957}
!951 = !DILocalVariable(name: "fd", arg: 1, scope: !944, file: !945, line: 485, type: !144)
!952 = !DILocalVariable(name: "target", arg: 2, scope: !944, file: !945, line: 485, type: !144)
!953 = !DILocalVariable(name: "result", scope: !944, file: !945, line: 487, type: !144)
!954 = !DILocalVariable(name: "flags", scope: !955, file: !945, line: 530, type: !144)
!955 = distinct !DILexicalBlock(scope: !956, file: !945, line: 529, column: 5)
!956 = distinct !DILexicalBlock(scope: !944, file: !945, line: 528, column: 7)
!957 = !DILocalVariable(name: "saved_errno", scope: !958, file: !945, line: 533, type: !144)
!958 = distinct !DILexicalBlock(scope: !959, file: !945, line: 532, column: 9)
!959 = distinct !DILexicalBlock(scope: !955, file: !945, line: 531, column: 11)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !962, line: 108, type: !100, isLocal: true, isDefinition: true)
!962 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "internal_state", scope: !965, file: !962, line: 97, type: !968, isLocal: true, isDefinition: true)
!965 = distinct !DICompileUnit(language: DW_LANG_C11, file: !962, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !966, globals: !967, splitDebugInlining: false, nameTableKind: None)
!966 = !{!201, !203, !208}
!967 = !{!960, !963}
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !736, line: 6, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !738, line: 21, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !738, line: 13, size: 64, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !970, file: !738, line: 15, baseType: !144, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !970, file: !738, line: 20, baseType: !974, size: 32, offset: 32)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !738, line: 16, size: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !974, file: !738, line: 18, baseType: !118, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !974, file: !738, line: 19, baseType: !396, size: 32)
!978 = distinct !DICompileUnit(language: DW_LANG_C11, file: !979, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !980, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!980 = !{!190}
!981 = distinct !DICompileUnit(language: DW_LANG_C11, file: !982, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!983 = distinct !DICompileUnit(language: DW_LANG_C11, file: !984, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!985 = !{!201}
!986 = distinct !DICompileUnit(language: DW_LANG_C11, file: !987, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!988 = distinct !DICompileUnit(language: DW_LANG_C11, file: !989, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!989 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!990 = distinct !DICompileUnit(language: DW_LANG_C11, file: !991, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!992 = distinct !DICompileUnit(language: DW_LANG_C11, file: !993, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!993 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!994 = distinct !DICompileUnit(language: DW_LANG_C11, file: !710, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !995, splitDebugInlining: false, nameTableKind: None)
!995 = !{!996, !708}
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !710, line: 35, type: !261, isLocal: true, isDefinition: true)
!998 = distinct !DICompileUnit(language: DW_LANG_C11, file: !999, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1000, splitDebugInlining: false, nameTableKind: None)
!999 = !DIFile(filename: "lib/linebuffer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d85d9b8947aefddab7f1bb42f1d43333")
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!1002 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1003, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "lib/memcasecmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9561ef43f3c3f66f3a67023c94981a8b")
!1004 = !{!144}
!1005 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1006, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1008, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1009 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1010, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1010 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1011 = distinct !DICompileUnit(language: DW_LANG_C11, file: !847, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1012, retainedTypes: !985, globals: !1016, splitDebugInlining: false, nameTableKind: None)
!1012 = !{!1013}
!1013 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !847, line: 40, baseType: !118, size: 32, elements: !1014)
!1014 = !{!1015}
!1015 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1016 = !{!845, !848, !850, !852, !854, !856, !861, !863, !865, !867, !869, !874, !876, !878, !880, !885, !890, !892, !894, !896, !898, !900, !902, !904}
!1017 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1018, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1019, retainedTypes: !1047, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1019 = !{!1020, !1032}
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1021, file: !1018, line: 188, baseType: !118, size: 32, elements: !1030)
!1021 = distinct !DISubprogram(name: "x2nrealloc", scope: !1018, file: !1018, line: 176, type: !1022, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1017, retainedNodes: !1025)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!201, !201, !1024, !203}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!1025 = !{!1026, !1027, !1028, !1029}
!1026 = !DILocalVariable(name: "p", arg: 1, scope: !1021, file: !1018, line: 176, type: !201)
!1027 = !DILocalVariable(name: "pn", arg: 2, scope: !1021, file: !1018, line: 176, type: !1024)
!1028 = !DILocalVariable(name: "s", arg: 3, scope: !1021, file: !1018, line: 176, type: !203)
!1029 = !DILocalVariable(name: "n", scope: !1021, file: !1018, line: 178, type: !203)
!1030 = !{!1031}
!1031 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1032 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1033, file: !1018, line: 228, baseType: !118, size: 32, elements: !1030)
!1033 = distinct !DISubprogram(name: "xpalloc", scope: !1018, file: !1018, line: 223, type: !1034, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1017, retainedNodes: !1037)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!201, !201, !1036, !510, !512, !510}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!1038 = !DILocalVariable(name: "pa", arg: 1, scope: !1033, file: !1018, line: 223, type: !201)
!1039 = !DILocalVariable(name: "pn", arg: 2, scope: !1033, file: !1018, line: 223, type: !1036)
!1040 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1033, file: !1018, line: 223, type: !510)
!1041 = !DILocalVariable(name: "n_max", arg: 4, scope: !1033, file: !1018, line: 223, type: !512)
!1042 = !DILocalVariable(name: "s", arg: 5, scope: !1033, file: !1018, line: 223, type: !510)
!1043 = !DILocalVariable(name: "n0", scope: !1033, file: !1018, line: 230, type: !510)
!1044 = !DILocalVariable(name: "n", scope: !1033, file: !1018, line: 237, type: !510)
!1045 = !DILocalVariable(name: "nbytes", scope: !1033, file: !1018, line: 248, type: !510)
!1046 = !DILocalVariable(name: "adjusted_nbytes", scope: !1033, file: !1018, line: 252, type: !510)
!1047 = !{!200, !201, !283, !363, !205}
!1048 = distinct !DICompileUnit(language: DW_LANG_C11, file: !916, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1049, splitDebugInlining: false, nameTableKind: None)
!1049 = !{!914, !917, !919}
!1050 = distinct !DICompileUnit(language: DW_LANG_C11, file: !923, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1051, globals: !1052, splitDebugInlining: false, nameTableKind: None)
!1051 = !{!148}
!1052 = !{!921, !924, !926, !937}
!1053 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1054, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1055, retainedTypes: !1056, splitDebugInlining: false, nameTableKind: None)
!1054 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1055 = !{!124}
!1056 = !{!283, !363, !205, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !622, line: 101, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !302, line: 72, baseType: !363)
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1060, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1055, retainedTypes: !1061, splitDebugInlining: false, nameTableKind: None)
!1060 = !DIFile(filename: "lib/xstrtol.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a1112be551b7ea11a9f6293a4923a73")
!1061 = !{!283, !363, !205}
!1062 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1063, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!1063 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1064 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1065, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1065 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1066 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1067, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1067 = !DIFile(filename: "lib/memcoll.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f316fa5066b9311c53750cfc7e26d495")
!1068 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1069, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1070, splitDebugInlining: false, nameTableKind: None)
!1069 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1070 = !{!283, !205, !201}
!1071 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1072 = !{i32 7, !"Dwarf Version", i32 5}
!1073 = !{i32 2, !"Debug Info Version", i32 3}
!1074 = !{i32 1, !"wchar_size", i32 4}
!1075 = !{i32 8, !"PIC Level", i32 2}
!1076 = !{i32 7, !"PIE Level", i32 2}
!1077 = !{i32 7, !"uwtable", i32 2}
!1078 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 189, type: !1079, scopeLine: 190, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !1081)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{null, !144}
!1081 = !{!1082}
!1082 = !DILocalVariable(name: "status", arg: 1, scope: !1078, file: !2, line: 189, type: !144)
!1083 = !DILocation(line: 0, scope: !1078)
!1084 = !DILocation(line: 191, column: 14, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 191, column: 7)
!1086 = !DILocation(line: 191, column: 7, scope: !1078)
!1087 = !DILocation(line: 192, column: 5, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1085, file: !2, line: 192, column: 5)
!1089 = !{!1090, !1090, i64 0}
!1090 = !{!"any pointer", !1091, i64 0}
!1091 = !{!"omnipotent char", !1092, i64 0}
!1092 = !{!"Simple C/C++ TBAA"}
!1093 = !DILocation(line: 195, column: 7, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1085, file: !2, line: 194, column: 5)
!1095 = !DILocation(line: 199, column: 7, scope: !1094)
!1096 = !DILocation(line: 204, column: 7, scope: !1094)
!1097 = !DILocation(line: 209, column: 7, scope: !1094)
!1098 = !DILocation(line: 214, column: 7, scope: !1094)
!1099 = !DILocation(line: 219, column: 7, scope: !1094)
!1100 = !DILocation(line: 223, column: 7, scope: !1094)
!1101 = !DILocation(line: 227, column: 7, scope: !1094)
!1102 = !DILocation(line: 231, column: 7, scope: !1094)
!1103 = !DILocation(line: 235, column: 7, scope: !1094)
!1104 = !DILocation(line: 239, column: 7, scope: !1094)
!1105 = !DILocation(line: 243, column: 7, scope: !1094)
!1106 = !DILocation(line: 247, column: 7, scope: !1094)
!1107 = !DILocation(line: 252, column: 7, scope: !1094)
!1108 = !DILocation(line: 256, column: 7, scope: !1094)
!1109 = !DILocation(line: 261, column: 7, scope: !1094)
!1110 = !DILocation(line: 265, column: 7, scope: !1094)
!1111 = !DILocation(line: 266, column: 7, scope: !1094)
!1112 = !DILocation(line: 267, column: 7, scope: !1094)
!1113 = !DILocalVariable(name: "program", arg: 1, scope: !1114, file: !143, line: 836, type: !206)
!1114 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !143, file: !143, line: 836, type: !1115, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !1117)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !206}
!1117 = !{!1113, !1118, !1125, !1126, !1128, !1129}
!1118 = !DILocalVariable(name: "infomap", scope: !1114, file: !143, line: 838, type: !1119)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1120, size: 896, elements: !421)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1114, file: !143, line: 838, size: 128, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1121, file: !143, line: 838, baseType: !206, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1121, file: !143, line: 838, baseType: !206, size: 64, offset: 64)
!1125 = !DILocalVariable(name: "node", scope: !1114, file: !143, line: 848, type: !206)
!1126 = !DILocalVariable(name: "map_prog", scope: !1114, file: !143, line: 849, type: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1128 = !DILocalVariable(name: "lc_messages", scope: !1114, file: !143, line: 861, type: !206)
!1129 = !DILocalVariable(name: "url_program", scope: !1114, file: !143, line: 874, type: !206)
!1130 = !DILocation(line: 0, scope: !1114, inlinedAt: !1131)
!1131 = distinct !DILocation(line: 284, column: 7, scope: !1094)
!1132 = !DILocation(line: 857, column: 3, scope: !1114, inlinedAt: !1131)
!1133 = !DILocation(line: 861, column: 29, scope: !1114, inlinedAt: !1131)
!1134 = !DILocation(line: 862, column: 7, scope: !1135, inlinedAt: !1131)
!1135 = distinct !DILexicalBlock(scope: !1114, file: !143, line: 862, column: 7)
!1136 = !DILocation(line: 862, column: 19, scope: !1135, inlinedAt: !1131)
!1137 = !DILocation(line: 862, column: 22, scope: !1135, inlinedAt: !1131)
!1138 = !DILocation(line: 862, column: 7, scope: !1114, inlinedAt: !1131)
!1139 = !DILocation(line: 868, column: 7, scope: !1140, inlinedAt: !1131)
!1140 = distinct !DILexicalBlock(scope: !1135, file: !143, line: 863, column: 5)
!1141 = !DILocation(line: 870, column: 5, scope: !1140, inlinedAt: !1131)
!1142 = !DILocation(line: 875, column: 3, scope: !1114, inlinedAt: !1131)
!1143 = !DILocation(line: 877, column: 3, scope: !1114, inlinedAt: !1131)
!1144 = !DILocation(line: 286, column: 3, scope: !1078)
!1145 = !DISubprogram(name: "dcgettext", scope: !1146, file: !1146, line: 51, type: !1147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1146 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!200, !206, !206, !144}
!1149 = !{}
!1150 = !DISubprogram(name: "__fprintf_chk", scope: !1151, file: !1151, line: 93, type: !1152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!144, !1154, !144, !1155, null}
!1154 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !336)
!1155 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !206)
!1156 = !DISubprogram(name: "__printf_chk", scope: !1151, file: !1151, line: 95, type: !1157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!144, !144, !1155, null}
!1159 = !DISubprogram(name: "fputs_unlocked", scope: !1160, file: !1160, line: 691, type: !1161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1160 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!144, !1155, !1154}
!1163 = !DILocation(line: 0, scope: !314)
!1164 = !DILocation(line: 581, column: 7, scope: !322)
!1165 = !{!1166, !1166, i64 0}
!1166 = !{!"int", !1091, i64 0}
!1167 = !DILocation(line: 581, column: 19, scope: !322)
!1168 = !DILocation(line: 581, column: 7, scope: !314)
!1169 = !DILocation(line: 585, column: 26, scope: !321)
!1170 = !DILocation(line: 0, scope: !321)
!1171 = !DILocation(line: 586, column: 23, scope: !321)
!1172 = !DILocation(line: 586, column: 28, scope: !321)
!1173 = !DILocation(line: 586, column: 32, scope: !321)
!1174 = !{!1091, !1091, i64 0}
!1175 = !DILocation(line: 586, column: 38, scope: !321)
!1176 = !DILocalVariable(name: "__s1", arg: 1, scope: !1177, file: !1178, line: 1359, type: !206)
!1177 = distinct !DISubprogram(name: "streq", scope: !1178, file: !1178, line: 1359, type: !1179, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !1181)
!1178 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!283, !206, !206}
!1181 = !{!1176, !1182}
!1182 = !DILocalVariable(name: "__s2", arg: 2, scope: !1177, file: !1178, line: 1359, type: !206)
!1183 = !DILocation(line: 0, scope: !1177, inlinedAt: !1184)
!1184 = distinct !DILocation(line: 586, column: 41, scope: !321)
!1185 = !DILocation(line: 1361, column: 11, scope: !1177, inlinedAt: !1184)
!1186 = !DILocation(line: 1361, column: 10, scope: !1177, inlinedAt: !1184)
!1187 = !DILocation(line: 586, column: 19, scope: !321)
!1188 = !DILocation(line: 587, column: 5, scope: !321)
!1189 = !DILocation(line: 588, column: 7, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !314, file: !143, line: 588, column: 7)
!1191 = !DILocation(line: 588, column: 7, scope: !314)
!1192 = !DILocation(line: 590, column: 7, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1190, file: !143, line: 589, column: 5)
!1194 = !DILocation(line: 591, column: 7, scope: !1193)
!1195 = !DILocation(line: 595, column: 37, scope: !314)
!1196 = !DILocation(line: 595, column: 35, scope: !314)
!1197 = !DILocation(line: 596, column: 29, scope: !314)
!1198 = !DILocation(line: 597, column: 8, scope: !329)
!1199 = !DILocation(line: 597, column: 7, scope: !314)
!1200 = !DILocation(line: 604, column: 24, scope: !328)
!1201 = !DILocation(line: 604, column: 12, scope: !329)
!1202 = !DILocation(line: 0, scope: !327)
!1203 = !DILocation(line: 610, column: 16, scope: !327)
!1204 = !DILocation(line: 610, column: 7, scope: !327)
!1205 = !DILocation(line: 611, column: 21, scope: !327)
!1206 = !{!1207, !1207, i64 0}
!1207 = !{!"short", !1091, i64 0}
!1208 = !DILocation(line: 611, column: 19, scope: !327)
!1209 = !DILocation(line: 611, column: 16, scope: !327)
!1210 = !DILocation(line: 610, column: 30, scope: !327)
!1211 = distinct !{!1211, !1204, !1205, !1212}
!1212 = !{!"llvm.loop.mustprogress"}
!1213 = !DILocation(line: 612, column: 18, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !327, file: !143, line: 612, column: 11)
!1215 = !DILocation(line: 612, column: 11, scope: !327)
!1216 = !DILocation(line: 618, column: 5, scope: !327)
!1217 = !DILocation(line: 620, column: 23, scope: !314)
!1218 = !DILocation(line: 625, column: 39, scope: !314)
!1219 = !DILocation(line: 626, column: 3, scope: !314)
!1220 = !DILocation(line: 626, column: 10, scope: !314)
!1221 = !DILocation(line: 626, column: 21, scope: !314)
!1222 = !DILocation(line: 628, column: 44, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !143, line: 628, column: 11)
!1224 = distinct !DILexicalBlock(scope: !314, file: !143, line: 627, column: 5)
!1225 = !DILocation(line: 628, column: 32, scope: !1223)
!1226 = !DILocation(line: 628, column: 49, scope: !1223)
!1227 = !DILocation(line: 628, column: 11, scope: !1224)
!1228 = !DILocation(line: 630, column: 11, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1224, file: !143, line: 630, column: 11)
!1230 = !DILocation(line: 630, column: 11, scope: !1224)
!1231 = !DILocation(line: 632, column: 26, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !143, line: 632, column: 15)
!1233 = distinct !DILexicalBlock(scope: !1229, file: !143, line: 631, column: 9)
!1234 = !DILocation(line: 632, column: 34, scope: !1232)
!1235 = !DILocation(line: 632, column: 37, scope: !1232)
!1236 = !DILocation(line: 632, column: 15, scope: !1233)
!1237 = !DILocation(line: 636, column: 16, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1233, file: !143, line: 636, column: 15)
!1239 = !DILocation(line: 636, column: 29, scope: !1238)
!1240 = !DILocation(line: 640, column: 16, scope: !1224)
!1241 = distinct !{!1241, !1219, !1242, !1212}
!1242 = !DILocation(line: 641, column: 5, scope: !314)
!1243 = !DILocation(line: 644, column: 3, scope: !314)
!1244 = !DILocation(line: 0, scope: !1177, inlinedAt: !1245)
!1245 = distinct !DILocation(line: 648, column: 31, scope: !314)
!1246 = !DILocation(line: 0, scope: !1177, inlinedAt: !1247)
!1247 = distinct !DILocation(line: 649, column: 31, scope: !314)
!1248 = !DILocation(line: 0, scope: !1177, inlinedAt: !1249)
!1249 = distinct !DILocation(line: 650, column: 31, scope: !314)
!1250 = !DILocation(line: 0, scope: !1177, inlinedAt: !1251)
!1251 = distinct !DILocation(line: 651, column: 31, scope: !314)
!1252 = !DILocation(line: 0, scope: !1177, inlinedAt: !1253)
!1253 = distinct !DILocation(line: 652, column: 31, scope: !314)
!1254 = !DILocation(line: 0, scope: !1177, inlinedAt: !1255)
!1255 = distinct !DILocation(line: 653, column: 31, scope: !314)
!1256 = !DILocation(line: 0, scope: !1177, inlinedAt: !1257)
!1257 = distinct !DILocation(line: 654, column: 31, scope: !314)
!1258 = !DILocation(line: 0, scope: !1177, inlinedAt: !1259)
!1259 = distinct !DILocation(line: 655, column: 31, scope: !314)
!1260 = !DILocation(line: 0, scope: !1177, inlinedAt: !1261)
!1261 = distinct !DILocation(line: 656, column: 31, scope: !314)
!1262 = !DILocation(line: 0, scope: !1177, inlinedAt: !1263)
!1263 = distinct !DILocation(line: 657, column: 31, scope: !314)
!1264 = !DILocation(line: 663, column: 7, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !314, file: !143, line: 663, column: 7)
!1266 = !DILocation(line: 664, column: 7, scope: !1265)
!1267 = !DILocation(line: 664, column: 10, scope: !1265)
!1268 = !DILocation(line: 663, column: 7, scope: !314)
!1269 = !DILocation(line: 669, column: 7, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1265, file: !143, line: 665, column: 5)
!1271 = !DILocation(line: 671, column: 5, scope: !1270)
!1272 = !DILocation(line: 676, column: 7, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1265, file: !143, line: 673, column: 5)
!1274 = !DILocation(line: 679, column: 3, scope: !314)
!1275 = !DILocation(line: 683, column: 3, scope: !314)
!1276 = !DILocation(line: 686, column: 3, scope: !314)
!1277 = !DILocation(line: 688, column: 3, scope: !314)
!1278 = !DILocation(line: 691, column: 3, scope: !314)
!1279 = !DILocation(line: 695, column: 3, scope: !314)
!1280 = !DILocation(line: 696, column: 1, scope: !314)
!1281 = !DISubprogram(name: "setlocale", scope: !1282, file: !1282, line: 122, type: !1283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1282 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!200, !144, !206}
!1285 = !DISubprogram(name: "strncmp", scope: !1286, file: !1286, line: 159, type: !1287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1286 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!144, !206, !206, !203}
!1289 = !DISubprogram(name: "exit", scope: !1290, file: !1290, line: 624, type: !1079, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1290 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1291 = !DISubprogram(name: "getenv", scope: !1290, file: !1290, line: 641, type: !1292, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!200, !206}
!1294 = !DISubprogram(name: "strcmp", scope: !1286, file: !1286, line: 156, type: !1295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!144, !206, !206}
!1297 = !DISubprogram(name: "strspn", scope: !1286, file: !1286, line: 297, type: !1298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1149)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!205, !206, !206}
