; ModuleID = 'src/link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s FILE1 FILE2\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [76 x i8] c"Call the link function to create a link named FILE2 to an existing FILE1.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"link\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 15)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !77, line: 676, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 61)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !77, line: 679, type: !148, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !77, line: 683, type: !19, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !77, line: 688, type: !19, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !77, line: 691, type: !164, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !77, line: 839, type: !56, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !77, line: 840, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 22)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !77, line: 841, type: !185, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !77, line: 862, type: !129, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !77, line: 868, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 71)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !77, line: 875, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 27)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 51)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 12)
!232 = !{!233, !234, !235, !238, !240, !241, !242, !246, !247, !248, !249, !251, !305, !306, !307, !309, !310}
!233 = !DILocalVariable(name: "program", arg: 1, scope: !76, file: !77, line: 573, type: !80)
!234 = !DILocalVariable(name: "option", arg: 2, scope: !76, file: !77, line: 573, type: !80)
!235 = !DILocalVariable(name: "term", scope: !236, file: !77, line: 585, type: !80)
!236 = distinct !DILexicalBlock(scope: !237, file: !77, line: 582, column: 5)
!237 = distinct !DILexicalBlock(scope: !76, file: !77, line: 581, column: 7)
!238 = !DILocalVariable(name: "double_space", scope: !76, file: !77, line: 594, type: !239)
!239 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!240 = !DILocalVariable(name: "first_word", scope: !76, file: !77, line: 595, type: !80)
!241 = !DILocalVariable(name: "option_text", scope: !76, file: !77, line: 596, type: !80)
!242 = !DILocalVariable(name: "s", scope: !243, file: !77, line: 608, type: !80)
!243 = distinct !DILexicalBlock(scope: !244, file: !77, line: 605, column: 5)
!244 = distinct !DILexicalBlock(scope: !245, file: !77, line: 604, column: 12)
!245 = distinct !DILexicalBlock(scope: !76, file: !77, line: 597, column: 7)
!246 = !DILocalVariable(name: "spaces", scope: !243, file: !77, line: 609, type: !118)
!247 = !DILocalVariable(name: "anchor_len", scope: !76, file: !77, line: 620, type: !118)
!248 = !DILocalVariable(name: "desc_text", scope: !76, file: !77, line: 625, type: !80)
!249 = !DILocalVariable(name: "__ptr", scope: !250, file: !77, line: 644, type: !80)
!250 = distinct !DILexicalBlock(scope: !76, file: !77, line: 644, column: 3)
!251 = !DILocalVariable(name: "__stream", scope: !250, file: !77, line: 644, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !255)
!254 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !257)
!256 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!257 = !{!258, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !274, !276, !277, !278, !282, !283, !285, !286, !289, !291, !294, !297, !298, !299, !300, !301}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !255, file: !256, line: 51, baseType: !116, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !255, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !255, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !255, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !255, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !255, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !255, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !255, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !255, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !255, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !255, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !255, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !255, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !256, line: 36, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !255, file: !256, line: 70, baseType: !275, size: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !255, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !255, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !255, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !280, line: 152, baseType: !281)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!281 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !255, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !255, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!284 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !255, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !255, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !256, line: 43, baseType: null)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !255, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !280, line: 153, baseType: !281)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !255, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !256, line: 37, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !255, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !256, line: 38, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !255, file: !256, line: 93, baseType: !275, size: 64, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !255, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !255, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !255, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !255, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 20)
!305 = !DILocalVariable(name: "__cnt", scope: !250, file: !77, line: 644, type: !118)
!306 = !DILocalVariable(name: "url_program", scope: !76, file: !77, line: 648, type: !80)
!307 = !DILocalVariable(name: "__ptr", scope: !308, file: !77, line: 686, type: !80)
!308 = distinct !DILexicalBlock(scope: !76, file: !77, line: 686, column: 3)
!309 = !DILocalVariable(name: "__stream", scope: !308, file: !77, line: 686, type: !252)
!310 = !DILocalVariable(name: "__cnt", scope: !308, file: !77, line: 686, type: !118)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !313, line: 3, type: !185, isLocal: true, isDefinition: true)
!313 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "Version", scope: !316, file: !313, line: 3, type: !80, isLocal: false, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!317 = !{!311, !314}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "file_name", scope: !320, file: !321, line: 45, type: !80, isLocal: true, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C11, file: !321, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !322, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!322 = !{!323, !325, !327, !329, !318, !331}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !159, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !229, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !321, line: 123, type: !159, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !321, line: 126, type: !148, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !320, file: !321, line: 55, type: !239, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !335, file: !336, line: 66, type: !382, isLocal: false, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C11, file: !336, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !337, globals: !338, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!337 = !{!115, !121}
!338 = !{!339, !341, !361, !363, !365, !367, !333, !369, !371, !373, !375, !380}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !336, line: 272, type: !19, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "old_file_name", scope: !343, file: !336, line: 304, type: !80, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "verror_at_line", scope: !336, file: !336, line: 298, type: !344, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !354)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !116, !116, !80, !86, !80, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !348)
!348 = !{!349, !351, !352, !353}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !347, file: !350, baseType: !86, size: 32)
!350 = !DIFile(filename: "lib/error.c", directory: "/src")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !347, file: !350, baseType: !86, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !347, file: !350, baseType: !115, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !347, file: !350, baseType: !115, size: 64, offset: 128)
!354 = !{!355, !356, !357, !358, !359, !360}
!355 = !DILocalVariable(name: "status", arg: 1, scope: !343, file: !336, line: 298, type: !116)
!356 = !DILocalVariable(name: "errnum", arg: 2, scope: !343, file: !336, line: 298, type: !116)
!357 = !DILocalVariable(name: "file_name", arg: 3, scope: !343, file: !336, line: 298, type: !80)
!358 = !DILocalVariable(name: "line_number", arg: 4, scope: !343, file: !336, line: 298, type: !86)
!359 = !DILocalVariable(name: "message", arg: 5, scope: !343, file: !336, line: 298, type: !80)
!360 = !DILocalVariable(name: "args", arg: 6, scope: !343, file: !336, line: 298, type: !346)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "old_line_number", scope: !343, file: !336, line: 305, type: !86, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !336, line: 338, type: !129, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !164, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !139, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "error_message_count", scope: !335, file: !336, line: 69, type: !86, isLocal: false, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !335, file: !336, line: 295, type: !116, isLocal: false, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !159, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 21)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !336, line: 214, type: !19, isLocal: true, isDefinition: true)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null}
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !387, line: 60, type: !139, isLocal: true, isDefinition: true)
!387 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "long_options", scope: !390, file: !387, line: 34, type: !398, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C11, file: !387, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!391 = !{!385, !392, !394, !396, !388}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !387, line: 112, type: !34, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !387, line: 36, type: !19, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !387, line: 37, type: !164, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 768, elements: !149)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !401, line: 50, size: 256, elements: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!402 = !{!403, !404, !405, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !401, line: 52, baseType: !80, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !400, file: !401, line: 55, baseType: !116, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !401, line: 56, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !400, file: !401, line: 57, baseType: !116, size: 32, offset: 192)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "program_name", scope: !410, file: !411, line: 31, type: !80, isLocal: false, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, globals: !413, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!412 = !{!260}
!413 = !{!408, !414, !416}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !411, line: 46, type: !164, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !411, line: 49, type: !129, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "utf07FF", scope: !420, file: !421, line: 46, type: !448, isLocal: true, isDefinition: true)
!420 = distinct !DISubprogram(name: "proper_name_lite", scope: !421, file: !421, line: 38, type: !422, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !424, retainedNodes: !426)
!421 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!422 = !DISubroutineType(types: !423)
!423 = !{!80, !80, !80}
!424 = distinct !DICompileUnit(language: DW_LANG_C11, file: !421, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !425, splitDebugInlining: false, nameTableKind: None)
!425 = !{!418}
!426 = !{!427, !428, !429, !430, !435}
!427 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !420, file: !421, line: 38, type: !80)
!428 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !420, file: !421, line: 38, type: !80)
!429 = !DILocalVariable(name: "translation", scope: !420, file: !421, line: 40, type: !80)
!430 = !DILocalVariable(name: "w", scope: !420, file: !421, line: 47, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !432, line: 37, baseType: !433)
!432 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !280, line: 57, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !280, line: 42, baseType: !86)
!435 = !DILocalVariable(name: "mbs", scope: !420, file: !421, line: 48, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !438)
!437 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !440)
!439 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !440, file: !439, line: 15, baseType: !116, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !440, file: !439, line: 20, baseType: !444, size: 32, offset: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !439, line: 16, size: 32, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !444, file: !439, line: 18, baseType: !86, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !444, file: !439, line: 19, baseType: !129, size: 32)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !140)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !451, line: 78, type: !164, isLocal: true, isDefinition: true)
!451 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !451, line: 79, type: !134, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !451, line: 80, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 13)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !451, line: 81, type: !456, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !451, line: 82, type: !302, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !451, line: 83, type: !139, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !451, line: 84, type: !164, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !451, line: 85, type: !159, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !451, line: 86, type: !159, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !451, line: 87, type: !164, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !475, file: !451, line: 76, type: !547, isLocal: false, isDefinition: true)
!475 = distinct !DICompileUnit(language: DW_LANG_C11, file: !451, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !476, retainedTypes: !482, globals: !483, splitDebugInlining: false, nameTableKind: None)
!476 = !{!84, !477, !99}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !85, line: 254, baseType: !86, size: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!480 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!481 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!482 = !{!116, !117, !118}
!483 = !{!449, !452, !454, !459, !461, !463, !465, !467, !469, !471, !473, !484, !488, !498, !500, !505, !507, !509, !511, !513, !536, !543, !545}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !475, file: !451, line: 92, type: !486, isLocal: false, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 320, elements: !40)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !475, file: !451, line: 1040, type: !490, isLocal: false, isDefinition: true)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !451, line: 56, size: 448, elements: !491)
!491 = !{!492, !493, !494, !496, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !490, file: !451, line: 59, baseType: !84, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !490, file: !451, line: 62, baseType: !116, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !490, file: !451, line: 66, baseType: !495, size: 256, offset: 64)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 256, elements: !165)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !490, file: !451, line: 69, baseType: !80, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !490, file: !451, line: 72, baseType: !80, size: 64, offset: 384)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !475, file: !451, line: 107, type: !490, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "slot0", scope: !475, file: !451, line: 831, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 256)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !451, line: 321, type: !139, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !451, line: 357, type: !139, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !451, line: 358, type: !139, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !451, line: 199, type: !159, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "quote", scope: !515, file: !451, line: 228, type: !534, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "gettext_quote", scope: !451, file: !451, line: 197, type: !516, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !475, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!80, !80, !84}
!518 = !{!519, !520, !521, !522, !523}
!519 = !DILocalVariable(name: "msgid", arg: 1, scope: !515, file: !451, line: 197, type: !80)
!520 = !DILocalVariable(name: "s", arg: 2, scope: !515, file: !451, line: 197, type: !84)
!521 = !DILocalVariable(name: "translation", scope: !515, file: !451, line: 199, type: !80)
!522 = !DILocalVariable(name: "w", scope: !515, file: !451, line: 229, type: !431)
!523 = !DILocalVariable(name: "mbs", scope: !515, file: !451, line: 230, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !526, file: !439, line: 15, baseType: !116, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !526, file: !439, line: 20, baseType: !530, size: 32, offset: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !439, line: 16, size: 32, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !530, file: !439, line: 18, baseType: !86, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !530, file: !439, line: 19, baseType: !129, size: 32)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !535)
!535 = !{!141, !131}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "slotvec", scope: !475, file: !451, line: 834, type: !538, isLocal: true, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !451, line: 823, size: 128, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !539, file: !451, line: 825, baseType: !118, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !539, file: !451, line: 826, baseType: !260, size: 64, offset: 64)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "nslots", scope: !475, file: !451, line: 832, type: !116, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "slotvec0", scope: !475, file: !451, line: 833, type: !539, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 704, elements: !549)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!549 = !{!550}
!550 = !DISubrange(count: 11)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !553, line: 67, type: !229, isLocal: true, isDefinition: true)
!553 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !553, line: 69, type: !159, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !553, line: 83, type: !159, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !553, line: 83, type: !129, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !553, line: 85, type: !139, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !553, line: 88, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 171)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !553, line: 88, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 34)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !553, line: 105, type: !56, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !553, line: 109, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 23)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !553, line: 113, type: !71, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !553, line: 120, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 32)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !553, line: 127, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 36)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !553, line: 134, type: !9, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !553, line: 142, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 44)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !553, line: 150, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 48)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !553, line: 159, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 52)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !553, line: 170, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 60)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !553, line: 248, type: !302, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !553, line: 248, type: !205, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !302, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !49, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !9, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !553, line: 259, type: !3, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !553, line: 259, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 29)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !632, file: !633, line: 26, type: !635, isLocal: false, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C11, file: !633, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !634, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!634 = !{!630}
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 376, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 47)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "exit_failure", scope: !640, file: !641, line: 24, type: !643, isLocal: false, isDefinition: true)
!640 = distinct !DICompileUnit(language: DW_LANG_C11, file: !641, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !642, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!642 = !{!638}
!643 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !646, line: 34, type: !148, isLocal: true, isDefinition: true)
!646 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !646, line: 34, type: !159, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !646, line: 34, type: !66, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !653, line: 108, type: !34, isLocal: true, isDefinition: true)
!653 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "internal_state", scope: !656, file: !653, line: 97, type: !659, isLocal: true, isDefinition: true)
!656 = distinct !DICompileUnit(language: DW_LANG_C11, file: !653, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!657 = !{!115, !118, !121}
!658 = !{!651, !654}
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !661, file: !439, line: 15, baseType: !116, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !661, file: !439, line: 20, baseType: !665, size: 32, offset: 32)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !439, line: 16, size: 32, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !665, file: !439, line: 18, baseType: !86, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !665, file: !439, line: 19, baseType: !129, size: 32)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !671, line: 35, type: !134, isLocal: true, isDefinition: true)
!671 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!672 = distinct !DICompileUnit(language: DW_LANG_C11, file: !673, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!674 = distinct !DICompileUnit(language: DW_LANG_C11, file: !553, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !675, retainedTypes: !679, globals: !680, splitDebugInlining: false, nameTableKind: None)
!675 = !{!676}
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 40, baseType: !86, size: 32, elements: !677)
!677 = !{!678}
!678 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!679 = !{!115}
!680 = !{!551, !554, !556, !558, !560, !562, !567, !572, !574, !579, !581, !586, !591, !593, !598, !603, !608, !613, !615, !617, !619, !621, !623, !625}
!681 = distinct !DICompileUnit(language: DW_LANG_C11, file: !682, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !683, retainedTypes: !714, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!683 = !{!684, !696}
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !685, file: !682, line: 188, baseType: !86, size: 32, elements: !694)
!685 = distinct !DISubprogram(name: "x2nrealloc", scope: !682, file: !682, line: 176, type: !686, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !681, retainedNodes: !689)
!686 = !DISubroutineType(types: !687)
!687 = !{!115, !115, !688, !118}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!689 = !{!690, !691, !692, !693}
!690 = !DILocalVariable(name: "p", arg: 1, scope: !685, file: !682, line: 176, type: !115)
!691 = !DILocalVariable(name: "pn", arg: 2, scope: !685, file: !682, line: 176, type: !688)
!692 = !DILocalVariable(name: "s", arg: 3, scope: !685, file: !682, line: 176, type: !118)
!693 = !DILocalVariable(name: "n", scope: !685, file: !682, line: 178, type: !118)
!694 = !{!695}
!695 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !697, file: !682, line: 228, baseType: !86, size: 32, elements: !694)
!697 = distinct !DISubprogram(name: "xpalloc", scope: !682, file: !682, line: 223, type: !698, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !681, retainedNodes: !704)
!698 = !DISubroutineType(types: !699)
!699 = !{!115, !115, !700, !701, !703, !701}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !702, line: 130, baseType: !703)
!702 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !119, line: 35, baseType: !281)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713}
!705 = !DILocalVariable(name: "pa", arg: 1, scope: !697, file: !682, line: 223, type: !115)
!706 = !DILocalVariable(name: "pn", arg: 2, scope: !697, file: !682, line: 223, type: !700)
!707 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !697, file: !682, line: 223, type: !701)
!708 = !DILocalVariable(name: "n_max", arg: 4, scope: !697, file: !682, line: 223, type: !703)
!709 = !DILocalVariable(name: "s", arg: 5, scope: !697, file: !682, line: 223, type: !701)
!710 = !DILocalVariable(name: "n0", scope: !697, file: !682, line: 230, type: !701)
!711 = !DILocalVariable(name: "n", scope: !697, file: !682, line: 237, type: !701)
!712 = !DILocalVariable(name: "nbytes", scope: !697, file: !682, line: 248, type: !701)
!713 = !DILocalVariable(name: "adjusted_nbytes", scope: !697, file: !682, line: 252, type: !701)
!714 = !{!260, !115, !239, !281, !120}
!715 = distinct !DICompileUnit(language: DW_LANG_C11, file: !646, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !716, splitDebugInlining: false, nameTableKind: None)
!716 = !{!644, !647, !649}
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !718, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !722, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !679, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !679, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !727, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!727 = !{!239, !120, !115}
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !671, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !729, splitDebugInlining: false, nameTableKind: None)
!729 = !{!730, !669}
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !671, line: 35, type: !139, isLocal: true, isDefinition: true)
!732 = distinct !DICompileUnit(language: DW_LANG_C11, file: !733, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!734 = distinct !DICompileUnit(language: DW_LANG_C11, file: !735, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !679, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!736 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!737 = !{i32 7, !"Dwarf Version", i32 5}
!738 = !{i32 2, !"Debug Info Version", i32 3}
!739 = !{i32 1, !"wchar_size", i32 4}
!740 = !{i32 8, !"PIC Level", i32 2}
!741 = !{i32 7, !"PIE Level", i32 2}
!742 = !{i32 7, !"uwtable", i32 2}
!743 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !744, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !116}
!746 = !{!747}
!747 = !DILocalVariable(name: "status", arg: 1, scope: !743, file: !2, line: 37, type: !116)
!748 = !DILocation(line: 0, scope: !743)
!749 = !DILocation(line: 39, column: 14, scope: !750)
!750 = distinct !DILexicalBlock(scope: !743, file: !2, line: 39, column: 7)
!751 = !DILocation(line: 39, column: 7, scope: !743)
!752 = !DILocation(line: 40, column: 5, scope: !753)
!753 = distinct !DILexicalBlock(scope: !750, file: !2, line: 40, column: 5)
!754 = !{!755, !755, i64 0}
!755 = !{!"any pointer", !756, i64 0}
!756 = !{!"omnipotent char", !757, i64 0}
!757 = !{!"Simple C/C++ TBAA"}
!758 = !DILocation(line: 43, column: 7, scope: !759)
!759 = distinct !DILexicalBlock(scope: !750, file: !2, line: 42, column: 5)
!760 = !DILocation(line: 46, column: 7, scope: !759)
!761 = !DILocation(line: 49, column: 7, scope: !759)
!762 = !DILocation(line: 50, column: 7, scope: !759)
!763 = !DILocalVariable(name: "program", arg: 1, scope: !764, file: !77, line: 836, type: !80)
!764 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !77, file: !77, line: 836, type: !765, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !80}
!767 = !{!763, !768, !775, !776, !778, !779}
!768 = !DILocalVariable(name: "infomap", scope: !764, file: !77, line: 838, type: !769)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 896, elements: !160)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !764, file: !77, line: 838, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !771, file: !77, line: 838, baseType: !80, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !771, file: !77, line: 838, baseType: !80, size: 64, offset: 64)
!775 = !DILocalVariable(name: "node", scope: !764, file: !77, line: 848, type: !80)
!776 = !DILocalVariable(name: "map_prog", scope: !764, file: !77, line: 849, type: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!778 = !DILocalVariable(name: "lc_messages", scope: !764, file: !77, line: 861, type: !80)
!779 = !DILocalVariable(name: "url_program", scope: !764, file: !77, line: 874, type: !80)
!780 = !DILocation(line: 0, scope: !764, inlinedAt: !781)
!781 = distinct !DILocation(line: 51, column: 7, scope: !759)
!782 = !DILocation(line: 857, column: 3, scope: !764, inlinedAt: !781)
!783 = !DILocation(line: 861, column: 29, scope: !764, inlinedAt: !781)
!784 = !DILocation(line: 862, column: 7, scope: !785, inlinedAt: !781)
!785 = distinct !DILexicalBlock(scope: !764, file: !77, line: 862, column: 7)
!786 = !DILocation(line: 862, column: 19, scope: !785, inlinedAt: !781)
!787 = !DILocation(line: 862, column: 22, scope: !785, inlinedAt: !781)
!788 = !DILocation(line: 862, column: 7, scope: !764, inlinedAt: !781)
!789 = !DILocation(line: 868, column: 7, scope: !790, inlinedAt: !781)
!790 = distinct !DILexicalBlock(scope: !785, file: !77, line: 863, column: 5)
!791 = !DILocation(line: 870, column: 5, scope: !790, inlinedAt: !781)
!792 = !DILocation(line: 875, column: 3, scope: !764, inlinedAt: !781)
!793 = !DILocation(line: 877, column: 3, scope: !764, inlinedAt: !781)
!794 = !DILocation(line: 53, column: 3, scope: !743)
!795 = !DISubprogram(name: "dcgettext", scope: !796, file: !796, line: 51, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!796 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!797 = !DISubroutineType(types: !798)
!798 = !{!260, !80, !80, !116}
!799 = !{}
!800 = !DISubprogram(name: "__fprintf_chk", scope: !801, file: !801, line: 93, type: !802, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!801 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!802 = !DISubroutineType(types: !803)
!803 = !{!116, !804, !116, !805, null}
!804 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !252)
!805 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!806 = !DISubprogram(name: "__printf_chk", scope: !801, file: !801, line: 95, type: !807, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!807 = !DISubroutineType(types: !808)
!808 = !{!116, !116, !805, null}
!809 = !DISubprogram(name: "fputs_unlocked", scope: !810, file: !810, line: 691, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!810 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!811 = !DISubroutineType(types: !812)
!812 = !{!116, !805, !804}
!813 = !DILocation(line: 0, scope: !76)
!814 = !DILocation(line: 581, column: 7, scope: !237)
!815 = !{!816, !816, i64 0}
!816 = !{!"int", !756, i64 0}
!817 = !DILocation(line: 581, column: 19, scope: !237)
!818 = !DILocation(line: 581, column: 7, scope: !76)
!819 = !DILocation(line: 585, column: 26, scope: !236)
!820 = !DILocation(line: 0, scope: !236)
!821 = !DILocation(line: 586, column: 23, scope: !236)
!822 = !DILocation(line: 586, column: 28, scope: !236)
!823 = !DILocation(line: 586, column: 32, scope: !236)
!824 = !{!756, !756, i64 0}
!825 = !DILocation(line: 586, column: 38, scope: !236)
!826 = !DILocalVariable(name: "__s1", arg: 1, scope: !827, file: !828, line: 1359, type: !80)
!827 = distinct !DISubprogram(name: "streq", scope: !828, file: !828, line: 1359, type: !829, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !831)
!828 = !DIFile(filename: "./lib/string.h", directory: "/src")
!829 = !DISubroutineType(types: !830)
!830 = !{!239, !80, !80}
!831 = !{!826, !832}
!832 = !DILocalVariable(name: "__s2", arg: 2, scope: !827, file: !828, line: 1359, type: !80)
!833 = !DILocation(line: 0, scope: !827, inlinedAt: !834)
!834 = distinct !DILocation(line: 586, column: 41, scope: !236)
!835 = !DILocation(line: 1361, column: 11, scope: !827, inlinedAt: !834)
!836 = !DILocation(line: 1361, column: 10, scope: !827, inlinedAt: !834)
!837 = !DILocation(line: 586, column: 19, scope: !236)
!838 = !DILocation(line: 587, column: 5, scope: !236)
!839 = !DILocation(line: 588, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !76, file: !77, line: 588, column: 7)
!841 = !DILocation(line: 588, column: 7, scope: !76)
!842 = !DILocation(line: 590, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !840, file: !77, line: 589, column: 5)
!844 = !DILocation(line: 591, column: 7, scope: !843)
!845 = !DILocation(line: 595, column: 37, scope: !76)
!846 = !DILocation(line: 595, column: 35, scope: !76)
!847 = !DILocation(line: 596, column: 29, scope: !76)
!848 = !DILocation(line: 597, column: 8, scope: !245)
!849 = !DILocation(line: 597, column: 7, scope: !76)
!850 = !DILocation(line: 604, column: 24, scope: !244)
!851 = !DILocation(line: 604, column: 12, scope: !245)
!852 = !DILocation(line: 0, scope: !243)
!853 = !DILocation(line: 610, column: 16, scope: !243)
!854 = !DILocation(line: 610, column: 7, scope: !243)
!855 = !DILocation(line: 611, column: 21, scope: !243)
!856 = !{!857, !857, i64 0}
!857 = !{!"short", !756, i64 0}
!858 = !DILocation(line: 611, column: 19, scope: !243)
!859 = !DILocation(line: 611, column: 16, scope: !243)
!860 = !DILocation(line: 610, column: 30, scope: !243)
!861 = distinct !{!861, !854, !855, !862}
!862 = !{!"llvm.loop.mustprogress"}
!863 = !DILocation(line: 612, column: 18, scope: !864)
!864 = distinct !DILexicalBlock(scope: !243, file: !77, line: 612, column: 11)
!865 = !DILocation(line: 612, column: 11, scope: !243)
!866 = !DILocation(line: 618, column: 5, scope: !243)
!867 = !DILocation(line: 620, column: 23, scope: !76)
!868 = !DILocation(line: 625, column: 39, scope: !76)
!869 = !DILocation(line: 626, column: 3, scope: !76)
!870 = !DILocation(line: 626, column: 10, scope: !76)
!871 = !DILocation(line: 626, column: 21, scope: !76)
!872 = !DILocation(line: 628, column: 44, scope: !873)
!873 = distinct !DILexicalBlock(scope: !874, file: !77, line: 628, column: 11)
!874 = distinct !DILexicalBlock(scope: !76, file: !77, line: 627, column: 5)
!875 = !DILocation(line: 628, column: 32, scope: !873)
!876 = !DILocation(line: 628, column: 49, scope: !873)
!877 = !DILocation(line: 628, column: 11, scope: !874)
!878 = !DILocation(line: 630, column: 11, scope: !879)
!879 = distinct !DILexicalBlock(scope: !874, file: !77, line: 630, column: 11)
!880 = !DILocation(line: 630, column: 11, scope: !874)
!881 = !DILocation(line: 632, column: 26, scope: !882)
!882 = distinct !DILexicalBlock(scope: !883, file: !77, line: 632, column: 15)
!883 = distinct !DILexicalBlock(scope: !879, file: !77, line: 631, column: 9)
!884 = !DILocation(line: 632, column: 34, scope: !882)
!885 = !DILocation(line: 632, column: 37, scope: !882)
!886 = !DILocation(line: 632, column: 15, scope: !883)
!887 = !DILocation(line: 636, column: 16, scope: !888)
!888 = distinct !DILexicalBlock(scope: !883, file: !77, line: 636, column: 15)
!889 = !DILocation(line: 636, column: 29, scope: !888)
!890 = !DILocation(line: 640, column: 16, scope: !874)
!891 = distinct !{!891, !869, !892, !862}
!892 = !DILocation(line: 641, column: 5, scope: !76)
!893 = !DILocation(line: 644, column: 3, scope: !76)
!894 = !DILocation(line: 0, scope: !827, inlinedAt: !895)
!895 = distinct !DILocation(line: 648, column: 31, scope: !76)
!896 = !DILocation(line: 0, scope: !827, inlinedAt: !897)
!897 = distinct !DILocation(line: 649, column: 31, scope: !76)
!898 = !DILocation(line: 0, scope: !827, inlinedAt: !899)
!899 = distinct !DILocation(line: 650, column: 31, scope: !76)
!900 = !DILocation(line: 0, scope: !827, inlinedAt: !901)
!901 = distinct !DILocation(line: 651, column: 31, scope: !76)
!902 = !DILocation(line: 0, scope: !827, inlinedAt: !903)
!903 = distinct !DILocation(line: 652, column: 31, scope: !76)
!904 = !DILocation(line: 0, scope: !827, inlinedAt: !905)
!905 = distinct !DILocation(line: 653, column: 31, scope: !76)
!906 = !DILocation(line: 0, scope: !827, inlinedAt: !907)
!907 = distinct !DILocation(line: 654, column: 31, scope: !76)
!908 = !DILocation(line: 0, scope: !827, inlinedAt: !909)
!909 = distinct !DILocation(line: 655, column: 31, scope: !76)
!910 = !DILocation(line: 0, scope: !827, inlinedAt: !911)
!911 = distinct !DILocation(line: 656, column: 31, scope: !76)
!912 = !DILocation(line: 0, scope: !827, inlinedAt: !913)
!913 = distinct !DILocation(line: 657, column: 31, scope: !76)
!914 = !DILocation(line: 663, column: 7, scope: !915)
!915 = distinct !DILexicalBlock(scope: !76, file: !77, line: 663, column: 7)
!916 = !DILocation(line: 664, column: 7, scope: !915)
!917 = !DILocation(line: 664, column: 10, scope: !915)
!918 = !DILocation(line: 663, column: 7, scope: !76)
!919 = !DILocation(line: 669, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !915, file: !77, line: 665, column: 5)
!921 = !DILocation(line: 671, column: 5, scope: !920)
!922 = !DILocation(line: 676, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !915, file: !77, line: 673, column: 5)
!924 = !DILocation(line: 679, column: 3, scope: !76)
!925 = !DILocation(line: 683, column: 3, scope: !76)
!926 = !DILocation(line: 686, column: 3, scope: !76)
!927 = !DILocation(line: 688, column: 3, scope: !76)
!928 = !DILocation(line: 691, column: 3, scope: !76)
!929 = !DILocation(line: 695, column: 3, scope: !76)
!930 = !DILocation(line: 696, column: 1, scope: !76)
!931 = !DISubprogram(name: "setlocale", scope: !932, file: !932, line: 122, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!932 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!933 = !DISubroutineType(types: !934)
!934 = !{!260, !116, !80}
!935 = !DISubprogram(name: "strncmp", scope: !936, file: !936, line: 159, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!936 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!937 = !DISubroutineType(types: !938)
!938 = !{!116, !80, !80, !118}
!939 = !DISubprogram(name: "exit", scope: !940, file: !940, line: 624, type: !744, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !799)
!940 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!941 = !DISubprogram(name: "getenv", scope: !940, file: !940, line: 641, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!942 = !DISubroutineType(types: !943)
!943 = !{!260, !80}
!944 = !DISubprogram(name: "strcmp", scope: !936, file: !936, line: 156, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!945 = !DISubroutineType(types: !946)
!946 = !{!116, !80, !80}
!947 = !DISubprogram(name: "strspn", scope: !936, file: !936, line: 297, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!948 = !DISubroutineType(types: !949)
!949 = !{!120, !80, !80}
!950 = !DISubprogram(name: "strchr", scope: !936, file: !936, line: 246, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!951 = !DISubroutineType(types: !952)
!952 = !{!260, !80, !116}
!953 = !DISubprogram(name: "__ctype_b_loc", scope: !100, file: !100, line: 79, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!954 = !DISubroutineType(types: !955)
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!959 = !DISubprogram(name: "strcspn", scope: !936, file: !936, line: 293, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!960 = !DISubprogram(name: "fwrite_unlocked", scope: !810, file: !810, line: 704, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!961 = !DISubroutineType(types: !962)
!962 = !{!118, !963, !118, !118, !804}
!963 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!966 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 57, type: !967, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !970)
!967 = !DISubroutineType(types: !968)
!968 = !{!116, !116, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!970 = !{!971, !972}
!971 = !DILocalVariable(name: "argc", arg: 1, scope: !966, file: !2, line: 57, type: !116)
!972 = !DILocalVariable(name: "argv", arg: 2, scope: !966, file: !2, line: 57, type: !969)
!973 = !DILocation(line: 0, scope: !966)
!974 = !DILocation(line: 60, column: 21, scope: !966)
!975 = !DILocation(line: 60, column: 3, scope: !966)
!976 = !DILocation(line: 61, column: 3, scope: !966)
!977 = !DILocation(line: 62, column: 3, scope: !966)
!978 = !DILocation(line: 63, column: 3, scope: !966)
!979 = !DILocation(line: 65, column: 3, scope: !966)
!980 = !DILocation(line: 68, column: 36, scope: !966)
!981 = !DILocation(line: 68, column: 58, scope: !966)
!982 = !DILocation(line: 67, column: 3, scope: !966)
!983 = !DILocation(line: 71, column: 14, scope: !984)
!984 = distinct !DILexicalBlock(scope: !966, file: !2, line: 71, column: 7)
!985 = !DILocation(line: 71, column: 21, scope: !984)
!986 = !DILocation(line: 71, column: 12, scope: !984)
!987 = !DILocation(line: 71, column: 7, scope: !966)
!988 = !DILocation(line: 73, column: 16, scope: !989)
!989 = distinct !DILexicalBlock(scope: !990, file: !2, line: 73, column: 11)
!990 = distinct !DILexicalBlock(scope: !984, file: !2, line: 72, column: 5)
!991 = !DILocation(line: 73, column: 11, scope: !990)
!992 = !DILocation(line: 74, column: 9, scope: !989)
!993 = !DILocation(line: 76, column: 9, scope: !989)
!994 = !DILocation(line: 77, column: 7, scope: !990)
!995 = !DILocation(line: 80, column: 18, scope: !996)
!996 = distinct !DILexicalBlock(scope: !966, file: !2, line: 80, column: 7)
!997 = !DILocation(line: 80, column: 7, scope: !966)
!998 = !DILocation(line: 82, column: 7, scope: !999)
!999 = distinct !DILexicalBlock(scope: !996, file: !2, line: 81, column: 5)
!1000 = !DILocation(line: 83, column: 7, scope: !999)
!1001 = !DILocation(line: 86, column: 13, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !966, file: !2, line: 86, column: 7)
!1003 = !DILocation(line: 86, column: 39, scope: !1002)
!1004 = !DILocation(line: 86, column: 27, scope: !1002)
!1005 = !DILocation(line: 86, column: 7, scope: !1002)
!1006 = !DILocation(line: 86, column: 45, scope: !1002)
!1007 = !DILocation(line: 86, column: 7, scope: !966)
!1008 = !DILocation(line: 87, column: 5, scope: !1002)
!1009 = !DILocation(line: 90, column: 3, scope: !966)
!1010 = !DISubprogram(name: "bindtextdomain", scope: !796, file: !796, line: 86, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!260, !80, !80}
!1013 = !DISubprogram(name: "textdomain", scope: !796, file: !796, line: 82, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1014 = !DISubprogram(name: "atexit", scope: !940, file: !940, line: 602, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!116, !382}
!1017 = !DISubprogram(name: "link", scope: !1018, file: !1018, line: 819, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1018 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1019 = !DISubprogram(name: "__errno_location", scope: !1020, file: !1020, line: 37, type: !1021, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1020 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!406}
!1023 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !321, file: !321, line: 50, type: !765, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1024)
!1024 = !{!1025}
!1025 = !DILocalVariable(name: "file", arg: 1, scope: !1023, file: !321, line: 50, type: !80)
!1026 = !DILocation(line: 0, scope: !1023)
!1027 = !DILocation(line: 52, column: 13, scope: !1023)
!1028 = !DILocation(line: 53, column: 1, scope: !1023)
!1029 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !321, file: !321, line: 87, type: !1030, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1032)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !239}
!1032 = !{!1033}
!1033 = !DILocalVariable(name: "ignore", arg: 1, scope: !1029, file: !321, line: 87, type: !239)
!1034 = !DILocation(line: 0, scope: !1029)
!1035 = !DILocation(line: 89, column: 16, scope: !1029)
!1036 = !{!1037, !1037, i64 0}
!1037 = !{!"_Bool", !756, i64 0}
!1038 = !DILocation(line: 90, column: 1, scope: !1029)
!1039 = distinct !DISubprogram(name: "close_stdout", scope: !321, file: !321, line: 116, type: !383, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1040)
!1040 = !{!1041}
!1041 = !DILocalVariable(name: "write_error", scope: !1042, file: !321, line: 121, type: !80)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !321, line: 120, column: 5)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !321, line: 118, column: 7)
!1044 = !DILocation(line: 118, column: 21, scope: !1043)
!1045 = !DILocation(line: 118, column: 7, scope: !1043)
!1046 = !DILocation(line: 118, column: 29, scope: !1043)
!1047 = !DILocation(line: 119, column: 7, scope: !1043)
!1048 = !DILocation(line: 119, column: 12, scope: !1043)
!1049 = !{i8 0, i8 2}
!1050 = !DILocation(line: 119, column: 25, scope: !1043)
!1051 = !DILocation(line: 119, column: 28, scope: !1043)
!1052 = !DILocation(line: 119, column: 34, scope: !1043)
!1053 = !DILocation(line: 118, column: 7, scope: !1039)
!1054 = !DILocation(line: 121, column: 33, scope: !1042)
!1055 = !DILocation(line: 0, scope: !1042)
!1056 = !DILocation(line: 122, column: 11, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1042, file: !321, line: 122, column: 11)
!1058 = !DILocation(line: 0, scope: !1057)
!1059 = !DILocation(line: 122, column: 11, scope: !1042)
!1060 = !DILocation(line: 123, column: 9, scope: !1057)
!1061 = !DILocation(line: 126, column: 9, scope: !1057)
!1062 = !DILocation(line: 128, column: 14, scope: !1042)
!1063 = !DILocation(line: 128, column: 7, scope: !1042)
!1064 = !DILocation(line: 133, column: 42, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1039, file: !321, line: 133, column: 7)
!1066 = !DILocation(line: 133, column: 28, scope: !1065)
!1067 = !DILocation(line: 133, column: 50, scope: !1065)
!1068 = !DILocation(line: 133, column: 7, scope: !1039)
!1069 = !DILocation(line: 134, column: 12, scope: !1065)
!1070 = !DILocation(line: 134, column: 5, scope: !1065)
!1071 = !DILocation(line: 135, column: 1, scope: !1039)
!1072 = !DISubprogram(name: "_exit", scope: !1018, file: !1018, line: 624, type: !744, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1073 = distinct !DISubprogram(name: "verror", scope: !336, file: !336, line: 251, type: !1074, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1076)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !116, !116, !80, !346}
!1076 = !{!1077, !1078, !1079, !1080}
!1077 = !DILocalVariable(name: "status", arg: 1, scope: !1073, file: !336, line: 251, type: !116)
!1078 = !DILocalVariable(name: "errnum", arg: 2, scope: !1073, file: !336, line: 251, type: !116)
!1079 = !DILocalVariable(name: "message", arg: 3, scope: !1073, file: !336, line: 251, type: !80)
!1080 = !DILocalVariable(name: "args", arg: 4, scope: !1073, file: !336, line: 251, type: !346)
!1081 = !DILocation(line: 0, scope: !1073)
!1082 = !DILocation(line: 261, column: 3, scope: !1073)
!1083 = !DILocation(line: 265, column: 7, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1073, file: !336, line: 265, column: 7)
!1085 = !DILocation(line: 265, column: 7, scope: !1073)
!1086 = !DILocation(line: 266, column: 5, scope: !1084)
!1087 = !DILocation(line: 272, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1084, file: !336, line: 268, column: 5)
!1089 = !DILocation(line: 276, column: 3, scope: !1073)
!1090 = !DILocation(line: 282, column: 1, scope: !1073)
!1091 = distinct !DISubprogram(name: "flush_stdout", scope: !336, file: !336, line: 163, type: !383, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1092)
!1092 = !{!1093}
!1093 = !DILocalVariable(name: "stdout_fd", scope: !1091, file: !336, line: 166, type: !116)
!1094 = !DILocation(line: 0, scope: !1091)
!1095 = !DILocalVariable(name: "fd", arg: 1, scope: !1096, file: !336, line: 145, type: !116)
!1096 = distinct !DISubprogram(name: "is_open", scope: !336, file: !336, line: 145, type: !1097, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1099)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!116, !116}
!1099 = !{!1095}
!1100 = !DILocation(line: 0, scope: !1096, inlinedAt: !1101)
!1101 = distinct !DILocation(line: 182, column: 25, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1091, file: !336, line: 182, column: 7)
!1103 = !DILocation(line: 157, column: 15, scope: !1096, inlinedAt: !1101)
!1104 = !DILocation(line: 157, column: 12, scope: !1096, inlinedAt: !1101)
!1105 = !DILocation(line: 182, column: 7, scope: !1091)
!1106 = !DILocation(line: 184, column: 5, scope: !1102)
!1107 = !DILocation(line: 185, column: 1, scope: !1091)
!1108 = distinct !DISubprogram(name: "error_tail", scope: !336, file: !336, line: 219, type: !1074, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1109)
!1109 = !{!1110, !1111, !1112, !1113}
!1110 = !DILocalVariable(name: "status", arg: 1, scope: !1108, file: !336, line: 219, type: !116)
!1111 = !DILocalVariable(name: "errnum", arg: 2, scope: !1108, file: !336, line: 219, type: !116)
!1112 = !DILocalVariable(name: "message", arg: 3, scope: !1108, file: !336, line: 219, type: !80)
!1113 = !DILocalVariable(name: "args", arg: 4, scope: !1108, file: !336, line: 219, type: !346)
!1114 = !DILocation(line: 0, scope: !1108)
!1115 = !DILocation(line: 229, column: 13, scope: !1108)
!1116 = !DILocalVariable(name: "__stream", arg: 1, scope: !1117, file: !801, line: 132, type: !1120)
!1117 = distinct !DISubprogram(name: "vfprintf", scope: !801, file: !801, line: 132, type: !1118, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1155)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!116, !1120, !805, !346}
!1120 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1123, file: !256, line: 51, baseType: !116, size: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1123, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1123, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1123, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1123, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1123, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1123, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1123, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1123, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1123, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1123, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1123, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1123, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1123, file: !256, line: 70, baseType: !1139, size: 64, offset: 832)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1123, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1123, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1123, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1123, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1123, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1123, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1123, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1123, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1123, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1123, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1123, file: !256, line: 93, baseType: !1139, size: 64, offset: 1344)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1123, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1123, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1123, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1123, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!1155 = !{!1116, !1156, !1157}
!1156 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1117, file: !801, line: 133, type: !805)
!1157 = !DILocalVariable(name: "__ap", arg: 3, scope: !1117, file: !801, line: 133, type: !346)
!1158 = !DILocation(line: 0, scope: !1117, inlinedAt: !1159)
!1159 = distinct !DILocation(line: 229, column: 3, scope: !1108)
!1160 = !DILocation(line: 135, column: 10, scope: !1117, inlinedAt: !1159)
!1161 = !DILocation(line: 232, column: 3, scope: !1108)
!1162 = !DILocation(line: 233, column: 7, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1108, file: !336, line: 233, column: 7)
!1164 = !DILocation(line: 233, column: 7, scope: !1108)
!1165 = !DILocalVariable(name: "errnum", arg: 1, scope: !1166, file: !336, line: 188, type: !116)
!1166 = distinct !DISubprogram(name: "print_errno_message", scope: !336, file: !336, line: 188, type: !744, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1167)
!1167 = !{!1165, !1168, !1169}
!1168 = !DILocalVariable(name: "s", scope: !1166, file: !336, line: 190, type: !80)
!1169 = !DILocalVariable(name: "errbuf", scope: !1166, file: !336, line: 193, type: !1170)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1171)
!1171 = !{!1172}
!1172 = !DISubrange(count: 1024)
!1173 = !DILocation(line: 0, scope: !1166, inlinedAt: !1174)
!1174 = distinct !DILocation(line: 234, column: 5, scope: !1163)
!1175 = !DILocation(line: 193, column: 3, scope: !1166, inlinedAt: !1174)
!1176 = !DILocation(line: 193, column: 8, scope: !1166, inlinedAt: !1174)
!1177 = !DILocation(line: 195, column: 7, scope: !1166, inlinedAt: !1174)
!1178 = !DILocation(line: 207, column: 9, scope: !1179, inlinedAt: !1174)
!1179 = distinct !DILexicalBlock(scope: !1166, file: !336, line: 207, column: 7)
!1180 = !DILocation(line: 207, column: 7, scope: !1166, inlinedAt: !1174)
!1181 = !DILocation(line: 208, column: 9, scope: !1179, inlinedAt: !1174)
!1182 = !DILocation(line: 208, column: 5, scope: !1179, inlinedAt: !1174)
!1183 = !DILocation(line: 214, column: 3, scope: !1166, inlinedAt: !1174)
!1184 = !DILocation(line: 216, column: 1, scope: !1166, inlinedAt: !1174)
!1185 = !DILocation(line: 234, column: 5, scope: !1163)
!1186 = !DILocation(line: 238, column: 3, scope: !1108)
!1187 = !DILocalVariable(name: "__c", arg: 1, scope: !1188, file: !1189, line: 101, type: !116)
!1188 = distinct !DISubprogram(name: "putc_unlocked", scope: !1189, file: !1189, line: 101, type: !1190, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1192)
!1189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!116, !116, !1121}
!1192 = !{!1187, !1193}
!1193 = !DILocalVariable(name: "__stream", arg: 2, scope: !1188, file: !1189, line: 101, type: !1121)
!1194 = !DILocation(line: 0, scope: !1188, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 238, column: 3, scope: !1108)
!1196 = !DILocation(line: 103, column: 10, scope: !1188, inlinedAt: !1195)
!1197 = !{!1198, !755, i64 40}
!1198 = !{!"_IO_FILE", !816, i64 0, !755, i64 8, !755, i64 16, !755, i64 24, !755, i64 32, !755, i64 40, !755, i64 48, !755, i64 56, !755, i64 64, !755, i64 72, !755, i64 80, !755, i64 88, !755, i64 96, !755, i64 104, !816, i64 112, !816, i64 116, !1199, i64 120, !857, i64 128, !756, i64 130, !756, i64 131, !755, i64 136, !1199, i64 144, !755, i64 152, !755, i64 160, !755, i64 168, !755, i64 176, !1199, i64 184, !816, i64 192, !756, i64 196}
!1199 = !{!"long", !756, i64 0}
!1200 = !{!1198, !755, i64 48}
!1201 = !{!"branch_weights", i32 2000, i32 1}
!1202 = !DILocation(line: 240, column: 3, scope: !1108)
!1203 = !DILocation(line: 241, column: 7, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1108, file: !336, line: 241, column: 7)
!1205 = !DILocation(line: 241, column: 7, scope: !1108)
!1206 = !DILocation(line: 242, column: 5, scope: !1204)
!1207 = !DILocation(line: 243, column: 1, scope: !1108)
!1208 = !DISubprogram(name: "__vfprintf_chk", scope: !801, file: !801, line: 96, type: !1209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!116, !1120, !116, !805, !346}
!1211 = !DISubprogram(name: "strerror_r", scope: !936, file: !936, line: 444, type: !1212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!260, !116, !260, !118}
!1214 = !DISubprogram(name: "__overflow", scope: !810, file: !810, line: 886, type: !1215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!116, !1121, !116}
!1217 = !DISubprogram(name: "fflush_unlocked", scope: !810, file: !810, line: 239, type: !1218, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!116, !1121}
!1220 = !DISubprogram(name: "fcntl", scope: !1221, file: !1221, line: 149, type: !1222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !799)
!1221 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!116, !116, !116, null}
!1224 = distinct !DISubprogram(name: "error", scope: !336, file: !336, line: 285, type: !1225, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1227)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{null, !116, !116, !80, null}
!1227 = !{!1228, !1229, !1230, !1231}
!1228 = !DILocalVariable(name: "status", arg: 1, scope: !1224, file: !336, line: 285, type: !116)
!1229 = !DILocalVariable(name: "errnum", arg: 2, scope: !1224, file: !336, line: 285, type: !116)
!1230 = !DILocalVariable(name: "message", arg: 3, scope: !1224, file: !336, line: 285, type: !80)
!1231 = !DILocalVariable(name: "ap", scope: !1224, file: !336, line: 287, type: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !810, line: 52, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1234, line: 14, baseType: !1235)
!1234 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !350, baseType: !1236)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 192, elements: !35)
!1237 = !DILocation(line: 0, scope: !1224)
!1238 = !DILocation(line: 287, column: 3, scope: !1224)
!1239 = !DILocation(line: 287, column: 11, scope: !1224)
!1240 = !DILocation(line: 288, column: 3, scope: !1224)
!1241 = !DILocation(line: 289, column: 3, scope: !1224)
!1242 = !DILocation(line: 290, column: 3, scope: !1224)
!1243 = !DILocation(line: 291, column: 1, scope: !1224)
!1244 = !DILocation(line: 0, scope: !343)
!1245 = !DILocation(line: 302, column: 7, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !343, file: !336, line: 302, column: 7)
!1247 = !DILocation(line: 302, column: 7, scope: !343)
!1248 = !DILocation(line: 307, column: 11, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !336, line: 307, column: 11)
!1250 = distinct !DILexicalBlock(scope: !1246, file: !336, line: 303, column: 5)
!1251 = !DILocation(line: 307, column: 27, scope: !1249)
!1252 = !DILocation(line: 308, column: 11, scope: !1249)
!1253 = !DILocation(line: 308, column: 28, scope: !1249)
!1254 = !DILocation(line: 308, column: 25, scope: !1249)
!1255 = !DILocation(line: 309, column: 15, scope: !1249)
!1256 = !DILocation(line: 309, column: 33, scope: !1249)
!1257 = !DILocation(line: 310, column: 19, scope: !1249)
!1258 = !DILocation(line: 311, column: 22, scope: !1249)
!1259 = !DILocation(line: 311, column: 56, scope: !1249)
!1260 = !DILocation(line: 307, column: 11, scope: !1250)
!1261 = !DILocation(line: 316, column: 21, scope: !1250)
!1262 = !DILocation(line: 317, column: 23, scope: !1250)
!1263 = !DILocation(line: 318, column: 5, scope: !1250)
!1264 = !DILocation(line: 327, column: 3, scope: !343)
!1265 = !DILocation(line: 331, column: 7, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !343, file: !336, line: 331, column: 7)
!1267 = !DILocation(line: 331, column: 7, scope: !343)
!1268 = !DILocation(line: 332, column: 5, scope: !1266)
!1269 = !DILocation(line: 338, column: 7, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1266, file: !336, line: 334, column: 5)
!1271 = !DILocation(line: 346, column: 3, scope: !343)
!1272 = !DILocation(line: 350, column: 3, scope: !343)
!1273 = !DILocation(line: 356, column: 1, scope: !343)
!1274 = distinct !DISubprogram(name: "error_at_line", scope: !336, file: !336, line: 359, type: !1275, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1277)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{null, !116, !116, !80, !86, !80, null}
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1283}
!1278 = !DILocalVariable(name: "status", arg: 1, scope: !1274, file: !336, line: 359, type: !116)
!1279 = !DILocalVariable(name: "errnum", arg: 2, scope: !1274, file: !336, line: 359, type: !116)
!1280 = !DILocalVariable(name: "file_name", arg: 3, scope: !1274, file: !336, line: 359, type: !80)
!1281 = !DILocalVariable(name: "line_number", arg: 4, scope: !1274, file: !336, line: 360, type: !86)
!1282 = !DILocalVariable(name: "message", arg: 5, scope: !1274, file: !336, line: 360, type: !80)
!1283 = !DILocalVariable(name: "ap", scope: !1274, file: !336, line: 362, type: !1232)
!1284 = !DILocation(line: 0, scope: !1274)
!1285 = !DILocation(line: 362, column: 3, scope: !1274)
!1286 = !DILocation(line: 362, column: 11, scope: !1274)
!1287 = !DILocation(line: 363, column: 3, scope: !1274)
!1288 = !DILocation(line: 364, column: 3, scope: !1274)
!1289 = !DILocation(line: 366, column: 3, scope: !1274)
!1290 = !DILocation(line: 367, column: 1, scope: !1274)
!1291 = distinct !DISubprogram(name: "getprogname", scope: !673, file: !673, line: 54, type: !1292, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !672, retainedNodes: !799)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!80}
!1294 = !DILocation(line: 58, column: 10, scope: !1291)
!1295 = !DILocation(line: 58, column: 3, scope: !1291)
!1296 = distinct !DISubprogram(name: "parse_long_options", scope: !387, file: !387, line: 45, type: !1297, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1300)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{null, !116, !969, !80, !80, !80, !1299, null}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1311}
!1301 = !DILocalVariable(name: "argc", arg: 1, scope: !1296, file: !387, line: 45, type: !116)
!1302 = !DILocalVariable(name: "argv", arg: 2, scope: !1296, file: !387, line: 46, type: !969)
!1303 = !DILocalVariable(name: "command_name", arg: 3, scope: !1296, file: !387, line: 47, type: !80)
!1304 = !DILocalVariable(name: "package", arg: 4, scope: !1296, file: !387, line: 48, type: !80)
!1305 = !DILocalVariable(name: "version", arg: 5, scope: !1296, file: !387, line: 49, type: !80)
!1306 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1296, file: !387, line: 50, type: !1299)
!1307 = !DILocalVariable(name: "saved_opterr", scope: !1296, file: !387, line: 53, type: !116)
!1308 = !DILocalVariable(name: "c", scope: !1309, file: !387, line: 60, type: !116)
!1309 = distinct !DILexicalBlock(scope: !1310, file: !387, line: 59, column: 5)
!1310 = distinct !DILexicalBlock(scope: !1296, file: !387, line: 58, column: 7)
!1311 = !DILocalVariable(name: "authors", scope: !1312, file: !387, line: 71, type: !1316)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !387, line: 70, column: 15)
!1313 = distinct !DILexicalBlock(scope: !1314, file: !387, line: 64, column: 13)
!1314 = distinct !DILexicalBlock(scope: !1315, file: !387, line: 62, column: 9)
!1315 = distinct !DILexicalBlock(scope: !1309, file: !387, line: 61, column: 11)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !810, line: 52, baseType: !1317)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1234, line: 14, baseType: !1318)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1319, baseType: !1320)
!1319 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 192, elements: !35)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1322)
