; ModuleID = 'src/logname.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [20 x i8] c"Usage: %s [OPTION]\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [31 x i8] c"Print the user's login name.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"logname\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32
@.str.7 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !37

!163 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 61)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !67, line: 679, type: !127, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !67, line: 683, type: !101, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !67, line: 688, type: !101, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !67, line: 691, type: !19, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !67, line: 839, type: !54, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !67, line: 840, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 22)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !67, line: 841, type: !164, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !67, line: 862, type: !108, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !67, line: 868, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 71)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !67, line: 875, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 27)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 51)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 12)
!211 = !{!212, !213, !214, !217, !219, !220, !221, !225, !226, !227, !228, !230, !281, !282, !283, !285, !286}
!212 = !DILocalVariable(name: "program", arg: 1, scope: !66, file: !67, line: 573, type: !70)
!213 = !DILocalVariable(name: "option", arg: 2, scope: !66, file: !67, line: 573, type: !70)
!214 = !DILocalVariable(name: "term", scope: !215, file: !67, line: 585, type: !70)
!215 = distinct !DILexicalBlock(scope: !216, file: !67, line: 582, column: 5)
!216 = distinct !DILexicalBlock(scope: !66, file: !67, line: 581, column: 7)
!217 = !DILocalVariable(name: "double_space", scope: !66, file: !67, line: 594, type: !218)
!218 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!219 = !DILocalVariable(name: "first_word", scope: !66, file: !67, line: 595, type: !70)
!220 = !DILocalVariable(name: "option_text", scope: !66, file: !67, line: 596, type: !70)
!221 = !DILocalVariable(name: "s", scope: !222, file: !67, line: 608, type: !70)
!222 = distinct !DILexicalBlock(scope: !223, file: !67, line: 605, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !67, line: 604, column: 12)
!224 = distinct !DILexicalBlock(scope: !66, file: !67, line: 597, column: 7)
!225 = !DILocalVariable(name: "spaces", scope: !222, file: !67, line: 609, type: !94)
!226 = !DILocalVariable(name: "anchor_len", scope: !66, file: !67, line: 620, type: !94)
!227 = !DILocalVariable(name: "desc_text", scope: !66, file: !67, line: 625, type: !70)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !67, line: 644, type: !70)
!229 = distinct !DILexicalBlock(scope: !66, file: !67, line: 644, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !67, line: 644, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!236 = !{!237, !238, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !253, !255, !256, !257, !261, !262, !264, !265, !268, !270, !273, !276, !277, !278, !279, !280}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 51, baseType: !92, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 54, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 55, baseType: !239, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 56, baseType: !239, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 57, baseType: !239, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 58, baseType: !239, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 59, baseType: !239, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 60, baseType: !239, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 61, baseType: !239, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 64, baseType: !239, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 65, baseType: !239, size: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 66, baseType: !239, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 68, baseType: !251, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 36, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 70, baseType: !254, size: 64, offset: 832)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 72, baseType: !92, size: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 73, baseType: !92, size: 32, offset: 928)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 74, baseType: !258, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !259, line: 152, baseType: !260)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!260 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 77, baseType: !93, size: 16, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 78, baseType: !263, size: 8, offset: 1040)
!263 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 79, baseType: !34, size: 8, offset: 1048)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 81, baseType: !266, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 43, baseType: null)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 89, baseType: !269, size: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !259, line: 153, baseType: !260)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !235, line: 91, baseType: !271, size: 64, offset: 1216)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !235, line: 37, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !235, line: 92, baseType: !274, size: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !235, line: 38, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !235, line: 93, baseType: !254, size: 64, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !235, line: 94, baseType: !91, size: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 95, baseType: !94, size: 64, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 96, baseType: !92, size: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 98, baseType: !9, size: 160, offset: 1568)
!281 = !DILocalVariable(name: "__cnt", scope: !229, file: !67, line: 644, type: !94)
!282 = !DILocalVariable(name: "url_program", scope: !66, file: !67, line: 648, type: !70)
!283 = !DILocalVariable(name: "__ptr", scope: !284, file: !67, line: 686, type: !70)
!284 = distinct !DILexicalBlock(scope: !66, file: !67, line: 686, column: 3)
!285 = !DILocalVariable(name: "__stream", scope: !284, file: !67, line: 686, type: !231)
!286 = !DILocalVariable(name: "__cnt", scope: !284, file: !67, line: 686, type: !94)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !289, line: 3, type: !164, isLocal: true, isDefinition: true)
!289 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "Version", scope: !292, file: !289, line: 3, type: !70, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C11, file: !289, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !293, splitDebugInlining: false, nameTableKind: None)
!293 = !{!287, !290}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "file_name", scope: !296, file: !297, line: 45, type: !70, isLocal: true, isDefinition: true)
!296 = distinct !DICompileUnit(language: DW_LANG_C11, file: !297, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !298, splitDebugInlining: false, nameTableKind: None)
!297 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!298 = !{!299, !301, !303, !305, !294, !307}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !297, line: 121, type: !138, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !297, line: 121, type: !208, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !297, line: 123, type: !138, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !297, line: 126, type: !127, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !296, file: !297, line: 55, type: !218, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !311, file: !312, line: 66, type: !358, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C11, file: !312, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !313, globals: !314, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!313 = !{!91, !97}
!314 = !{!315, !317, !337, !339, !341, !343, !309, !345, !347, !349, !351, !356}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !312, line: 272, type: !101, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "old_file_name", scope: !319, file: !312, line: 304, type: !70, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "verror_at_line", scope: !312, file: !312, line: 298, type: !320, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !330)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !92, !92, !70, !76, !70, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !324)
!324 = !{!325, !327, !328, !329}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !323, file: !326, baseType: !76, size: 32)
!326 = !DIFile(filename: "lib/error.c", directory: "/src")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !323, file: !326, baseType: !76, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !323, file: !326, baseType: !91, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !323, file: !326, baseType: !91, size: 64, offset: 128)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DILocalVariable(name: "status", arg: 1, scope: !319, file: !312, line: 298, type: !92)
!332 = !DILocalVariable(name: "errnum", arg: 2, scope: !319, file: !312, line: 298, type: !92)
!333 = !DILocalVariable(name: "file_name", arg: 3, scope: !319, file: !312, line: 298, type: !70)
!334 = !DILocalVariable(name: "line_number", arg: 4, scope: !319, file: !312, line: 298, type: !76)
!335 = !DILocalVariable(name: "message", arg: 5, scope: !319, file: !312, line: 298, type: !70)
!336 = !DILocalVariable(name: "args", arg: 6, scope: !319, file: !312, line: 298, type: !322)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "old_line_number", scope: !319, file: !312, line: 305, type: !76, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !312, line: 338, type: !108, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !312, line: 346, type: !19, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !312, line: 346, type: !118, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "error_message_count", scope: !311, file: !312, line: 69, type: !76, isLocal: false, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !311, file: !312, line: 295, type: !92, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !312, line: 208, type: !138, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !312, line: 208, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 21)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !312, line: 214, type: !101, isLocal: true, isDefinition: true)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !363, line: 60, type: !118, isLocal: true, isDefinition: true)
!363 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "long_options", scope: !366, file: !363, line: 34, type: !374, isLocal: true, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C11, file: !363, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !367, splitDebugInlining: false, nameTableKind: None)
!367 = !{!361, !368, !370, !372, !364}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !363, line: 112, type: !34, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !363, line: 36, type: !101, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !363, line: 37, type: !19, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 768, elements: !128)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !377, line: 50, size: 256, elements: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!378 = !{!379, !380, !381, !383}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !377, line: 52, baseType: !70, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !376, file: !377, line: 55, baseType: !92, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !377, line: 56, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !376, file: !377, line: 57, baseType: !92, size: 32, offset: 192)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "program_name", scope: !386, file: !387, line: 31, type: !70, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C11, file: !387, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !388, globals: !389, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!388 = !{!239}
!389 = !{!384, !390, !392}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !387, line: 46, type: !19, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !387, line: 49, type: !108, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "utf07FF", scope: !396, file: !397, line: 46, type: !424, isLocal: true, isDefinition: true)
!396 = distinct !DISubprogram(name: "proper_name_lite", scope: !397, file: !397, line: 38, type: !398, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !400, retainedNodes: !402)
!397 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!398 = !DISubroutineType(types: !399)
!399 = !{!70, !70, !70}
!400 = distinct !DICompileUnit(language: DW_LANG_C11, file: !397, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !401, splitDebugInlining: false, nameTableKind: None)
!401 = !{!394}
!402 = !{!403, !404, !405, !406, !411}
!403 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !396, file: !397, line: 38, type: !70)
!404 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !396, file: !397, line: 38, type: !70)
!405 = !DILocalVariable(name: "translation", scope: !396, file: !397, line: 40, type: !70)
!406 = !DILocalVariable(name: "w", scope: !396, file: !397, line: 47, type: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !408, line: 37, baseType: !409)
!408 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !259, line: 57, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !259, line: 42, baseType: !76)
!411 = !DILocalVariable(name: "mbs", scope: !396, file: !397, line: 48, type: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !413, line: 6, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !415, line: 21, baseType: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 13, size: 64, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !416, file: !415, line: 15, baseType: !92, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !416, file: !415, line: 20, baseType: !420, size: 32, offset: 32)
!420 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !415, line: 16, size: 32, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !420, file: !415, line: 18, baseType: !76, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !420, file: !415, line: 19, baseType: !108, size: 32)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16, elements: !119)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !427, line: 78, type: !19, isLocal: true, isDefinition: true)
!427 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !427, line: 79, type: !113, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !427, line: 80, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 13)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !427, line: 81, type: !432, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !427, line: 82, type: !9, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !427, line: 83, type: !118, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !427, line: 84, type: !19, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !427, line: 85, type: !138, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !427, line: 86, type: !138, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !427, line: 87, type: !19, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !451, file: !427, line: 76, type: !537, isLocal: false, isDefinition: true)
!451 = distinct !DICompileUnit(language: DW_LANG_C11, file: !427, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !452, retainedTypes: !472, globals: !473, splitDebugInlining: false, nameTableKind: None)
!452 = !{!453, !467, !74}
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !454, line: 42, baseType: !76, size: 32, elements: !455)
!454 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!456 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!457 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!458 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!459 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!460 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!461 = !DIEnumerator(name: "c_quoting_style", value: 5)
!462 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!463 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!464 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!465 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!466 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !454, line: 254, baseType: !76, size: 32, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!470 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!471 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!472 = !{!92, !93, !94}
!473 = !{!425, !428, !430, !435, !437, !439, !441, !443, !445, !447, !449, !474, !478, !488, !490, !495, !497, !499, !501, !503, !526, !533, !535}
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !451, file: !427, line: 92, type: !476, isLocal: false, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !40)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !451, file: !427, line: 1040, type: !480, isLocal: false, isDefinition: true)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !427, line: 56, size: 448, elements: !481)
!481 = !{!482, !483, !484, !486, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !480, file: !427, line: 59, baseType: !453, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !480, file: !427, line: 62, baseType: !92, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !480, file: !427, line: 66, baseType: !485, size: 256, offset: 64)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !20)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !480, file: !427, line: 69, baseType: !70, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !480, file: !427, line: 72, baseType: !70, size: 64, offset: 384)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !451, file: !427, line: 107, type: !480, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "slot0", scope: !451, file: !427, line: 831, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 256)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !427, line: 321, type: !118, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !427, line: 357, type: !118, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !427, line: 358, type: !118, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !427, line: 199, type: !138, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "quote", scope: !505, file: !427, line: 228, type: !524, isLocal: true, isDefinition: true)
!505 = distinct !DISubprogram(name: "gettext_quote", scope: !427, file: !427, line: 197, type: !506, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !451, retainedNodes: !508)
!506 = !DISubroutineType(types: !507)
!507 = !{!70, !70, !453}
!508 = !{!509, !510, !511, !512, !513}
!509 = !DILocalVariable(name: "msgid", arg: 1, scope: !505, file: !427, line: 197, type: !70)
!510 = !DILocalVariable(name: "s", arg: 2, scope: !505, file: !427, line: 197, type: !453)
!511 = !DILocalVariable(name: "translation", scope: !505, file: !427, line: 199, type: !70)
!512 = !DILocalVariable(name: "w", scope: !505, file: !427, line: 229, type: !407)
!513 = !DILocalVariable(name: "mbs", scope: !505, file: !427, line: 230, type: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !413, line: 6, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !415, line: 21, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 13, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !516, file: !415, line: 15, baseType: !92, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !516, file: !415, line: 20, baseType: !520, size: 32, offset: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !516, file: !415, line: 16, size: 32, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !520, file: !415, line: 18, baseType: !76, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !520, file: !415, line: 19, baseType: !108, size: 32)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !525)
!525 = !{!120, !110}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "slotvec", scope: !451, file: !427, line: 834, type: !528, isLocal: true, isDefinition: true)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !427, line: 823, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !427, line: 825, baseType: !94, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !529, file: !427, line: 826, baseType: !239, size: 64, offset: 64)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "nslots", scope: !451, file: !427, line: 832, type: !92, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "slotvec0", scope: !451, file: !427, line: 833, type: !529, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 704, elements: !539)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!539 = !{!540}
!540 = !DISubrange(count: 11)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !543, line: 67, type: !208, isLocal: true, isDefinition: true)
!543 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !543, line: 69, type: !138, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !543, line: 83, type: !138, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !543, line: 83, type: !108, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !543, line: 85, type: !118, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !543, line: 88, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 171)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !543, line: 88, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 34)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !543, line: 105, type: !54, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !543, line: 109, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 23)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !543, line: 113, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 28)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !543, line: 120, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !543, line: 127, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 36)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !543, line: 134, type: !159, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !543, line: 142, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 44)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !543, line: 150, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 48)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !543, line: 159, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 52)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !543, line: 170, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 60)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !543, line: 248, type: !9, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !543, line: 248, type: !184, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !543, line: 254, type: !9, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !543, line: 254, type: !49, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !543, line: 254, type: !159, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !543, line: 259, type: !3, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !543, line: 259, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 29)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !625, file: !626, line: 26, type: !628, isLocal: false, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C11, file: !626, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !627, splitDebugInlining: false, nameTableKind: None)
!626 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!627 = !{!623}
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 376, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 47)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "exit_failure", scope: !633, file: !634, line: 24, type: !636, isLocal: false, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C11, file: !634, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !635, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!635 = !{!631}
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !639, line: 34, type: !127, isLocal: true, isDefinition: true)
!639 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !639, line: 34, type: !138, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !639, line: 34, type: !59, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !646, line: 108, type: !34, isLocal: true, isDefinition: true)
!646 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "internal_state", scope: !649, file: !646, line: 97, type: !652, isLocal: true, isDefinition: true)
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !646, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !650, globals: !651, splitDebugInlining: false, nameTableKind: None)
!650 = !{!91, !94, !97}
!651 = !{!644, !647}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !413, line: 6, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !415, line: 21, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 13, size: 64, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !654, file: !415, line: 15, baseType: !92, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !654, file: !415, line: 20, baseType: !658, size: 32, offset: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !654, file: !415, line: 16, size: 32, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !658, file: !415, line: 18, baseType: !76, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !658, file: !415, line: 19, baseType: !108, size: 32)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !664, line: 35, type: !113, isLocal: true, isDefinition: true)
!664 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!665 = distinct !DICompileUnit(language: DW_LANG_C11, file: !666, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!667 = distinct !DICompileUnit(language: DW_LANG_C11, file: !543, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !668, retainedTypes: !672, globals: !673, splitDebugInlining: false, nameTableKind: None)
!668 = !{!669}
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !543, line: 40, baseType: !76, size: 32, elements: !670)
!670 = !{!671}
!671 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!672 = !{!91}
!673 = !{!541, !544, !546, !548, !550, !552, !557, !562, !564, !569, !574, !579, !584, !586, !591, !596, !601, !606, !608, !610, !612, !614, !616, !618}
!674 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !676, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!676 = !{!677, !689}
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !678, file: !675, line: 188, baseType: !76, size: 32, elements: !687)
!678 = distinct !DISubprogram(name: "x2nrealloc", scope: !675, file: !675, line: 176, type: !679, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !674, retainedNodes: !682)
!679 = !DISubroutineType(types: !680)
!680 = !{!91, !91, !681, !94}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!682 = !{!683, !684, !685, !686}
!683 = !DILocalVariable(name: "p", arg: 1, scope: !678, file: !675, line: 176, type: !91)
!684 = !DILocalVariable(name: "pn", arg: 2, scope: !678, file: !675, line: 176, type: !681)
!685 = !DILocalVariable(name: "s", arg: 3, scope: !678, file: !675, line: 176, type: !94)
!686 = !DILocalVariable(name: "n", scope: !678, file: !675, line: 178, type: !94)
!687 = !{!688}
!688 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !690, file: !675, line: 228, baseType: !76, size: 32, elements: !687)
!690 = distinct !DISubprogram(name: "xpalloc", scope: !675, file: !675, line: 223, type: !691, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !674, retainedNodes: !697)
!691 = !DISubroutineType(types: !692)
!692 = !{!91, !91, !693, !694, !696, !694}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !695, line: 130, baseType: !696)
!695 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !95, line: 35, baseType: !260)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706}
!698 = !DILocalVariable(name: "pa", arg: 1, scope: !690, file: !675, line: 223, type: !91)
!699 = !DILocalVariable(name: "pn", arg: 2, scope: !690, file: !675, line: 223, type: !693)
!700 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !690, file: !675, line: 223, type: !694)
!701 = !DILocalVariable(name: "n_max", arg: 4, scope: !690, file: !675, line: 223, type: !696)
!702 = !DILocalVariable(name: "s", arg: 5, scope: !690, file: !675, line: 223, type: !694)
!703 = !DILocalVariable(name: "n0", scope: !690, file: !675, line: 230, type: !694)
!704 = !DILocalVariable(name: "n", scope: !690, file: !675, line: 237, type: !694)
!705 = !DILocalVariable(name: "nbytes", scope: !690, file: !675, line: 248, type: !694)
!706 = !DILocalVariable(name: "adjusted_nbytes", scope: !690, file: !675, line: 252, type: !694)
!707 = !{!239, !91, !218, !260, !96}
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !709, splitDebugInlining: false, nameTableKind: None)
!709 = !{!637, !640, !642}
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !672, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !672, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!718 = distinct !DICompileUnit(language: DW_LANG_C11, file: !719, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !720, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!720 = !{!218, !96, !91}
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !664, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !722, splitDebugInlining: false, nameTableKind: None)
!722 = !{!723, !662}
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !664, line: 35, type: !118, isLocal: true, isDefinition: true)
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !672, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!729 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!730 = !{i32 7, !"Dwarf Version", i32 5}
!731 = !{i32 2, !"Debug Info Version", i32 3}
!732 = !{i32 1, !"wchar_size", i32 4}
!733 = !{i32 8, !"PIC Level", i32 2}
!734 = !{i32 7, !"PIE Level", i32 2}
!735 = !{i32 7, !"uwtable", i32 2}
!736 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 31, type: !737, scopeLine: 32, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !92}
!739 = !{!740}
!740 = !DILocalVariable(name: "status", arg: 1, scope: !736, file: !2, line: 31, type: !92)
!741 = !DILocation(line: 0, scope: !736)
!742 = !DILocation(line: 33, column: 14, scope: !743)
!743 = distinct !DILexicalBlock(scope: !736, file: !2, line: 33, column: 7)
!744 = !DILocation(line: 33, column: 7, scope: !736)
!745 = !DILocation(line: 34, column: 5, scope: !746)
!746 = distinct !DILexicalBlock(scope: !743, file: !2, line: 34, column: 5)
!747 = !{!748, !748, i64 0}
!748 = !{!"any pointer", !749, i64 0}
!749 = !{!"omnipotent char", !750, i64 0}
!750 = !{!"Simple C/C++ TBAA"}
!751 = !DILocation(line: 37, column: 7, scope: !752)
!752 = distinct !DILexicalBlock(scope: !743, file: !2, line: 36, column: 5)
!753 = !DILocation(line: 38, column: 7, scope: !752)
!754 = !DILocation(line: 42, column: 7, scope: !752)
!755 = !DILocation(line: 43, column: 7, scope: !752)
!756 = !DILocalVariable(name: "program", arg: 1, scope: !757, file: !67, line: 836, type: !70)
!757 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !67, file: !67, line: 836, type: !758, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !70}
!760 = !{!756, !761, !768, !769, !771, !772}
!761 = !DILocalVariable(name: "infomap", scope: !757, file: !67, line: 838, type: !762)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 896, elements: !139)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !757, file: !67, line: 838, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !764, file: !67, line: 838, baseType: !70, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !764, file: !67, line: 838, baseType: !70, size: 64, offset: 64)
!768 = !DILocalVariable(name: "node", scope: !757, file: !67, line: 848, type: !70)
!769 = !DILocalVariable(name: "map_prog", scope: !757, file: !67, line: 849, type: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!771 = !DILocalVariable(name: "lc_messages", scope: !757, file: !67, line: 861, type: !70)
!772 = !DILocalVariable(name: "url_program", scope: !757, file: !67, line: 874, type: !70)
!773 = !DILocation(line: 0, scope: !757, inlinedAt: !774)
!774 = distinct !DILocation(line: 44, column: 7, scope: !752)
!775 = !DILocation(line: 857, column: 3, scope: !757, inlinedAt: !774)
!776 = !DILocation(line: 861, column: 29, scope: !757, inlinedAt: !774)
!777 = !DILocation(line: 862, column: 7, scope: !778, inlinedAt: !774)
!778 = distinct !DILexicalBlock(scope: !757, file: !67, line: 862, column: 7)
!779 = !DILocation(line: 862, column: 19, scope: !778, inlinedAt: !774)
!780 = !DILocation(line: 862, column: 22, scope: !778, inlinedAt: !774)
!781 = !DILocation(line: 862, column: 7, scope: !757, inlinedAt: !774)
!782 = !DILocation(line: 868, column: 7, scope: !783, inlinedAt: !774)
!783 = distinct !DILexicalBlock(scope: !778, file: !67, line: 863, column: 5)
!784 = !DILocation(line: 870, column: 5, scope: !783, inlinedAt: !774)
!785 = !DILocation(line: 875, column: 3, scope: !757, inlinedAt: !774)
!786 = !DILocation(line: 877, column: 3, scope: !757, inlinedAt: !774)
!787 = !DILocation(line: 46, column: 3, scope: !736)
!788 = !DISubprogram(name: "dcgettext", scope: !789, file: !789, line: 51, type: !790, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!789 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!790 = !DISubroutineType(types: !791)
!791 = !{!239, !70, !70, !92}
!792 = !{}
!793 = !DISubprogram(name: "__fprintf_chk", scope: !794, file: !794, line: 93, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!794 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!795 = !DISubroutineType(types: !796)
!796 = !{!92, !797, !92, !798, null}
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!798 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!799 = !DISubprogram(name: "__printf_chk", scope: !794, file: !794, line: 95, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!800 = !DISubroutineType(types: !801)
!801 = !{!92, !92, !798, null}
!802 = !DISubprogram(name: "fputs_unlocked", scope: !803, file: !803, line: 691, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!803 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!804 = !DISubroutineType(types: !805)
!805 = !{!92, !798, !797}
!806 = !DILocation(line: 0, scope: !66)
!807 = !DILocation(line: 581, column: 7, scope: !216)
!808 = !{!809, !809, i64 0}
!809 = !{!"int", !749, i64 0}
!810 = !DILocation(line: 581, column: 19, scope: !216)
!811 = !DILocation(line: 581, column: 7, scope: !66)
!812 = !DILocation(line: 585, column: 26, scope: !215)
!813 = !DILocation(line: 0, scope: !215)
!814 = !DILocation(line: 586, column: 23, scope: !215)
!815 = !DILocation(line: 586, column: 28, scope: !215)
!816 = !DILocation(line: 586, column: 32, scope: !215)
!817 = !{!749, !749, i64 0}
!818 = !DILocation(line: 586, column: 38, scope: !215)
!819 = !DILocalVariable(name: "__s1", arg: 1, scope: !820, file: !821, line: 1359, type: !70)
!820 = distinct !DISubprogram(name: "streq", scope: !821, file: !821, line: 1359, type: !822, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !824)
!821 = !DIFile(filename: "./lib/string.h", directory: "/src")
!822 = !DISubroutineType(types: !823)
!823 = !{!218, !70, !70}
!824 = !{!819, !825}
!825 = !DILocalVariable(name: "__s2", arg: 2, scope: !820, file: !821, line: 1359, type: !70)
!826 = !DILocation(line: 0, scope: !820, inlinedAt: !827)
!827 = distinct !DILocation(line: 586, column: 41, scope: !215)
!828 = !DILocation(line: 1361, column: 11, scope: !820, inlinedAt: !827)
!829 = !DILocation(line: 1361, column: 10, scope: !820, inlinedAt: !827)
!830 = !DILocation(line: 586, column: 19, scope: !215)
!831 = !DILocation(line: 587, column: 5, scope: !215)
!832 = !DILocation(line: 588, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !66, file: !67, line: 588, column: 7)
!834 = !DILocation(line: 588, column: 7, scope: !66)
!835 = !DILocation(line: 590, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !833, file: !67, line: 589, column: 5)
!837 = !DILocation(line: 591, column: 7, scope: !836)
!838 = !DILocation(line: 595, column: 37, scope: !66)
!839 = !DILocation(line: 595, column: 35, scope: !66)
!840 = !DILocation(line: 596, column: 29, scope: !66)
!841 = !DILocation(line: 597, column: 8, scope: !224)
!842 = !DILocation(line: 597, column: 7, scope: !66)
!843 = !DILocation(line: 604, column: 24, scope: !223)
!844 = !DILocation(line: 604, column: 12, scope: !224)
!845 = !DILocation(line: 0, scope: !222)
!846 = !DILocation(line: 610, column: 16, scope: !222)
!847 = !DILocation(line: 610, column: 7, scope: !222)
!848 = !DILocation(line: 611, column: 21, scope: !222)
!849 = !{!850, !850, i64 0}
!850 = !{!"short", !749, i64 0}
!851 = !DILocation(line: 611, column: 19, scope: !222)
!852 = !DILocation(line: 611, column: 16, scope: !222)
!853 = !DILocation(line: 610, column: 30, scope: !222)
!854 = distinct !{!854, !847, !848, !855}
!855 = !{!"llvm.loop.mustprogress"}
!856 = !DILocation(line: 612, column: 18, scope: !857)
!857 = distinct !DILexicalBlock(scope: !222, file: !67, line: 612, column: 11)
!858 = !DILocation(line: 612, column: 11, scope: !222)
!859 = !DILocation(line: 618, column: 5, scope: !222)
!860 = !DILocation(line: 620, column: 23, scope: !66)
!861 = !DILocation(line: 625, column: 39, scope: !66)
!862 = !DILocation(line: 626, column: 3, scope: !66)
!863 = !DILocation(line: 626, column: 10, scope: !66)
!864 = !DILocation(line: 626, column: 21, scope: !66)
!865 = !DILocation(line: 628, column: 44, scope: !866)
!866 = distinct !DILexicalBlock(scope: !867, file: !67, line: 628, column: 11)
!867 = distinct !DILexicalBlock(scope: !66, file: !67, line: 627, column: 5)
!868 = !DILocation(line: 628, column: 32, scope: !866)
!869 = !DILocation(line: 628, column: 49, scope: !866)
!870 = !DILocation(line: 628, column: 11, scope: !867)
!871 = !DILocation(line: 630, column: 11, scope: !872)
!872 = distinct !DILexicalBlock(scope: !867, file: !67, line: 630, column: 11)
!873 = !DILocation(line: 630, column: 11, scope: !867)
!874 = !DILocation(line: 632, column: 26, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !67, line: 632, column: 15)
!876 = distinct !DILexicalBlock(scope: !872, file: !67, line: 631, column: 9)
!877 = !DILocation(line: 632, column: 34, scope: !875)
!878 = !DILocation(line: 632, column: 37, scope: !875)
!879 = !DILocation(line: 632, column: 15, scope: !876)
!880 = !DILocation(line: 636, column: 16, scope: !881)
!881 = distinct !DILexicalBlock(scope: !876, file: !67, line: 636, column: 15)
!882 = !DILocation(line: 636, column: 29, scope: !881)
!883 = !DILocation(line: 640, column: 16, scope: !867)
!884 = distinct !{!884, !862, !885, !855}
!885 = !DILocation(line: 641, column: 5, scope: !66)
!886 = !DILocation(line: 644, column: 3, scope: !66)
!887 = !DILocation(line: 0, scope: !820, inlinedAt: !888)
!888 = distinct !DILocation(line: 648, column: 31, scope: !66)
!889 = !DILocation(line: 0, scope: !820, inlinedAt: !890)
!890 = distinct !DILocation(line: 649, column: 31, scope: !66)
!891 = !DILocation(line: 0, scope: !820, inlinedAt: !892)
!892 = distinct !DILocation(line: 650, column: 31, scope: !66)
!893 = !DILocation(line: 0, scope: !820, inlinedAt: !894)
!894 = distinct !DILocation(line: 651, column: 31, scope: !66)
!895 = !DILocation(line: 0, scope: !820, inlinedAt: !896)
!896 = distinct !DILocation(line: 652, column: 31, scope: !66)
!897 = !DILocation(line: 0, scope: !820, inlinedAt: !898)
!898 = distinct !DILocation(line: 653, column: 31, scope: !66)
!899 = !DILocation(line: 0, scope: !820, inlinedAt: !900)
!900 = distinct !DILocation(line: 654, column: 31, scope: !66)
!901 = !DILocation(line: 0, scope: !820, inlinedAt: !902)
!902 = distinct !DILocation(line: 655, column: 31, scope: !66)
!903 = !DILocation(line: 0, scope: !820, inlinedAt: !904)
!904 = distinct !DILocation(line: 656, column: 31, scope: !66)
!905 = !DILocation(line: 0, scope: !820, inlinedAt: !906)
!906 = distinct !DILocation(line: 657, column: 31, scope: !66)
!907 = !DILocation(line: 663, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !66, file: !67, line: 663, column: 7)
!909 = !DILocation(line: 664, column: 7, scope: !908)
!910 = !DILocation(line: 664, column: 10, scope: !908)
!911 = !DILocation(line: 663, column: 7, scope: !66)
!912 = !DILocation(line: 669, column: 7, scope: !913)
!913 = distinct !DILexicalBlock(scope: !908, file: !67, line: 665, column: 5)
!914 = !DILocation(line: 671, column: 5, scope: !913)
!915 = !DILocation(line: 676, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !908, file: !67, line: 673, column: 5)
!917 = !DILocation(line: 679, column: 3, scope: !66)
!918 = !DILocation(line: 683, column: 3, scope: !66)
!919 = !DILocation(line: 686, column: 3, scope: !66)
!920 = !DILocation(line: 688, column: 3, scope: !66)
!921 = !DILocation(line: 691, column: 3, scope: !66)
!922 = !DILocation(line: 695, column: 3, scope: !66)
!923 = !DILocation(line: 696, column: 1, scope: !66)
!924 = !DISubprogram(name: "setlocale", scope: !925, file: !925, line: 122, type: !926, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!925 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!926 = !DISubroutineType(types: !927)
!927 = !{!239, !92, !70}
!928 = !DISubprogram(name: "strncmp", scope: !929, file: !929, line: 159, type: !930, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!929 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!930 = !DISubroutineType(types: !931)
!931 = !{!92, !70, !70, !94}
!932 = !DISubprogram(name: "exit", scope: !933, file: !933, line: 624, type: !737, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !792)
!933 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!934 = !DISubprogram(name: "getenv", scope: !933, file: !933, line: 641, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!935 = !DISubroutineType(types: !936)
!936 = !{!239, !70}
!937 = !DISubprogram(name: "strcmp", scope: !929, file: !929, line: 156, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!938 = !DISubroutineType(types: !939)
!939 = !{!92, !70, !70}
!940 = !DISubprogram(name: "strspn", scope: !929, file: !929, line: 297, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!941 = !DISubroutineType(types: !942)
!942 = !{!96, !70, !70}
!943 = !DISubprogram(name: "strchr", scope: !929, file: !929, line: 246, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!944 = !DISubroutineType(types: !945)
!945 = !{!239, !70, !92}
!946 = !DISubprogram(name: "__ctype_b_loc", scope: !75, file: !75, line: 79, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!947 = !DISubroutineType(types: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!952 = !DISubprogram(name: "strcspn", scope: !929, file: !929, line: 293, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!953 = !DISubprogram(name: "fwrite_unlocked", scope: !803, file: !803, line: 704, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!954 = !DISubroutineType(types: !955)
!955 = !{!94, !956, !94, !94, !797}
!956 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!959 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 50, type: !960, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !963)
!960 = !DISubroutineType(types: !961)
!961 = !{!92, !92, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!963 = !{!964, !965, !966}
!964 = !DILocalVariable(name: "argc", arg: 1, scope: !959, file: !2, line: 50, type: !92)
!965 = !DILocalVariable(name: "argv", arg: 2, scope: !959, file: !2, line: 50, type: !962)
!966 = !DILocalVariable(name: "cp", scope: !959, file: !2, line: 72, type: !70)
!967 = !DILocation(line: 0, scope: !959)
!968 = !DILocation(line: 53, column: 21, scope: !959)
!969 = !DILocation(line: 53, column: 3, scope: !959)
!970 = !DILocation(line: 54, column: 3, scope: !959)
!971 = !DILocation(line: 55, column: 3, scope: !959)
!972 = !DILocation(line: 56, column: 3, scope: !959)
!973 = !DILocation(line: 58, column: 3, scope: !959)
!974 = !DILocation(line: 61, column: 36, scope: !959)
!975 = !DILocation(line: 61, column: 58, scope: !959)
!976 = !DILocation(line: 60, column: 3, scope: !959)
!977 = !DILocation(line: 64, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !959, file: !2, line: 64, column: 7)
!979 = !DILocation(line: 64, column: 14, scope: !978)
!980 = !DILocation(line: 64, column: 7, scope: !959)
!981 = !DILocation(line: 66, column: 7, scope: !982)
!982 = distinct !DILexicalBlock(scope: !978, file: !2, line: 65, column: 5)
!983 = !DILocation(line: 67, column: 7, scope: !982)
!984 = !DILocation(line: 72, column: 20, scope: !959)
!985 = !DILocation(line: 73, column: 9, scope: !986)
!986 = distinct !DILexicalBlock(scope: !959, file: !2, line: 73, column: 7)
!987 = !DILocation(line: 73, column: 7, scope: !959)
!988 = !DILocation(line: 74, column: 5, scope: !986)
!989 = !DILocation(line: 76, column: 3, scope: !959)
!990 = !DILocation(line: 77, column: 3, scope: !959)
!991 = !DISubprogram(name: "bindtextdomain", scope: !789, file: !789, line: 86, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!992 = !DISubroutineType(types: !993)
!993 = !{!239, !70, !70}
!994 = !DISubprogram(name: "textdomain", scope: !789, file: !789, line: 82, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!995 = !DISubprogram(name: "atexit", scope: !933, file: !933, line: 602, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!996 = !DISubroutineType(types: !997)
!997 = !{!92, !358}
!998 = !DISubprogram(name: "getlogin", scope: !999, file: !999, line: 881, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!999 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1000 = !DISubroutineType(types: !388)
!1001 = !DISubprogram(name: "puts", scope: !803, file: !803, line: 661, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!92, !70}
!1004 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !297, file: !297, line: 50, type: !758, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !296, retainedNodes: !1005)
!1005 = !{!1006}
!1006 = !DILocalVariable(name: "file", arg: 1, scope: !1004, file: !297, line: 50, type: !70)
!1007 = !DILocation(line: 0, scope: !1004)
!1008 = !DILocation(line: 52, column: 13, scope: !1004)
!1009 = !DILocation(line: 53, column: 1, scope: !1004)
!1010 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !297, file: !297, line: 87, type: !1011, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !296, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !218}
!1013 = !{!1014}
!1014 = !DILocalVariable(name: "ignore", arg: 1, scope: !1010, file: !297, line: 87, type: !218)
!1015 = !DILocation(line: 0, scope: !1010)
!1016 = !DILocation(line: 89, column: 16, scope: !1010)
!1017 = !{!1018, !1018, i64 0}
!1018 = !{!"_Bool", !749, i64 0}
!1019 = !DILocation(line: 90, column: 1, scope: !1010)
!1020 = distinct !DISubprogram(name: "close_stdout", scope: !297, file: !297, line: 116, type: !359, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !296, retainedNodes: !1021)
!1021 = !{!1022}
!1022 = !DILocalVariable(name: "write_error", scope: !1023, file: !297, line: 121, type: !70)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !297, line: 120, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1020, file: !297, line: 118, column: 7)
!1025 = !DILocation(line: 118, column: 21, scope: !1024)
!1026 = !DILocation(line: 118, column: 7, scope: !1024)
!1027 = !DILocation(line: 118, column: 29, scope: !1024)
!1028 = !DILocation(line: 119, column: 7, scope: !1024)
!1029 = !DILocation(line: 119, column: 12, scope: !1024)
!1030 = !{i8 0, i8 2}
!1031 = !DILocation(line: 119, column: 25, scope: !1024)
!1032 = !DILocation(line: 119, column: 28, scope: !1024)
!1033 = !DILocation(line: 119, column: 34, scope: !1024)
!1034 = !DILocation(line: 118, column: 7, scope: !1020)
!1035 = !DILocation(line: 121, column: 33, scope: !1023)
!1036 = !DILocation(line: 0, scope: !1023)
!1037 = !DILocation(line: 122, column: 11, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1023, file: !297, line: 122, column: 11)
!1039 = !DILocation(line: 0, scope: !1038)
!1040 = !DILocation(line: 122, column: 11, scope: !1023)
!1041 = !DILocation(line: 123, column: 9, scope: !1038)
!1042 = !DILocation(line: 126, column: 9, scope: !1038)
!1043 = !DILocation(line: 128, column: 14, scope: !1023)
!1044 = !DILocation(line: 128, column: 7, scope: !1023)
!1045 = !DILocation(line: 133, column: 42, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1020, file: !297, line: 133, column: 7)
!1047 = !DILocation(line: 133, column: 28, scope: !1046)
!1048 = !DILocation(line: 133, column: 50, scope: !1046)
!1049 = !DILocation(line: 133, column: 7, scope: !1020)
!1050 = !DILocation(line: 134, column: 12, scope: !1046)
!1051 = !DILocation(line: 134, column: 5, scope: !1046)
!1052 = !DILocation(line: 135, column: 1, scope: !1020)
!1053 = !DISubprogram(name: "__errno_location", scope: !1054, file: !1054, line: 37, type: !1055, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1054 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!382}
!1057 = !DISubprogram(name: "_exit", scope: !999, file: !999, line: 624, type: !737, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1058 = distinct !DISubprogram(name: "verror", scope: !312, file: !312, line: 251, type: !1059, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1061)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{null, !92, !92, !70, !322}
!1061 = !{!1062, !1063, !1064, !1065}
!1062 = !DILocalVariable(name: "status", arg: 1, scope: !1058, file: !312, line: 251, type: !92)
!1063 = !DILocalVariable(name: "errnum", arg: 2, scope: !1058, file: !312, line: 251, type: !92)
!1064 = !DILocalVariable(name: "message", arg: 3, scope: !1058, file: !312, line: 251, type: !70)
!1065 = !DILocalVariable(name: "args", arg: 4, scope: !1058, file: !312, line: 251, type: !322)
!1066 = !DILocation(line: 0, scope: !1058)
!1067 = !DILocation(line: 261, column: 3, scope: !1058)
!1068 = !DILocation(line: 265, column: 7, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1058, file: !312, line: 265, column: 7)
!1070 = !DILocation(line: 265, column: 7, scope: !1058)
!1071 = !DILocation(line: 266, column: 5, scope: !1069)
!1072 = !DILocation(line: 272, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !312, line: 268, column: 5)
!1074 = !DILocation(line: 276, column: 3, scope: !1058)
!1075 = !DILocation(line: 282, column: 1, scope: !1058)
!1076 = distinct !DISubprogram(name: "flush_stdout", scope: !312, file: !312, line: 163, type: !359, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1077)
!1077 = !{!1078}
!1078 = !DILocalVariable(name: "stdout_fd", scope: !1076, file: !312, line: 166, type: !92)
!1079 = !DILocation(line: 0, scope: !1076)
!1080 = !DILocalVariable(name: "fd", arg: 1, scope: !1081, file: !312, line: 145, type: !92)
!1081 = distinct !DISubprogram(name: "is_open", scope: !312, file: !312, line: 145, type: !1082, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1084)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!92, !92}
!1084 = !{!1080}
!1085 = !DILocation(line: 0, scope: !1081, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 182, column: 25, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1076, file: !312, line: 182, column: 7)
!1088 = !DILocation(line: 157, column: 15, scope: !1081, inlinedAt: !1086)
!1089 = !DILocation(line: 157, column: 12, scope: !1081, inlinedAt: !1086)
!1090 = !DILocation(line: 182, column: 7, scope: !1076)
!1091 = !DILocation(line: 184, column: 5, scope: !1087)
!1092 = !DILocation(line: 185, column: 1, scope: !1076)
!1093 = distinct !DISubprogram(name: "error_tail", scope: !312, file: !312, line: 219, type: !1059, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1094)
!1094 = !{!1095, !1096, !1097, !1098}
!1095 = !DILocalVariable(name: "status", arg: 1, scope: !1093, file: !312, line: 219, type: !92)
!1096 = !DILocalVariable(name: "errnum", arg: 2, scope: !1093, file: !312, line: 219, type: !92)
!1097 = !DILocalVariable(name: "message", arg: 3, scope: !1093, file: !312, line: 219, type: !70)
!1098 = !DILocalVariable(name: "args", arg: 4, scope: !1093, file: !312, line: 219, type: !322)
!1099 = !DILocation(line: 0, scope: !1093)
!1100 = !DILocation(line: 229, column: 13, scope: !1093)
!1101 = !DILocalVariable(name: "__stream", arg: 1, scope: !1102, file: !794, line: 132, type: !1105)
!1102 = distinct !DISubprogram(name: "vfprintf", scope: !794, file: !794, line: 132, type: !1103, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1140)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!92, !1105, !798, !322}
!1105 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1108, file: !235, line: 51, baseType: !92, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1108, file: !235, line: 54, baseType: !239, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1108, file: !235, line: 55, baseType: !239, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1108, file: !235, line: 56, baseType: !239, size: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1108, file: !235, line: 57, baseType: !239, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1108, file: !235, line: 58, baseType: !239, size: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1108, file: !235, line: 59, baseType: !239, size: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1108, file: !235, line: 60, baseType: !239, size: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1108, file: !235, line: 61, baseType: !239, size: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1108, file: !235, line: 64, baseType: !239, size: 64, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1108, file: !235, line: 65, baseType: !239, size: 64, offset: 640)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1108, file: !235, line: 66, baseType: !239, size: 64, offset: 704)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1108, file: !235, line: 68, baseType: !251, size: 64, offset: 768)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1108, file: !235, line: 70, baseType: !1124, size: 64, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1108, file: !235, line: 72, baseType: !92, size: 32, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1108, file: !235, line: 73, baseType: !92, size: 32, offset: 928)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1108, file: !235, line: 74, baseType: !258, size: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1108, file: !235, line: 77, baseType: !93, size: 16, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1108, file: !235, line: 78, baseType: !263, size: 8, offset: 1040)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1108, file: !235, line: 79, baseType: !34, size: 8, offset: 1048)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1108, file: !235, line: 81, baseType: !266, size: 64, offset: 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1108, file: !235, line: 89, baseType: !269, size: 64, offset: 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1108, file: !235, line: 91, baseType: !271, size: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1108, file: !235, line: 92, baseType: !274, size: 64, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1108, file: !235, line: 93, baseType: !1124, size: 64, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1108, file: !235, line: 94, baseType: !91, size: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1108, file: !235, line: 95, baseType: !94, size: 64, offset: 1472)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1108, file: !235, line: 96, baseType: !92, size: 32, offset: 1536)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1108, file: !235, line: 98, baseType: !9, size: 160, offset: 1568)
!1140 = !{!1101, !1141, !1142}
!1141 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1102, file: !794, line: 133, type: !798)
!1142 = !DILocalVariable(name: "__ap", arg: 3, scope: !1102, file: !794, line: 133, type: !322)
!1143 = !DILocation(line: 0, scope: !1102, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 229, column: 3, scope: !1093)
!1145 = !DILocation(line: 135, column: 10, scope: !1102, inlinedAt: !1144)
!1146 = !DILocation(line: 232, column: 3, scope: !1093)
!1147 = !DILocation(line: 233, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1093, file: !312, line: 233, column: 7)
!1149 = !DILocation(line: 233, column: 7, scope: !1093)
!1150 = !DILocalVariable(name: "errnum", arg: 1, scope: !1151, file: !312, line: 188, type: !92)
!1151 = distinct !DISubprogram(name: "print_errno_message", scope: !312, file: !312, line: 188, type: !737, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1152)
!1152 = !{!1150, !1153, !1154}
!1153 = !DILocalVariable(name: "s", scope: !1151, file: !312, line: 190, type: !70)
!1154 = !DILocalVariable(name: "errbuf", scope: !1151, file: !312, line: 193, type: !1155)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1156)
!1156 = !{!1157}
!1157 = !DISubrange(count: 1024)
!1158 = !DILocation(line: 0, scope: !1151, inlinedAt: !1159)
!1159 = distinct !DILocation(line: 234, column: 5, scope: !1148)
!1160 = !DILocation(line: 193, column: 3, scope: !1151, inlinedAt: !1159)
!1161 = !DILocation(line: 193, column: 8, scope: !1151, inlinedAt: !1159)
!1162 = !DILocation(line: 195, column: 7, scope: !1151, inlinedAt: !1159)
!1163 = !DILocation(line: 207, column: 9, scope: !1164, inlinedAt: !1159)
!1164 = distinct !DILexicalBlock(scope: !1151, file: !312, line: 207, column: 7)
!1165 = !DILocation(line: 207, column: 7, scope: !1151, inlinedAt: !1159)
!1166 = !DILocation(line: 208, column: 9, scope: !1164, inlinedAt: !1159)
!1167 = !DILocation(line: 208, column: 5, scope: !1164, inlinedAt: !1159)
!1168 = !DILocation(line: 214, column: 3, scope: !1151, inlinedAt: !1159)
!1169 = !DILocation(line: 216, column: 1, scope: !1151, inlinedAt: !1159)
!1170 = !DILocation(line: 234, column: 5, scope: !1148)
!1171 = !DILocation(line: 238, column: 3, scope: !1093)
!1172 = !DILocalVariable(name: "__c", arg: 1, scope: !1173, file: !1174, line: 101, type: !92)
!1173 = distinct !DISubprogram(name: "putc_unlocked", scope: !1174, file: !1174, line: 101, type: !1175, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1177)
!1174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!92, !92, !1106}
!1177 = !{!1172, !1178}
!1178 = !DILocalVariable(name: "__stream", arg: 2, scope: !1173, file: !1174, line: 101, type: !1106)
!1179 = !DILocation(line: 0, scope: !1173, inlinedAt: !1180)
!1180 = distinct !DILocation(line: 238, column: 3, scope: !1093)
!1181 = !DILocation(line: 103, column: 10, scope: !1173, inlinedAt: !1180)
!1182 = !{!1183, !748, i64 40}
!1183 = !{!"_IO_FILE", !809, i64 0, !748, i64 8, !748, i64 16, !748, i64 24, !748, i64 32, !748, i64 40, !748, i64 48, !748, i64 56, !748, i64 64, !748, i64 72, !748, i64 80, !748, i64 88, !748, i64 96, !748, i64 104, !809, i64 112, !809, i64 116, !1184, i64 120, !850, i64 128, !749, i64 130, !749, i64 131, !748, i64 136, !1184, i64 144, !748, i64 152, !748, i64 160, !748, i64 168, !748, i64 176, !1184, i64 184, !809, i64 192, !749, i64 196}
!1184 = !{!"long", !749, i64 0}
!1185 = !{!1183, !748, i64 48}
!1186 = !{!"branch_weights", i32 2000, i32 1}
!1187 = !DILocation(line: 240, column: 3, scope: !1093)
!1188 = !DILocation(line: 241, column: 7, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1093, file: !312, line: 241, column: 7)
!1190 = !DILocation(line: 241, column: 7, scope: !1093)
!1191 = !DILocation(line: 242, column: 5, scope: !1189)
!1192 = !DILocation(line: 243, column: 1, scope: !1093)
!1193 = !DISubprogram(name: "__vfprintf_chk", scope: !794, file: !794, line: 96, type: !1194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!92, !1105, !92, !798, !322}
!1196 = !DISubprogram(name: "strerror_r", scope: !929, file: !929, line: 444, type: !1197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!239, !92, !239, !94}
!1199 = !DISubprogram(name: "__overflow", scope: !803, file: !803, line: 886, type: !1200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!92, !1106, !92}
!1202 = !DISubprogram(name: "fflush_unlocked", scope: !803, file: !803, line: 239, type: !1203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!92, !1106}
!1205 = !DISubprogram(name: "fcntl", scope: !1206, file: !1206, line: 149, type: !1207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !792)
!1206 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!92, !92, !92, null}
!1209 = distinct !DISubprogram(name: "error", scope: !312, file: !312, line: 285, type: !1210, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1212)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{null, !92, !92, !70, null}
!1212 = !{!1213, !1214, !1215, !1216}
!1213 = !DILocalVariable(name: "status", arg: 1, scope: !1209, file: !312, line: 285, type: !92)
!1214 = !DILocalVariable(name: "errnum", arg: 2, scope: !1209, file: !312, line: 285, type: !92)
!1215 = !DILocalVariable(name: "message", arg: 3, scope: !1209, file: !312, line: 285, type: !70)
!1216 = !DILocalVariable(name: "ap", scope: !1209, file: !312, line: 287, type: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !803, line: 52, baseType: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1219, line: 14, baseType: !1220)
!1219 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !326, baseType: !1221)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 192, elements: !35)
!1222 = !DILocation(line: 0, scope: !1209)
!1223 = !DILocation(line: 287, column: 3, scope: !1209)
!1224 = !DILocation(line: 287, column: 11, scope: !1209)
!1225 = !DILocation(line: 288, column: 3, scope: !1209)
!1226 = !DILocation(line: 289, column: 3, scope: !1209)
!1227 = !DILocation(line: 290, column: 3, scope: !1209)
!1228 = !DILocation(line: 291, column: 1, scope: !1209)
!1229 = !DILocation(line: 0, scope: !319)
!1230 = !DILocation(line: 302, column: 7, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !319, file: !312, line: 302, column: 7)
!1232 = !DILocation(line: 302, column: 7, scope: !319)
!1233 = !DILocation(line: 307, column: 11, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !312, line: 307, column: 11)
!1235 = distinct !DILexicalBlock(scope: !1231, file: !312, line: 303, column: 5)
!1236 = !DILocation(line: 307, column: 27, scope: !1234)
!1237 = !DILocation(line: 308, column: 11, scope: !1234)
!1238 = !DILocation(line: 308, column: 28, scope: !1234)
!1239 = !DILocation(line: 308, column: 25, scope: !1234)
!1240 = !DILocation(line: 309, column: 15, scope: !1234)
!1241 = !DILocation(line: 309, column: 33, scope: !1234)
!1242 = !DILocation(line: 310, column: 19, scope: !1234)
!1243 = !DILocation(line: 311, column: 22, scope: !1234)
!1244 = !DILocation(line: 311, column: 56, scope: !1234)
!1245 = !DILocation(line: 307, column: 11, scope: !1235)
!1246 = !DILocation(line: 316, column: 21, scope: !1235)
!1247 = !DILocation(line: 317, column: 23, scope: !1235)
!1248 = !DILocation(line: 318, column: 5, scope: !1235)
!1249 = !DILocation(line: 327, column: 3, scope: !319)
!1250 = !DILocation(line: 331, column: 7, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !319, file: !312, line: 331, column: 7)
!1252 = !DILocation(line: 331, column: 7, scope: !319)
!1253 = !DILocation(line: 332, column: 5, scope: !1251)
!1254 = !DILocation(line: 338, column: 7, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1251, file: !312, line: 334, column: 5)
!1256 = !DILocation(line: 346, column: 3, scope: !319)
!1257 = !DILocation(line: 350, column: 3, scope: !319)
!1258 = !DILocation(line: 356, column: 1, scope: !319)
!1259 = distinct !DISubprogram(name: "error_at_line", scope: !312, file: !312, line: 359, type: !1260, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1262)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !92, !92, !70, !76, !70, null}
!1262 = !{!1263, !1264, !1265, !1266, !1267, !1268}
!1263 = !DILocalVariable(name: "status", arg: 1, scope: !1259, file: !312, line: 359, type: !92)
!1264 = !DILocalVariable(name: "errnum", arg: 2, scope: !1259, file: !312, line: 359, type: !92)
!1265 = !DILocalVariable(name: "file_name", arg: 3, scope: !1259, file: !312, line: 359, type: !70)
!1266 = !DILocalVariable(name: "line_number", arg: 4, scope: !1259, file: !312, line: 360, type: !76)
!1267 = !DILocalVariable(name: "message", arg: 5, scope: !1259, file: !312, line: 360, type: !70)
!1268 = !DILocalVariable(name: "ap", scope: !1259, file: !312, line: 362, type: !1217)
!1269 = !DILocation(line: 0, scope: !1259)
!1270 = !DILocation(line: 362, column: 3, scope: !1259)
!1271 = !DILocation(line: 362, column: 11, scope: !1259)
!1272 = !DILocation(line: 363, column: 3, scope: !1259)
!1273 = !DILocation(line: 364, column: 3, scope: !1259)
!1274 = !DILocation(line: 366, column: 3, scope: !1259)
!1275 = !DILocation(line: 367, column: 1, scope: !1259)
!1276 = distinct !DISubprogram(name: "getprogname", scope: !666, file: !666, line: 54, type: !1277, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !665, retainedNodes: !792)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!70}
!1279 = !DILocation(line: 58, column: 10, scope: !1276)
!1280 = !DILocation(line: 58, column: 3, scope: !1276)
!1281 = distinct !DISubprogram(name: "parse_long_options", scope: !363, file: !363, line: 45, type: !1282, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !366, retainedNodes: !1285)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null, !92, !962, !70, !70, !70, !1284, null}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1296}
!1286 = !DILocalVariable(name: "argc", arg: 1, scope: !1281, file: !363, line: 45, type: !92)
!1287 = !DILocalVariable(name: "argv", arg: 2, scope: !1281, file: !363, line: 46, type: !962)
!1288 = !DILocalVariable(name: "command_name", arg: 3, scope: !1281, file: !363, line: 47, type: !70)
!1289 = !DILocalVariable(name: "package", arg: 4, scope: !1281, file: !363, line: 48, type: !70)
!1290 = !DILocalVariable(name: "version", arg: 5, scope: !1281, file: !363, line: 49, type: !70)
!1291 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1281, file: !363, line: 50, type: !1284)
!1292 = !DILocalVariable(name: "saved_opterr", scope: !1281, file: !363, line: 53, type: !92)
!1293 = !DILocalVariable(name: "c", scope: !1294, file: !363, line: 60, type: !92)
!1294 = distinct !DILexicalBlock(scope: !1295, file: !363, line: 59, column: 5)
!1295 = distinct !DILexicalBlock(scope: !1281, file: !363, line: 58, column: 7)
!1296 = !DILocalVariable(name: "authors", scope: !1297, file: !363, line: 71, type: !1301)
!1297 = distinct !DILexicalBlock(scope: !1298, file: !363, line: 70, column: 15)
!1298 = distinct !DILexicalBlock(scope: !1299, file: !363, line: 64, column: 13)
!1299 = distinct !DILexicalBlock(scope: !1300, file: !363, line: 62, column: 9)
