; ModuleID = 'src/mkfifo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [50 x i8] c"Create named pipes (FIFOs) with the given NAMEs.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"mkfifo\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [79 x i8] c"  -m, --mode=MODE\0A         set file permission bits to MODE, not a=rw - umask\0A\00", align 1, !dbg !22

!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 73)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 14)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 16)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !127, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !14, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 13)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 44)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 22)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 29)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !69, line: 736, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 75)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !161, file: !69, line: 575, type: !70, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "oputs_", scope: !69, file: !69, line: 573, type: !162, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !164)
!162 = !DISubroutineType(cc: DW_CC_nocall, types: !163)
!163 = !{null, !111, !111}
!164 = !{!165, !166, !167, !170, !172, !173, !174, !178, !179, !180, !181, !183, !236, !237, !238, !240, !241}
!165 = !DILocalVariable(name: "program", arg: 1, scope: !161, file: !69, line: 573, type: !111)
!166 = !DILocalVariable(name: "option", arg: 2, scope: !161, file: !69, line: 573, type: !111)
!167 = !DILocalVariable(name: "term", scope: !168, file: !69, line: 585, type: !111)
!168 = distinct !DILexicalBlock(scope: !169, file: !69, line: 582, column: 5)
!169 = distinct !DILexicalBlock(scope: !161, file: !69, line: 581, column: 7)
!170 = !DILocalVariable(name: "double_space", scope: !161, file: !69, line: 594, type: !171)
!171 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!172 = !DILocalVariable(name: "first_word", scope: !161, file: !69, line: 595, type: !111)
!173 = !DILocalVariable(name: "option_text", scope: !161, file: !69, line: 596, type: !111)
!174 = !DILocalVariable(name: "s", scope: !175, file: !69, line: 608, type: !111)
!175 = distinct !DILexicalBlock(scope: !176, file: !69, line: 605, column: 5)
!176 = distinct !DILexicalBlock(scope: !177, file: !69, line: 604, column: 12)
!177 = distinct !DILexicalBlock(scope: !161, file: !69, line: 597, column: 7)
!178 = !DILocalVariable(name: "spaces", scope: !175, file: !69, line: 609, type: !108)
!179 = !DILocalVariable(name: "anchor_len", scope: !161, file: !69, line: 620, type: !108)
!180 = !DILocalVariable(name: "desc_text", scope: !161, file: !69, line: 625, type: !111)
!181 = !DILocalVariable(name: "__ptr", scope: !182, file: !69, line: 644, type: !111)
!182 = distinct !DILexicalBlock(scope: !161, file: !69, line: 644, column: 3)
!183 = !DILocalVariable(name: "__stream", scope: !182, file: !69, line: 644, type: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !186, line: 7, baseType: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !188, line: 49, size: 1728, elements: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !205, !207, !208, !209, !213, !214, !216, !217, !220, !222, !225, !228, !229, !230, !231, !232}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !187, file: !188, line: 51, baseType: !70, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !187, file: !188, line: 54, baseType: !105, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !187, file: !188, line: 55, baseType: !105, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !187, file: !188, line: 56, baseType: !105, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !187, file: !188, line: 57, baseType: !105, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !187, file: !188, line: 58, baseType: !105, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !187, file: !188, line: 59, baseType: !105, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !187, file: !188, line: 60, baseType: !105, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !187, file: !188, line: 61, baseType: !105, size: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !187, file: !188, line: 64, baseType: !105, size: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !187, file: !188, line: 65, baseType: !105, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !187, file: !188, line: 66, baseType: !105, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !187, file: !188, line: 68, baseType: !203, size: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !188, line: 36, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !187, file: !188, line: 70, baseType: !206, size: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !187, file: !188, line: 72, baseType: !70, size: 32, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !187, file: !188, line: 73, baseType: !70, size: 32, offset: 928)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !187, file: !188, line: 74, baseType: !210, size: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !211, line: 152, baseType: !212)
!211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!212 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !187, file: !188, line: 77, baseType: !107, size: 16, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !187, file: !188, line: 78, baseType: !215, size: 8, offset: 1040)
!215 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !187, file: !188, line: 79, baseType: !46, size: 8, offset: 1048)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !187, file: !188, line: 81, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !188, line: 43, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !187, file: !188, line: 89, baseType: !221, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !211, line: 153, baseType: !212)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !187, file: !188, line: 91, baseType: !223, size: 64, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !188, line: 37, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !187, file: !188, line: 92, baseType: !226, size: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !188, line: 38, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !187, file: !188, line: 93, baseType: !206, size: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !187, file: !188, line: 94, baseType: !106, size: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !187, file: !188, line: 95, baseType: !108, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !187, file: !188, line: 96, baseType: !70, size: 32, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !187, file: !188, line: 98, baseType: !233, size: 160, offset: 1568)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 20)
!236 = !DILocalVariable(name: "__cnt", scope: !182, file: !69, line: 644, type: !108)
!237 = !DILocalVariable(name: "url_program", scope: !161, file: !69, line: 648, type: !111)
!238 = !DILocalVariable(name: "__ptr", scope: !239, file: !69, line: 686, type: !111)
!239 = distinct !DILexicalBlock(scope: !161, file: !69, line: 686, column: 3)
!240 = !DILocalVariable(name: "__stream", scope: !239, file: !69, line: 686, type: !184)
!241 = !DILocalVariable(name: "__cnt", scope: !239, file: !69, line: 686, type: !108)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !69, line: 585, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 5)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !69, line: 586, type: !244, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !69, line: 595, type: !61, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !69, line: 620, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 6)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 2)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !244, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !61, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 3)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !69, line: 650, type: !244, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !253, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !253, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !69, line: 652, type: !19, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !69, line: 653, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !69, line: 654, type: !51, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !69, line: 655, type: !51, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !69, line: 656, type: !51, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !69, line: 657, type: !51, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !69, line: 663, type: !19, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !69, line: 664, type: !51, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 17)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 40)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 15)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 61)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !267, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !244, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !244, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !280, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !127, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !146, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !307, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !61, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 71)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 27)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 51)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 12)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 38, type: !280, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 39, type: !244, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !244, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !280, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 1280, elements: !245)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !362, line: 50, size: 256, elements: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!363 = !{!364, !365, !366, !368}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !362, line: 52, baseType: !111, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !361, file: !362, line: 55, baseType: !70, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !361, file: !362, line: 56, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !361, file: !362, line: 57, baseType: !70, size: 32, offset: 192)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !371, line: 3, type: !307, isLocal: true, isDefinition: true)
!371 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "Version", scope: !374, file: !371, line: 3, type: !111, isLocal: false, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C11, file: !371, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !375, splitDebugInlining: false, nameTableKind: None)
!375 = !{!369, !372}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "file_name", scope: !378, file: !379, line: 45, type: !111, isLocal: true, isDefinition: true)
!378 = distinct !DICompileUnit(language: DW_LANG_C11, file: !379, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !380, splitDebugInlining: false, nameTableKind: None)
!379 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!380 = !{!381, !383, !385, !387, !376, !389}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !379, line: 121, type: !19, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !379, line: 121, type: !348, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !379, line: 123, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !379, line: 126, type: !267, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !378, file: !379, line: 55, type: !171, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !393, file: !394, line: 66, type: !440, isLocal: false, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C11, file: !394, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, globals: !396, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!395 = !{!106, !113}
!396 = !{!397, !399, !419, !421, !423, !425, !391, !427, !429, !431, !433, !438}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !394, line: 272, type: !244, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "old_file_name", scope: !401, file: !394, line: 304, type: !111, isLocal: true, isDefinition: true)
!401 = distinct !DISubprogram(name: "verror_at_line", scope: !394, file: !394, line: 298, type: !402, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !412)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !70, !70, !111, !76, !111, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !406)
!406 = !{!407, !409, !410, !411}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !405, file: !408, baseType: !76, size: 32)
!408 = !DIFile(filename: "lib/error.c", directory: "/src")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !405, file: !408, baseType: !76, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !405, file: !408, baseType: !106, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !405, file: !408, baseType: !106, size: 64, offset: 128)
!412 = !{!413, !414, !415, !416, !417, !418}
!413 = !DILocalVariable(name: "status", arg: 1, scope: !401, file: !394, line: 298, type: !70)
!414 = !DILocalVariable(name: "errnum", arg: 2, scope: !401, file: !394, line: 298, type: !70)
!415 = !DILocalVariable(name: "file_name", arg: 3, scope: !401, file: !394, line: 298, type: !111)
!416 = !DILocalVariable(name: "line_number", arg: 4, scope: !401, file: !394, line: 298, type: !76)
!417 = !DILocalVariable(name: "message", arg: 5, scope: !401, file: !394, line: 298, type: !111)
!418 = !DILocalVariable(name: "args", arg: 6, scope: !401, file: !394, line: 298, type: !404)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "old_line_number", scope: !401, file: !394, line: 305, type: !76, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !394, line: 338, type: !61, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !394, line: 346, type: !280, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !394, line: 346, type: !258, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "error_message_count", scope: !393, file: !394, line: 69, type: !76, isLocal: false, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !393, file: !394, line: 295, type: !70, isLocal: false, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !394, line: 208, type: !19, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !394, line: 208, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 21)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !394, line: 214, type: !244, isLocal: true, isDefinition: true)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null}
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "program_name", scope: !445, file: !446, line: 31, type: !111, isLocal: false, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C11, file: !446, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !447, globals: !448, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!447 = !{!105}
!448 = !{!443, !449, !451}
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !446, line: 46, type: !280, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !446, line: 49, type: !61, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "utf07FF", scope: !455, file: !456, line: 46, type: !483, isLocal: true, isDefinition: true)
!455 = distinct !DISubprogram(name: "proper_name_lite", scope: !456, file: !456, line: 38, type: !457, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !459, retainedNodes: !461)
!456 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!457 = !DISubroutineType(types: !458)
!458 = !{!111, !111, !111}
!459 = distinct !DICompileUnit(language: DW_LANG_C11, file: !456, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !460, splitDebugInlining: false, nameTableKind: None)
!460 = !{!453}
!461 = !{!462, !463, !464, !465, !470}
!462 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !455, file: !456, line: 38, type: !111)
!463 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !455, file: !456, line: 38, type: !111)
!464 = !DILocalVariable(name: "translation", scope: !455, file: !456, line: 40, type: !111)
!465 = !DILocalVariable(name: "w", scope: !455, file: !456, line: 47, type: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !467, line: 37, baseType: !468)
!467 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !211, line: 57, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !211, line: 42, baseType: !76)
!470 = !DILocalVariable(name: "mbs", scope: !455, file: !456, line: 48, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !472, line: 6, baseType: !473)
!472 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !474, line: 21, baseType: !475)
!474 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 13, size: 64, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !475, file: !474, line: 15, baseType: !70, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !475, file: !474, line: 20, baseType: !479, size: 32, offset: 32)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !475, file: !474, line: 16, size: 32, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !479, file: !474, line: 18, baseType: !76, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !479, file: !474, line: 19, baseType: !61, size: 32)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 16, elements: !259)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !486, line: 78, type: !280, isLocal: true, isDefinition: true)
!486 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !486, line: 79, type: !253, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !486, line: 80, type: !136, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !486, line: 81, type: !136, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !486, line: 82, type: !233, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !486, line: 83, type: !258, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !486, line: 84, type: !280, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !486, line: 85, type: !19, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !486, line: 86, type: !19, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !486, line: 87, type: !280, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !507, file: !486, line: 76, type: !579, isLocal: false, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C11, file: !486, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !508, retainedTypes: !514, globals: !515, splitDebugInlining: false, nameTableKind: None)
!508 = !{!74, !509, !89}
!509 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !75, line: 254, baseType: !76, size: 32, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!512 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!513 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!514 = !{!70, !107, !108}
!515 = !{!484, !487, !489, !491, !493, !495, !497, !499, !501, !503, !505, !516, !520, !530, !532, !537, !539, !541, !543, !545, !568, !575, !577}
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !507, file: !486, line: 92, type: !518, isLocal: false, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 320, elements: !52)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !507, file: !486, line: 1040, type: !522, isLocal: false, isDefinition: true)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !486, line: 56, size: 448, elements: !523)
!523 = !{!524, !525, !526, !528, !529}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !522, file: !486, line: 59, baseType: !74, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !522, file: !486, line: 62, baseType: !70, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !522, file: !486, line: 66, baseType: !527, size: 256, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !281)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !522, file: !486, line: 69, baseType: !111, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !522, file: !486, line: 72, baseType: !111, size: 64, offset: 384)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !507, file: !486, line: 107, type: !522, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "slot0", scope: !507, file: !486, line: 831, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 256)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !486, line: 321, type: !258, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !486, line: 357, type: !258, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !486, line: 358, type: !258, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !486, line: 199, type: !19, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "quote", scope: !547, file: !486, line: 228, type: !566, isLocal: true, isDefinition: true)
!547 = distinct !DISubprogram(name: "gettext_quote", scope: !486, file: !486, line: 197, type: !548, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !507, retainedNodes: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{!111, !111, !74}
!550 = !{!551, !552, !553, !554, !555}
!551 = !DILocalVariable(name: "msgid", arg: 1, scope: !547, file: !486, line: 197, type: !111)
!552 = !DILocalVariable(name: "s", arg: 2, scope: !547, file: !486, line: 197, type: !74)
!553 = !DILocalVariable(name: "translation", scope: !547, file: !486, line: 199, type: !111)
!554 = !DILocalVariable(name: "w", scope: !547, file: !486, line: 229, type: !466)
!555 = !DILocalVariable(name: "mbs", scope: !547, file: !486, line: 230, type: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !472, line: 6, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !474, line: 21, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 13, size: 64, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !558, file: !474, line: 15, baseType: !70, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !558, file: !474, line: 20, baseType: !562, size: 32, offset: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !474, line: 16, size: 32, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !562, file: !474, line: 18, baseType: !76, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !562, file: !474, line: 19, baseType: !61, size: 32)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !567)
!567 = !{!260, !63}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "slotvec", scope: !507, file: !486, line: 834, type: !570, isLocal: true, isDefinition: true)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !486, line: 823, size: 128, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !571, file: !486, line: 825, baseType: !108, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !571, file: !486, line: 826, baseType: !105, size: 64, offset: 64)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "nslots", scope: !507, file: !486, line: 832, type: !70, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "slotvec0", scope: !507, file: !486, line: 833, type: !571, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 704, elements: !581)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!581 = !{!582}
!582 = !DISubrange(count: 11)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !585, line: 67, type: !348, isLocal: true, isDefinition: true)
!585 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !585, line: 69, type: !19, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !585, line: 83, type: !19, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !585, line: 83, type: !61, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !585, line: 85, type: !258, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !585, line: 88, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 171)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !585, line: 88, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 34)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !585, line: 105, type: !127, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !585, line: 109, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 23)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !585, line: 113, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 28)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !585, line: 120, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 32)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !585, line: 127, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 36)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !585, line: 134, type: !302, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !585, line: 142, type: !141, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !585, line: 150, type: !632, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 48)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !585, line: 159, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 52)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !585, line: 170, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 60)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !585, line: 248, type: !233, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !585, line: 248, type: !146, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !585, line: 254, type: !233, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !585, line: 254, type: !122, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !585, line: 254, type: !302, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !585, line: 259, type: !3, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !585, line: 259, type: !151, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !661, file: !662, line: 26, type: !664, isLocal: false, isDefinition: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C11, file: !662, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !663, splitDebugInlining: false, nameTableKind: None)
!662 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!663 = !{!659}
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 376, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 47)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "exit_failure", scope: !669, file: !670, line: 24, type: !672, isLocal: false, isDefinition: true)
!669 = distinct !DICompileUnit(language: DW_LANG_C11, file: !670, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !671, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!671 = !{!667}
!672 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !675, line: 34, type: !267, isLocal: true, isDefinition: true)
!675 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !675, line: 34, type: !19, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !675, line: 34, type: !297, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !682, line: 108, type: !46, isLocal: true, isDefinition: true)
!682 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "internal_state", scope: !685, file: !682, line: 97, type: !688, isLocal: true, isDefinition: true)
!685 = distinct !DICompileUnit(language: DW_LANG_C11, file: !682, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !686, globals: !687, splitDebugInlining: false, nameTableKind: None)
!686 = !{!106, !108, !113}
!687 = !{!680, !683}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !472, line: 6, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !474, line: 21, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 13, size: 64, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !690, file: !474, line: 15, baseType: !70, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !690, file: !474, line: 20, baseType: !694, size: 32, offset: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !690, file: !474, line: 16, size: 32, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !694, file: !474, line: 18, baseType: !76, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !694, file: !474, line: 19, baseType: !61, size: 32)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !700, line: 35, type: !253, isLocal: true, isDefinition: true)
!700 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !704, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!705 = distinct !DICompileUnit(language: DW_LANG_C11, file: !706, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !707, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/modechange.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d9d9323c1a974dc920f948d08984b73e")
!707 = !{!708}
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !706, line: 78, baseType: !76, size: 32, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIEnumerator(name: "MODE_DONE", value: 0)
!711 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!712 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!713 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !585, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !715, retainedTypes: !719, globals: !720, splitDebugInlining: false, nameTableKind: None)
!715 = !{!716}
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !585, line: 40, baseType: !76, size: 32, elements: !717)
!717 = !{!718}
!718 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!719 = !{!106}
!720 = !{!583, !586, !588, !590, !592, !594, !599, !604, !606, !611, !616, !621, !626, !628, !630, !635, !640, !645, !647, !649, !651, !653, !655, !657}
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !722, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !723, retainedTypes: !754, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!723 = !{!724, !736}
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !725, file: !722, line: 188, baseType: !76, size: 32, elements: !734)
!725 = distinct !DISubprogram(name: "x2nrealloc", scope: !722, file: !722, line: 176, type: !726, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !721, retainedNodes: !729)
!726 = !DISubroutineType(types: !727)
!727 = !{!106, !106, !728, !108}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!729 = !{!730, !731, !732, !733}
!730 = !DILocalVariable(name: "p", arg: 1, scope: !725, file: !722, line: 176, type: !106)
!731 = !DILocalVariable(name: "pn", arg: 2, scope: !725, file: !722, line: 176, type: !728)
!732 = !DILocalVariable(name: "s", arg: 3, scope: !725, file: !722, line: 176, type: !108)
!733 = !DILocalVariable(name: "n", scope: !725, file: !722, line: 178, type: !108)
!734 = !{!735}
!735 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !737, file: !722, line: 228, baseType: !76, size: 32, elements: !734)
!737 = distinct !DISubprogram(name: "xpalloc", scope: !722, file: !722, line: 223, type: !738, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !721, retainedNodes: !744)
!738 = !DISubroutineType(types: !739)
!739 = !{!106, !106, !740, !741, !743, !741}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !742, line: 130, baseType: !743)
!742 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !109, line: 35, baseType: !212)
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753}
!745 = !DILocalVariable(name: "pa", arg: 1, scope: !737, file: !722, line: 223, type: !106)
!746 = !DILocalVariable(name: "pn", arg: 2, scope: !737, file: !722, line: 223, type: !740)
!747 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !737, file: !722, line: 223, type: !741)
!748 = !DILocalVariable(name: "n_max", arg: 4, scope: !737, file: !722, line: 223, type: !743)
!749 = !DILocalVariable(name: "s", arg: 5, scope: !737, file: !722, line: 223, type: !741)
!750 = !DILocalVariable(name: "n0", scope: !737, file: !722, line: 230, type: !741)
!751 = !DILocalVariable(name: "n", scope: !737, file: !722, line: 237, type: !741)
!752 = !DILocalVariable(name: "nbytes", scope: !737, file: !722, line: 248, type: !741)
!753 = !DILocalVariable(name: "adjusted_nbytes", scope: !737, file: !722, line: 252, type: !741)
!754 = !{!105, !106, !171, !212, !110}
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !756, splitDebugInlining: false, nameTableKind: None)
!756 = !{!673, !676, !678}
!757 = distinct !DICompileUnit(language: DW_LANG_C11, file: !758, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!759 = distinct !DICompileUnit(language: DW_LANG_C11, file: !760, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!761 = distinct !DICompileUnit(language: DW_LANG_C11, file: !762, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !719, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !719, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!765 = distinct !DICompileUnit(language: DW_LANG_C11, file: !766, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !767, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!767 = !{!171, !110, !106}
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !769, splitDebugInlining: false, nameTableKind: None)
!769 = !{!770, !698}
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !700, line: 35, type: !258, isLocal: true, isDefinition: true)
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !773, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !719, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!776 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!777 = !{i32 7, !"Dwarf Version", i32 5}
!778 = !{i32 2, !"Debug Info Version", i32 3}
!779 = !{i32 1, !"wchar_size", i32 4}
!780 = !{i32 8, !"PIC Level", i32 2}
!781 = !{i32 7, !"PIE Level", i32 2}
!782 = !{i32 7, !"uwtable", i32 2}
!783 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 46, type: !784, scopeLine: 47, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !70}
!786 = !{!787}
!787 = !DILocalVariable(name: "status", arg: 1, scope: !783, file: !2, line: 46, type: !70)
!788 = !DILocation(line: 0, scope: !783)
!789 = !DILocation(line: 48, column: 14, scope: !790)
!790 = distinct !DILexicalBlock(scope: !783, file: !2, line: 48, column: 7)
!791 = !DILocation(line: 48, column: 7, scope: !783)
!792 = !DILocation(line: 49, column: 5, scope: !793)
!793 = distinct !DILexicalBlock(scope: !790, file: !2, line: 49, column: 5)
!794 = !{!795, !795, i64 0}
!795 = !{!"any pointer", !796, i64 0}
!796 = !{!"omnipotent char", !797, i64 0}
!797 = !{!"Simple C/C++ TBAA"}
!798 = !DILocation(line: 52, column: 7, scope: !799)
!799 = distinct !DILexicalBlock(scope: !790, file: !2, line: 51, column: 5)
!800 = !DILocation(line: 53, column: 7, scope: !799)
!801 = !DILocation(line: 736, column: 3, scope: !802, inlinedAt: !804)
!802 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !69, file: !69, line: 734, type: !441, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !803)
!803 = !{}
!804 = distinct !DILocation(line: 57, column: 7, scope: !799)
!805 = !DILocation(line: 59, column: 7, scope: !799)
!806 = !DILocation(line: 63, column: 7, scope: !799)
!807 = !DILocation(line: 67, column: 7, scope: !799)
!808 = !DILocation(line: 72, column: 7, scope: !799)
!809 = !DILocation(line: 73, column: 7, scope: !799)
!810 = !DILocalVariable(name: "program", arg: 1, scope: !811, file: !69, line: 836, type: !111)
!811 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !812, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !111}
!814 = !{!810, !815, !822, !823, !825, !826}
!815 = !DILocalVariable(name: "infomap", scope: !811, file: !69, line: 838, type: !816)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 896, elements: !20)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !811, file: !69, line: 838, size: 128, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !818, file: !69, line: 838, baseType: !111, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !818, file: !69, line: 838, baseType: !111, size: 64, offset: 64)
!822 = !DILocalVariable(name: "node", scope: !811, file: !69, line: 848, type: !111)
!823 = !DILocalVariable(name: "map_prog", scope: !811, file: !69, line: 849, type: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!825 = !DILocalVariable(name: "lc_messages", scope: !811, file: !69, line: 861, type: !111)
!826 = !DILocalVariable(name: "url_program", scope: !811, file: !69, line: 874, type: !111)
!827 = !DILocation(line: 0, scope: !811, inlinedAt: !828)
!828 = distinct !DILocation(line: 74, column: 7, scope: !799)
!829 = !DILocation(line: 857, column: 3, scope: !811, inlinedAt: !828)
!830 = !DILocation(line: 861, column: 29, scope: !811, inlinedAt: !828)
!831 = !DILocation(line: 862, column: 7, scope: !832, inlinedAt: !828)
!832 = distinct !DILexicalBlock(scope: !811, file: !69, line: 862, column: 7)
!833 = !DILocation(line: 862, column: 19, scope: !832, inlinedAt: !828)
!834 = !DILocation(line: 862, column: 22, scope: !832, inlinedAt: !828)
!835 = !DILocation(line: 862, column: 7, scope: !811, inlinedAt: !828)
!836 = !DILocation(line: 868, column: 7, scope: !837, inlinedAt: !828)
!837 = distinct !DILexicalBlock(scope: !832, file: !69, line: 863, column: 5)
!838 = !DILocation(line: 870, column: 5, scope: !837, inlinedAt: !828)
!839 = !DILocation(line: 875, column: 3, scope: !811, inlinedAt: !828)
!840 = !DILocation(line: 877, column: 3, scope: !811, inlinedAt: !828)
!841 = !DILocation(line: 76, column: 3, scope: !783)
!842 = !DISubprogram(name: "dcgettext", scope: !843, file: !843, line: 51, type: !844, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!843 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!844 = !DISubroutineType(types: !845)
!845 = !{!105, !111, !111, !70}
!846 = !DISubprogram(name: "__fprintf_chk", scope: !847, file: !847, line: 93, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!847 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!848 = !DISubroutineType(types: !849)
!849 = !{!70, !850, !70, !851, null}
!850 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !184)
!851 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !111)
!852 = !DISubprogram(name: "__printf_chk", scope: !847, file: !847, line: 95, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!853 = !DISubroutineType(types: !854)
!854 = !{!70, !70, !851, null}
!855 = !DISubprogram(name: "fputs_unlocked", scope: !856, file: !856, line: 691, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!856 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!857 = !DISubroutineType(types: !858)
!858 = !{!70, !851, !850}
!859 = !DILocation(line: 0, scope: !161)
!860 = !DILocation(line: 581, column: 7, scope: !169)
!861 = !{!862, !862, i64 0}
!862 = !{!"int", !796, i64 0}
!863 = !DILocation(line: 581, column: 19, scope: !169)
!864 = !DILocation(line: 581, column: 7, scope: !161)
!865 = !DILocation(line: 585, column: 26, scope: !168)
!866 = !DILocation(line: 0, scope: !168)
!867 = !DILocation(line: 586, column: 23, scope: !168)
!868 = !DILocation(line: 586, column: 28, scope: !168)
!869 = !DILocation(line: 586, column: 32, scope: !168)
!870 = !{!796, !796, i64 0}
!871 = !DILocation(line: 586, column: 38, scope: !168)
!872 = !DILocalVariable(name: "__s1", arg: 1, scope: !873, file: !874, line: 1359, type: !111)
!873 = distinct !DISubprogram(name: "streq", scope: !874, file: !874, line: 1359, type: !875, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !877)
!874 = !DIFile(filename: "./lib/string.h", directory: "/src")
!875 = !DISubroutineType(types: !876)
!876 = !{!171, !111, !111}
!877 = !{!872, !878}
!878 = !DILocalVariable(name: "__s2", arg: 2, scope: !873, file: !874, line: 1359, type: !111)
!879 = !DILocation(line: 0, scope: !873, inlinedAt: !880)
!880 = distinct !DILocation(line: 586, column: 41, scope: !168)
!881 = !DILocation(line: 1361, column: 11, scope: !873, inlinedAt: !880)
!882 = !DILocation(line: 1361, column: 10, scope: !873, inlinedAt: !880)
!883 = !DILocation(line: 586, column: 19, scope: !168)
!884 = !DILocation(line: 587, column: 5, scope: !168)
!885 = !DILocation(line: 588, column: 7, scope: !886)
!886 = distinct !DILexicalBlock(scope: !161, file: !69, line: 588, column: 7)
!887 = !DILocation(line: 588, column: 7, scope: !161)
!888 = !DILocation(line: 590, column: 7, scope: !889)
!889 = distinct !DILexicalBlock(scope: !886, file: !69, line: 589, column: 5)
!890 = !DILocation(line: 591, column: 7, scope: !889)
!891 = !DILocation(line: 595, column: 37, scope: !161)
!892 = !DILocation(line: 595, column: 35, scope: !161)
!893 = !DILocation(line: 596, column: 29, scope: !161)
!894 = !DILocation(line: 597, column: 8, scope: !177)
!895 = !DILocation(line: 597, column: 7, scope: !161)
!896 = !DILocation(line: 604, column: 24, scope: !176)
!897 = !DILocation(line: 604, column: 12, scope: !177)
!898 = !DILocation(line: 0, scope: !175)
!899 = !DILocation(line: 610, column: 16, scope: !175)
!900 = !DILocation(line: 610, column: 7, scope: !175)
!901 = !DILocation(line: 611, column: 21, scope: !175)
!902 = !{!903, !903, i64 0}
!903 = !{!"short", !796, i64 0}
!904 = !DILocation(line: 611, column: 19, scope: !175)
!905 = !DILocation(line: 611, column: 16, scope: !175)
!906 = !DILocation(line: 610, column: 30, scope: !175)
!907 = distinct !{!907, !900, !901, !908}
!908 = !{!"llvm.loop.mustprogress"}
!909 = !DILocation(line: 612, column: 18, scope: !910)
!910 = distinct !DILexicalBlock(scope: !175, file: !69, line: 612, column: 11)
!911 = !DILocation(line: 612, column: 11, scope: !175)
!912 = !DILocation(line: 618, column: 5, scope: !175)
!913 = !DILocation(line: 620, column: 23, scope: !161)
!914 = !DILocation(line: 625, column: 39, scope: !161)
!915 = !DILocation(line: 626, column: 3, scope: !161)
!916 = !DILocation(line: 626, column: 10, scope: !161)
!917 = !DILocation(line: 626, column: 21, scope: !161)
!918 = !DILocation(line: 628, column: 44, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !69, line: 628, column: 11)
!920 = distinct !DILexicalBlock(scope: !161, file: !69, line: 627, column: 5)
!921 = !DILocation(line: 628, column: 32, scope: !919)
!922 = !DILocation(line: 628, column: 49, scope: !919)
!923 = !DILocation(line: 628, column: 11, scope: !920)
!924 = !DILocation(line: 630, column: 11, scope: !925)
!925 = distinct !DILexicalBlock(scope: !920, file: !69, line: 630, column: 11)
!926 = !DILocation(line: 630, column: 11, scope: !920)
!927 = !DILocation(line: 632, column: 26, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !69, line: 632, column: 15)
!929 = distinct !DILexicalBlock(scope: !925, file: !69, line: 631, column: 9)
!930 = !DILocation(line: 632, column: 34, scope: !928)
!931 = !DILocation(line: 632, column: 37, scope: !928)
!932 = !DILocation(line: 632, column: 15, scope: !929)
!933 = !DILocation(line: 636, column: 16, scope: !934)
!934 = distinct !DILexicalBlock(scope: !929, file: !69, line: 636, column: 15)
!935 = !DILocation(line: 636, column: 29, scope: !934)
!936 = !DILocation(line: 640, column: 16, scope: !920)
!937 = distinct !{!937, !915, !938, !908}
!938 = !DILocation(line: 641, column: 5, scope: !161)
!939 = !DILocation(line: 644, column: 3, scope: !161)
!940 = !DILocation(line: 0, scope: !873, inlinedAt: !941)
!941 = distinct !DILocation(line: 648, column: 31, scope: !161)
!942 = !DILocation(line: 0, scope: !873, inlinedAt: !943)
!943 = distinct !DILocation(line: 649, column: 31, scope: !161)
!944 = !DILocation(line: 0, scope: !873, inlinedAt: !945)
!945 = distinct !DILocation(line: 650, column: 31, scope: !161)
!946 = !DILocation(line: 0, scope: !873, inlinedAt: !947)
!947 = distinct !DILocation(line: 651, column: 31, scope: !161)
!948 = !DILocation(line: 0, scope: !873, inlinedAt: !949)
!949 = distinct !DILocation(line: 652, column: 31, scope: !161)
!950 = !DILocation(line: 0, scope: !873, inlinedAt: !951)
!951 = distinct !DILocation(line: 653, column: 31, scope: !161)
!952 = !DILocation(line: 0, scope: !873, inlinedAt: !953)
!953 = distinct !DILocation(line: 654, column: 31, scope: !161)
!954 = !DILocation(line: 0, scope: !873, inlinedAt: !955)
!955 = distinct !DILocation(line: 655, column: 31, scope: !161)
!956 = !DILocation(line: 0, scope: !873, inlinedAt: !957)
!957 = distinct !DILocation(line: 656, column: 31, scope: !161)
!958 = !DILocation(line: 0, scope: !873, inlinedAt: !959)
!959 = distinct !DILocation(line: 657, column: 31, scope: !161)
!960 = !DILocation(line: 663, column: 7, scope: !961)
!961 = distinct !DILexicalBlock(scope: !161, file: !69, line: 663, column: 7)
!962 = !DILocation(line: 664, column: 7, scope: !961)
!963 = !DILocation(line: 664, column: 10, scope: !961)
!964 = !DILocation(line: 663, column: 7, scope: !161)
!965 = !DILocation(line: 669, column: 7, scope: !966)
!966 = distinct !DILexicalBlock(scope: !961, file: !69, line: 665, column: 5)
!967 = !DILocation(line: 671, column: 5, scope: !966)
!968 = !DILocation(line: 676, column: 7, scope: !969)
!969 = distinct !DILexicalBlock(scope: !961, file: !69, line: 673, column: 5)
!970 = !DILocation(line: 679, column: 3, scope: !161)
!971 = !DILocation(line: 683, column: 3, scope: !161)
!972 = !DILocation(line: 686, column: 3, scope: !161)
!973 = !DILocation(line: 688, column: 3, scope: !161)
!974 = !DILocation(line: 691, column: 3, scope: !161)
!975 = !DILocation(line: 695, column: 3, scope: !161)
!976 = !DILocation(line: 696, column: 1, scope: !161)
!977 = !DISubprogram(name: "setlocale", scope: !978, file: !978, line: 122, type: !979, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!978 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!979 = !DISubroutineType(types: !980)
!980 = !{!105, !70, !111}
!981 = !DISubprogram(name: "strncmp", scope: !982, file: !982, line: 159, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!982 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!983 = !DISubroutineType(types: !984)
!984 = !{!70, !111, !111, !108}
!985 = !DISubprogram(name: "exit", scope: !986, file: !986, line: 624, type: !784, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !803)
!986 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!987 = !DISubprogram(name: "getenv", scope: !986, file: !986, line: 641, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!988 = !DISubroutineType(types: !989)
!989 = !{!105, !111}
!990 = !DISubprogram(name: "strcmp", scope: !982, file: !982, line: 156, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!991 = !DISubroutineType(types: !992)
!992 = !{!70, !111, !111}
!993 = !DISubprogram(name: "strspn", scope: !982, file: !982, line: 297, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!994 = !DISubroutineType(types: !995)
!995 = !{!110, !111, !111}
!996 = !DISubprogram(name: "strchr", scope: !982, file: !982, line: 246, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!997 = !DISubroutineType(types: !998)
!998 = !{!105, !111, !70}
!999 = !DISubprogram(name: "__ctype_b_loc", scope: !90, file: !90, line: 79, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!1005 = !DISubprogram(name: "strcspn", scope: !982, file: !982, line: 293, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1006 = !DISubprogram(name: "fwrite_unlocked", scope: !856, file: !856, line: 704, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!108, !1009, !108, !108, !850}
!1009 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1012 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 80, type: !1013, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1016)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!70, !70, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1025, !1026, !1029, !1033, !1039, !1040}
!1017 = !DILocalVariable(name: "argc", arg: 1, scope: !1012, file: !2, line: 80, type: !70)
!1018 = !DILocalVariable(name: "argv", arg: 2, scope: !1012, file: !2, line: 80, type: !1015)
!1019 = !DILocalVariable(name: "specified_mode", scope: !1012, file: !2, line: 82, type: !111)
!1020 = !DILocalVariable(name: "scontext", scope: !1012, file: !2, line: 83, type: !111)
!1021 = !DILocalVariable(name: "set_security_context", scope: !1012, file: !2, line: 84, type: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !1024, line: 53, flags: DIFlagFwdDecl)
!1024 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!1025 = !DILocalVariable(name: "optc", scope: !1012, file: !2, line: 94, type: !70)
!1026 = !DILocalVariable(name: "ret", scope: !1027, file: !2, line: 142, type: !70)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 141, column: 5)
!1028 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 140, column: 7)
!1029 = !DILocalVariable(name: "newmode", scope: !1012, file: !2, line: 154, type: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !1031, line: 69, baseType: !1032)
!1031 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !211, line: 150, baseType: !76)
!1033 = !DILocalVariable(name: "change", scope: !1034, file: !2, line: 157, type: !1036)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 156, column: 5)
!1035 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 155, column: 7)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !1038, line: 35, flags: DIFlagFwdDecl)
!1038 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!1039 = !DILocalVariable(name: "umask_value", scope: !1034, file: !2, line: 160, type: !1030)
!1040 = !DILocalVariable(name: "exit_status", scope: !1012, file: !2, line: 169, type: !70)
!1041 = !DILocation(line: 0, scope: !1012)
!1042 = !DILocation(line: 87, column: 21, scope: !1012)
!1043 = !DILocation(line: 87, column: 3, scope: !1012)
!1044 = !DILocation(line: 88, column: 3, scope: !1012)
!1045 = !DILocation(line: 89, column: 3, scope: !1012)
!1046 = !DILocation(line: 90, column: 3, scope: !1012)
!1047 = !DILocation(line: 92, column: 3, scope: !1012)
!1048 = !DILocation(line: 95, column: 3, scope: !1012)
!1049 = !DILocation(line: 95, column: 18, scope: !1012)
!1050 = !DILocation(line: 100, column: 28, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 98, column: 9)
!1052 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 96, column: 5)
!1053 = !DILocation(line: 101, column: 11, scope: !1051)
!1054 = distinct !{!1054, !1048, !1055, !908}
!1055 = !DILocation(line: 132, column: 5, scope: !1012)
!1056 = !DILocation(line: 120, column: 20, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !2, line: 120, column: 20)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 108, column: 20)
!1059 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 103, column: 15)
!1060 = !DILocation(line: 120, column: 20, scope: !1058)
!1061 = !DILocation(line: 122, column: 15, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1057, file: !2, line: 121, column: 13)
!1063 = !DILocation(line: 125, column: 13, scope: !1062)
!1064 = !DILocation(line: 127, column: 9, scope: !1051)
!1065 = !DILocation(line: 128, column: 9, scope: !1051)
!1066 = !DILocation(line: 130, column: 11, scope: !1051)
!1067 = !DILocation(line: 134, column: 7, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 134, column: 7)
!1069 = !DILocation(line: 134, column: 14, scope: !1068)
!1070 = !DILocation(line: 134, column: 7, scope: !1012)
!1071 = !DILocation(line: 136, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1068, file: !2, line: 135, column: 5)
!1073 = !DILocation(line: 137, column: 7, scope: !1072)
!1074 = !DILocation(line: 155, column: 7, scope: !1035)
!1075 = !DILocation(line: 155, column: 7, scope: !1012)
!1076 = !DILocation(line: 157, column: 36, scope: !1034)
!1077 = !DILocation(line: 0, scope: !1034)
!1078 = !DILocation(line: 158, column: 12, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1034, file: !2, line: 158, column: 11)
!1080 = !DILocation(line: 158, column: 11, scope: !1034)
!1081 = !DILocation(line: 159, column: 9, scope: !1079)
!1082 = !DILocation(line: 160, column: 28, scope: !1034)
!1083 = !DILocation(line: 161, column: 7, scope: !1034)
!1084 = !DILocation(line: 162, column: 17, scope: !1034)
!1085 = !DILocation(line: 163, column: 7, scope: !1034)
!1086 = !DILocation(line: 164, column: 19, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1034, file: !2, line: 164, column: 11)
!1088 = !DILocation(line: 164, column: 11, scope: !1034)
!1089 = !DILocation(line: 170, column: 10, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !2, line: 170, column: 3)
!1091 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 170, column: 3)
!1092 = !DILocation(line: 165, column: 9, scope: !1087)
!1093 = !DILocation(line: 170, column: 17, scope: !1090)
!1094 = !DILocation(line: 170, column: 3, scope: !1091)
!1095 = !DILocation(line: 174, column: 19, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !2, line: 174, column: 11)
!1097 = distinct !DILexicalBlock(scope: !1090, file: !2, line: 171, column: 5)
!1098 = !DILocation(line: 174, column: 11, scope: !1096)
!1099 = !DILocation(line: 174, column: 42, scope: !1096)
!1100 = !DILocation(line: 174, column: 11, scope: !1097)
!1101 = !DILocation(line: 179, column: 31, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1096, file: !2, line: 179, column: 16)
!1103 = !DILocation(line: 179, column: 47, scope: !1102)
!1104 = !DILocation(line: 179, column: 42, scope: !1102)
!1105 = !DILocation(line: 179, column: 34, scope: !1102)
!1106 = !DILocation(line: 179, column: 65, scope: !1102)
!1107 = !DILocation(line: 179, column: 16, scope: !1096)
!1108 = !DILocation(line: 0, scope: !1096)
!1109 = !DILocation(line: 170, column: 25, scope: !1090)
!1110 = distinct !{!1110, !1094, !1111, !908}
!1111 = !DILocation(line: 185, column: 5, scope: !1091)
!1112 = !DILocation(line: 187, column: 3, scope: !1012)
!1113 = !DISubprogram(name: "bindtextdomain", scope: !843, file: !843, line: 86, type: !1114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!105, !111, !111}
!1116 = !DISubprogram(name: "textdomain", scope: !843, file: !843, line: 82, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1117 = !DISubprogram(name: "atexit", scope: !986, file: !986, line: 602, type: !1118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!70, !440}
!1120 = !DISubprogram(name: "getopt_long", scope: !362, file: !362, line: 66, type: !1121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!70, !70, !1123, !111, !1125, !367}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!1126 = !DISubprogram(name: "umask", scope: !1127, file: !1127, line: 380, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!1032, !1032}
!1130 = !DISubprogram(name: "free", scope: !986, file: !986, line: 555, type: !1131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{null, !106}
!1133 = !DISubprogram(name: "mkfifo", scope: !1127, file: !1127, line: 418, type: !1134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!70, !111, !1032}
!1136 = !DISubprogram(name: "lchmod", scope: !1127, file: !1127, line: 359, type: !1134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1137 = !DISubprogram(name: "__errno_location", scope: !1138, file: !1138, line: 37, type: !1139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1138 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!367}
!1141 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !379, file: !379, line: 50, type: !812, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1142)
!1142 = !{!1143}
!1143 = !DILocalVariable(name: "file", arg: 1, scope: !1141, file: !379, line: 50, type: !111)
!1144 = !DILocation(line: 0, scope: !1141)
!1145 = !DILocation(line: 52, column: 13, scope: !1141)
!1146 = !DILocation(line: 53, column: 1, scope: !1141)
!1147 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !379, file: !379, line: 87, type: !1148, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1150)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !171}
!1150 = !{!1151}
!1151 = !DILocalVariable(name: "ignore", arg: 1, scope: !1147, file: !379, line: 87, type: !171)
!1152 = !DILocation(line: 0, scope: !1147)
!1153 = !DILocation(line: 89, column: 16, scope: !1147)
!1154 = !{!1155, !1155, i64 0}
!1155 = !{!"_Bool", !796, i64 0}
!1156 = !DILocation(line: 90, column: 1, scope: !1147)
!1157 = distinct !DISubprogram(name: "close_stdout", scope: !379, file: !379, line: 116, type: !441, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1158)
!1158 = !{!1159}
!1159 = !DILocalVariable(name: "write_error", scope: !1160, file: !379, line: 121, type: !111)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !379, line: 120, column: 5)
!1161 = distinct !DILexicalBlock(scope: !1157, file: !379, line: 118, column: 7)
!1162 = !DILocation(line: 118, column: 21, scope: !1161)
!1163 = !DILocation(line: 118, column: 7, scope: !1161)
!1164 = !DILocation(line: 118, column: 29, scope: !1161)
!1165 = !DILocation(line: 119, column: 7, scope: !1161)
!1166 = !DILocation(line: 119, column: 12, scope: !1161)
!1167 = !{i8 0, i8 2}
!1168 = !DILocation(line: 119, column: 25, scope: !1161)
!1169 = !DILocation(line: 119, column: 28, scope: !1161)
!1170 = !DILocation(line: 119, column: 34, scope: !1161)
!1171 = !DILocation(line: 118, column: 7, scope: !1157)
!1172 = !DILocation(line: 121, column: 33, scope: !1160)
!1173 = !DILocation(line: 0, scope: !1160)
!1174 = !DILocation(line: 122, column: 11, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1160, file: !379, line: 122, column: 11)
!1176 = !DILocation(line: 0, scope: !1175)
!1177 = !DILocation(line: 122, column: 11, scope: !1160)
!1178 = !DILocation(line: 123, column: 9, scope: !1175)
!1179 = !DILocation(line: 126, column: 9, scope: !1175)
!1180 = !DILocation(line: 128, column: 14, scope: !1160)
!1181 = !DILocation(line: 128, column: 7, scope: !1160)
!1182 = !DILocation(line: 133, column: 42, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1157, file: !379, line: 133, column: 7)
!1184 = !DILocation(line: 133, column: 28, scope: !1183)
!1185 = !DILocation(line: 133, column: 50, scope: !1183)
!1186 = !DILocation(line: 133, column: 7, scope: !1157)
!1187 = !DILocation(line: 134, column: 12, scope: !1183)
!1188 = !DILocation(line: 134, column: 5, scope: !1183)
!1189 = !DILocation(line: 135, column: 1, scope: !1157)
!1190 = !DISubprogram(name: "_exit", scope: !1191, file: !1191, line: 624, type: !784, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1191 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1192 = distinct !DISubprogram(name: "verror", scope: !394, file: !394, line: 251, type: !1193, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1195)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{null, !70, !70, !111, !404}
!1195 = !{!1196, !1197, !1198, !1199}
!1196 = !DILocalVariable(name: "status", arg: 1, scope: !1192, file: !394, line: 251, type: !70)
!1197 = !DILocalVariable(name: "errnum", arg: 2, scope: !1192, file: !394, line: 251, type: !70)
!1198 = !DILocalVariable(name: "message", arg: 3, scope: !1192, file: !394, line: 251, type: !111)
!1199 = !DILocalVariable(name: "args", arg: 4, scope: !1192, file: !394, line: 251, type: !404)
!1200 = !DILocation(line: 0, scope: !1192)
!1201 = !DILocation(line: 261, column: 3, scope: !1192)
!1202 = !DILocation(line: 265, column: 7, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1192, file: !394, line: 265, column: 7)
!1204 = !DILocation(line: 265, column: 7, scope: !1192)
!1205 = !DILocation(line: 266, column: 5, scope: !1203)
!1206 = !DILocation(line: 272, column: 7, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1203, file: !394, line: 268, column: 5)
!1208 = !DILocation(line: 276, column: 3, scope: !1192)
!1209 = !DILocation(line: 282, column: 1, scope: !1192)
!1210 = distinct !DISubprogram(name: "flush_stdout", scope: !394, file: !394, line: 163, type: !441, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1211)
!1211 = !{!1212}
!1212 = !DILocalVariable(name: "stdout_fd", scope: !1210, file: !394, line: 166, type: !70)
!1213 = !DILocation(line: 0, scope: !1210)
!1214 = !DILocalVariable(name: "fd", arg: 1, scope: !1215, file: !394, line: 145, type: !70)
!1215 = distinct !DISubprogram(name: "is_open", scope: !394, file: !394, line: 145, type: !1216, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1218)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!70, !70}
!1218 = !{!1214}
!1219 = !DILocation(line: 0, scope: !1215, inlinedAt: !1220)
!1220 = distinct !DILocation(line: 182, column: 25, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1210, file: !394, line: 182, column: 7)
!1222 = !DILocation(line: 157, column: 15, scope: !1215, inlinedAt: !1220)
!1223 = !DILocation(line: 157, column: 12, scope: !1215, inlinedAt: !1220)
!1224 = !DILocation(line: 182, column: 7, scope: !1210)
!1225 = !DILocation(line: 184, column: 5, scope: !1221)
!1226 = !DILocation(line: 185, column: 1, scope: !1210)
!1227 = distinct !DISubprogram(name: "error_tail", scope: !394, file: !394, line: 219, type: !1193, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1228)
!1228 = !{!1229, !1230, !1231, !1232}
!1229 = !DILocalVariable(name: "status", arg: 1, scope: !1227, file: !394, line: 219, type: !70)
!1230 = !DILocalVariable(name: "errnum", arg: 2, scope: !1227, file: !394, line: 219, type: !70)
!1231 = !DILocalVariable(name: "message", arg: 3, scope: !1227, file: !394, line: 219, type: !111)
!1232 = !DILocalVariable(name: "args", arg: 4, scope: !1227, file: !394, line: 219, type: !404)
!1233 = !DILocation(line: 0, scope: !1227)
!1234 = !DILocation(line: 229, column: 13, scope: !1227)
!1235 = !DILocalVariable(name: "__stream", arg: 1, scope: !1236, file: !847, line: 132, type: !1239)
!1236 = distinct !DISubprogram(name: "vfprintf", scope: !847, file: !847, line: 132, type: !1237, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1274)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!70, !1239, !851, !404}
!1239 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !186, line: 7, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !188, line: 49, size: 1728, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1242, file: !188, line: 51, baseType: !70, size: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1242, file: !188, line: 54, baseType: !105, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1242, file: !188, line: 55, baseType: !105, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1242, file: !188, line: 56, baseType: !105, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1242, file: !188, line: 57, baseType: !105, size: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1242, file: !188, line: 58, baseType: !105, size: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1242, file: !188, line: 59, baseType: !105, size: 64, offset: 384)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1242, file: !188, line: 60, baseType: !105, size: 64, offset: 448)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1242, file: !188, line: 61, baseType: !105, size: 64, offset: 512)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1242, file: !188, line: 64, baseType: !105, size: 64, offset: 576)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1242, file: !188, line: 65, baseType: !105, size: 64, offset: 640)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1242, file: !188, line: 66, baseType: !105, size: 64, offset: 704)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1242, file: !188, line: 68, baseType: !203, size: 64, offset: 768)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1242, file: !188, line: 70, baseType: !1258, size: 64, offset: 832)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1242, file: !188, line: 72, baseType: !70, size: 32, offset: 896)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1242, file: !188, line: 73, baseType: !70, size: 32, offset: 928)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1242, file: !188, line: 74, baseType: !210, size: 64, offset: 960)
