; ModuleID = 'src/nl.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.re_pattern_buffer = type { ptr, i64, i64, i64, ptr, ptr, i64, i8 }
%struct.linebuffer = type { i64, i64, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [62 x i8] c"Write each FILE to standard output, with line numbers added.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [3 x i8] c"nl\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [70 x i8] c"  -b, --body-numbering=STYLE      use STYLE for numbering body lines\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [70 x i8] c"  -d, --section-delimiter=CC      use CC for logical page delimiters\0A\00", align 1, !dbg !27

!185 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !{!0, !7, !12, !17, !22, !27, !29, !34, !36, !38, !43, !48, !50, !52, !57, !62, !67, !69, !74, !79, !84, !89, !94, !99, !188, !193, !195, !197, !202, !207, !209, !214, !216, !218, !220, !225, !230, !235, !237, !242, !244, !246, !270, !272, !274, !279, !281, !283, !285, !287, !289, !291, !303, !309, !311, !316, !318, !398, !403, !405, !410, !415, !417, !419, !421, !423, !425, !427, !429, !434, !439, !441, !443, !445, !447, !449, !451, !456, !461, !466, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !494, !499, !504, !506, !508, !510, !515, !517, !519, !521, !523, !528, !530, !535, !537, !104, !539, !541, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !565, !568, !570, !573, !575, !577, !582, !584, !586, !588, !590, !593, !595, !597, !607, !609, !611}
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 521, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 35)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !9, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 537, type: !190, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 544, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 29)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !2, line: 549, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 30)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 556, type: !190, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 564, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 568, type: !19, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !19, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !19, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 576, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 34)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !2, line: 591, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 14)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !232, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 16)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !2, line: 643, type: !227, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "current_type", scope: !106, file: !2, line: 75, type: !183, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "body_regex", scope: !106, file: !2, line: 78, type: !248, isLocal: true, isDefinition: true)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !249, line: 413, size: 512, elements: !250)
!249 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!250 = !{!251, !254, !256, !257, !259, !260, !262, !263, !264, !265, !266, !267, !268, !269}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !248, file: !249, line: 417, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !249, line: 417, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !248, file: !249, line: 420, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !249, line: 56, baseType: !182)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !248, file: !249, line: 423, baseType: !255, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !248, file: !249, line: 426, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !249, line: 71, baseType: !182)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !248, file: !249, line: 431, baseType: !177, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !248, file: !249, line: 437, baseType: !261, size: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !248, file: !249, line: 440, baseType: !180, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !248, file: !249, line: 446, baseType: !110, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !248, file: !249, line: 457, baseType: !110, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !248, file: !249, line: 461, baseType: !110, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !248, file: !249, line: 465, baseType: !110, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !248, file: !249, line: 469, baseType: !110, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !248, file: !249, line: 472, baseType: !110, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !248, file: !249, line: 475, baseType: !110, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "header_regex", scope: !106, file: !2, line: 81, type: !248, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "footer_regex", scope: !106, file: !2, line: 84, type: !248, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !106, file: !2, line: 87, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !106, file: !2, line: 88, type: !276, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !106, file: !2, line: 89, type: !276, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "section_del_len", scope: !106, file: !2, line: 101, type: !180, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "header_del_len", scope: !106, file: !2, line: 107, type: !180, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "body_del_len", scope: !106, file: !2, line: 113, type: !180, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !106, file: !2, line: 119, type: !180, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "line_buf", scope: !106, file: !2, line: 122, type: !293, isLocal: true, isDefinition: true)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !294, line: 32, size: 192, elements: !295)
!294 = !DIFile(filename: "./lib/linebuffer.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a0b4e97fdade8fc6fdf94c5a34c83419")
!295 = !{!296, !301, !302}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !293, file: !294, line: 34, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !298, line: 130, baseType: !299)
!298 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !181, line: 35, baseType: !300)
!300 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !293, file: !294, line: 35, baseType: !297, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !293, file: !294, line: 36, baseType: !177, size: 64, offset: 128)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "line_no", scope: !106, file: !2, line: 146, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !306, line: 101, baseType: !307)
!306 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !308, line: 72, baseType: !300)
!308 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !106, file: !2, line: 152, type: !186, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !117, line: 729, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 56)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !117, line: 736, type: !45, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !320, file: !117, line: 575, type: !118, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "oputs_", scope: !117, file: !117, line: 573, type: !321, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !323)
!321 = !DISubroutineType(cc: DW_CC_nocall, types: !322)
!322 = !{null, !183, !183}
!323 = !{!324, !325, !326, !329, !330, !331, !332, !336, !337, !338, !339, !341, !392, !393, !394, !396, !397}
!324 = !DILocalVariable(name: "program", arg: 1, scope: !320, file: !117, line: 573, type: !183)
!325 = !DILocalVariable(name: "option", arg: 2, scope: !320, file: !117, line: 573, type: !183)
!326 = !DILocalVariable(name: "term", scope: !327, file: !117, line: 585, type: !183)
!327 = distinct !DILexicalBlock(scope: !328, file: !117, line: 582, column: 5)
!328 = distinct !DILexicalBlock(scope: !320, file: !117, line: 581, column: 7)
!329 = !DILocalVariable(name: "double_space", scope: !320, file: !117, line: 594, type: !186)
!330 = !DILocalVariable(name: "first_word", scope: !320, file: !117, line: 595, type: !183)
!331 = !DILocalVariable(name: "option_text", scope: !320, file: !117, line: 596, type: !183)
!332 = !DILocalVariable(name: "s", scope: !333, file: !117, line: 608, type: !183)
!333 = distinct !DILexicalBlock(scope: !334, file: !117, line: 605, column: 5)
!334 = distinct !DILexicalBlock(scope: !335, file: !117, line: 604, column: 12)
!335 = distinct !DILexicalBlock(scope: !320, file: !117, line: 597, column: 7)
!336 = !DILocalVariable(name: "spaces", scope: !333, file: !117, line: 609, type: !180)
!337 = !DILocalVariable(name: "anchor_len", scope: !320, file: !117, line: 620, type: !180)
!338 = !DILocalVariable(name: "desc_text", scope: !320, file: !117, line: 625, type: !183)
!339 = !DILocalVariable(name: "__ptr", scope: !340, file: !117, line: 644, type: !183)
!340 = distinct !DILexicalBlock(scope: !320, file: !117, line: 644, column: 3)
!341 = !DILocalVariable(name: "__stream", scope: !340, file: !117, line: 644, type: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !344, line: 7, baseType: !345)
!344 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !346, line: 49, size: 1728, elements: !347)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !363, !365, !366, !367, !369, !370, !372, !373, !376, !378, !381, !384, !385, !386, !387, !388}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !345, file: !346, line: 51, baseType: !118, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !345, file: !346, line: 54, baseType: !177, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !345, file: !346, line: 55, baseType: !177, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !345, file: !346, line: 56, baseType: !177, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !345, file: !346, line: 57, baseType: !177, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !345, file: !346, line: 58, baseType: !177, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !345, file: !346, line: 59, baseType: !177, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !345, file: !346, line: 60, baseType: !177, size: 64, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !345, file: !346, line: 61, baseType: !177, size: 64, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !345, file: !346, line: 64, baseType: !177, size: 64, offset: 576)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !345, file: !346, line: 65, baseType: !177, size: 64, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !345, file: !346, line: 66, baseType: !177, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !345, file: !346, line: 68, baseType: !361, size: 64, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !346, line: 36, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !345, file: !346, line: 70, baseType: !364, size: 64, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !345, file: !346, line: 72, baseType: !118, size: 32, offset: 896)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !345, file: !346, line: 73, baseType: !118, size: 32, offset: 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !345, file: !346, line: 74, baseType: !368, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !308, line: 152, baseType: !300)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !345, file: !346, line: 77, baseType: !179, size: 16, offset: 1024)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !345, file: !346, line: 78, baseType: !371, size: 8, offset: 1040)
!371 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !345, file: !346, line: 79, baseType: !86, size: 8, offset: 1048)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !345, file: !346, line: 81, baseType: !374, size: 64, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !346, line: 43, baseType: null)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !345, file: !346, line: 89, baseType: !377, size: 64, offset: 1152)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !308, line: 153, baseType: !300)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !345, file: !346, line: 91, baseType: !379, size: 64, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !346, line: 37, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !345, file: !346, line: 92, baseType: !382, size: 64, offset: 1280)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !346, line: 38, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !345, file: !346, line: 93, baseType: !364, size: 64, offset: 1344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !345, file: !346, line: 94, baseType: !178, size: 64, offset: 1408)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !345, file: !346, line: 95, baseType: !180, size: 64, offset: 1472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !345, file: !346, line: 96, baseType: !118, size: 32, offset: 1536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !345, file: !346, line: 98, baseType: !389, size: 160, offset: 1568)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 20)
!392 = !DILocalVariable(name: "__cnt", scope: !340, file: !117, line: 644, type: !180)
!393 = !DILocalVariable(name: "url_program", scope: !320, file: !117, line: 648, type: !183)
!394 = !DILocalVariable(name: "__ptr", scope: !395, file: !117, line: 686, type: !183)
!395 = distinct !DILexicalBlock(scope: !320, file: !117, line: 686, column: 3)
!396 = !DILocalVariable(name: "__stream", scope: !395, file: !117, line: 686, type: !342)
!397 = !DILocalVariable(name: "__cnt", scope: !395, file: !117, line: 686, type: !180)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !117, line: 585, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 5)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !117, line: 586, type: !400, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !117, line: 595, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 4)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !117, line: 620, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 6)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !117, line: 648, type: !227, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !117, line: 648, type: !400, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !117, line: 649, type: !407, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !117, line: 649, type: !19, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !117, line: 650, type: !400, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !117, line: 651, type: !412, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !117, line: 651, type: !412, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !117, line: 652, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 7)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !117, line: 653, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 8)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !117, line: 654, type: !91, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !117, line: 655, type: !91, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !117, line: 656, type: !91, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !117, line: 657, type: !91, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !117, line: 663, type: !431, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !117, line: 664, type: !91, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !117, line: 669, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 17)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !117, line: 669, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 40)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !117, line: 676, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 15)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !117, line: 676, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 61)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !117, line: 679, type: !19, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !117, line: 683, type: !400, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !117, line: 688, type: !400, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !117, line: 691, type: !436, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !117, line: 839, type: !239, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !117, line: 840, type: !101, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !117, line: 841, type: !463, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !117, line: 862, type: !407, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !117, line: 868, type: !59, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !117, line: 875, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 27)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !117, line: 877, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 51)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !117, line: 877, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 12)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !453, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !463, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !453, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 21)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !463, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !501, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 162, type: !453, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !453, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 13)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !232, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 18)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 167, type: !400, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !436, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !2, line: 287, type: !19, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !227, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "header_type", scope: !106, file: !2, line: 69, type: !183, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !227, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "body_type", scope: !106, file: !2, line: 66, type: !183, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "footer_type", scope: !106, file: !2, line: 72, type: !183, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !106, file: !2, line: 128, type: !305, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "page_incr", scope: !106, file: !2, line: 131, type: !305, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !106, file: !2, line: 134, type: !186, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "blank_join", scope: !106, file: !2, line: 137, type: !305, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !227, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "separator_str", scope: !106, file: !2, line: 95, type: !183, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "lineno_width", scope: !106, file: !2, line: 140, type: !118, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !106, file: !2, line: 53, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !437)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "lineno_format", scope: !106, file: !2, line: 143, type: !183, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !106, file: !2, line: 47, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 56, elements: !432)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !106, file: !2, line: 50, type: !567, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "section_del", scope: !106, file: !2, line: 98, type: !177, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !106, file: !2, line: 56, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 9)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "header_del", scope: !106, file: !2, line: 104, type: !177, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "body_del", scope: !106, file: !2, line: 110, type: !177, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "footer_del", scope: !106, file: !2, line: 116, type: !177, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !106, file: !2, line: 125, type: !177, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "current_regex", scope: !106, file: !2, line: 92, type: !592, isLocal: true, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 470, type: !227, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "line_no_overflow", scope: !106, file: !2, line: 149, type: !186, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "blank_lines", scope: !599, file: !2, line: 358, type: !305, isLocal: true, isDefinition: true)
!599 = distinct !DISubprogram(name: "proc_text", scope: !2, file: !2, line: 356, type: !600, scopeLine: 357, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{null}
!602 = !{!603, !605, !606}
!603 = !DILocalVariable(name: "__ptr", scope: !604, file: !2, line: 401, type: !183)
!604 = distinct !DILexicalBlock(scope: !599, file: !2, line: 401, column: 3)
!605 = !DILocalVariable(name: "__stream", scope: !604, file: !2, line: 401, type: !342)
!606 = !DILocalVariable(name: "__cnt", scope: !604, file: !2, line: 401, type: !180)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 390, type: !190, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !512, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !117, line: 952, type: !501, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 3584, elements: !233)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !616, line: 50, size: 256, elements: !617)
!616 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!617 = !{!618, !619, !620, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !615, file: !616, line: 52, baseType: !183, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !615, file: !616, line: 55, baseType: !118, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !616, line: 56, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !615, file: !616, line: 57, baseType: !118, size: 32, offset: 192)
!623 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!624 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!625 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !628, line: 3, type: !463, isLocal: true, isDefinition: true)
!628 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "Version", scope: !631, file: !628, line: 3, type: !183, isLocal: false, isDefinition: true)
!631 = distinct !DICompileUnit(language: DW_LANG_C11, file: !628, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !632, splitDebugInlining: false, nameTableKind: None)
!632 = !{!626, !629}
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "file_name", scope: !635, file: !636, line: 45, type: !183, isLocal: true, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C11, file: !636, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !637, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!637 = !{!638, !640, !642, !644, !633, !646}
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !636, line: 121, type: !431, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !636, line: 121, type: !501, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !636, line: 123, type: !431, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !636, line: 126, type: !19, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !635, file: !636, line: 55, type: !186, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !650, file: !651, line: 66, type: !694, isLocal: false, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !652, globals: !653, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!652 = !{!178, !185}
!653 = !{!654, !656, !676, !678, !680, !682, !648, !684, !686, !688, !690, !692}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !651, line: 272, type: !400, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "old_file_name", scope: !658, file: !651, line: 304, type: !183, isLocal: true, isDefinition: true)
!658 = distinct !DISubprogram(name: "verror_at_line", scope: !651, file: !651, line: 298, type: !659, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !669)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !118, !118, !183, !110, !183, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !663)
!663 = !{!664, !666, !667, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !662, file: !665, baseType: !110, size: 32)
!665 = !DIFile(filename: "lib/error.c", directory: "/src")
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !662, file: !665, baseType: !110, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !662, file: !665, baseType: !178, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !662, file: !665, baseType: !178, size: 64, offset: 128)
!669 = !{!670, !671, !672, !673, !674, !675}
!670 = !DILocalVariable(name: "status", arg: 1, scope: !658, file: !651, line: 298, type: !118)
!671 = !DILocalVariable(name: "errnum", arg: 2, scope: !658, file: !651, line: 298, type: !118)
!672 = !DILocalVariable(name: "file_name", arg: 3, scope: !658, file: !651, line: 298, type: !183)
!673 = !DILocalVariable(name: "line_number", arg: 4, scope: !658, file: !651, line: 298, type: !110)
!674 = !DILocalVariable(name: "message", arg: 5, scope: !658, file: !651, line: 298, type: !183)
!675 = !DILocalVariable(name: "args", arg: 6, scope: !658, file: !651, line: 298, type: !661)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "old_line_number", scope: !658, file: !651, line: 305, type: !110, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !651, line: 338, type: !407, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !651, line: 346, type: !436, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !651, line: 346, type: !227, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "error_message_count", scope: !650, file: !651, line: 69, type: !110, isLocal: false, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !650, file: !651, line: 295, type: !118, isLocal: false, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !651, line: 208, type: !431, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !651, line: 208, type: !512, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !651, line: 214, type: !400, isLocal: true, isDefinition: true)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "program_name", scope: !697, file: !698, line: 31, type: !183, isLocal: false, isDefinition: true)
!697 = distinct !DICompileUnit(language: DW_LANG_C11, file: !698, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !699, globals: !700, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!699 = !{!177}
!700 = !{!695, !701, !703}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !698, line: 46, type: !436, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !698, line: 49, type: !407, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "utf07FF", scope: !707, file: !708, line: 46, type: !735, isLocal: true, isDefinition: true)
!707 = distinct !DISubprogram(name: "proper_name_lite", scope: !708, file: !708, line: 38, type: !709, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !711, retainedNodes: !713)
!708 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!709 = !DISubroutineType(types: !710)
!710 = !{!183, !183, !183}
!711 = distinct !DICompileUnit(language: DW_LANG_C11, file: !708, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !712, splitDebugInlining: false, nameTableKind: None)
!712 = !{!705}
!713 = !{!714, !715, !716, !717, !722}
!714 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !707, file: !708, line: 38, type: !183)
!715 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !707, file: !708, line: 38, type: !183)
!716 = !DILocalVariable(name: "translation", scope: !707, file: !708, line: 40, type: !183)
!717 = !DILocalVariable(name: "w", scope: !707, file: !708, line: 47, type: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !719, line: 37, baseType: !720)
!719 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !308, line: 57, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !308, line: 42, baseType: !110)
!722 = !DILocalVariable(name: "mbs", scope: !707, file: !708, line: 48, type: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !724, line: 6, baseType: !725)
!724 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !726, line: 21, baseType: !727)
!726 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 13, size: 64, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !727, file: !726, line: 15, baseType: !118, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !727, file: !726, line: 20, baseType: !731, size: 32, offset: 32)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !727, file: !726, line: 16, size: 32, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !731, file: !726, line: 18, baseType: !110, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !731, file: !726, line: 19, baseType: !407, size: 32)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 16, elements: !228)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !738, line: 78, type: !436, isLocal: true, isDefinition: true)
!738 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !738, line: 79, type: !412, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !738, line: 80, type: !525, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !738, line: 81, type: !525, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !738, line: 82, type: !389, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !738, line: 83, type: !227, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !738, line: 84, type: !436, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !738, line: 85, type: !431, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !738, line: 86, type: !431, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !738, line: 87, type: !436, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !759, file: !738, line: 76, type: !828, isLocal: false, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !760, retainedTypes: !766, globals: !767, splitDebugInlining: false, nameTableKind: None)
!760 = !{!147, !761, !122}
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !148, line: 254, baseType: !110, size: 32, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!764 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!765 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!766 = !{!118, !179, !180}
!767 = !{!736, !739, !741, !743, !745, !747, !749, !751, !753, !755, !757, !768, !772, !782, !784, !786, !788, !790, !792, !794, !817, !824, !826}
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !759, file: !738, line: 92, type: !770, isLocal: false, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 320, elements: !92)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !759, file: !738, line: 1040, type: !774, isLocal: false, isDefinition: true)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !738, line: 56, size: 448, elements: !775)
!775 = !{!776, !777, !778, !780, !781}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !774, file: !738, line: 59, baseType: !147, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !774, file: !738, line: 62, baseType: !118, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !774, file: !738, line: 66, baseType: !779, size: 256, offset: 64)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 256, elements: !437)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !774, file: !738, line: 69, baseType: !183, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !774, file: !738, line: 72, baseType: !183, size: 64, offset: 384)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !759, file: !738, line: 107, type: !774, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "slot0", scope: !759, file: !738, line: 831, type: !276, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !738, line: 321, type: !227, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !738, line: 357, type: !227, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !738, line: 358, type: !227, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !738, line: 199, type: !431, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "quote", scope: !796, file: !738, line: 228, type: !815, isLocal: true, isDefinition: true)
!796 = distinct !DISubprogram(name: "gettext_quote", scope: !738, file: !738, line: 197, type: !797, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !759, retainedNodes: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{!183, !183, !147}
!799 = !{!800, !801, !802, !803, !804}
!800 = !DILocalVariable(name: "msgid", arg: 1, scope: !796, file: !738, line: 197, type: !183)
!801 = !DILocalVariable(name: "s", arg: 2, scope: !796, file: !738, line: 197, type: !147)
!802 = !DILocalVariable(name: "translation", scope: !796, file: !738, line: 199, type: !183)
!803 = !DILocalVariable(name: "w", scope: !796, file: !738, line: 229, type: !718)
!804 = !DILocalVariable(name: "mbs", scope: !796, file: !738, line: 230, type: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !724, line: 6, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !726, line: 21, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 13, size: 64, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !807, file: !726, line: 15, baseType: !118, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !807, file: !726, line: 20, baseType: !811, size: 32, offset: 32)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !807, file: !726, line: 16, size: 32, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !811, file: !726, line: 18, baseType: !110, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !811, file: !726, line: 19, baseType: !407, size: 32)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !816)
!816 = !{!229, !409}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "slotvec", scope: !759, file: !738, line: 834, type: !819, isLocal: true, isDefinition: true)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !738, line: 823, size: 128, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !820, file: !738, line: 825, baseType: !180, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !820, file: !738, line: 826, baseType: !177, size: 64, offset: 64)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "nslots", scope: !759, file: !738, line: 832, type: !118, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "slotvec0", scope: !759, file: !738, line: 833, type: !820, isLocal: true, isDefinition: true)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 704, elements: !830)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!830 = !{!831}
!831 = !DISubrange(count: 11)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !834, line: 67, type: !501, isLocal: true, isDefinition: true)
!834 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !834, line: 69, type: !431, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !834, line: 83, type: !431, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !834, line: 83, type: !407, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !834, line: 85, type: !227, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !834, line: 88, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 171)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !834, line: 88, type: !222, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !834, line: 105, type: !239, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !834, line: 109, type: !854, isLocal: true, isDefinition: true)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 23)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !834, line: 113, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 28)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !834, line: 120, type: !211, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !834, line: 127, type: !866, isLocal: true, isDefinition: true)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 36)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !834, line: 134, type: !458, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !834, line: 142, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 44)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !834, line: 150, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 48)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !834, line: 159, type: !883, isLocal: true, isDefinition: true)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 52)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !834, line: 170, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 60)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !834, line: 248, type: !389, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !834, line: 248, type: !101, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !834, line: 254, type: !389, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !834, line: 254, type: !232, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !834, line: 254, type: !458, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !834, line: 259, type: !3, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !834, line: 259, type: !199, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !907, file: !908, line: 26, type: !910, isLocal: false, isDefinition: true)
!907 = distinct !DICompileUnit(language: DW_LANG_C11, file: !908, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !909, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!909 = !{!905}
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 376, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 47)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "exit_failure", scope: !915, file: !916, line: 24, type: !918, isLocal: false, isDefinition: true)
!915 = distinct !DICompileUnit(language: DW_LANG_C11, file: !916, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !917, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!917 = !{!913}
!918 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !921, line: 34, type: !19, isLocal: true, isDefinition: true)
!921 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !921, line: 34, type: !431, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !921, line: 34, type: !453, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !928, line: 80, type: !431, isLocal: true, isDefinition: true)
!928 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !931, line: 108, type: !86, isLocal: true, isDefinition: true)
!931 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "internal_state", scope: !934, file: !931, line: 97, type: !937, isLocal: true, isDefinition: true)
!934 = distinct !DICompileUnit(language: DW_LANG_C11, file: !931, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !935, globals: !936, splitDebugInlining: false, nameTableKind: None)
!935 = !{!178, !180, !185}
!936 = !{!929, !932}
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !724, line: 6, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !726, line: 21, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 13, size: 64, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !939, file: !726, line: 15, baseType: !118, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !939, file: !726, line: 20, baseType: !943, size: 32, offset: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !939, file: !726, line: 16, size: 32, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !943, file: !726, line: 18, baseType: !110, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !943, file: !726, line: 19, baseType: !407, size: 32)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !949, line: 35, type: !412, isLocal: true, isDefinition: true)
!949 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!950 = distinct !DICompileUnit(language: DW_LANG_C11, file: !951, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !952, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!952 = !{!161}
!953 = distinct !DICompileUnit(language: DW_LANG_C11, file: !954, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!954 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!955 = distinct !DICompileUnit(language: DW_LANG_C11, file: !956, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !957, splitDebugInlining: false, nameTableKind: None)
!956 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!957 = !{!178}
!958 = distinct !DICompileUnit(language: DW_LANG_C11, file: !959, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!960 = distinct !DICompileUnit(language: DW_LANG_C11, file: !961, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !957, splitDebugInlining: false, nameTableKind: None)
!961 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!962 = distinct !DICompileUnit(language: DW_LANG_C11, file: !963, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!963 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!964 = distinct !DICompileUnit(language: DW_LANG_C11, file: !965, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !966, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "lib/linebuffer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d85d9b8947aefddab7f1bb42f1d43333")
!966 = !{!261}
!967 = distinct !DICompileUnit(language: DW_LANG_C11, file: !834, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !968, retainedTypes: !957, globals: !972, splitDebugInlining: false, nameTableKind: None)
!968 = !{!969}
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !834, line: 40, baseType: !110, size: 32, elements: !970)
!970 = !{!971}
!971 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!972 = !{!832, !835, !837, !839, !841, !843, !848, !850, !852, !857, !862, !864, !869, !871, !876, !881, !886, !891, !893, !895, !897, !899, !901, !903}
!973 = distinct !DICompileUnit(language: DW_LANG_C11, file: !974, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !975, retainedTypes: !1003, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!975 = !{!976, !988}
!976 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !977, file: !974, line: 188, baseType: !110, size: 32, elements: !986)
!977 = distinct !DISubprogram(name: "x2nrealloc", scope: !974, file: !974, line: 176, type: !978, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !973, retainedNodes: !981)
!978 = !DISubroutineType(types: !979)
!979 = !{!178, !178, !980, !180}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!981 = !{!982, !983, !984, !985}
!982 = !DILocalVariable(name: "p", arg: 1, scope: !977, file: !974, line: 176, type: !178)
!983 = !DILocalVariable(name: "pn", arg: 2, scope: !977, file: !974, line: 176, type: !980)
!984 = !DILocalVariable(name: "s", arg: 3, scope: !977, file: !974, line: 176, type: !180)
!985 = !DILocalVariable(name: "n", scope: !977, file: !974, line: 178, type: !180)
!986 = !{!987}
!987 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!988 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !989, file: !974, line: 228, baseType: !110, size: 32, elements: !986)
!989 = distinct !DISubprogram(name: "xpalloc", scope: !974, file: !974, line: 223, type: !990, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !973, retainedNodes: !993)
!990 = !DISubroutineType(types: !991)
!991 = !{!178, !178, !992, !297, !299, !297}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1002}
!994 = !DILocalVariable(name: "pa", arg: 1, scope: !989, file: !974, line: 223, type: !178)
!995 = !DILocalVariable(name: "pn", arg: 2, scope: !989, file: !974, line: 223, type: !992)
!996 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !989, file: !974, line: 223, type: !297)
!997 = !DILocalVariable(name: "n_max", arg: 4, scope: !989, file: !974, line: 223, type: !299)
!998 = !DILocalVariable(name: "s", arg: 5, scope: !989, file: !974, line: 223, type: !297)
!999 = !DILocalVariable(name: "n0", scope: !989, file: !974, line: 230, type: !297)
!1000 = !DILocalVariable(name: "n", scope: !989, file: !974, line: 237, type: !297)
!1001 = !DILocalVariable(name: "nbytes", scope: !989, file: !974, line: 248, type: !297)
!1002 = !DILocalVariable(name: "adjusted_nbytes", scope: !989, file: !974, line: 252, type: !297)
!1003 = !{!177, !178, !186, !300, !182}
!1004 = distinct !DICompileUnit(language: DW_LANG_C11, file: !921, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1005, splitDebugInlining: false, nameTableKind: None)
!1005 = !{!919, !922, !924}
!1006 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1007, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1008, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!1007 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!1008 = !{!1009, !108}
!1009 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !1010, line: 30, baseType: !110, size: 32, elements: !1011)
!1010 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!1011 = !{!1012, !1013, !1014, !1015, !1016}
!1012 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!1013 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!1014 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!1015 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!1016 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!1017 = !{!926}
!1018 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1019, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1020, retainedTypes: !1021, splitDebugInlining: false, nameTableKind: None)
!1019 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1020 = !{!1009}
!1021 = !{!186, !300, !182, !305}
!1022 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1023, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !957, splitDebugInlining: false, nameTableKind: None)
!1023 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1024 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1025, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1025 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1026 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1027, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1028, splitDebugInlining: false, nameTableKind: None)
!1027 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1028 = !{!186, !182, !178}
!1029 = distinct !DICompileUnit(language: DW_LANG_C11, file: !949, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!1030 = !{!1031, !947}
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !949, line: 35, type: !227, isLocal: true, isDefinition: true)
!1033 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1034, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1034 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1035 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1036, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !957, splitDebugInlining: false, nameTableKind: None)
!1036 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1037 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1038 = !{i32 7, !"Dwarf Version", i32 5}
!1039 = !{i32 2, !"Debug Info Version", i32 3}
!1040 = !{i32 1, !"wchar_size", i32 4}
!1041 = !{i32 8, !"PIC Level", i32 2}
!1042 = !{i32 7, !"PIE Level", i32 2}
!1043 = !{i32 7, !"uwtable", i32 2}
!1044 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 175, type: !1045, scopeLine: 176, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1047)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !118}
!1047 = !{!1048}
!1048 = !DILocalVariable(name: "status", arg: 1, scope: !1044, file: !2, line: 175, type: !118)
!1049 = !DILocation(line: 0, scope: !1044)
!1050 = !DILocation(line: 177, column: 14, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 177, column: 7)
!1052 = !DILocation(line: 177, column: 7, scope: !1044)
!1053 = !DILocation(line: 178, column: 5, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 178, column: 5)
!1055 = !{!1056, !1056, i64 0}
!1056 = !{!"any pointer", !1057, i64 0}
!1057 = !{!"omnipotent char", !1058, i64 0}
!1058 = !{!"Simple C/C++ TBAA"}
!1059 = !DILocation(line: 181, column: 7, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 180, column: 5)
!1061 = !DILocation(line: 185, column: 7, scope: !1060)
!1062 = !DILocation(line: 729, column: 3, scope: !1063, inlinedAt: !1065)
!1063 = distinct !DISubprogram(name: "emit_stdin_note", scope: !117, file: !117, line: 727, type: !600, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1064)
!1064 = !{}
!1065 = distinct !DILocation(line: 189, column: 7, scope: !1060)
!1066 = !DILocation(line: 736, column: 3, scope: !1067, inlinedAt: !1068)
!1067 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !117, file: !117, line: 734, type: !600, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1064)
!1068 = distinct !DILocation(line: 190, column: 7, scope: !1060)
!1069 = !DILocation(line: 192, column: 7, scope: !1060)
!1070 = !DILocation(line: 195, column: 7, scope: !1060)
!1071 = !DILocation(line: 198, column: 7, scope: !1060)
!1072 = !DILocation(line: 201, column: 7, scope: !1060)
!1073 = !DILocation(line: 204, column: 7, scope: !1060)
!1074 = !DILocation(line: 207, column: 7, scope: !1060)
!1075 = !DILocation(line: 210, column: 7, scope: !1060)
!1076 = !DILocation(line: 213, column: 7, scope: !1060)
!1077 = !DILocation(line: 216, column: 7, scope: !1060)
!1078 = !DILocation(line: 219, column: 7, scope: !1060)
!1079 = !DILocation(line: 222, column: 7, scope: !1060)
!1080 = !DILocation(line: 225, column: 7, scope: !1060)
!1081 = !DILocation(line: 226, column: 7, scope: !1060)
!1082 = !DILocation(line: 227, column: 7, scope: !1060)
!1083 = !DILocation(line: 236, column: 7, scope: !1060)
!1084 = !DILocation(line: 246, column: 7, scope: !1060)
!1085 = !DILocalVariable(name: "program", arg: 1, scope: !1086, file: !117, line: 836, type: !183)
!1086 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !117, file: !117, line: 836, type: !1087, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1089)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{null, !183}
!1089 = !{!1085, !1090, !1097, !1098, !1100, !1101}
!1090 = !DILocalVariable(name: "infomap", scope: !1086, file: !117, line: 838, type: !1091)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 896, elements: !432)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1086, file: !117, line: 838, size: 128, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1093, file: !117, line: 838, baseType: !183, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1093, file: !117, line: 838, baseType: !183, size: 64, offset: 64)
!1097 = !DILocalVariable(name: "node", scope: !1086, file: !117, line: 848, type: !183)
!1098 = !DILocalVariable(name: "map_prog", scope: !1086, file: !117, line: 849, type: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1100 = !DILocalVariable(name: "lc_messages", scope: !1086, file: !117, line: 861, type: !183)
!1101 = !DILocalVariable(name: "url_program", scope: !1086, file: !117, line: 874, type: !183)
!1102 = !DILocation(line: 0, scope: !1086, inlinedAt: !1103)
!1103 = distinct !DILocation(line: 255, column: 7, scope: !1060)
!1104 = !DILocation(line: 857, column: 3, scope: !1086, inlinedAt: !1103)
!1105 = !DILocation(line: 861, column: 29, scope: !1086, inlinedAt: !1103)
!1106 = !DILocation(line: 862, column: 7, scope: !1107, inlinedAt: !1103)
!1107 = distinct !DILexicalBlock(scope: !1086, file: !117, line: 862, column: 7)
!1108 = !DILocation(line: 862, column: 19, scope: !1107, inlinedAt: !1103)
!1109 = !DILocation(line: 862, column: 22, scope: !1107, inlinedAt: !1103)
!1110 = !DILocation(line: 862, column: 7, scope: !1086, inlinedAt: !1103)
!1111 = !DILocation(line: 868, column: 7, scope: !1112, inlinedAt: !1103)
!1112 = distinct !DILexicalBlock(scope: !1107, file: !117, line: 863, column: 5)
!1113 = !DILocation(line: 870, column: 5, scope: !1112, inlinedAt: !1103)
!1114 = !DILocation(line: 875, column: 3, scope: !1086, inlinedAt: !1103)
!1115 = !DILocation(line: 877, column: 3, scope: !1086, inlinedAt: !1103)
!1116 = !DILocation(line: 257, column: 3, scope: !1044)
!1117 = !DISubprogram(name: "dcgettext", scope: !1118, file: !1118, line: 51, type: !1119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1064)
!1118 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!177, !183, !183, !118}
!1121 = !DISubprogram(name: "__fprintf_chk", scope: !1122, file: !1122, line: 93, type: !1123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1064)
!1122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!118, !1125, !118, !1126, null}
!1125 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !342)
!1126 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !183)
!1127 = !DISubprogram(name: "__printf_chk", scope: !1122, file: !1122, line: 95, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1064)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!118, !118, !1126, null}
!1130 = !DISubprogram(name: "fputs_unlocked", scope: !1131, file: !1131, line: 691, type: !1132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1064)
!1131 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!118, !1126, !1125}
!1134 = !DILocation(line: 0, scope: !320)
!1135 = !DILocation(line: 581, column: 7, scope: !328)
!1136 = !{!1137, !1137, i64 0}
!1137 = !{!"int", !1057, i64 0}
!1138 = !DILocation(line: 581, column: 19, scope: !328)
!1139 = !DILocation(line: 581, column: 7, scope: !320)
!1140 = !DILocation(line: 585, column: 26, scope: !327)
!1141 = !DILocation(line: 0, scope: !327)
!1142 = !DILocation(line: 586, column: 23, scope: !327)
!1143 = !DILocation(line: 586, column: 28, scope: !327)
!1144 = !DILocation(line: 586, column: 32, scope: !327)
!1145 = !{!1057, !1057, i64 0}
!1146 = !DILocation(line: 586, column: 38, scope: !327)
!1147 = !DILocalVariable(name: "__s1", arg: 1, scope: !1148, file: !1149, line: 1359, type: !183)
!1148 = distinct !DISubprogram(name: "streq", scope: !1149, file: !1149, line: 1359, type: !1150, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1152)
!1149 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!186, !183, !183}
!1152 = !{!1147, !1153}
!1153 = !DILocalVariable(name: "__s2", arg: 2, scope: !1148, file: !1149, line: 1359, type: !183)
!1154 = !DILocation(line: 0, scope: !1148, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 586, column: 41, scope: !327)
!1156 = !DILocation(line: 1361, column: 11, scope: !1148, inlinedAt: !1155)
!1157 = !DILocation(line: 1361, column: 10, scope: !1148, inlinedAt: !1155)
!1158 = !DILocation(line: 586, column: 19, scope: !327)
!1159 = !DILocation(line: 587, column: 5, scope: !327)
!1160 = !DILocation(line: 588, column: 7, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !320, file: !117, line: 588, column: 7)
!1162 = !DILocation(line: 588, column: 7, scope: !320)
!1163 = !DILocation(line: 590, column: 7, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1161, file: !117, line: 589, column: 5)
!1165 = !DILocation(line: 591, column: 7, scope: !1164)
!1166 = !DILocation(line: 595, column: 37, scope: !320)
!1167 = !DILocation(line: 595, column: 35, scope: !320)
!1168 = !DILocation(line: 596, column: 29, scope: !320)
!1169 = !DILocation(line: 597, column: 8, scope: !335)
!1170 = !DILocation(line: 597, column: 7, scope: !320)
!1171 = !DILocation(line: 604, column: 24, scope: !334)
!1172 = !DILocation(line: 604, column: 12, scope: !335)
!1173 = !DILocation(line: 0, scope: !333)
!1174 = !DILocation(line: 610, column: 16, scope: !333)
!1175 = !DILocation(line: 610, column: 7, scope: !333)
!1176 = !DILocation(line: 611, column: 21, scope: !333)
!1177 = !{!1178, !1178, i64 0}
!1178 = !{!"short", !1057, i64 0}
!1179 = !DILocation(line: 611, column: 19, scope: !333)
!1180 = !DILocation(line: 611, column: 16, scope: !333)
!1181 = !DILocation(line: 610, column: 30, scope: !333)
!1182 = distinct !{!1182, !1175, !1176, !1183}
!1183 = !{!"llvm.loop.mustprogress"}
!1184 = !DILocation(line: 612, column: 18, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !333, file: !117, line: 612, column: 11)
!1186 = !DILocation(line: 612, column: 11, scope: !333)
!1187 = !DILocation(line: 618, column: 5, scope: !333)
!1188 = !DILocation(line: 620, column: 23, scope: !320)
!1189 = !DILocation(line: 625, column: 39, scope: !320)
!1190 = !DILocation(line: 626, column: 3, scope: !320)
!1191 = !DILocation(line: 626, column: 10, scope: !320)
!1192 = !DILocation(line: 626, column: 21, scope: !320)
!1193 = !DILocation(line: 628, column: 44, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !117, line: 628, column: 11)
!1195 = distinct !DILexicalBlock(scope: !320, file: !117, line: 627, column: 5)
!1196 = !DILocation(line: 628, column: 32, scope: !1194)
!1197 = !DILocation(line: 628, column: 49, scope: !1194)
!1198 = !DILocation(line: 628, column: 11, scope: !1195)
!1199 = !DILocation(line: 630, column: 11, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1195, file: !117, line: 630, column: 11)
!1201 = !DILocation(line: 630, column: 11, scope: !1195)
!1202 = !DILocation(line: 632, column: 26, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !117, line: 632, column: 15)
!1204 = distinct !DILexicalBlock(scope: !1200, file: !117, line: 631, column: 9)
!1205 = !DILocation(line: 632, column: 34, scope: !1203)
!1206 = !DILocation(line: 632, column: 37, scope: !1203)
!1207 = !DILocation(line: 632, column: 15, scope: !1204)
!1208 = !DILocation(line: 636, column: 16, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1204, file: !117, line: 636, column: 15)
!1210 = !DILocation(line: 636, column: 29, scope: !1209)
!1211 = !DILocation(line: 640, column: 16, scope: !1195)
!1212 = distinct !{!1212, !1190, !1213, !1183}
!1213 = !DILocation(line: 641, column: 5, scope: !320)
!1214 = !DILocation(line: 644, column: 3, scope: !320)
!1215 = !DILocation(line: 0, scope: !1148, inlinedAt: !1216)
!1216 = distinct !DILocation(line: 648, column: 31, scope: !320)
!1217 = !DILocation(line: 0, scope: !1148, inlinedAt: !1218)
!1218 = distinct !DILocation(line: 649, column: 31, scope: !320)
!1219 = !DILocation(line: 0, scope: !1148, inlinedAt: !1220)
!1220 = distinct !DILocation(line: 650, column: 31, scope: !320)
!1221 = !DILocation(line: 0, scope: !1148, inlinedAt: !1222)
!1222 = distinct !DILocation(line: 651, column: 31, scope: !320)
!1223 = !DILocation(line: 0, scope: !1148, inlinedAt: !1224)
!1224 = distinct !DILocation(line: 652, column: 31, scope: !320)
!1225 = !DILocation(line: 0, scope: !1148, inlinedAt: !1226)
!1226 = distinct !DILocation(line: 653, column: 31, scope: !320)
!1227 = !DILocation(line: 0, scope: !1148, inlinedAt: !1228)
!1228 = distinct !DILocation(line: 654, column: 31, scope: !320)
!1229 = !DILocation(line: 0, scope: !1148, inlinedAt: !1230)
!1230 = distinct !DILocation(line: 655, column: 31, scope: !320)
!1231 = !DILocation(line: 0, scope: !1148, inlinedAt: !1232)
!1232 = distinct !DILocation(line: 656, column: 31, scope: !320)
!1233 = !DILocation(line: 0, scope: !1148, inlinedAt: !1234)
!1234 = distinct !DILocation(line: 657, column: 31, scope: !320)
!1235 = !DILocation(line: 663, column: 7, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !320, file: !117, line: 663, column: 7)
!1237 = !DILocation(line: 664, column: 7, scope: !1236)
!1238 = !DILocation(line: 664, column: 10, scope: !1236)
!1239 = !DILocation(line: 663, column: 7, scope: !320)
!1240 = !DILocation(line: 669, column: 7, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1236, file: !117, line: 665, column: 5)
!1242 = !DILocation(line: 671, column: 5, scope: !1241)
!1243 = !DILocation(line: 676, column: 7, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1236, file: !117, line: 673, column: 5)
!1245 = !DILocation(line: 679, column: 3, scope: !320)
!1246 = !DILocation(line: 683, column: 3, scope: !320)
!1247 = !DILocation(line: 686, column: 3, scope: !320)
!1248 = !DILocation(line: 688, column: 3, scope: !320)
!1249 = !DILocation(line: 691, column: 3, scope: !320)
!1250 = !DILocation(line: 695, column: 3, scope: !320)
!1251 = !DILocation(line: 696, column: 1, scope: !320)
!1252 = !DISubprogram(name: "setlocale", scope: !1253, file: !1253, line: 122, type: !1254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1064)
!1253 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!177, !118, !183}
