; ModuleID = 'src/nohup.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [45 x i8] c"Usage: %s COMMAND [ARG]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [40 x i8] c"Run COMMAND, ignoring hangup signals.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"nohup\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 61)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !131, line: 679, type: !213, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !131, line: 683, type: !90, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !131, line: 688, type: !90, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !131, line: 691, type: !229, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !131, line: 826, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1440, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 180)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !131, line: 839, type: !59, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !131, line: 840, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 22)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !131, line: 841, type: !83, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !131, line: 862, type: !197, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !131, line: 868, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 71)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !131, line: 875, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 27)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !131, line: 877, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 51)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !131, line: 877, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 12)
!302 = !{!303, !304, !305, !308, !310, !311, !312, !316, !317, !318, !319, !321, !375, !376, !377, !379, !380}
!303 = !DILocalVariable(name: "program", arg: 1, scope: !130, file: !131, line: 573, type: !134)
!304 = !DILocalVariable(name: "option", arg: 2, scope: !130, file: !131, line: 573, type: !134)
!305 = !DILocalVariable(name: "term", scope: !306, file: !131, line: 585, type: !134)
!306 = distinct !DILexicalBlock(scope: !307, file: !131, line: 582, column: 5)
!307 = distinct !DILexicalBlock(scope: !130, file: !131, line: 581, column: 7)
!308 = !DILocalVariable(name: "double_space", scope: !130, file: !131, line: 594, type: !309)
!309 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!310 = !DILocalVariable(name: "first_word", scope: !130, file: !131, line: 595, type: !134)
!311 = !DILocalVariable(name: "option_text", scope: !130, file: !131, line: 596, type: !134)
!312 = !DILocalVariable(name: "s", scope: !313, file: !131, line: 608, type: !134)
!313 = distinct !DILexicalBlock(scope: !314, file: !131, line: 605, column: 5)
!314 = distinct !DILexicalBlock(scope: !315, file: !131, line: 604, column: 12)
!315 = distinct !DILexicalBlock(scope: !130, file: !131, line: 597, column: 7)
!316 = !DILocalVariable(name: "spaces", scope: !313, file: !131, line: 609, type: !186)
!317 = !DILocalVariable(name: "anchor_len", scope: !130, file: !131, line: 620, type: !186)
!318 = !DILocalVariable(name: "desc_text", scope: !130, file: !131, line: 625, type: !134)
!319 = !DILocalVariable(name: "__ptr", scope: !320, file: !131, line: 644, type: !134)
!320 = distinct !DILexicalBlock(scope: !130, file: !131, line: 644, column: 3)
!321 = !DILocalVariable(name: "__stream", scope: !320, file: !131, line: 644, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !324, line: 7, baseType: !325)
!324 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !326, line: 49, size: 1728, elements: !327)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!327 = !{!328, !329, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !344, !346, !347, !348, !352, !353, !355, !356, !359, !361, !364, !367, !368, !369, !370, !371}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !325, file: !326, line: 51, baseType: !184, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !325, file: !326, line: 54, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !325, file: !326, line: 55, baseType: !330, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !325, file: !326, line: 56, baseType: !330, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !325, file: !326, line: 57, baseType: !330, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !325, file: !326, line: 58, baseType: !330, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !325, file: !326, line: 59, baseType: !330, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !325, file: !326, line: 60, baseType: !330, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !325, file: !326, line: 61, baseType: !330, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !325, file: !326, line: 64, baseType: !330, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !325, file: !326, line: 65, baseType: !330, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !325, file: !326, line: 66, baseType: !330, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !325, file: !326, line: 68, baseType: !342, size: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !326, line: 36, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !325, file: !326, line: 70, baseType: !345, size: 64, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !325, file: !326, line: 72, baseType: !184, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !325, file: !326, line: 73, baseType: !184, size: 32, offset: 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !325, file: !326, line: 74, baseType: !349, size: 64, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !350, line: 152, baseType: !351)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!351 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !325, file: !326, line: 77, baseType: !185, size: 16, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !325, file: !326, line: 78, baseType: !354, size: 8, offset: 1040)
!354 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !325, file: !326, line: 79, baseType: !44, size: 8, offset: 1048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !325, file: !326, line: 81, baseType: !357, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !326, line: 43, baseType: null)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !325, file: !326, line: 89, baseType: !360, size: 64, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !350, line: 153, baseType: !351)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !325, file: !326, line: 91, baseType: !362, size: 64, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !326, line: 37, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !325, file: !326, line: 92, baseType: !365, size: 64, offset: 1280)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !326, line: 38, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !325, file: !326, line: 93, baseType: !345, size: 64, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !325, file: !326, line: 94, baseType: !178, size: 64, offset: 1408)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !325, file: !326, line: 95, baseType: !186, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !325, file: !326, line: 96, baseType: !184, size: 32, offset: 1536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !325, file: !326, line: 98, baseType: !372, size: 160, offset: 1568)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 20)
!375 = !DILocalVariable(name: "__cnt", scope: !320, file: !131, line: 644, type: !186)
!376 = !DILocalVariable(name: "url_program", scope: !130, file: !131, line: 648, type: !134)
!377 = !DILocalVariable(name: "__ptr", scope: !378, file: !131, line: 686, type: !134)
!378 = distinct !DILexicalBlock(scope: !130, file: !131, line: 686, column: 3)
!379 = !DILocalVariable(name: "__stream", scope: !378, file: !131, line: 686, type: !322)
!380 = !DILocalVariable(name: "__cnt", scope: !378, file: !131, line: 686, type: !186)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !383, line: 3, type: !83, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "Version", scope: !386, file: !383, line: 3, type: !134, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C11, file: !383, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !387, splitDebugInlining: false, nameTableKind: None)
!387 = !{!381, !384}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "file_name", scope: !390, file: !391, line: 45, type: !134, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C11, file: !391, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !392, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!392 = !{!393, !395, !397, !399, !388, !401}
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !391, line: 121, type: !224, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !391, line: 121, type: !299, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !391, line: 123, type: !224, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !391, line: 126, type: !213, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !390, file: !391, line: 55, type: !309, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !405, file: !406, line: 66, type: !452, isLocal: false, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C11, file: !406, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, globals: !408, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!407 = !{!178, !189}
!408 = !{!409, !411, !431, !433, !435, !437, !403, !439, !441, !443, !445, !450}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !406, line: 272, type: !90, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "old_file_name", scope: !413, file: !406, line: 304, type: !134, isLocal: true, isDefinition: true)
!413 = distinct !DISubprogram(name: "verror_at_line", scope: !406, file: !406, line: 298, type: !414, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !424)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !184, !184, !134, !139, !134, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !418)
!418 = !{!419, !421, !422, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !417, file: !420, baseType: !139, size: 32)
!420 = !DIFile(filename: "lib/error.c", directory: "/src")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !417, file: !420, baseType: !139, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !417, file: !420, baseType: !178, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !417, file: !420, baseType: !178, size: 64, offset: 128)
!424 = !{!425, !426, !427, !428, !429, !430}
!425 = !DILocalVariable(name: "status", arg: 1, scope: !413, file: !406, line: 298, type: !184)
!426 = !DILocalVariable(name: "errnum", arg: 2, scope: !413, file: !406, line: 298, type: !184)
!427 = !DILocalVariable(name: "file_name", arg: 3, scope: !413, file: !406, line: 298, type: !134)
!428 = !DILocalVariable(name: "line_number", arg: 4, scope: !413, file: !406, line: 298, type: !139)
!429 = !DILocalVariable(name: "message", arg: 5, scope: !413, file: !406, line: 298, type: !134)
!430 = !DILocalVariable(name: "args", arg: 6, scope: !413, file: !406, line: 298, type: !416)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "old_line_number", scope: !413, file: !406, line: 305, type: !139, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !406, line: 338, type: !197, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !406, line: 346, type: !229, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !406, line: 346, type: !204, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "error_message_count", scope: !405, file: !406, line: 69, type: !139, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !405, file: !406, line: 295, type: !184, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !406, line: 208, type: !224, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !406, line: 208, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 21)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !406, line: 214, type: !90, isLocal: true, isDefinition: true)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null}
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !457, file: !458, line: 506, type: !184, isLocal: true, isDefinition: true)
!457 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !458, file: !458, line: 485, type: !459, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !461, retainedNodes: !463)
!458 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!459 = !DISubroutineType(types: !460)
!460 = !{!184, !184, !184}
!461 = distinct !DICompileUnit(language: DW_LANG_C11, file: !458, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !462, splitDebugInlining: false, nameTableKind: None)
!462 = !{!455}
!463 = !{!464, !465, !466, !467, !470}
!464 = !DILocalVariable(name: "fd", arg: 1, scope: !457, file: !458, line: 485, type: !184)
!465 = !DILocalVariable(name: "target", arg: 2, scope: !457, file: !458, line: 485, type: !184)
!466 = !DILocalVariable(name: "result", scope: !457, file: !458, line: 487, type: !184)
!467 = !DILocalVariable(name: "flags", scope: !468, file: !458, line: 530, type: !184)
!468 = distinct !DILexicalBlock(scope: !469, file: !458, line: 529, column: 5)
!469 = distinct !DILexicalBlock(scope: !457, file: !458, line: 528, column: 7)
!470 = !DILocalVariable(name: "saved_errno", scope: !471, file: !458, line: 533, type: !184)
!471 = distinct !DILexicalBlock(scope: !472, file: !458, line: 532, column: 9)
!472 = distinct !DILexicalBlock(scope: !468, file: !458, line: 531, column: 11)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !475, line: 60, type: !204, isLocal: true, isDefinition: true)
!475 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "long_options", scope: !478, file: !475, line: 34, type: !486, isLocal: true, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C11, file: !475, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !479, splitDebugInlining: false, nameTableKind: None)
!479 = !{!473, !480, !482, !484, !476}
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !475, line: 112, type: !44, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !475, line: 36, type: !90, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !475, line: 37, type: !229, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 768, elements: !214)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !489, line: 50, size: 256, elements: !490)
!489 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!490 = !{!491, !492, !493, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !488, file: !489, line: 52, baseType: !134, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !488, file: !489, line: 55, baseType: !184, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !489, line: 56, baseType: !494, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !488, file: !489, line: 57, baseType: !184, size: 32, offset: 192)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "program_name", scope: !498, file: !499, line: 31, type: !134, isLocal: false, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C11, file: !499, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !500, globals: !501, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!500 = !{!330}
!501 = !{!496, !502, !504}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !499, line: 46, type: !229, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !499, line: 49, type: !197, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "utf07FF", scope: !508, file: !509, line: 46, type: !536, isLocal: true, isDefinition: true)
!508 = distinct !DISubprogram(name: "proper_name_lite", scope: !509, file: !509, line: 38, type: !510, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !512, retainedNodes: !514)
!509 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!510 = !DISubroutineType(types: !511)
!511 = !{!134, !134, !134}
!512 = distinct !DICompileUnit(language: DW_LANG_C11, file: !509, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !513, splitDebugInlining: false, nameTableKind: None)
!513 = !{!506}
!514 = !{!515, !516, !517, !518, !523}
!515 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !508, file: !509, line: 38, type: !134)
!516 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !508, file: !509, line: 38, type: !134)
!517 = !DILocalVariable(name: "translation", scope: !508, file: !509, line: 40, type: !134)
!518 = !DILocalVariable(name: "w", scope: !508, file: !509, line: 47, type: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !520, line: 37, baseType: !521)
!520 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !350, line: 57, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !350, line: 42, baseType: !139)
!523 = !DILocalVariable(name: "mbs", scope: !508, file: !509, line: 48, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !525, line: 6, baseType: !526)
!525 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !527, line: 21, baseType: !528)
!527 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !527, line: 13, size: 64, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !528, file: !527, line: 15, baseType: !184, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !528, file: !527, line: 20, baseType: !532, size: 32, offset: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !527, line: 16, size: 32, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !532, file: !527, line: 18, baseType: !139, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !532, file: !527, line: 19, baseType: !197, size: 32)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 16, elements: !205)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !539, line: 78, type: !229, isLocal: true, isDefinition: true)
!539 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !539, line: 79, type: !19, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !539, line: 80, type: !69, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !539, line: 81, type: !69, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !539, line: 82, type: !372, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !539, line: 83, type: !204, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !539, line: 84, type: !229, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !539, line: 85, type: !224, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !539, line: 86, type: !224, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !539, line: 87, type: !229, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !560, file: !539, line: 76, type: !632, isLocal: false, isDefinition: true)
!560 = distinct !DICompileUnit(language: DW_LANG_C11, file: !539, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !561, retainedTypes: !567, globals: !568, splitDebugInlining: false, nameTableKind: None)
!561 = !{!148, !562, !162}
!562 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !149, line: 254, baseType: !139, size: 32, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!565 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!566 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!567 = !{!184, !185, !186}
!568 = !{!537, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558, !569, !573, !583, !585, !590, !592, !594, !596, !598, !621, !628, !630}
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !560, file: !539, line: 92, type: !571, isLocal: false, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 320, elements: !50)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !560, file: !539, line: 1040, type: !575, isLocal: false, isDefinition: true)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !539, line: 56, size: 448, elements: !576)
!576 = !{!577, !578, !579, !581, !582}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !575, file: !539, line: 59, baseType: !148, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !575, file: !539, line: 62, baseType: !184, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !575, file: !539, line: 66, baseType: !580, size: 256, offset: 64)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !230)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !575, file: !539, line: 69, baseType: !134, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !575, file: !539, line: 72, baseType: !134, size: 64, offset: 384)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !560, file: !539, line: 107, type: !575, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "slot0", scope: !560, file: !539, line: 831, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 256)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !539, line: 321, type: !204, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !539, line: 357, type: !204, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !539, line: 358, type: !204, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !539, line: 199, type: !224, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "quote", scope: !600, file: !539, line: 228, type: !619, isLocal: true, isDefinition: true)
!600 = distinct !DISubprogram(name: "gettext_quote", scope: !539, file: !539, line: 197, type: !601, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !560, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!134, !134, !148}
!603 = !{!604, !605, !606, !607, !608}
!604 = !DILocalVariable(name: "msgid", arg: 1, scope: !600, file: !539, line: 197, type: !134)
!605 = !DILocalVariable(name: "s", arg: 2, scope: !600, file: !539, line: 197, type: !148)
!606 = !DILocalVariable(name: "translation", scope: !600, file: !539, line: 199, type: !134)
!607 = !DILocalVariable(name: "w", scope: !600, file: !539, line: 229, type: !519)
!608 = !DILocalVariable(name: "mbs", scope: !600, file: !539, line: 230, type: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !525, line: 6, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !527, line: 21, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !527, line: 13, size: 64, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !611, file: !527, line: 15, baseType: !184, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !611, file: !527, line: 20, baseType: !615, size: 32, offset: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !611, file: !527, line: 16, size: 32, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !615, file: !527, line: 18, baseType: !139, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !615, file: !527, line: 19, baseType: !197, size: 32)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !620)
!620 = !{!206, !199}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "slotvec", scope: !560, file: !539, line: 834, type: !623, isLocal: true, isDefinition: true)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !539, line: 823, size: 128, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !624, file: !539, line: 825, baseType: !186, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !624, file: !539, line: 826, baseType: !330, size: 64, offset: 64)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "nslots", scope: !560, file: !539, line: 832, type: !184, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "slotvec0", scope: !560, file: !539, line: 833, type: !624, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 704, elements: !634)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!634 = !{!635}
!635 = !DISubrange(count: 11)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !638, line: 67, type: !299, isLocal: true, isDefinition: true)
!638 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !638, line: 69, type: !224, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !638, line: 83, type: !224, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !638, line: 83, type: !197, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !638, line: 85, type: !204, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !638, line: 88, type: !649, isLocal: true, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 171)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !638, line: 88, type: !120, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !638, line: 105, type: !59, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !638, line: 109, type: !105, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !638, line: 113, type: !660, isLocal: true, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 28)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !638, line: 120, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 32)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !638, line: 127, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 36)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !638, line: 134, type: !14, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !638, line: 142, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 44)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !638, line: 150, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 48)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !638, line: 159, type: !687, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 52)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !638, line: 170, type: !692, isLocal: true, isDefinition: true)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 60)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !638, line: 248, type: !372, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !638, line: 248, type: !275, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !638, line: 254, type: !372, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !638, line: 254, type: !64, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !638, line: 254, type: !14, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !638, line: 259, type: !3, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !638, line: 259, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 29)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !714, file: !715, line: 26, type: !717, isLocal: false, isDefinition: true)
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !716, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!716 = !{!712}
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 376, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 47)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "exit_failure", scope: !722, file: !723, line: 24, type: !725, isLocal: false, isDefinition: true)
!722 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !724, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!724 = !{!720}
!725 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !728, line: 34, type: !213, isLocal: true, isDefinition: true)
!728 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !728, line: 34, type: !224, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !728, line: 34, type: !246, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !735, line: 108, type: !44, isLocal: true, isDefinition: true)
!735 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "internal_state", scope: !738, file: !735, line: 97, type: !741, isLocal: true, isDefinition: true)
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !735, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !739, globals: !740, splitDebugInlining: false, nameTableKind: None)
!739 = !{!178, !186, !189}
!740 = !{!733, !736}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !525, line: 6, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !527, line: 21, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !527, line: 13, size: 64, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !743, file: !527, line: 15, baseType: !184, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !743, file: !527, line: 20, baseType: !747, size: 32, offset: 32)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !743, file: !527, line: 16, size: 32, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !747, file: !527, line: 18, baseType: !139, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !747, file: !527, line: 19, baseType: !197, size: 32)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !753, line: 35, type: !19, isLocal: true, isDefinition: true)
!753 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!754 = distinct !DICompileUnit(language: DW_LANG_C11, file: !755, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!756 = distinct !DICompileUnit(language: DW_LANG_C11, file: !757, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!757 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!758 = !{!178}
!759 = distinct !DICompileUnit(language: DW_LANG_C11, file: !760, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!761 = distinct !DICompileUnit(language: DW_LANG_C11, file: !762, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !638, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !764, retainedTypes: !758, globals: !768, splitDebugInlining: false, nameTableKind: None)
!764 = !{!765}
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !638, line: 40, baseType: !139, size: 32, elements: !766)
!766 = !{!767}
!767 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!768 = !{!636, !639, !641, !643, !645, !647, !652, !654, !656, !658, !663, !668, !673, !675, !680, !685, !690, !695, !697, !699, !701, !703, !705, !707}
!769 = distinct !DICompileUnit(language: DW_LANG_C11, file: !770, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !771, retainedTypes: !802, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!771 = !{!772, !784}
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !773, file: !770, line: 188, baseType: !139, size: 32, elements: !782)
!773 = distinct !DISubprogram(name: "x2nrealloc", scope: !770, file: !770, line: 176, type: !774, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !769, retainedNodes: !777)
!774 = !DISubroutineType(types: !775)
!775 = !{!178, !178, !776, !186}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!777 = !{!778, !779, !780, !781}
!778 = !DILocalVariable(name: "p", arg: 1, scope: !773, file: !770, line: 176, type: !178)
!779 = !DILocalVariable(name: "pn", arg: 2, scope: !773, file: !770, line: 176, type: !776)
!780 = !DILocalVariable(name: "s", arg: 3, scope: !773, file: !770, line: 176, type: !186)
!781 = !DILocalVariable(name: "n", scope: !773, file: !770, line: 178, type: !186)
!782 = !{!783}
!783 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!784 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !785, file: !770, line: 228, baseType: !139, size: 32, elements: !782)
!785 = distinct !DISubprogram(name: "xpalloc", scope: !770, file: !770, line: 223, type: !786, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !769, retainedNodes: !792)
!786 = !DISubroutineType(types: !787)
!787 = !{!178, !178, !788, !789, !791, !789}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !790, line: 130, baseType: !791)
!790 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !187, line: 35, baseType: !351)
!792 = !{!793, !794, !795, !796, !797, !798, !799, !800, !801}
!793 = !DILocalVariable(name: "pa", arg: 1, scope: !785, file: !770, line: 223, type: !178)
!794 = !DILocalVariable(name: "pn", arg: 2, scope: !785, file: !770, line: 223, type: !788)
!795 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !785, file: !770, line: 223, type: !789)
!796 = !DILocalVariable(name: "n_max", arg: 4, scope: !785, file: !770, line: 223, type: !791)
!797 = !DILocalVariable(name: "s", arg: 5, scope: !785, file: !770, line: 223, type: !789)
!798 = !DILocalVariable(name: "n0", scope: !785, file: !770, line: 230, type: !789)
!799 = !DILocalVariable(name: "n", scope: !785, file: !770, line: 237, type: !789)
!800 = !DILocalVariable(name: "nbytes", scope: !785, file: !770, line: 248, type: !789)
!801 = !DILocalVariable(name: "adjusted_nbytes", scope: !785, file: !770, line: 252, type: !789)
!802 = !{!330, !178, !309, !351, !188}
!803 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !804, splitDebugInlining: false, nameTableKind: None)
!804 = !{!726, !729, !731}
!805 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !500, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!807 = distinct !DICompileUnit(language: DW_LANG_C11, file: !808, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !810, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!813 = distinct !DICompileUnit(language: DW_LANG_C11, file: !814, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!815 = distinct !DICompileUnit(language: DW_LANG_C11, file: !816, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !817, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!817 = !{!309, !188, !178}
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !753, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !819, splitDebugInlining: false, nameTableKind: None)
!819 = !{!820, !751}
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !753, line: 35, type: !204, isLocal: true, isDefinition: true)
!822 = distinct !DICompileUnit(language: DW_LANG_C11, file: !823, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!824 = distinct !DICompileUnit(language: DW_LANG_C11, file: !825, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!826 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!827 = !{i32 7, !"Dwarf Version", i32 5}
!828 = !{i32 2, !"Debug Info Version", i32 3}
!829 = !{i32 1, !"wchar_size", i32 4}
!830 = !{i32 8, !"PIC Level", i32 2}
!831 = !{i32 7, !"PIE Level", i32 2}
!832 = !{i32 7, !"uwtable", i32 2}
!833 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 43, type: !182, scopeLine: 44, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !834)
!834 = !{!835}
!835 = !DILocalVariable(name: "status", arg: 1, scope: !833, file: !2, line: 43, type: !184)
!836 = !DILocation(line: 0, scope: !833)
!837 = !DILocation(line: 45, column: 14, scope: !838)
!838 = distinct !DILexicalBlock(scope: !833, file: !2, line: 45, column: 7)
!839 = !DILocation(line: 45, column: 7, scope: !833)
!840 = !DILocation(line: 46, column: 5, scope: !841)
!841 = distinct !DILexicalBlock(scope: !838, file: !2, line: 46, column: 5)
!842 = !{!843, !843, i64 0}
!843 = !{!"any pointer", !844, i64 0}
!844 = !{!"omnipotent char", !845, i64 0}
!845 = !{!"Simple C/C++ TBAA"}
!846 = !DILocation(line: 49, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !838, file: !2, line: 48, column: 5)
!848 = !DILocation(line: 55, column: 7, scope: !847)
!849 = !DILocation(line: 59, column: 7, scope: !847)
!850 = !DILocation(line: 60, column: 7, scope: !847)
!851 = !DILocation(line: 61, column: 7, scope: !847)
!852 = !DILocation(line: 68, column: 7, scope: !847)
!853 = !DILocalVariable(name: "program", arg: 1, scope: !854, file: !131, line: 824, type: !134)
!854 = distinct !DISubprogram(name: "emit_exec_status", scope: !131, file: !131, line: 824, type: !855, scopeLine: 825, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !857)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !134}
!857 = !{!853}
!858 = !DILocation(line: 0, scope: !854, inlinedAt: !859)
!859 = distinct !DILocation(line: 69, column: 7, scope: !847)
!860 = !DILocation(line: 826, column: 7, scope: !854, inlinedAt: !859)
!861 = !DILocalVariable(name: "program", arg: 1, scope: !862, file: !131, line: 836, type: !134)
!862 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !131, file: !131, line: 836, type: !855, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !863)
!863 = !{!861, !864, !871, !872, !874, !875}
!864 = !DILocalVariable(name: "infomap", scope: !862, file: !131, line: 838, type: !865)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 896, elements: !225)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !862, file: !131, line: 838, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !867, file: !131, line: 838, baseType: !134, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !867, file: !131, line: 838, baseType: !134, size: 64, offset: 64)
!871 = !DILocalVariable(name: "node", scope: !862, file: !131, line: 848, type: !134)
!872 = !DILocalVariable(name: "map_prog", scope: !862, file: !131, line: 849, type: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!874 = !DILocalVariable(name: "lc_messages", scope: !862, file: !131, line: 861, type: !134)
!875 = !DILocalVariable(name: "url_program", scope: !862, file: !131, line: 874, type: !134)
!876 = !DILocation(line: 0, scope: !862, inlinedAt: !877)
!877 = distinct !DILocation(line: 70, column: 7, scope: !847)
!878 = !DILocation(line: 857, column: 3, scope: !862, inlinedAt: !877)
!879 = !DILocation(line: 861, column: 29, scope: !862, inlinedAt: !877)
!880 = !DILocation(line: 862, column: 7, scope: !881, inlinedAt: !877)
!881 = distinct !DILexicalBlock(scope: !862, file: !131, line: 862, column: 7)
!882 = !DILocation(line: 862, column: 19, scope: !881, inlinedAt: !877)
!883 = !DILocation(line: 862, column: 22, scope: !881, inlinedAt: !877)
!884 = !DILocation(line: 862, column: 7, scope: !862, inlinedAt: !877)
!885 = !DILocation(line: 868, column: 7, scope: !886, inlinedAt: !877)
!886 = distinct !DILexicalBlock(scope: !881, file: !131, line: 863, column: 5)
!887 = !DILocation(line: 870, column: 5, scope: !886, inlinedAt: !877)
!888 = !DILocation(line: 875, column: 3, scope: !862, inlinedAt: !877)
!889 = !DILocation(line: 877, column: 3, scope: !862, inlinedAt: !877)
!890 = !DILocation(line: 72, column: 3, scope: !833)
!891 = !DISubprogram(name: "dcgettext", scope: !892, file: !892, line: 51, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!892 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!893 = !DISubroutineType(types: !894)
!894 = !{!330, !134, !134, !184}
!895 = !{}
!896 = !DISubprogram(name: "__fprintf_chk", scope: !897, file: !897, line: 93, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!897 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!898 = !DISubroutineType(types: !899)
!899 = !{!184, !900, !184, !901, null}
!900 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !322)
!901 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !134)
!902 = !DISubprogram(name: "__printf_chk", scope: !897, file: !897, line: 95, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!903 = !DISubroutineType(types: !904)
!904 = !{!184, !184, !901, null}
!905 = !DISubprogram(name: "fputs_unlocked", scope: !906, file: !906, line: 691, type: !907, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!906 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!907 = !DISubroutineType(types: !908)
!908 = !{!184, !901, !900}
!909 = !DILocation(line: 0, scope: !130)
!910 = !DILocation(line: 581, column: 7, scope: !307)
!911 = !{!912, !912, i64 0}
!912 = !{!"int", !844, i64 0}
!913 = !DILocation(line: 581, column: 19, scope: !307)
!914 = !DILocation(line: 581, column: 7, scope: !130)
!915 = !DILocation(line: 585, column: 26, scope: !306)
!916 = !DILocation(line: 0, scope: !306)
!917 = !DILocation(line: 586, column: 23, scope: !306)
!918 = !DILocation(line: 586, column: 28, scope: !306)
!919 = !DILocation(line: 586, column: 32, scope: !306)
!920 = !{!844, !844, i64 0}
!921 = !DILocation(line: 586, column: 38, scope: !306)
!922 = !DILocalVariable(name: "__s1", arg: 1, scope: !923, file: !924, line: 1359, type: !134)
!923 = distinct !DISubprogram(name: "streq", scope: !924, file: !924, line: 1359, type: !925, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !927)
!924 = !DIFile(filename: "./lib/string.h", directory: "/src")
!925 = !DISubroutineType(types: !926)
!926 = !{!309, !134, !134}
!927 = !{!922, !928}
!928 = !DILocalVariable(name: "__s2", arg: 2, scope: !923, file: !924, line: 1359, type: !134)
!929 = !DILocation(line: 0, scope: !923, inlinedAt: !930)
!930 = distinct !DILocation(line: 586, column: 41, scope: !306)
!931 = !DILocation(line: 1361, column: 11, scope: !923, inlinedAt: !930)
!932 = !DILocation(line: 1361, column: 10, scope: !923, inlinedAt: !930)
!933 = !DILocation(line: 586, column: 19, scope: !306)
!934 = !DILocation(line: 587, column: 5, scope: !306)
!935 = !DILocation(line: 588, column: 7, scope: !936)
!936 = distinct !DILexicalBlock(scope: !130, file: !131, line: 588, column: 7)
!937 = !DILocation(line: 588, column: 7, scope: !130)
!938 = !DILocation(line: 590, column: 7, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !131, line: 589, column: 5)
!940 = !DILocation(line: 591, column: 7, scope: !939)
!941 = !DILocation(line: 595, column: 37, scope: !130)
!942 = !DILocation(line: 595, column: 35, scope: !130)
!943 = !DILocation(line: 596, column: 29, scope: !130)
!944 = !DILocation(line: 597, column: 8, scope: !315)
!945 = !DILocation(line: 597, column: 7, scope: !130)
!946 = !DILocation(line: 604, column: 24, scope: !314)
!947 = !DILocation(line: 604, column: 12, scope: !315)
!948 = !DILocation(line: 0, scope: !313)
!949 = !DILocation(line: 610, column: 16, scope: !313)
!950 = !DILocation(line: 610, column: 7, scope: !313)
!951 = !DILocation(line: 611, column: 21, scope: !313)
!952 = !{!953, !953, i64 0}
!953 = !{!"short", !844, i64 0}
!954 = !DILocation(line: 611, column: 19, scope: !313)
!955 = !DILocation(line: 611, column: 16, scope: !313)
!956 = !DILocation(line: 610, column: 30, scope: !313)
!957 = distinct !{!957, !950, !951, !958}
!958 = !{!"llvm.loop.mustprogress"}
!959 = !DILocation(line: 612, column: 18, scope: !960)
!960 = distinct !DILexicalBlock(scope: !313, file: !131, line: 612, column: 11)
!961 = !DILocation(line: 612, column: 11, scope: !313)
!962 = !DILocation(line: 618, column: 5, scope: !313)
!963 = !DILocation(line: 620, column: 23, scope: !130)
!964 = !DILocation(line: 625, column: 39, scope: !130)
!965 = !DILocation(line: 626, column: 3, scope: !130)
!966 = !DILocation(line: 626, column: 10, scope: !130)
!967 = !DILocation(line: 626, column: 21, scope: !130)
!968 = !DILocation(line: 628, column: 44, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !131, line: 628, column: 11)
!970 = distinct !DILexicalBlock(scope: !130, file: !131, line: 627, column: 5)
!971 = !DILocation(line: 628, column: 32, scope: !969)
!972 = !DILocation(line: 628, column: 49, scope: !969)
!973 = !DILocation(line: 628, column: 11, scope: !970)
!974 = !DILocation(line: 630, column: 11, scope: !975)
!975 = distinct !DILexicalBlock(scope: !970, file: !131, line: 630, column: 11)
!976 = !DILocation(line: 630, column: 11, scope: !970)
!977 = !DILocation(line: 632, column: 26, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !131, line: 632, column: 15)
!979 = distinct !DILexicalBlock(scope: !975, file: !131, line: 631, column: 9)
!980 = !DILocation(line: 632, column: 34, scope: !978)
!981 = !DILocation(line: 632, column: 37, scope: !978)
!982 = !DILocation(line: 632, column: 15, scope: !979)
!983 = !DILocation(line: 636, column: 16, scope: !984)
!984 = distinct !DILexicalBlock(scope: !979, file: !131, line: 636, column: 15)
!985 = !DILocation(line: 636, column: 29, scope: !984)
!986 = !DILocation(line: 640, column: 16, scope: !970)
!987 = distinct !{!987, !965, !988, !958}
!988 = !DILocation(line: 641, column: 5, scope: !130)
!989 = !DILocation(line: 644, column: 3, scope: !130)
!990 = !DILocation(line: 0, scope: !923, inlinedAt: !991)
!991 = distinct !DILocation(line: 648, column: 31, scope: !130)
!992 = !DILocation(line: 0, scope: !923, inlinedAt: !993)
!993 = distinct !DILocation(line: 649, column: 31, scope: !130)
!994 = !DILocation(line: 0, scope: !923, inlinedAt: !995)
!995 = distinct !DILocation(line: 650, column: 31, scope: !130)
!996 = !DILocation(line: 0, scope: !923, inlinedAt: !997)
!997 = distinct !DILocation(line: 651, column: 31, scope: !130)
!998 = !DILocation(line: 0, scope: !923, inlinedAt: !999)
!999 = distinct !DILocation(line: 652, column: 31, scope: !130)
!1000 = !DILocation(line: 0, scope: !923, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 653, column: 31, scope: !130)
!1002 = !DILocation(line: 0, scope: !923, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 654, column: 31, scope: !130)
!1004 = !DILocation(line: 0, scope: !923, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 655, column: 31, scope: !130)
!1006 = !DILocation(line: 0, scope: !923, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 656, column: 31, scope: !130)
!1008 = !DILocation(line: 0, scope: !923, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 657, column: 31, scope: !130)
!1010 = !DILocation(line: 663, column: 7, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !130, file: !131, line: 663, column: 7)
!1012 = !DILocation(line: 664, column: 7, scope: !1011)
!1013 = !DILocation(line: 664, column: 10, scope: !1011)
!1014 = !DILocation(line: 663, column: 7, scope: !130)
!1015 = !DILocation(line: 669, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1011, file: !131, line: 665, column: 5)
!1017 = !DILocation(line: 671, column: 5, scope: !1016)
!1018 = !DILocation(line: 676, column: 7, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1011, file: !131, line: 673, column: 5)
!1020 = !DILocation(line: 679, column: 3, scope: !130)
!1021 = !DILocation(line: 683, column: 3, scope: !130)
!1022 = !DILocation(line: 686, column: 3, scope: !130)
!1023 = !DILocation(line: 688, column: 3, scope: !130)
!1024 = !DILocation(line: 691, column: 3, scope: !130)
!1025 = !DILocation(line: 695, column: 3, scope: !130)
!1026 = !DILocation(line: 696, column: 1, scope: !130)
!1027 = !DISubprogram(name: "setlocale", scope: !1028, file: !1028, line: 122, type: !1029, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1028 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!330, !184, !134}
!1031 = !DISubprogram(name: "strncmp", scope: !1032, file: !1032, line: 159, type: !1033, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1032 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!184, !134, !134, !186}
!1035 = !DISubprogram(name: "exit", scope: !1036, file: !1036, line: 624, type: !182, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1036 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1037 = !DISubprogram(name: "getenv", scope: !1036, file: !1036, line: 641, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!330, !134}
!1040 = !DISubprogram(name: "strcmp", scope: !1032, file: !1032, line: 156, type: !1041, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!184, !134, !134}
!1043 = !DISubprogram(name: "strspn", scope: !1032, file: !1032, line: 297, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!188, !134, !134}
!1046 = !DISubprogram(name: "strchr", scope: !1032, file: !1032, line: 246, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!330, !134, !184}
!1049 = !DISubprogram(name: "__ctype_b_loc", scope: !163, file: !163, line: 79, type: !1050, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!1055 = !DISubprogram(name: "strcspn", scope: !1032, file: !1032, line: 293, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1056 = !DISubprogram(name: "fwrite_unlocked", scope: !906, file: !906, line: 704, type: !1057, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!186, !1059, !186, !186, !900}
!1059 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1062 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 82, type: !1063, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1066)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!184, !184, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1080, !1081, !1084, !1085, !1086, !1090, !1091, !1094, !1095, !1098, !1099, !1104, !1105, !1106}
!1067 = !DILocalVariable(name: "argc", arg: 1, scope: !1062, file: !2, line: 82, type: !184)
!1068 = !DILocalVariable(name: "argv", arg: 2, scope: !1062, file: !2, line: 82, type: !1065)
!1069 = !DILocalVariable(name: "exit_internal_failure", scope: !1062, file: !2, line: 94, type: !184)
!1070 = !DILocalVariable(name: "ignoring_input", scope: !1062, file: !2, line: 109, type: !309)
!1071 = !DILocalVariable(name: "redirecting_stdout", scope: !1062, file: !2, line: 110, type: !309)
!1072 = !DILocalVariable(name: "stdout_is_closed", scope: !1062, file: !2, line: 111, type: !309)
!1073 = !DILocalVariable(name: "redirecting_stderr", scope: !1062, file: !2, line: 112, type: !309)
!1074 = !DILocalVariable(name: "__errstatus", scope: !1075, file: !2, line: 120, type: !1079)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !2, line: 120, column: 9)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !2, line: 119, column: 11)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 118, column: 5)
!1078 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 117, column: 7)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!1080 = !DILocalVariable(name: "out_fd", scope: !1062, file: !2, line: 130, type: !184)
!1081 = !DILocalVariable(name: "in_home", scope: !1082, file: !2, line: 133, type: !330)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !2, line: 132, column: 5)
!1083 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 131, column: 7)
!1084 = !DILocalVariable(name: "file", scope: !1082, file: !2, line: 134, type: !134)
!1085 = !DILocalVariable(name: "flags", scope: !1082, file: !2, line: 135, type: !184)
!1086 = !DILocalVariable(name: "mode", scope: !1082, file: !2, line: 136, type: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !1088, line: 69, baseType: !1089)
!1088 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !350, line: 150, baseType: !139)
!1090 = !DILocalVariable(name: "umask_value", scope: !1082, file: !2, line: 137, type: !1087)
!1091 = !DILocalVariable(name: "saved_errno", scope: !1092, file: !2, line: 144, type: !184)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !2, line: 143, column: 9)
!1093 = distinct !DILexicalBlock(scope: !1082, file: !2, line: 142, column: 11)
!1094 = !DILocalVariable(name: "home", scope: !1092, file: !2, line: 145, type: !134)
!1095 = !DILocalVariable(name: "saved_errno2", scope: !1096, file: !2, line: 155, type: !184)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !2, line: 154, column: 13)
!1097 = distinct !DILexicalBlock(scope: !1092, file: !2, line: 153, column: 15)
!1098 = !DILocalVariable(name: "saved_stderr_fd", scope: !1062, file: !2, line: 175, type: !184)
!1099 = !DILocalVariable(name: "__errstatus", scope: !1100, file: !2, line: 193, type: !1079)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 193, column: 9)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 192, column: 11)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 177, column: 5)
!1103 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 176, column: 7)
!1104 = !DILocalVariable(name: "cmd", scope: !1062, file: !2, line: 211, type: !1065)
!1105 = !DILocalVariable(name: "exit_status", scope: !1062, file: !2, line: 213, type: !184)
!1106 = !DILocalVariable(name: "saved_errno", scope: !1062, file: !2, line: 214, type: !184)
!1107 = !DILocation(line: 0, scope: !1062)
!1108 = !DILocation(line: 85, column: 21, scope: !1062)
!1109 = !DILocation(line: 85, column: 3, scope: !1062)
!1110 = !DILocation(line: 86, column: 3, scope: !1062)
!1111 = !DILocation(line: 87, column: 3, scope: !1062)
!1112 = !DILocation(line: 88, column: 3, scope: !1062)
!1113 = !DILocation(line: 94, column: 32, scope: !1062)
!1114 = !DILocalVariable(name: "status", arg: 1, scope: !1115, file: !131, line: 102, type: !184)
!1115 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !131, file: !131, line: 102, type: !182, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1116)
!1116 = !{!1114}
!1117 = !DILocation(line: 0, scope: !1115, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 96, column: 3, scope: !1062)
!1119 = !DILocation(line: 105, column: 18, scope: !1120, inlinedAt: !1118)
!1120 = distinct !DILexicalBlock(scope: !1115, file: !131, line: 104, column: 7)
!1121 = !DILocation(line: 97, column: 3, scope: !1062)
!1122 = !DILocation(line: 100, column: 36, scope: !1062)
!1123 = !DILocation(line: 100, column: 59, scope: !1062)
!1124 = !DILocation(line: 99, column: 3, scope: !1062)
!1125 = !DILocation(line: 103, column: 15, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 103, column: 7)
!1127 = !DILocation(line: 103, column: 12, scope: !1126)
!1128 = !DILocation(line: 103, column: 7, scope: !1062)
!1129 = !DILocation(line: 105, column: 7, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !2, line: 104, column: 5)
!1131 = !DILocation(line: 106, column: 7, scope: !1130)
!1132 = !DILocation(line: 109, column: 25, scope: !1062)
!1133 = !DILocation(line: 110, column: 29, scope: !1062)
!1134 = !DILocation(line: 111, column: 48, scope: !1062)
!1135 = !DILocation(line: 111, column: 51, scope: !1062)
!1136 = !DILocation(line: 111, column: 57, scope: !1062)
!1137 = !DILocation(line: 112, column: 29, scope: !1062)
!1138 = !DILocation(line: 117, column: 7, scope: !1062)
!1139 = !DILocation(line: 119, column: 11, scope: !1076)
!1140 = !DILocation(line: 119, column: 62, scope: !1076)
!1141 = !DILocation(line: 119, column: 11, scope: !1077)
!1142 = !DILocation(line: 120, column: 9, scope: !1076)
!1143 = !DILocation(line: 122, column: 31, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1077, file: !2, line: 122, column: 11)
!1145 = !DILocation(line: 123, column: 9, scope: !1144)
!1146 = !DILocation(line: 131, column: 26, scope: !1083)
!1147 = !DILocation(line: 0, scope: !1082)
!1148 = !DILocation(line: 137, column: 28, scope: !1082)
!1149 = !DILocation(line: 138, column: 17, scope: !1082)
!1150 = !DILocation(line: 139, column: 19, scope: !1082)
!1151 = !DILocation(line: 140, column: 19, scope: !1082)
!1152 = !DILocation(line: 142, column: 18, scope: !1093)
!1153 = !DILocation(line: 142, column: 11, scope: !1082)
!1154 = !DILocation(line: 144, column: 29, scope: !1092)
!1155 = !DILocation(line: 0, scope: !1092)
!1156 = !DILocation(line: 145, column: 30, scope: !1092)
!1157 = !DILocation(line: 146, column: 15, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1092, file: !2, line: 146, column: 15)
!1159 = !DILocation(line: 146, column: 15, scope: !1092)
!1160 = !DILocation(line: 148, column: 25, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1158, file: !2, line: 147, column: 13)
!1162 = !DILocation(line: 149, column: 25, scope: !1161)
!1163 = !DILocation(line: 150, column: 27, scope: !1161)
!1164 = !DILocation(line: 151, column: 27, scope: !1161)
!1165 = !DILocation(line: 153, column: 22, scope: !1097)
!1166 = !DILocation(line: 153, column: 15, scope: !1092)
!1167 = !DILocation(line: 155, column: 34, scope: !1096)
!1168 = !DILocation(line: 0, scope: !1096)
!1169 = !DILocation(line: 156, column: 15, scope: !1096)
!1170 = !DILocation(line: 157, column: 19, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1096, file: !2, line: 157, column: 19)
!1172 = !DILocation(line: 157, column: 19, scope: !1096)
!1173 = !DILocation(line: 158, column: 17, scope: !1171)
!1174 = !DILocation(line: 134, column: 19, scope: !1082)
!1175 = !DILocation(line: 165, column: 7, scope: !1082)
!1176 = !DILocation(line: 166, column: 7, scope: !1082)
!1177 = !DILocation(line: 171, column: 7, scope: !1082)
!1178 = !DILocation(line: 176, column: 7, scope: !1062)
!1179 = !DILocation(line: 182, column: 25, scope: !1102)
!1180 = !DILocation(line: 185, column: 11, scope: !1102)
!1181 = !DILocation(line: 186, column: 9, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 185, column: 11)
!1183 = !DILocation(line: 192, column: 11, scope: !1101)
!1184 = !DILocation(line: 192, column: 40, scope: !1101)
!1185 = !DILocation(line: 192, column: 11, scope: !1102)
!1186 = !DILocation(line: 193, column: 9, scope: !1101)
!1187 = !DILocation(line: 196, column: 11, scope: !1102)
!1188 = !DILocation(line: 197, column: 9, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 196, column: 11)
!1190 = !DILocation(line: 206, column: 7, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 206, column: 7)
!1192 = !DILocalVariable(name: "__stream", arg: 1, scope: !1193, file: !1194, line: 135, type: !322)
!1193 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1194, file: !1194, line: 135, type: !1195, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1197)
!1194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!184, !322}
!1197 = !{!1192}
!1198 = !DILocation(line: 0, scope: !1193, inlinedAt: !1199)
!1199 = distinct !DILocation(line: 206, column: 7, scope: !1191)
!1200 = !DILocation(line: 137, column: 10, scope: !1193, inlinedAt: !1199)
!1201 = !{!1202, !912, i64 0}
!1202 = !{!"_IO_FILE", !912, i64 0, !843, i64 8, !843, i64 16, !843, i64 24, !843, i64 32, !843, i64 40, !843, i64 48, !843, i64 56, !843, i64 64, !843, i64 72, !843, i64 80, !843, i64 88, !843, i64 96, !843, i64 104, !912, i64 112, !912, i64 116, !1203, i64 120, !953, i64 128, !844, i64 130, !844, i64 131, !843, i64 136, !1203, i64 144, !843, i64 152, !843, i64 160, !843, i64 168, !843, i64 176, !1203, i64 184, !912, i64 192, !844, i64 196}
!1203 = !{!"long", !844, i64 0}
!1204 = !DILocation(line: 206, column: 7, scope: !1062)
!1205 = !DILocation(line: 209, column: 3, scope: !1062)
!1206 = !DILocation(line: 211, column: 23, scope: !1062)
!1207 = !DILocation(line: 211, column: 21, scope: !1062)
!1208 = !DILocation(line: 212, column: 11, scope: !1062)
!1209 = !DILocation(line: 212, column: 3, scope: !1062)
!1210 = !DILocation(line: 213, column: 21, scope: !1062)
!1211 = !DILocation(line: 213, column: 27, scope: !1062)
!1212 = !DILocation(line: 222, column: 7, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 222, column: 7)
!1214 = !DILocation(line: 222, column: 45, scope: !1213)
!1215 = !DILocation(line: 222, column: 7, scope: !1062)
!1216 = !DILocation(line: 223, column: 5, scope: !1213)
!1217 = !DILocation(line: 226, column: 1, scope: !1062)
!1218 = !DISubprogram(name: "bindtextdomain", scope: !892, file: !892, line: 86, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!330, !134, !134}
!1221 = !DISubprogram(name: "textdomain", scope: !892, file: !892, line: 82, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1222 = !DISubprogram(name: "atexit", scope: !1036, file: !1036, line: 602, type: !1223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!184, !452}
!1225 = !DISubprogram(name: "isatty", scope: !1226, file: !1226, line: 809, type: !1227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1226 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!184, !184}
!1229 = !DISubprogram(name: "__errno_location", scope: !1230, file: !1230, line: 37, type: !1231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1230 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!494}
!1233 = !DISubprogram(name: "umask", scope: !1234, file: !1234, line: 380, type: !1235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!1089, !1089}
!1237 = !DISubprogram(name: "open", scope: !1238, file: !1238, line: 181, type: !1239, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1238 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!184, !134, !184, null}
!1241 = !DISubprogram(name: "free", scope: !1036, file: !1036, line: 555, type: !1242, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !178}
!1244 = !DISubprogram(name: "dup2", scope: !1226, file: !1226, line: 555, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1245 = !DISubprogram(name: "close", scope: !1226, file: !1226, line: 358, type: !1227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1246 = !DISubprogram(name: "signal", scope: !180, file: !180, line: 88, type: !1247, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!179, !184, !179}
!1249 = !DISubprogram(name: "execvp", scope: !1226, file: !1226, line: 599, type: !1250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!184, !134, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!1254 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !391, file: !391, line: 50, type: !855, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1255)
!1255 = !{!1256}
!1256 = !DILocalVariable(name: "file", arg: 1, scope: !1254, file: !391, line: 50, type: !134)
!1257 = !DILocation(line: 0, scope: !1254)
!1258 = !DILocation(line: 52, column: 13, scope: !1254)
!1259 = !DILocation(line: 53, column: 1, scope: !1254)
!1260 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !391, file: !391, line: 87, type: !1261, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1263)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !309}
!1263 = !{!1264}
!1264 = !DILocalVariable(name: "ignore", arg: 1, scope: !1260, file: !391, line: 87, type: !309)
!1265 = !DILocation(line: 0, scope: !1260)
!1266 = !DILocation(line: 89, column: 16, scope: !1260)
!1267 = !{!1268, !1268, i64 0}
!1268 = !{!"_Bool", !844, i64 0}
!1269 = !DILocation(line: 90, column: 1, scope: !1260)
!1270 = distinct !DISubprogram(name: "close_stdout", scope: !391, file: !391, line: 116, type: !453, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1271)
!1271 = !{!1272}
!1272 = !DILocalVariable(name: "write_error", scope: !1273, file: !391, line: 121, type: !134)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !391, line: 120, column: 5)
!1274 = distinct !DILexicalBlock(scope: !1270, file: !391, line: 118, column: 7)
!1275 = !DILocation(line: 118, column: 21, scope: !1274)
!1276 = !DILocation(line: 118, column: 7, scope: !1274)
!1277 = !DILocation(line: 118, column: 29, scope: !1274)
!1278 = !DILocation(line: 119, column: 7, scope: !1274)
!1279 = !DILocation(line: 119, column: 12, scope: !1274)
!1280 = !{i8 0, i8 2}
!1281 = !DILocation(line: 119, column: 25, scope: !1274)
!1282 = !DILocation(line: 119, column: 28, scope: !1274)
!1283 = !DILocation(line: 119, column: 34, scope: !1274)
!1284 = !DILocation(line: 118, column: 7, scope: !1270)
!1285 = !DILocation(line: 121, column: 33, scope: !1273)
!1286 = !DILocation(line: 0, scope: !1273)
!1287 = !DILocation(line: 122, column: 11, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1273, file: !391, line: 122, column: 11)
!1289 = !DILocation(line: 0, scope: !1288)
!1290 = !DILocation(line: 122, column: 11, scope: !1273)
!1291 = !DILocation(line: 123, column: 9, scope: !1288)
!1292 = !DILocation(line: 126, column: 9, scope: !1288)
!1293 = !DILocation(line: 128, column: 14, scope: !1273)
!1294 = !DILocation(line: 128, column: 7, scope: !1273)
!1295 = !DILocation(line: 133, column: 42, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1270, file: !391, line: 133, column: 7)
!1297 = !DILocation(line: 133, column: 28, scope: !1296)
!1298 = !DILocation(line: 133, column: 50, scope: !1296)
!1299 = !DILocation(line: 133, column: 7, scope: !1270)
!1300 = !DILocation(line: 134, column: 12, scope: !1296)
!1301 = !DILocation(line: 134, column: 5, scope: !1296)
!1302 = !DILocation(line: 135, column: 1, scope: !1270)
!1303 = !DISubprogram(name: "_exit", scope: !1226, file: !1226, line: 624, type: !182, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !895)
!1304 = distinct !DISubprogram(name: "verror", scope: !406, file: !406, line: 251, type: !1305, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1307)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{null, !184, !184, !134, !416}
!1307 = !{!1308, !1309, !1310, !1311}
!1308 = !DILocalVariable(name: "status", arg: 1, scope: !1304, file: !406, line: 251, type: !184)
!1309 = !DILocalVariable(name: "errnum", arg: 2, scope: !1304, file: !406, line: 251, type: !184)
!1310 = !DILocalVariable(name: "message", arg: 3, scope: !1304, file: !406, line: 251, type: !134)
!1311 = !DILocalVariable(name: "args", arg: 4, scope: !1304, file: !406, line: 251, type: !416)
!1312 = !DILocation(line: 0, scope: !1304)
!1313 = !DILocation(line: 261, column: 3, scope: !1304)
!1314 = !DILocation(line: 265, column: 7, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1304, file: !406, line: 265, column: 7)
!1316 = !DILocation(line: 265, column: 7, scope: !1304)
!1317 = !DILocation(line: 266, column: 5, scope: !1315)
!1318 = !DILocation(line: 272, column: 7, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1315, file: !406, line: 268, column: 5)
!1320 = !DILocation(line: 276, column: 3, scope: !1304)
!1321 = !DILocation(line: 282, column: 1, scope: !1304)
!1322 = distinct !DISubprogram(name: "flush_stdout", scope: !406, file: !406, line: 163, type: !453, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1323)
!1323 = !{!1324}
!1324 = !DILocalVariable(name: "stdout_fd", scope: !1322, file: !406, line: 166, type: !184)
!1325 = !DILocation(line: 0, scope: !1322)
!1326 = !DILocalVariable(name: "fd", arg: 1, scope: !1327, file: !406, line: 145, type: !184)
!1327 = distinct !DISubprogram(name: "is_open", scope: !406, file: !406, line: 145, type: !1227, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1328)
!1328 = !{!1326}
!1329 = !DILocation(line: 0, scope: !1327, inlinedAt: !1330)
!1330 = distinct !DILocation(line: 182, column: 25, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1322, file: !406, line: 182, column: 7)
!1332 = !DILocation(line: 157, column: 15, scope: !1327, inlinedAt: !1330)
!1333 = !DILocation(line: 157, column: 12, scope: !1327, inlinedAt: !1330)
!1334 = !DILocation(line: 182, column: 7, scope: !1322)
!1335 = !DILocation(line: 184, column: 5, scope: !1331)
!1336 = !DILocation(line: 185, column: 1, scope: !1322)
!1337 = distinct !DISubprogram(name: "error_tail", scope: !406, file: !406, line: 219, type: !1305, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1338)
!1338 = !{!1339, !1340, !1341, !1342}
!1339 = !DILocalVariable(name: "status", arg: 1, scope: !1337, file: !406, line: 219, type: !184)
!1340 = !DILocalVariable(name: "errnum", arg: 2, scope: !1337, file: !406, line: 219, type: !184)
!1341 = !DILocalVariable(name: "message", arg: 3, scope: !1337, file: !406, line: 219, type: !134)
!1342 = !DILocalVariable(name: "args", arg: 4, scope: !1337, file: !406, line: 219, type: !416)
!1343 = !DILocation(line: 0, scope: !1337)
!1344 = !DILocation(line: 229, column: 13, scope: !1337)
!1345 = !DILocalVariable(name: "__stream", arg: 1, scope: !1346, file: !897, line: 132, type: !1349)
!1346 = distinct !DISubprogram(name: "vfprintf", scope: !897, file: !897, line: 132, type: !1347, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1384)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!184, !1349, !901, !416}
!1349 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !324, line: 7, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !326, line: 49, size: 1728, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1352, file: !326, line: 51, baseType: !184, size: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1352, file: !326, line: 54, baseType: !330, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1352, file: !326, line: 55, baseType: !330, size: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1352, file: !326, line: 56, baseType: !330, size: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1352, file: !326, line: 57, baseType: !330, size: 64, offset: 256)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1352, file: !326, line: 58, baseType: !330, size: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1352, file: !326, line: 59, baseType: !330, size: 64, offset: 384)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1352, file: !326, line: 60, baseType: !330, size: 64, offset: 448)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1352, file: !326, line: 61, baseType: !330, size: 64, offset: 512)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1352, file: !326, line: 64, baseType: !330, size: 64, offset: 576)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1352, file: !326, line: 65, baseType: !330, size: 64, offset: 640)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1352, file: !326, line: 66, baseType: !330, size: 64, offset: 704)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1352, file: !326, line: 68, baseType: !342, size: 64, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1352, file: !326, line: 70, baseType: !1368, size: 64, offset: 832)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1352, file: !326, line: 72, baseType: !184, size: 32, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1352, file: !326, line: 73, baseType: !184, size: 32, offset: 928)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1352, file: !326, line: 74, baseType: !349, size: 64, offset: 960)
