; ModuleID = 'src/od.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tspec = type { i32, i32, ptr, [18 x i8], i8, i32, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { x86_fp80 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1829, type: !24, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !24, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1832, type: !24, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1833, type: !24, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1835, type: !24, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 14)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 13)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1875, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 46)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1949, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 17)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !24, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 45)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1970, type: !100, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1973, type: !24, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2012, type: !340, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2031, type: !333, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2061, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 15)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "string_min", scope: !161, file: !2, line: 193, type: !257, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !161, file: !2, line: 196, type: !241, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "traditional", scope: !161, file: !2, line: 201, type: !241, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !161, file: !2, line: 204, type: !241, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !161, file: !2, line: 208, type: !366, isLocal: true, isDefinition: true)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !367, line: 101, baseType: !368)
!367 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !369, line: 72, baseType: !260)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !161, file: !2, line: 216, type: !366, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "spec", scope: !161, file: !2, line: 228, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !2, line: 122, size: 384, elements: !376)
!376 = !{!377, !378, !379, !380, !384, !385, !386}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !375, file: !2, line: 124, baseType: !185, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !375, file: !2, line: 125, baseType: !196, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !375, file: !2, line: 126, baseType: !253, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !375, file: !2, line: 127, baseType: !381, size: 144, offset: 128)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 18)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !375, file: !2, line: 128, baseType: !241, size: 8, offset: 272)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !375, file: !2, line: 129, baseType: !158, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !375, file: !2, line: 130, baseType: !257, size: 64, offset: 320)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "n_specs", scope: !161, file: !2, line: 231, type: !257, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !161, file: !2, line: 240, type: !257, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "file_list", scope: !161, file: !2, line: 247, type: !244, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "in_stream", scope: !161, file: !2, line: 254, type: !395, isLocal: true, isDefinition: true)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !397, line: 7, baseType: !398)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !399, line: 49, size: 1728, elements: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !416, !418, !419, !420, !422, !423, !425, !426, !429, !431, !434, !437, !438, !439, !440, !441}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !398, file: !399, line: 51, baseType: !158, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !398, file: !399, line: 54, baseType: !160, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !398, file: !399, line: 55, baseType: !160, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !398, file: !399, line: 56, baseType: !160, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !398, file: !399, line: 57, baseType: !160, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !398, file: !399, line: 58, baseType: !160, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !398, file: !399, line: 59, baseType: !160, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !398, file: !399, line: 60, baseType: !160, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !398, file: !399, line: 61, baseType: !160, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !398, file: !399, line: 64, baseType: !160, size: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !398, file: !399, line: 65, baseType: !160, size: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !398, file: !399, line: 66, baseType: !160, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !398, file: !399, line: 68, baseType: !414, size: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !399, line: 36, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !398, file: !399, line: 70, baseType: !417, size: 64, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !398, file: !399, line: 72, baseType: !158, size: 32, offset: 896)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !398, file: !399, line: 73, baseType: !158, size: 32, offset: 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !398, file: !399, line: 74, baseType: !421, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !369, line: 152, baseType: !260)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !398, file: !399, line: 77, baseType: !248, size: 16, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !398, file: !399, line: 78, baseType: !424, size: 8, offset: 1040)
!424 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !398, file: !399, line: 79, baseType: !265, size: 8, offset: 1048)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !398, file: !399, line: 81, baseType: !427, size: 64, offset: 1088)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !399, line: 43, baseType: null)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !398, file: !399, line: 89, baseType: !430, size: 64, offset: 1152)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !369, line: 153, baseType: !260)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !398, file: !399, line: 91, baseType: !432, size: 64, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !399, line: 37, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !398, file: !399, line: 92, baseType: !435, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !399, line: 38, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !398, file: !399, line: 93, baseType: !417, size: 64, offset: 1344)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !398, file: !399, line: 94, baseType: !240, size: 64, offset: 1408)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !398, file: !399, line: 95, baseType: !249, size: 64, offset: 1472)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !398, file: !399, line: 96, baseType: !158, size: 32, offset: 1536)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !398, file: !399, line: 98, baseType: !442, size: 160, offset: 1568)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 20)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !161, file: !2, line: 257, type: !241, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "input_swap", scope: !161, file: !2, line: 305, type: !241, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !181, line: 729, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 56)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !181, line: 736, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 75)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !461, file: !181, line: 575, type: !158, isLocal: true, isDefinition: true)
!461 = distinct !DISubprogram(name: "oputs_", scope: !181, file: !181, line: 573, type: !462, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !464)
!462 = !DISubroutineType(cc: DW_CC_nocall, types: !463)
!463 = !{null, !246, !246}
!464 = !{!465, !466, !467, !470, !471, !472, !473, !477, !478, !479, !480, !482, !483, !484, !485, !487, !488}
!465 = !DILocalVariable(name: "program", arg: 1, scope: !461, file: !181, line: 573, type: !246)
!466 = !DILocalVariable(name: "option", arg: 2, scope: !461, file: !181, line: 573, type: !246)
!467 = !DILocalVariable(name: "term", scope: !468, file: !181, line: 585, type: !246)
!468 = distinct !DILexicalBlock(scope: !469, file: !181, line: 582, column: 5)
!469 = distinct !DILexicalBlock(scope: !461, file: !181, line: 581, column: 7)
!470 = !DILocalVariable(name: "double_space", scope: !461, file: !181, line: 594, type: !241)
!471 = !DILocalVariable(name: "first_word", scope: !461, file: !181, line: 595, type: !246)
!472 = !DILocalVariable(name: "option_text", scope: !461, file: !181, line: 596, type: !246)
!473 = !DILocalVariable(name: "s", scope: !474, file: !181, line: 608, type: !246)
!474 = distinct !DILexicalBlock(scope: !475, file: !181, line: 605, column: 5)
!475 = distinct !DILexicalBlock(scope: !476, file: !181, line: 604, column: 12)
!476 = distinct !DILexicalBlock(scope: !461, file: !181, line: 597, column: 7)
!477 = !DILocalVariable(name: "spaces", scope: !474, file: !181, line: 609, type: !249)
!478 = !DILocalVariable(name: "anchor_len", scope: !461, file: !181, line: 620, type: !249)
!479 = !DILocalVariable(name: "desc_text", scope: !461, file: !181, line: 625, type: !246)
!480 = !DILocalVariable(name: "__ptr", scope: !481, file: !181, line: 644, type: !246)
!481 = distinct !DILexicalBlock(scope: !461, file: !181, line: 644, column: 3)
!482 = !DILocalVariable(name: "__stream", scope: !481, file: !181, line: 644, type: !395)
!483 = !DILocalVariable(name: "__cnt", scope: !481, file: !181, line: 644, type: !249)
!484 = !DILocalVariable(name: "url_program", scope: !461, file: !181, line: 648, type: !246)
!485 = !DILocalVariable(name: "__ptr", scope: !486, file: !181, line: 686, type: !246)
!486 = distinct !DILexicalBlock(scope: !461, file: !181, line: 686, column: 3)
!487 = !DILocalVariable(name: "__stream", scope: !486, file: !181, line: 686, type: !395)
!488 = !DILocalVariable(name: "__cnt", scope: !486, file: !181, line: 686, type: !249)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !181, line: 585, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 5)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !181, line: 586, type: !491, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !181, line: 595, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 4)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !181, line: 620, type: !503, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 6)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !287, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !491, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !498, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !24, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !181, line: 650, type: !491, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !503, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !503, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !181, line: 652, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 7)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !181, line: 653, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 8)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !181, line: 654, type: !270, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !181, line: 655, type: !270, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !181, line: 656, type: !270, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !181, line: 657, type: !270, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !181, line: 663, type: !522, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !181, line: 664, type: !270, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !333, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 40)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !353, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 61)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !181, line: 679, type: !24, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !181, line: 683, type: !491, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !181, line: 688, type: !491, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !181, line: 691, type: !527, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !181, line: 839, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 16)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !181, line: 840, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 22)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !181, line: 841, type: !353, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !181, line: 862, type: !498, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !181, line: 868, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 71)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !181, line: 875, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 27)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !120, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 12)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "short_options", scope: !161, file: !2, line: 307, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 280, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 35)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 335, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 11)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 336, type: !318, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !602, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 338, type: !522, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !381, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !527, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !592, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !503, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 343, type: !522, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !491, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 346, type: !527, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "long_options", scope: !161, file: !2, line: 333, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 3072, elements: !593)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !630, line: 50, size: 256, elements: !631)
!630 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!631 = !{!632, !633, !634, !636}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !629, file: !630, line: 52, baseType: !246, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !629, file: !630, line: 55, baseType: !158, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !630, line: 56, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !629, file: !630, line: 57, baseType: !158, size: 32, offset: 192)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1267, type: !333, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "format_address", scope: !161, file: !2, line: 213, type: !641, isLocal: true, isDefinition: true)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !366, !4}
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "address_base", scope: !161, file: !2, line: 182, type: !158, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !161, file: !2, line: 190, type: !158, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !270, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !282, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 328, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 41)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !161, file: !2, line: 234, type: !257, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !2, line: 797, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 23)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !2, line: 807, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 76)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !503, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !287, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !498, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !282, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !287, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !498, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !287, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !498, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !287, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !498, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !287, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 664, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 83)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 921, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 656, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 82)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 937, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 53)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !2, line: 993, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !655)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "integral_type_size", scope: !161, file: !2, line: 265, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 288, elements: !283)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !161, file: !2, line: 288, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 544, elements: !334)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !2, line: 585, type: !498, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 618, type: !498, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "charname", scope: !161, file: !2, line: 172, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 1056, elements: !739)
!739 = !{!740, !500}
!740 = !DISubrange(count: 33)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !2, line: 651, type: !24, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !24, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 659, type: !24, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !2, line: 663, type: !24, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !2, line: 667, type: !24, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !2, line: 671, type: !24, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !2, line: 675, type: !24, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !2, line: 679, type: !24, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !24, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !491, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !161, file: !2, line: 225, type: !241, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "endian_types", scope: !161, file: !2, line: 328, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 64, elements: !288)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !522, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !498, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "endian_args", scope: !161, file: !2, line: 323, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 192, elements: !25)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1488, type: !24, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1294, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !598)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "end_offset", scope: !161, file: !2, line: 220, type: !366, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !287, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "default_file_list", scope: !161, file: !2, line: 251, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 128, elements: !288)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1039, type: !287, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "input_filename", scope: !161, file: !2, line: 244, type: !246, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1227, type: !3, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1086, type: !592, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "width_bytes", scope: !161, file: !2, line: 134, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 288, elements: !283)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 32)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 136, elements: !334)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 30)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !654, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "first", scope: !815, file: !2, line: 1313, type: !241, isLocal: true, isDefinition: true)
!815 = distinct !DISubprogram(name: "write_block", scope: !2, file: !2, line: 1310, type: !816, scopeLine: 1312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !366, !257, !246, !246}
!818 = !{!819, !820, !821, !822, !823, !827, !830, !831, !832, !835, !837}
!819 = !DILocalVariable(name: "current_offset", arg: 1, scope: !815, file: !2, line: 1310, type: !366)
!820 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !815, file: !2, line: 1310, type: !257)
!821 = !DILocalVariable(name: "prev_block", arg: 3, scope: !815, file: !2, line: 1311, type: !246)
!822 = !DILocalVariable(name: "curr_block", arg: 4, scope: !815, file: !2, line: 1311, type: !246)
!823 = !DILocalVariable(name: "i", scope: !824, file: !2, line: 1334, type: !257)
!824 = distinct !DILexicalBlock(scope: !825, file: !2, line: 1334, column: 7)
!825 = distinct !DILexicalBlock(scope: !826, file: !2, line: 1332, column: 5)
!826 = distinct !DILexicalBlock(scope: !815, file: !2, line: 1316, column: 7)
!827 = !DILocalVariable(name: "datum_width", scope: !828, file: !2, line: 1336, type: !158)
!828 = distinct !DILexicalBlock(scope: !829, file: !2, line: 1335, column: 9)
!829 = distinct !DILexicalBlock(scope: !824, file: !2, line: 1334, column: 7)
!830 = !DILocalVariable(name: "fields_per_block", scope: !828, file: !2, line: 1337, type: !257)
!831 = !DILocalVariable(name: "blank_fields", scope: !828, file: !2, line: 1338, type: !257)
!832 = !DILocalVariable(name: "field_width", scope: !833, file: !2, line: 1349, type: !158)
!833 = distinct !DILexicalBlock(scope: !834, file: !2, line: 1347, column: 13)
!834 = distinct !DILexicalBlock(scope: !828, file: !2, line: 1346, column: 15)
!835 = !DILocalVariable(name: "f", scope: !836, file: !2, line: 1350, type: !257)
!836 = distinct !DILexicalBlock(scope: !833, file: !2, line: 1350, column: 15)
!837 = !DILocalVariable(name: "pad_width", scope: !833, file: !2, line: 1352, type: !257)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !815, file: !2, line: 1314, type: !241, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1327, type: !24, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !498, isLocal: true, isDefinition: true)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !857, !858, !859, !860, !864, !867, !870, !871, !873, !876, !877, !879, !882, !883}
!845 = !DILocalVariable(name: "argc", arg: 1, scope: !155, file: !2, line: 1677, type: !158)
!846 = !DILocalVariable(name: "argv", arg: 2, scope: !155, file: !2, line: 1677, type: !159)
!847 = !DILocalVariable(name: "n_files", scope: !155, file: !2, line: 1679, type: !158)
!848 = !DILocalVariable(name: "l_c_m", scope: !155, file: !2, line: 1680, type: !158)
!849 = !DILocalVariable(name: "desired_width", scope: !155, file: !2, line: 1681, type: !257)
!850 = !DILocalVariable(name: "modern", scope: !155, file: !2, line: 1682, type: !241)
!851 = !DILocalVariable(name: "ok", scope: !155, file: !2, line: 1683, type: !241)
!852 = !DILocalVariable(name: "width_per_block", scope: !155, file: !2, line: 1684, type: !257)
!853 = !DILocalVariable(name: "max_bytes_to_format", scope: !155, file: !2, line: 1689, type: !366)
!854 = !DILocalVariable(name: "pseudo_start", scope: !155, file: !2, line: 1693, type: !366)
!855 = !DILocalVariable(name: "tmp", scope: !856, file: !2, line: 1705, type: !366)
!856 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1704, column: 5)
!857 = !DILocalVariable(name: "s_err", scope: !856, file: !2, line: 1706, type: !163)
!858 = !DILocalVariable(name: "oi", scope: !856, file: !2, line: 1707, type: !158)
!859 = !DILocalVariable(name: "c", scope: !856, file: !2, line: 1708, type: !158)
!860 = !DILocalVariable(name: "i", scope: !861, file: !2, line: 1769, type: !257)
!861 = distinct !DILexicalBlock(scope: !862, file: !2, line: 1765, column: 13)
!862 = distinct !DILexicalBlock(scope: !863, file: !2, line: 1762, column: 15)
!863 = distinct !DILexicalBlock(scope: !856, file: !2, line: 1713, column: 9)
!864 = !DILocalVariable(name: "w_tmp", scope: !865, file: !2, line: 1847, type: !366)
!865 = distinct !DILexicalBlock(scope: !866, file: !2, line: 1846, column: 13)
!866 = distinct !DILexicalBlock(scope: !863, file: !2, line: 1841, column: 15)
!867 = !DILocalVariable(name: "o1", scope: !868, file: !2, line: 1894, type: !366)
!868 = distinct !DILexicalBlock(scope: !869, file: !2, line: 1893, column: 5)
!869 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1892, column: 7)
!870 = !DILocalVariable(name: "o2", scope: !868, file: !2, line: 1895, type: !366)
!871 = !DILocalVariable(name: "i", scope: !872, file: !2, line: 2027, type: !257)
!872 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2027, column: 3)
!873 = !DILocalVariable(name: "fields_per_block", scope: !874, file: !2, line: 2029, type: !257)
!874 = distinct !DILexicalBlock(scope: !875, file: !2, line: 2028, column: 5)
!875 = distinct !DILexicalBlock(scope: !872, file: !2, line: 2027, column: 3)
!876 = !DILocalVariable(name: "block_width", scope: !874, file: !2, line: 2032, type: !257)
!877 = !DILocalVariable(name: "i", scope: !878, file: !2, line: 2036, type: !257)
!878 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2036, column: 3)
!879 = !DILocalVariable(name: "fields_per_block", scope: !880, file: !2, line: 2038, type: !257)
!880 = distinct !DILexicalBlock(scope: !881, file: !2, line: 2037, column: 5)
!881 = distinct !DILexicalBlock(scope: !878, file: !2, line: 2036, column: 3)
!882 = !DILocalVariable(name: "block_width", scope: !880, file: !2, line: 2039, type: !257)
!883 = !DILabel(scope: !155, name: "cleanup", file: !2, line: 2058)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 120, elements: !354)
!885 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!886 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!887 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!888 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!889 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!890 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!891 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!892 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !895, line: 3, type: !353, isLocal: true, isDefinition: true)
!895 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "Version", scope: !898, file: !895, line: 3, type: !246, isLocal: false, isDefinition: true)
!898 = distinct !DICompileUnit(language: DW_LANG_C11, file: !895, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !899, splitDebugInlining: false, nameTableKind: None)
!899 = !{!893, !896}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !902, file: !903, line: 65, type: !925, isLocal: false, isDefinition: true)
!902 = distinct !DICompileUnit(language: DW_LANG_C11, file: !903, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !904, retainedTypes: !905, globals: !906, splitDebugInlining: false, nameTableKind: None)
!903 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!904 = !{!225}
!905 = !{!240, !246, !252}
!906 = !{!900, !907, !909, !911, !916, !921, !923}
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !903, line: 141, type: !522, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !903, line: 141, type: !585, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !903, line: 142, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 29)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !903, line: 160, type: !918, isLocal: true, isDefinition: true)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 21)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !903, line: 165, type: !527, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !903, line: 170, type: !491, isLocal: true, isDefinition: true)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !926, line: 69, baseType: !927)
!926 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null}
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "file_name", scope: !932, file: !933, line: 45, type: !246, isLocal: true, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C11, file: !933, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !934, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!934 = !{!935, !937, !939, !941, !930, !943}
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !933, line: 121, type: !522, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !933, line: 121, type: !592, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !933, line: 123, type: !522, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !933, line: 126, type: !24, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !932, file: !933, line: 55, type: !241, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !947, file: !948, line: 66, type: !927, isLocal: false, isDefinition: true)
!947 = distinct !DICompileUnit(language: DW_LANG_C11, file: !948, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !949, globals: !950, splitDebugInlining: false, nameTableKind: None)
!948 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!949 = !{!240, !252}
!950 = !{!951, !953, !973, !975, !977, !979, !945, !981, !983, !985, !987, !989}
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !948, line: 272, type: !491, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "old_file_name", scope: !955, file: !948, line: 304, type: !246, isLocal: true, isDefinition: true)
!955 = distinct !DISubprogram(name: "verror_at_line", scope: !948, file: !948, line: 298, type: !956, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !947, retainedNodes: !966)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !158, !158, !246, !165, !246, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !960)
!960 = !{!961, !963, !964, !965}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !959, file: !962, baseType: !165, size: 32)
!962 = !DIFile(filename: "lib/error.c", directory: "/src")
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !959, file: !962, baseType: !165, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !959, file: !962, baseType: !240, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !959, file: !962, baseType: !240, size: 64, offset: 128)
!966 = !{!967, !968, !969, !970, !971, !972}
!967 = !DILocalVariable(name: "status", arg: 1, scope: !955, file: !948, line: 298, type: !158)
!968 = !DILocalVariable(name: "errnum", arg: 2, scope: !955, file: !948, line: 298, type: !158)
!969 = !DILocalVariable(name: "file_name", arg: 3, scope: !955, file: !948, line: 298, type: !246)
!970 = !DILocalVariable(name: "line_number", arg: 4, scope: !955, file: !948, line: 298, type: !165)
!971 = !DILocalVariable(name: "message", arg: 5, scope: !955, file: !948, line: 298, type: !246)
!972 = !DILocalVariable(name: "args", arg: 6, scope: !955, file: !948, line: 298, type: !958)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "old_line_number", scope: !955, file: !948, line: 305, type: !165, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !948, line: 338, type: !498, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !948, line: 346, type: !527, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !948, line: 346, type: !287, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "error_message_count", scope: !947, file: !948, line: 69, type: !165, isLocal: false, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !947, file: !948, line: 295, type: !158, isLocal: false, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !948, line: 208, type: !522, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !948, line: 208, type: !918, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !948, line: 214, type: !491, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "program_name", scope: !993, file: !994, line: 31, type: !246, isLocal: false, isDefinition: true)
!993 = distinct !DICompileUnit(language: DW_LANG_C11, file: !994, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !995, globals: !996, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!995 = !{!160}
!996 = !{!991, !997, !999}
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !994, line: 46, type: !527, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !994, line: 49, type: !498, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1003, file: !1004, line: 46, type: !1031, isLocal: true, isDefinition: true)
!1003 = distinct !DISubprogram(name: "proper_name_lite", scope: !1004, file: !1004, line: 38, type: !1005, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1007, retainedNodes: !1009)
!1004 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!246, !246, !246}
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1004, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!1008 = !{!1001}
!1009 = !{!1010, !1011, !1012, !1013, !1018}
!1010 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1003, file: !1004, line: 38, type: !246)
!1011 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1003, file: !1004, line: 38, type: !246)
!1012 = !DILocalVariable(name: "translation", scope: !1003, file: !1004, line: 40, type: !246)
!1013 = !DILocalVariable(name: "w", scope: !1003, file: !1004, line: 47, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1015, line: 37, baseType: !1016)
!1015 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !369, line: 57, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !369, line: 42, baseType: !165)
!1018 = !DILocalVariable(name: "mbs", scope: !1003, file: !1004, line: 48, type: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1020, line: 6, baseType: !1021)
!1020 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1022, line: 21, baseType: !1023)
!1022 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1022, line: 13, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1023, file: !1022, line: 15, baseType: !158, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1023, file: !1022, line: 20, baseType: !1027, size: 32, offset: 32)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1023, file: !1022, line: 16, size: 32, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1027, file: !1022, line: 18, baseType: !165, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1027, file: !1022, line: 19, baseType: !498, size: 32)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 16, elements: !288)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 78, type: !527, isLocal: true, isDefinition: true)
!1034 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 79, type: !503, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 80, type: !323, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 81, type: !323, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 82, type: !442, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 83, type: !287, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 84, type: !527, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 85, type: !522, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 86, type: !522, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 87, type: !527, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1055, file: !1034, line: 76, type: !1127, isLocal: false, isDefinition: true)
!1055 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1034, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1056, retainedTypes: !1062, globals: !1063, splitDebugInlining: false, nameTableKind: None)
!1056 = !{!225, !1057, !210}
!1057 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !226, line: 254, baseType: !165, size: 32, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1060 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1061 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1062 = !{!158, !248, !249}
!1063 = !{!1032, !1035, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1064, !1068, !1078, !1080, !1085, !1087, !1089, !1091, !1093, !1116, !1123, !1125}
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1055, file: !1034, line: 92, type: !1066, isLocal: false, isDefinition: true)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 320, elements: !271)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1055, file: !1034, line: 1040, type: !1070, isLocal: false, isDefinition: true)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1034, line: 56, size: 448, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1076, !1077}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1070, file: !1034, line: 59, baseType: !225, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1070, file: !1034, line: 62, baseType: !158, size: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1070, file: !1034, line: 66, baseType: !1075, size: 256, offset: 64)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 256, elements: !528)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1070, file: !1034, line: 69, baseType: !246, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1070, file: !1034, line: 72, baseType: !246, size: 64, offset: 384)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1055, file: !1034, line: 107, type: !1070, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "slot0", scope: !1055, file: !1034, line: 831, type: !1082, isLocal: true, isDefinition: true)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 256)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 321, type: !287, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 357, type: !287, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 358, type: !287, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 199, type: !522, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(name: "quote", scope: !1095, file: !1034, line: 228, type: !1114, isLocal: true, isDefinition: true)
!1095 = distinct !DISubprogram(name: "gettext_quote", scope: !1034, file: !1034, line: 197, type: !1096, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1055, retainedNodes: !1098)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!246, !246, !225}
!1098 = !{!1099, !1100, !1101, !1102, !1103}
!1099 = !DILocalVariable(name: "msgid", arg: 1, scope: !1095, file: !1034, line: 197, type: !246)
!1100 = !DILocalVariable(name: "s", arg: 2, scope: !1095, file: !1034, line: 197, type: !225)
!1101 = !DILocalVariable(name: "translation", scope: !1095, file: !1034, line: 199, type: !246)
!1102 = !DILocalVariable(name: "w", scope: !1095, file: !1034, line: 229, type: !1014)
!1103 = !DILocalVariable(name: "mbs", scope: !1095, file: !1034, line: 230, type: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1020, line: 6, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1022, line: 21, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1022, line: 13, size: 64, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1106, file: !1022, line: 15, baseType: !158, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1106, file: !1022, line: 20, baseType: !1110, size: 32, offset: 32)
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1106, file: !1022, line: 16, size: 32, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1110, file: !1022, line: 18, baseType: !165, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1110, file: !1022, line: 19, baseType: !498, size: 32)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 64, elements: !1115)
!1115 = !{!289, !500}
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "slotvec", scope: !1055, file: !1034, line: 834, type: !1118, isLocal: true, isDefinition: true)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1034, line: 823, size: 128, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1119, file: !1034, line: 825, baseType: !249, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1119, file: !1034, line: 826, baseType: !160, size: 64, offset: 64)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "nslots", scope: !1055, file: !1034, line: 832, type: !158, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1055, file: !1034, line: 833, type: !1119, isLocal: true, isDefinition: true)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 704, elements: !603)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 67, type: !592, isLocal: true, isDefinition: true)
!1130 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 69, type: !522, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 83, type: !522, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 83, type: !498, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 85, type: !287, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 88, type: !1141, isLocal: true, isDefinition: true)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1142)
!1142 = !{!1143}
!1143 = !DISubrange(count: 171)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 88, type: !1146, isLocal: true, isDefinition: true)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 34)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 105, type: !566, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 109, type: !661, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 113, type: !1155, isLocal: true, isDefinition: true)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1156)
!1156 = !{!1157}
!1157 = !DISubrange(count: 28)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 120, type: !800, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 127, type: !1162, isLocal: true, isDefinition: true)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1163)
!1163 = !{!1164}
!1164 = !DISubrange(count: 36)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 134, type: !546, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 142, type: !110, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 150, type: !1171, isLocal: true, isDefinition: true)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1172)
!1172 = !{!1173}
!1173 = !DISubrange(count: 48)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 159, type: !1176, isLocal: true, isDefinition: true)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 52)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 170, type: !95, isLocal: true, isDefinition: true)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 248, type: !442, isLocal: true, isDefinition: true)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 248, type: !571, isLocal: true, isDefinition: true)
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 254, type: !442, isLocal: true, isDefinition: true)
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 254, type: !318, isLocal: true, isDefinition: true)
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 254, type: !546, isLocal: true, isDefinition: true)
!1191 = !DIGlobalVariableExpression(var: !1192, expr: !DIExpression())
!1192 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 259, type: !3, isLocal: true, isDefinition: true)
!1193 = !DIGlobalVariableExpression(var: !1194, expr: !DIExpression())
!1194 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 259, type: !913, isLocal: true, isDefinition: true)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1197, file: !1198, line: 26, type: !1200, isLocal: false, isDefinition: true)
!1197 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1198, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1199, splitDebugInlining: false, nameTableKind: None)
!1198 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1199 = !{!1195}
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 376, elements: !1201)
!1201 = !{!1202}
!1202 = !DISubrange(count: 47)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 34, type: !24, isLocal: true, isDefinition: true)
!1205 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 34, type: !522, isLocal: true, isDefinition: true)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 34, type: !333, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1212, line: 47, type: !522, isLocal: true, isDefinition: true)
!1212 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1212, line: 47, type: !800, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1217, file: !1218, line: 24, type: !1220, isLocal: false, isDefinition: true)
!1217 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1218, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1219, splitDebugInlining: false, nameTableKind: None)
!1218 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1219 = !{!1215}
!1220 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(scope: null, file: !1223, line: 60, type: !585, isLocal: true, isDefinition: true)
!1223 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !1223, line: 65, type: !100, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !1223, line: 69, type: !913, isLocal: true, isDefinition: true)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !1223, line: 73, type: !24, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(scope: null, file: !1223, line: 86, type: !522, isLocal: true, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !1234, line: 108, type: !265, isLocal: true, isDefinition: true)
!1234 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(name: "internal_state", scope: !1237, file: !1234, line: 97, type: !1240, isLocal: true, isDefinition: true)
!1237 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1234, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1238, globals: !1239, splitDebugInlining: false, nameTableKind: None)
!1238 = !{!240, !249, !252}
!1239 = !{!1232, !1235}
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1020, line: 6, baseType: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1022, line: 21, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1022, line: 13, size: 64, elements: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1242, file: !1022, line: 15, baseType: !158, size: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1242, file: !1022, line: 20, baseType: !1246, size: 32, offset: 32)
!1246 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1242, file: !1022, line: 16, size: 32, elements: !1247)
!1247 = !{!1248, !1249}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1246, file: !1022, line: 18, baseType: !165, size: 32)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1246, file: !1022, line: 19, baseType: !498, size: 32)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1252, line: 4617, type: !498, isLocal: true, isDefinition: true)
!1252 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1252, line: 5292, type: !503, isLocal: true, isDefinition: true)
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(name: "decimal_format", scope: !1257, file: !1252, line: 5889, type: !1719, isLocal: true, isDefinition: true)
!1257 = distinct !DISubprogram(name: "vasnprintf", scope: !1252, file: !1252, line: 2459, type: !1258, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1269, retainedNodes: !1804)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!160, !160, !1260, !246, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1263)
!1263 = !{!1264, !1266, !1267, !1268}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1262, file: !1265, baseType: !165, size: 32)
!1265 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src")
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1262, file: !1265, baseType: !165, size: 32, offset: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1262, file: !1265, baseType: !240, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1262, file: !1265, baseType: !240, size: 64, offset: 128)
!1269 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1252, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1270, retainedTypes: !1707, globals: !1716, splitDebugInlining: false, nameTableKind: None)
!1270 = !{!1271, !1321}
!1271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1272, line: 47, baseType: !165, size: 32, elements: !1273)
!1272 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1273 = !{!1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320}
!1274 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1275 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1276 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1277 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1278 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1279 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1280 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1281 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1282 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1283 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1284 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1285 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1286 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1287 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1288 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1289 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1290 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1291 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1292 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1293 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1294 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1295 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1296 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1297 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1298 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1299 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1300 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1301 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1302 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1303 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1304 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1305 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1306 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1307 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1308 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1309 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1310 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1311 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1312 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1313 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1314 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1315 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1316 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1317 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1318 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1319 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1320 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1322, line: 41, baseType: !165, size: 32, elements: !1323)
!1322 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!1323 = !{!1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706}
!1324 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!1325 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!1326 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!1327 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!1328 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!1329 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!1330 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!1331 = !DIEnumerator(name: "DAY_1", value: 131079)
!1332 = !DIEnumerator(name: "DAY_2", value: 131080)
!1333 = !DIEnumerator(name: "DAY_3", value: 131081)
!1334 = !DIEnumerator(name: "DAY_4", value: 131082)
!1335 = !DIEnumerator(name: "DAY_5", value: 131083)
!1336 = !DIEnumerator(name: "DAY_6", value: 131084)
!1337 = !DIEnumerator(name: "DAY_7", value: 131085)
!1338 = !DIEnumerator(name: "ABMON_1", value: 131086)
!1339 = !DIEnumerator(name: "ABMON_2", value: 131087)
!1340 = !DIEnumerator(name: "ABMON_3", value: 131088)
!1341 = !DIEnumerator(name: "ABMON_4", value: 131089)
!1342 = !DIEnumerator(name: "ABMON_5", value: 131090)
!1343 = !DIEnumerator(name: "ABMON_6", value: 131091)
!1344 = !DIEnumerator(name: "ABMON_7", value: 131092)
!1345 = !DIEnumerator(name: "ABMON_8", value: 131093)
!1346 = !DIEnumerator(name: "ABMON_9", value: 131094)
!1347 = !DIEnumerator(name: "ABMON_10", value: 131095)
!1348 = !DIEnumerator(name: "ABMON_11", value: 131096)
!1349 = !DIEnumerator(name: "ABMON_12", value: 131097)
!1350 = !DIEnumerator(name: "MON_1", value: 131098)
!1351 = !DIEnumerator(name: "MON_2", value: 131099)
!1352 = !DIEnumerator(name: "MON_3", value: 131100)
!1353 = !DIEnumerator(name: "MON_4", value: 131101)
!1354 = !DIEnumerator(name: "MON_5", value: 131102)
!1355 = !DIEnumerator(name: "MON_6", value: 131103)
!1356 = !DIEnumerator(name: "MON_7", value: 131104)
!1357 = !DIEnumerator(name: "MON_8", value: 131105)
!1358 = !DIEnumerator(name: "MON_9", value: 131106)
!1359 = !DIEnumerator(name: "MON_10", value: 131107)
!1360 = !DIEnumerator(name: "MON_11", value: 131108)
!1361 = !DIEnumerator(name: "MON_12", value: 131109)
!1362 = !DIEnumerator(name: "AM_STR", value: 131110)
!1363 = !DIEnumerator(name: "PM_STR", value: 131111)
!1364 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!1365 = !DIEnumerator(name: "D_FMT", value: 131113)
!1366 = !DIEnumerator(name: "T_FMT", value: 131114)
!1367 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!1368 = !DIEnumerator(name: "ERA", value: 131116)
!1369 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!1370 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!1371 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!1372 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!1373 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!1374 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!1375 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!1376 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!1377 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!1378 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!1379 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!1380 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
