; ModuleID = 'src/pathchk.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [47 x i8] c"Diagnose invalid or non-portable file names.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"pathchk\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [39 x i8] c"  -p     check for most POSIX systems\0A\00", align 1, !dbg !22

!129 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!130 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!131 = !{!132, !133, !74, !134, !135, !138, !140}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !136, line: 46, baseType: !137)
!136 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!137 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !{!0, !7, !12, !17, !22, !24, !29, !34, !39, !44, !49, !54, !59, !142, !147, !152, !157, !162, !164, !247, !252, !254, !256, !261, !266, !268, !270, !275, !277, !279, !281, !286, !288, !290, !292, !294, !296, !298, !300, !305, !310, !315, !320, !322, !324, !326, !328, !330, !335, !337, !339, !344, !349, !354, !356, !358, !360, !64, !362, !364, !366, !368, !370, !375, !377, !382, !387, !392}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 14)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 12)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 13)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !154, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !166, file: !73, line: 575, type: !74, isLocal: true, isDefinition: true)
!166 = distinct !DISubprogram(name: "oputs_", scope: !73, file: !73, line: 573, type: !167, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !169)
!167 = !DISubroutineType(cc: DW_CC_nocall, types: !168)
!168 = !{null, !138, !138}
!169 = !{!170, !171, !172, !175, !177, !178, !179, !183, !184, !185, !186, !188, !241, !242, !243, !245, !246}
!170 = !DILocalVariable(name: "program", arg: 1, scope: !166, file: !73, line: 573, type: !138)
!171 = !DILocalVariable(name: "option", arg: 2, scope: !166, file: !73, line: 573, type: !138)
!172 = !DILocalVariable(name: "term", scope: !173, file: !73, line: 585, type: !138)
!173 = distinct !DILexicalBlock(scope: !174, file: !73, line: 582, column: 5)
!174 = distinct !DILexicalBlock(scope: !166, file: !73, line: 581, column: 7)
!175 = !DILocalVariable(name: "double_space", scope: !166, file: !73, line: 594, type: !176)
!176 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!177 = !DILocalVariable(name: "first_word", scope: !166, file: !73, line: 595, type: !138)
!178 = !DILocalVariable(name: "option_text", scope: !166, file: !73, line: 596, type: !138)
!179 = !DILocalVariable(name: "s", scope: !180, file: !73, line: 608, type: !138)
!180 = distinct !DILexicalBlock(scope: !181, file: !73, line: 605, column: 5)
!181 = distinct !DILexicalBlock(scope: !182, file: !73, line: 604, column: 12)
!182 = distinct !DILexicalBlock(scope: !166, file: !73, line: 597, column: 7)
!183 = !DILocalVariable(name: "spaces", scope: !180, file: !73, line: 609, type: !135)
!184 = !DILocalVariable(name: "anchor_len", scope: !166, file: !73, line: 620, type: !135)
!185 = !DILocalVariable(name: "desc_text", scope: !166, file: !73, line: 625, type: !138)
!186 = !DILocalVariable(name: "__ptr", scope: !187, file: !73, line: 644, type: !138)
!187 = distinct !DILexicalBlock(scope: !166, file: !73, line: 644, column: 3)
!188 = !DILocalVariable(name: "__stream", scope: !187, file: !73, line: 644, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !191, line: 7, baseType: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !193, line: 49, size: 1728, elements: !194)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !210, !212, !213, !214, !218, !219, !221, !222, !225, !227, !230, !233, !234, !235, !236, !237}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !192, file: !193, line: 51, baseType: !74, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !192, file: !193, line: 54, baseType: !132, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !192, file: !193, line: 55, baseType: !132, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !192, file: !193, line: 56, baseType: !132, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !192, file: !193, line: 57, baseType: !132, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !192, file: !193, line: 58, baseType: !132, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !192, file: !193, line: 59, baseType: !132, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !192, file: !193, line: 60, baseType: !132, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !192, file: !193, line: 61, baseType: !132, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !192, file: !193, line: 64, baseType: !132, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !192, file: !193, line: 65, baseType: !132, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !192, file: !193, line: 66, baseType: !132, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !192, file: !193, line: 68, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !193, line: 36, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !192, file: !193, line: 70, baseType: !211, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !192, file: !193, line: 72, baseType: !74, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !192, file: !193, line: 73, baseType: !74, size: 32, offset: 928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !192, file: !193, line: 74, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !216, line: 152, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!217 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !192, file: !193, line: 77, baseType: !134, size: 16, offset: 1024)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !192, file: !193, line: 78, baseType: !220, size: 8, offset: 1040)
!220 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !192, file: !193, line: 79, baseType: !46, size: 8, offset: 1048)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !192, file: !193, line: 81, baseType: !223, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !193, line: 43, baseType: null)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !192, file: !193, line: 89, baseType: !226, size: 64, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !216, line: 153, baseType: !217)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !192, file: !193, line: 91, baseType: !228, size: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !193, line: 37, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !192, file: !193, line: 92, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !193, line: 38, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !192, file: !193, line: 93, baseType: !211, size: 64, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !192, file: !193, line: 94, baseType: !133, size: 64, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !192, file: !193, line: 95, baseType: !135, size: 64, offset: 1472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !192, file: !193, line: 96, baseType: !74, size: 32, offset: 1536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !192, file: !193, line: 98, baseType: !238, size: 160, offset: 1568)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 20)
!241 = !DILocalVariable(name: "__cnt", scope: !187, file: !73, line: 644, type: !135)
!242 = !DILocalVariable(name: "url_program", scope: !166, file: !73, line: 648, type: !138)
!243 = !DILocalVariable(name: "__ptr", scope: !244, file: !73, line: 686, type: !138)
!244 = distinct !DILexicalBlock(scope: !166, file: !73, line: 686, column: 3)
!245 = !DILocalVariable(name: "__stream", scope: !244, file: !73, line: 686, type: !189)
!246 = !DILocalVariable(name: "__cnt", scope: !244, file: !73, line: 686, type: !135)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !73, line: 585, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 5)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !73, line: 586, type: !249, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !73, line: 595, type: !61, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !73, line: 620, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 6)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !73, line: 648, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !73, line: 648, type: !249, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !73, line: 649, type: !61, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !73, line: 649, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 3)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !73, line: 650, type: !249, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !73, line: 651, type: !258, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !73, line: 651, type: !258, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !73, line: 652, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 7)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !73, line: 653, type: !19, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !73, line: 654, type: !51, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !73, line: 655, type: !51, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !73, line: 656, type: !51, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !73, line: 657, type: !51, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !73, line: 663, type: !283, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !73, line: 664, type: !51, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !73, line: 669, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 17)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !73, line: 669, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 40)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !73, line: 676, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 15)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !73, line: 676, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 61)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !73, line: 679, type: !272, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !73, line: 683, type: !249, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !73, line: 688, type: !249, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !73, line: 691, type: !19, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !73, line: 839, type: !154, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !73, line: 840, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 22)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !73, line: 841, type: !312, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !73, line: 862, type: !61, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !73, line: 868, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 71)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !73, line: 875, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 27)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !73, line: 877, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 51)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !73, line: 877, type: !149, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !149, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !249, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !19, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !154, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !2, line: 295, type: !272, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !263, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !263, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 49)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !372, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !2, line: 408, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 59)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !2, line: 173, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 43)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 67)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 198, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 42)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 1024, elements: !62)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !400, line: 50, size: 256, elements: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!401 = !{!402, !403, !404, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !400, line: 52, baseType: !138, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !399, file: !400, line: 55, baseType: !74, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !400, line: 56, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !399, file: !400, line: 57, baseType: !74, size: 32, offset: 192)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !409, line: 3, type: !312, isLocal: true, isDefinition: true)
!409 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "Version", scope: !412, file: !409, line: 3, type: !138, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !413, splitDebugInlining: false, nameTableKind: None)
!413 = !{!407, !410}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "file_name", scope: !416, file: !417, line: 45, type: !138, isLocal: true, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C11, file: !417, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !418, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!418 = !{!419, !421, !423, !425, !414, !427}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !417, line: 121, type: !283, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !417, line: 121, type: !149, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !417, line: 123, type: !283, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !417, line: 126, type: !272, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !416, file: !417, line: 55, type: !176, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !431, file: !432, line: 66, type: !478, isLocal: false, isDefinition: true)
!431 = distinct !DICompileUnit(language: DW_LANG_C11, file: !432, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !433, globals: !434, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!433 = !{!133, !140}
!434 = !{!435, !437, !457, !459, !461, !463, !429, !465, !467, !469, !471, !476}
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !432, line: 272, type: !249, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "old_file_name", scope: !439, file: !432, line: 304, type: !138, isLocal: true, isDefinition: true)
!439 = distinct !DISubprogram(name: "verror_at_line", scope: !432, file: !432, line: 298, type: !440, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !431, retainedNodes: !450)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !74, !74, !138, !69, !138, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !444)
!444 = !{!445, !447, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !443, file: !446, baseType: !69, size: 32)
!446 = !DIFile(filename: "lib/error.c", directory: "/src")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !443, file: !446, baseType: !69, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !443, file: !446, baseType: !133, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !443, file: !446, baseType: !133, size: 64, offset: 128)
!450 = !{!451, !452, !453, !454, !455, !456}
!451 = !DILocalVariable(name: "status", arg: 1, scope: !439, file: !432, line: 298, type: !74)
!452 = !DILocalVariable(name: "errnum", arg: 2, scope: !439, file: !432, line: 298, type: !74)
!453 = !DILocalVariable(name: "file_name", arg: 3, scope: !439, file: !432, line: 298, type: !138)
!454 = !DILocalVariable(name: "line_number", arg: 4, scope: !439, file: !432, line: 298, type: !69)
!455 = !DILocalVariable(name: "message", arg: 5, scope: !439, file: !432, line: 298, type: !138)
!456 = !DILocalVariable(name: "args", arg: 6, scope: !439, file: !432, line: 298, type: !442)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "old_line_number", scope: !439, file: !432, line: 305, type: !69, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !432, line: 338, type: !61, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !432, line: 346, type: !19, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !432, line: 346, type: !263, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "error_message_count", scope: !431, file: !432, line: 69, type: !69, isLocal: false, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !431, file: !432, line: 295, type: !74, isLocal: false, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !432, line: 208, type: !283, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !432, line: 208, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 21)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !432, line: 214, type: !249, isLocal: true, isDefinition: true)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "internal_state", scope: !483, file: !484, line: 24, type: !487, isLocal: true, isDefinition: true)
!483 = distinct !DICompileUnit(language: DW_LANG_C11, file: !484, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !485, globals: !486, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/mbrlen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c924d5b17c62ecd87f5e0fdbef8c37ec")
!485 = !{!133}
!486 = !{!481}
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !491)
!490 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !491, file: !490, line: 15, baseType: !74, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !491, file: !490, line: 20, baseType: !495, size: 32, offset: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !491, file: !490, line: 16, size: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !495, file: !490, line: 18, baseType: !69, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !495, file: !490, line: 19, baseType: !61, size: 32)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "program_name", scope: !501, file: !502, line: 31, type: !138, isLocal: false, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C11, file: !502, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !503, globals: !504, splitDebugInlining: false, nameTableKind: None)
!502 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!503 = !{!132}
!504 = !{!499, !505, !507}
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !502, line: 46, type: !19, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !502, line: 49, type: !61, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "utf07FF", scope: !511, file: !512, line: 46, type: !537, isLocal: true, isDefinition: true)
!511 = distinct !DISubprogram(name: "proper_name_lite", scope: !512, file: !512, line: 38, type: !513, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !515, retainedNodes: !517)
!512 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!513 = !DISubroutineType(types: !514)
!514 = !{!138, !138, !138}
!515 = distinct !DICompileUnit(language: DW_LANG_C11, file: !512, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !516, splitDebugInlining: false, nameTableKind: None)
!516 = !{!509}
!517 = !{!518, !519, !520, !521, !526}
!518 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !511, file: !512, line: 38, type: !138)
!519 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !511, file: !512, line: 38, type: !138)
!520 = !DILocalVariable(name: "translation", scope: !511, file: !512, line: 40, type: !138)
!521 = !DILocalVariable(name: "w", scope: !511, file: !512, line: 47, type: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !523, line: 37, baseType: !524)
!523 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !216, line: 57, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !216, line: 42, baseType: !69)
!526 = !DILocalVariable(name: "mbs", scope: !511, file: !512, line: 48, type: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !529, file: !490, line: 15, baseType: !74, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !529, file: !490, line: 20, baseType: !533, size: 32, offset: 32)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !490, line: 16, size: 32, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !533, file: !490, line: 18, baseType: !69, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !533, file: !490, line: 19, baseType: !61, size: 32)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 16, elements: !264)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !540, line: 78, type: !19, isLocal: true, isDefinition: true)
!540 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !540, line: 79, type: !258, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !540, line: 80, type: !159, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !540, line: 81, type: !159, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !540, line: 82, type: !238, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !540, line: 83, type: !263, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !540, line: 84, type: !19, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !540, line: 85, type: !283, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !540, line: 86, type: !283, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !540, line: 87, type: !19, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !561, file: !540, line: 76, type: !633, isLocal: false, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C11, file: !540, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !562, retainedTypes: !568, globals: !569, splitDebugInlining: false, nameTableKind: None)
!562 = !{!93, !563, !78}
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !94, line: 254, baseType: !69, size: 32, elements: !564)
!564 = !{!565, !566, !567}
!565 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!566 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!567 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!568 = !{!74, !134, !135}
!569 = !{!538, !541, !543, !545, !547, !549, !551, !553, !555, !557, !559, !570, !574, !584, !586, !591, !593, !595, !597, !599, !622, !629, !631}
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !561, file: !540, line: 92, type: !572, isLocal: false, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 320, elements: !52)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !561, file: !540, line: 1040, type: !576, isLocal: false, isDefinition: true)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !540, line: 56, size: 448, elements: !577)
!577 = !{!578, !579, !580, !582, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !576, file: !540, line: 59, baseType: !93, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !576, file: !540, line: 62, baseType: !74, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !576, file: !540, line: 66, baseType: !581, size: 256, offset: 64)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !20)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !576, file: !540, line: 69, baseType: !138, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !576, file: !540, line: 72, baseType: !138, size: 64, offset: 384)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !561, file: !540, line: 107, type: !576, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "slot0", scope: !561, file: !540, line: 831, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 256)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !540, line: 321, type: !263, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !540, line: 357, type: !263, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !540, line: 358, type: !263, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !540, line: 199, type: !283, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "quote", scope: !601, file: !540, line: 228, type: !620, isLocal: true, isDefinition: true)
!601 = distinct !DISubprogram(name: "gettext_quote", scope: !540, file: !540, line: 197, type: !602, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !561, retainedNodes: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{!138, !138, !93}
!604 = !{!605, !606, !607, !608, !609}
!605 = !DILocalVariable(name: "msgid", arg: 1, scope: !601, file: !540, line: 197, type: !138)
!606 = !DILocalVariable(name: "s", arg: 2, scope: !601, file: !540, line: 197, type: !93)
!607 = !DILocalVariable(name: "translation", scope: !601, file: !540, line: 199, type: !138)
!608 = !DILocalVariable(name: "w", scope: !601, file: !540, line: 229, type: !522)
!609 = !DILocalVariable(name: "mbs", scope: !601, file: !540, line: 230, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !612, file: !490, line: 15, baseType: !74, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !612, file: !490, line: 20, baseType: !616, size: 32, offset: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !490, line: 16, size: 32, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !616, file: !490, line: 18, baseType: !69, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !616, file: !490, line: 19, baseType: !61, size: 32)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !621)
!621 = !{!265, !63}
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "slotvec", scope: !561, file: !540, line: 834, type: !624, isLocal: true, isDefinition: true)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !540, line: 823, size: 128, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !540, line: 825, baseType: !135, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !625, file: !540, line: 826, baseType: !132, size: 64, offset: 64)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "nslots", scope: !561, file: !540, line: 832, type: !74, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "slotvec0", scope: !561, file: !540, line: 833, type: !625, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 704, elements: !635)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!635 = !{!636}
!636 = !DISubrange(count: 11)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !639, line: 67, type: !149, isLocal: true, isDefinition: true)
!639 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !639, line: 69, type: !283, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !639, line: 83, type: !283, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !639, line: 83, type: !61, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !639, line: 85, type: !263, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !639, line: 88, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 171)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !639, line: 88, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 34)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !639, line: 105, type: !154, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !639, line: 109, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 23)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !639, line: 113, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 28)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !639, line: 120, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 32)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !639, line: 127, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 36)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !639, line: 134, type: !307, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !639, line: 142, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 44)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !639, line: 150, type: !26, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !639, line: 159, type: !691, isLocal: true, isDefinition: true)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 52)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !639, line: 170, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 60)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !639, line: 248, type: !238, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !639, line: 248, type: !332, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !639, line: 254, type: !238, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !639, line: 254, type: !144, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !639, line: 254, type: !307, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !639, line: 259, type: !3, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !639, line: 259, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 29)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !718, file: !719, line: 26, type: !721, isLocal: false, isDefinition: true)
!718 = distinct !DICompileUnit(language: DW_LANG_C11, file: !719, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !720, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!720 = !{!716}
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 376, elements: !15)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "exit_failure", scope: !724, file: !725, line: 24, type: !727, isLocal: false, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !726, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!726 = !{!722}
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !74)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !730, line: 34, type: !272, isLocal: true, isDefinition: true)
!730 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !730, line: 34, type: !283, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !730, line: 34, type: !302, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !737, line: 35, type: !258, isLocal: true, isDefinition: true)
!737 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !740, line: 108, type: !46, isLocal: true, isDefinition: true)
!740 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "internal_state", scope: !743, file: !740, line: 97, type: !746, isLocal: true, isDefinition: true)
!743 = distinct !DICompileUnit(language: DW_LANG_C11, file: !740, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !744, globals: !745, splitDebugInlining: false, nameTableKind: None)
!744 = !{!133, !135, !140}
!745 = !{!738, !741}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !748, file: !490, line: 15, baseType: !74, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !748, file: !490, line: 20, baseType: !752, size: 32, offset: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !748, file: !490, line: 16, size: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !752, file: !490, line: 18, baseType: !69, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !752, file: !490, line: 19, baseType: !61, size: 32)
!756 = distinct !DICompileUnit(language: DW_LANG_C11, file: !757, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!757 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!758 = distinct !DICompileUnit(language: DW_LANG_C11, file: !759, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !760, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/mbrtowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bbc936af6884a5d6522de5c3d04ed069")
!760 = !{!135}
!761 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !762, retainedTypes: !485, globals: !766, splitDebugInlining: false, nameTableKind: None)
!762 = !{!763}
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 40, baseType: !69, size: 32, elements: !764)
!764 = !{!765}
!765 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!766 = !{!637, !640, !642, !644, !646, !648, !653, !658, !660, !665, !670, !675, !680, !682, !687, !689, !694, !699, !701, !703, !705, !707, !709, !711}
!767 = distinct !DICompileUnit(language: DW_LANG_C11, file: !768, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, retainedTypes: !800, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!769 = !{!770, !782}
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !771, file: !768, line: 188, baseType: !69, size: 32, elements: !780)
!771 = distinct !DISubprogram(name: "x2nrealloc", scope: !768, file: !768, line: 176, type: !772, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !767, retainedNodes: !775)
!772 = !DISubroutineType(types: !773)
!773 = !{!133, !133, !774, !135}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!775 = !{!776, !777, !778, !779}
!776 = !DILocalVariable(name: "p", arg: 1, scope: !771, file: !768, line: 176, type: !133)
!777 = !DILocalVariable(name: "pn", arg: 2, scope: !771, file: !768, line: 176, type: !774)
!778 = !DILocalVariable(name: "s", arg: 3, scope: !771, file: !768, line: 176, type: !135)
!779 = !DILocalVariable(name: "n", scope: !771, file: !768, line: 178, type: !135)
!780 = !{!781}
!781 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!782 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !783, file: !768, line: 228, baseType: !69, size: 32, elements: !780)
!783 = distinct !DISubprogram(name: "xpalloc", scope: !768, file: !768, line: 223, type: !784, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !767, retainedNodes: !790)
!784 = !DISubroutineType(types: !785)
!785 = !{!133, !133, !786, !787, !789, !787}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !788, line: 130, baseType: !789)
!788 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !136, line: 35, baseType: !217)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799}
!791 = !DILocalVariable(name: "pa", arg: 1, scope: !783, file: !768, line: 223, type: !133)
!792 = !DILocalVariable(name: "pn", arg: 2, scope: !783, file: !768, line: 223, type: !786)
!793 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !783, file: !768, line: 223, type: !787)
!794 = !DILocalVariable(name: "n_max", arg: 4, scope: !783, file: !768, line: 223, type: !789)
!795 = !DILocalVariable(name: "s", arg: 5, scope: !783, file: !768, line: 223, type: !787)
!796 = !DILocalVariable(name: "n0", scope: !783, file: !768, line: 230, type: !787)
!797 = !DILocalVariable(name: "n", scope: !783, file: !768, line: 237, type: !787)
!798 = !DILocalVariable(name: "nbytes", scope: !783, file: !768, line: 248, type: !787)
!799 = !DILocalVariable(name: "adjusted_nbytes", scope: !783, file: !768, line: 252, type: !787)
!800 = !{!132, !133, !176, !217, !137}
!801 = distinct !DICompileUnit(language: DW_LANG_C11, file: !730, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !802, splitDebugInlining: false, nameTableKind: None)
!802 = !{!728, !731, !733}
!803 = distinct !DICompileUnit(language: DW_LANG_C11, file: !804, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!804 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!805 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!807 = distinct !DICompileUnit(language: DW_LANG_C11, file: !808, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !485, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !810, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !485, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !737, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !812, splitDebugInlining: false, nameTableKind: None)
!812 = !{!813, !735}
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !737, line: 35, type: !263, isLocal: true, isDefinition: true)
!815 = distinct !DICompileUnit(language: DW_LANG_C11, file: !816, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !817, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!817 = !{!176, !137, !133}
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !819, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!819 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!820 = distinct !DICompileUnit(language: DW_LANG_C11, file: !821, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !485, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!822 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!823 = !{i32 7, !"Dwarf Version", i32 5}
!824 = !{i32 2, !"Debug Info Version", i32 3}
!825 = !{i32 1, !"wchar_size", i32 4}
!826 = !{i32 8, !"PIC Level", i32 2}
!827 = !{i32 7, !"PIE Level", i32 2}
!828 = !{i32 7, !"uwtable", i32 2}
!829 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 81, type: !830, scopeLine: 82, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !74}
!832 = !{!833}
!833 = !DILocalVariable(name: "status", arg: 1, scope: !829, file: !2, line: 81, type: !74)
!834 = !DILocation(line: 0, scope: !829)
!835 = !DILocation(line: 83, column: 14, scope: !836)
!836 = distinct !DILexicalBlock(scope: !829, file: !2, line: 83, column: 7)
!837 = !DILocation(line: 83, column: 7, scope: !829)
!838 = !DILocation(line: 84, column: 5, scope: !839)
!839 = distinct !DILexicalBlock(scope: !836, file: !2, line: 84, column: 5)
!840 = !{!841, !841, i64 0}
!841 = !{!"any pointer", !842, i64 0}
!842 = !{!"omnipotent char", !843, i64 0}
!843 = !{!"Simple C/C++ TBAA"}
!844 = !DILocation(line: 87, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !836, file: !2, line: 86, column: 5)
!846 = !DILocation(line: 88, column: 7, scope: !845)
!847 = !DILocation(line: 92, column: 7, scope: !845)
!848 = !DILocation(line: 95, column: 7, scope: !845)
!849 = !DILocation(line: 98, column: 7, scope: !845)
!850 = !DILocation(line: 102, column: 7, scope: !845)
!851 = !DILocation(line: 103, column: 7, scope: !845)
!852 = !DILocalVariable(name: "program", arg: 1, scope: !853, file: !73, line: 836, type: !138)
!853 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !73, file: !73, line: 836, type: !854, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !856)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !138}
!856 = !{!852, !857, !864, !865, !867, !868}
!857 = !DILocalVariable(name: "infomap", scope: !853, file: !73, line: 838, type: !858)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 896, elements: !284)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !853, file: !73, line: 838, size: 128, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !860, file: !73, line: 838, baseType: !138, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !860, file: !73, line: 838, baseType: !138, size: 64, offset: 64)
!864 = !DILocalVariable(name: "node", scope: !853, file: !73, line: 848, type: !138)
!865 = !DILocalVariable(name: "map_prog", scope: !853, file: !73, line: 849, type: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!867 = !DILocalVariable(name: "lc_messages", scope: !853, file: !73, line: 861, type: !138)
!868 = !DILocalVariable(name: "url_program", scope: !853, file: !73, line: 874, type: !138)
!869 = !DILocation(line: 0, scope: !853, inlinedAt: !870)
!870 = distinct !DILocation(line: 104, column: 7, scope: !845)
!871 = !DILocation(line: 857, column: 3, scope: !853, inlinedAt: !870)
!872 = !DILocation(line: 861, column: 29, scope: !853, inlinedAt: !870)
!873 = !DILocation(line: 862, column: 7, scope: !874, inlinedAt: !870)
!874 = distinct !DILexicalBlock(scope: !853, file: !73, line: 862, column: 7)
!875 = !DILocation(line: 862, column: 19, scope: !874, inlinedAt: !870)
!876 = !DILocation(line: 862, column: 22, scope: !874, inlinedAt: !870)
!877 = !DILocation(line: 862, column: 7, scope: !853, inlinedAt: !870)
!878 = !DILocation(line: 868, column: 7, scope: !879, inlinedAt: !870)
!879 = distinct !DILexicalBlock(scope: !874, file: !73, line: 863, column: 5)
!880 = !DILocation(line: 870, column: 5, scope: !879, inlinedAt: !870)
!881 = !DILocation(line: 875, column: 3, scope: !853, inlinedAt: !870)
!882 = !DILocation(line: 877, column: 3, scope: !853, inlinedAt: !870)
!883 = !DILocation(line: 106, column: 3, scope: !829)
!884 = !DISubprogram(name: "dcgettext", scope: !885, file: !885, line: 51, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!885 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!886 = !DISubroutineType(types: !887)
!887 = !{!132, !138, !138, !74}
!888 = !{}
!889 = !DISubprogram(name: "__fprintf_chk", scope: !890, file: !890, line: 93, type: !891, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!890 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!891 = !DISubroutineType(types: !892)
!892 = !{!74, !893, !74, !894, null}
!893 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !189)
!894 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !138)
!895 = !DISubprogram(name: "__printf_chk", scope: !890, file: !890, line: 95, type: !896, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!896 = !DISubroutineType(types: !897)
!897 = !{!74, !74, !894, null}
!898 = !DISubprogram(name: "fputs_unlocked", scope: !899, file: !899, line: 691, type: !900, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!899 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!900 = !DISubroutineType(types: !901)
!901 = !{!74, !894, !893}
!902 = !DILocation(line: 0, scope: !166)
!903 = !DILocation(line: 581, column: 7, scope: !174)
!904 = !{!905, !905, i64 0}
!905 = !{!"int", !842, i64 0}
!906 = !DILocation(line: 581, column: 19, scope: !174)
!907 = !DILocation(line: 581, column: 7, scope: !166)
!908 = !DILocation(line: 585, column: 26, scope: !173)
!909 = !DILocation(line: 0, scope: !173)
!910 = !DILocation(line: 586, column: 23, scope: !173)
!911 = !DILocation(line: 586, column: 28, scope: !173)
!912 = !DILocation(line: 586, column: 32, scope: !173)
!913 = !{!842, !842, i64 0}
!914 = !DILocation(line: 586, column: 38, scope: !173)
!915 = !DILocalVariable(name: "__s1", arg: 1, scope: !916, file: !917, line: 1359, type: !138)
!916 = distinct !DISubprogram(name: "streq", scope: !917, file: !917, line: 1359, type: !918, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !920)
!917 = !DIFile(filename: "./lib/string.h", directory: "/src")
!918 = !DISubroutineType(types: !919)
!919 = !{!176, !138, !138}
!920 = !{!915, !921}
!921 = !DILocalVariable(name: "__s2", arg: 2, scope: !916, file: !917, line: 1359, type: !138)
!922 = !DILocation(line: 0, scope: !916, inlinedAt: !923)
!923 = distinct !DILocation(line: 586, column: 41, scope: !173)
!924 = !DILocation(line: 1361, column: 11, scope: !916, inlinedAt: !923)
!925 = !DILocation(line: 1361, column: 10, scope: !916, inlinedAt: !923)
!926 = !DILocation(line: 586, column: 19, scope: !173)
!927 = !DILocation(line: 587, column: 5, scope: !173)
!928 = !DILocation(line: 588, column: 7, scope: !929)
!929 = distinct !DILexicalBlock(scope: !166, file: !73, line: 588, column: 7)
!930 = !DILocation(line: 588, column: 7, scope: !166)
!931 = !DILocation(line: 590, column: 7, scope: !932)
!932 = distinct !DILexicalBlock(scope: !929, file: !73, line: 589, column: 5)
!933 = !DILocation(line: 591, column: 7, scope: !932)
!934 = !DILocation(line: 595, column: 37, scope: !166)
!935 = !DILocation(line: 595, column: 35, scope: !166)
!936 = !DILocation(line: 596, column: 29, scope: !166)
!937 = !DILocation(line: 597, column: 8, scope: !182)
!938 = !DILocation(line: 597, column: 7, scope: !166)
!939 = !DILocation(line: 604, column: 24, scope: !181)
!940 = !DILocation(line: 604, column: 12, scope: !182)
!941 = !DILocation(line: 0, scope: !180)
!942 = !DILocation(line: 610, column: 16, scope: !180)
!943 = !DILocation(line: 610, column: 7, scope: !180)
!944 = !DILocation(line: 611, column: 21, scope: !180)
!945 = !{!946, !946, i64 0}
!946 = !{!"short", !842, i64 0}
!947 = !DILocation(line: 611, column: 19, scope: !180)
!948 = !DILocation(line: 611, column: 16, scope: !180)
!949 = !DILocation(line: 610, column: 30, scope: !180)
!950 = distinct !{!950, !943, !944, !951}
!951 = !{!"llvm.loop.mustprogress"}
!952 = !DILocation(line: 612, column: 18, scope: !953)
!953 = distinct !DILexicalBlock(scope: !180, file: !73, line: 612, column: 11)
!954 = !DILocation(line: 612, column: 11, scope: !180)
!955 = !DILocation(line: 618, column: 5, scope: !180)
!956 = !DILocation(line: 620, column: 23, scope: !166)
!957 = !DILocation(line: 625, column: 39, scope: !166)
!958 = !DILocation(line: 626, column: 3, scope: !166)
!959 = !DILocation(line: 626, column: 10, scope: !166)
!960 = !DILocation(line: 626, column: 21, scope: !166)
!961 = !DILocation(line: 628, column: 44, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !73, line: 628, column: 11)
!963 = distinct !DILexicalBlock(scope: !166, file: !73, line: 627, column: 5)
!964 = !DILocation(line: 628, column: 32, scope: !962)
!965 = !DILocation(line: 628, column: 49, scope: !962)
!966 = !DILocation(line: 628, column: 11, scope: !963)
!967 = !DILocation(line: 630, column: 11, scope: !968)
!968 = distinct !DILexicalBlock(scope: !963, file: !73, line: 630, column: 11)
!969 = !DILocation(line: 630, column: 11, scope: !963)
!970 = !DILocation(line: 632, column: 26, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !73, line: 632, column: 15)
!972 = distinct !DILexicalBlock(scope: !968, file: !73, line: 631, column: 9)
!973 = !DILocation(line: 632, column: 34, scope: !971)
!974 = !DILocation(line: 632, column: 37, scope: !971)
!975 = !DILocation(line: 632, column: 15, scope: !972)
!976 = !DILocation(line: 636, column: 16, scope: !977)
!977 = distinct !DILexicalBlock(scope: !972, file: !73, line: 636, column: 15)
!978 = !DILocation(line: 636, column: 29, scope: !977)
!979 = !DILocation(line: 640, column: 16, scope: !963)
!980 = distinct !{!980, !958, !981, !951}
!981 = !DILocation(line: 641, column: 5, scope: !166)
!982 = !DILocation(line: 644, column: 3, scope: !166)
!983 = !DILocation(line: 0, scope: !916, inlinedAt: !984)
!984 = distinct !DILocation(line: 648, column: 31, scope: !166)
!985 = !DILocation(line: 0, scope: !916, inlinedAt: !986)
!986 = distinct !DILocation(line: 649, column: 31, scope: !166)
!987 = !DILocation(line: 0, scope: !916, inlinedAt: !988)
!988 = distinct !DILocation(line: 650, column: 31, scope: !166)
!989 = !DILocation(line: 0, scope: !916, inlinedAt: !990)
!990 = distinct !DILocation(line: 651, column: 31, scope: !166)
!991 = !DILocation(line: 0, scope: !916, inlinedAt: !992)
!992 = distinct !DILocation(line: 652, column: 31, scope: !166)
!993 = !DILocation(line: 0, scope: !916, inlinedAt: !994)
!994 = distinct !DILocation(line: 653, column: 31, scope: !166)
!995 = !DILocation(line: 0, scope: !916, inlinedAt: !996)
!996 = distinct !DILocation(line: 654, column: 31, scope: !166)
!997 = !DILocation(line: 0, scope: !916, inlinedAt: !998)
!998 = distinct !DILocation(line: 655, column: 31, scope: !166)
!999 = !DILocation(line: 0, scope: !916, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 656, column: 31, scope: !166)
!1001 = !DILocation(line: 0, scope: !916, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 657, column: 31, scope: !166)
!1003 = !DILocation(line: 663, column: 7, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !166, file: !73, line: 663, column: 7)
!1005 = !DILocation(line: 664, column: 7, scope: !1004)
!1006 = !DILocation(line: 664, column: 10, scope: !1004)
!1007 = !DILocation(line: 663, column: 7, scope: !166)
!1008 = !DILocation(line: 669, column: 7, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1004, file: !73, line: 665, column: 5)
!1010 = !DILocation(line: 671, column: 5, scope: !1009)
!1011 = !DILocation(line: 676, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1004, file: !73, line: 673, column: 5)
!1013 = !DILocation(line: 679, column: 3, scope: !166)
!1014 = !DILocation(line: 683, column: 3, scope: !166)
!1015 = !DILocation(line: 686, column: 3, scope: !166)
!1016 = !DILocation(line: 688, column: 3, scope: !166)
!1017 = !DILocation(line: 691, column: 3, scope: !166)
!1018 = !DILocation(line: 695, column: 3, scope: !166)
!1019 = !DILocation(line: 696, column: 1, scope: !166)
!1020 = !DISubprogram(name: "setlocale", scope: !1021, file: !1021, line: 122, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1021 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!132, !74, !138}
!1024 = !DISubprogram(name: "strncmp", scope: !1025, file: !1025, line: 159, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1025 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!74, !138, !138, !135}
!1028 = !DISubprogram(name: "exit", scope: !1029, file: !1029, line: 624, type: !830, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1029 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1030 = !DISubprogram(name: "getenv", scope: !1029, file: !1029, line: 641, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!132, !138}
!1033 = !DISubprogram(name: "strcmp", scope: !1025, file: !1025, line: 156, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!74, !138, !138}
!1036 = !DISubprogram(name: "strspn", scope: !1025, file: !1025, line: 297, type: !1037, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!137, !138, !138}
!1039 = !DISubprogram(name: "strchr", scope: !1025, file: !1025, line: 246, type: !1040, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!132, !138, !74}
!1042 = !DISubprogram(name: "__ctype_b_loc", scope: !79, file: !79, line: 79, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!1048 = !DISubprogram(name: "strcspn", scope: !1025, file: !1025, line: 293, type: !1037, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1049 = !DISubprogram(name: "fwrite_unlocked", scope: !899, file: !899, line: 704, type: !1050, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !888)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!135, !1052, !135, !135, !893}
!1052 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1055 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 110, type: !1056, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1059)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!74, !74, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065}
!1060 = !DILocalVariable(name: "argc", arg: 1, scope: !1055, file: !2, line: 110, type: !74)
!1061 = !DILocalVariable(name: "argv", arg: 2, scope: !1055, file: !2, line: 110, type: !1058)
!1062 = !DILocalVariable(name: "ok", scope: !1055, file: !2, line: 112, type: !176)
!1063 = !DILocalVariable(name: "check_basic_portability", scope: !1055, file: !2, line: 113, type: !176)
!1064 = !DILocalVariable(name: "check_extra_portability", scope: !1055, file: !2, line: 114, type: !176)
!1065 = !DILocalVariable(name: "optc", scope: !1055, file: !2, line: 115, type: !74)
!1066 = !DILocation(line: 0, scope: !1055)
!1067 = !DILocation(line: 118, column: 21, scope: !1055)
!1068 = !DILocation(line: 118, column: 3, scope: !1055)
!1069 = !DILocation(line: 119, column: 3, scope: !1055)
!1070 = !DILocation(line: 120, column: 3, scope: !1055)
!1071 = !DILocation(line: 121, column: 3, scope: !1055)
!1072 = !DILocation(line: 123, column: 3, scope: !1055)
!1073 = !DILocation(line: 125, column: 3, scope: !1055)
!1074 = !DILocation(line: 125, column: 18, scope: !1055)
!1075 = distinct !{!1075, !1073, !1076, !951}
!1076 = !DILocation(line: 149, column: 5, scope: !1055)
!1077 = !DILocation(line: 136, column: 11, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 128, column: 9)
!1079 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 126, column: 5)
!1080 = !DILocation(line: 140, column: 11, scope: !1078)
!1081 = distinct !{!1081, !1073, !1076, !951, !1082}
!1082 = !{!"llvm.loop.peeled.count", i32 1}
!1083 = !DILocation(line: 142, column: 9, scope: !1078)
!1084 = !DILocation(line: 144, column: 9, scope: !1078)
!1085 = !DILocation(line: 147, column: 11, scope: !1078)
!1086 = !DILocation(line: 151, column: 7, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 151, column: 7)
!1088 = !DILocation(line: 151, column: 14, scope: !1087)
!1089 = !DILocation(line: 151, column: 7, scope: !1055)
!1090 = !DILocation(line: 157, column: 17, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !2, line: 157, column: 3)
!1092 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 157, column: 3)
!1093 = !DILocation(line: 157, column: 3, scope: !1092)
!1094 = !DILocation(line: 153, column: 7, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 152, column: 5)
!1096 = !DILocation(line: 154, column: 7, scope: !1095)
!1097 = !DILocation(line: 158, column: 31, scope: !1091)
!1098 = !DILocalVariable(name: "file", arg: 1, scope: !1099, file: !2, line: 253, type: !132)
!1099 = distinct !DISubprogram(name: "validate_file_name", scope: !2, file: !2, line: 253, type: !1100, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!176, !132, !176, !176}
!1102 = !{!1098, !1103, !1104, !1105, !1106, !1107, !1108, !1145, !1148, !1151, !1152, !1156, !1159, !1162, !1163, !1165, !1168, !1171, !1172, !1173}
!1103 = !DILocalVariable(name: "check_basic_portability", arg: 2, scope: !1099, file: !2, line: 253, type: !176)
!1104 = !DILocalVariable(name: "check_extra_portability", arg: 3, scope: !1099, file: !2, line: 254, type: !176)
!1105 = !DILocalVariable(name: "filelen", scope: !1099, file: !2, line: 256, type: !787)
!1106 = !DILocalVariable(name: "check_component_lengths", scope: !1099, file: !2, line: 259, type: !176)
!1107 = !DILocalVariable(name: "file_exists", scope: !1099, file: !2, line: 262, type: !176)
!1108 = !DILocalVariable(name: "st", scope: !1109, file: !2, line: 290, type: !1111)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !2, line: 284, column: 5)
!1110 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 278, column: 7)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1112, line: 26, size: 1152, elements: !1113)
!1112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1113 = !{!1114, !1116, !1118, !1120, !1122, !1124, !1126, !1127, !1128, !1129, !1131, !1133, !1141, !1142, !1143}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1111, file: !1112, line: 31, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !216, line: 145, baseType: !137)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1111, file: !1112, line: 36, baseType: !1117, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !216, line: 148, baseType: !137)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1111, file: !1112, line: 44, baseType: !1119, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !216, line: 151, baseType: !137)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1111, file: !1112, line: 45, baseType: !1121, size: 32, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !216, line: 150, baseType: !69)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1111, file: !1112, line: 47, baseType: !1123, size: 32, offset: 224)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !216, line: 146, baseType: !69)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1111, file: !1112, line: 48, baseType: !1125, size: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !216, line: 147, baseType: !69)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1111, file: !1112, line: 50, baseType: !74, size: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1111, file: !1112, line: 52, baseType: !1115, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1111, file: !1112, line: 57, baseType: !215, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1111, file: !1112, line: 61, baseType: !1130, size: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !216, line: 175, baseType: !217)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1111, file: !1112, line: 63, baseType: !1132, size: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !216, line: 180, baseType: !217)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1111, file: !1112, line: 74, baseType: !1134, size: 128, offset: 576)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1135, line: 11, size: 128, elements: !1136)
!1135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1136 = !{!1137, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1134, file: !1135, line: 16, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !216, line: 160, baseType: !217)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1134, file: !1135, line: 21, baseType: !1140, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !216, line: 197, baseType: !217)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1111, file: !1112, line: 75, baseType: !1134, size: 128, offset: 704)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1111, file: !1112, line: 76, baseType: !1134, size: 128, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1111, file: !1112, line: 89, baseType: !1144, size: 192, offset: 960)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 192, elements: !273)
!1145 = !DILocalVariable(name: "maxsize", scope: !1146, file: !2, line: 303, type: !787)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 302, column: 5)
!1147 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 300, column: 7)
!1148 = !DILocalVariable(name: "size", scope: !1149, file: !2, line: 309, type: !217)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !2, line: 308, column: 9)
!1150 = distinct !DILexicalBlock(scope: !1146, file: !2, line: 305, column: 11)
!1151 = !DILocalVariable(name: "dir", scope: !1149, file: !2, line: 310, type: !138)
!1152 = !DILocalVariable(name: "start", scope: !1153, file: !2, line: 339, type: !132)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 339, column: 7)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 338, column: 5)
!1155 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 337, column: 7)
!1156 = !DILocalVariable(name: "length", scope: !1157, file: !2, line: 341, type: !135)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !2, line: 340, column: 9)
!1158 = distinct !DILexicalBlock(scope: !1153, file: !2, line: 339, column: 7)
!1159 = !DILocalVariable(name: "name_max", scope: !1160, file: !2, line: 359, type: !787)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !2, line: 354, column: 5)
!1161 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 353, column: 7)
!1162 = !DILocalVariable(name: "known_name_max", scope: !1160, file: !2, line: 362, type: !787)
!1163 = !DILocalVariable(name: "start", scope: !1164, file: !2, line: 364, type: !132)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !2, line: 364, column: 7)
!1165 = !DILocalVariable(name: "length", scope: !1166, file: !2, line: 366, type: !787)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !2, line: 365, column: 9)
!1167 = distinct !DILexicalBlock(scope: !1164, file: !2, line: 364, column: 7)
!1168 = !DILocalVariable(name: "len", scope: !1169, file: !2, line: 372, type: !217)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !2, line: 371, column: 13)
!1170 = distinct !DILexicalBlock(scope: !1166, file: !2, line: 368, column: 15)
!1171 = !DILocalVariable(name: "dir", scope: !1169, file: !2, line: 373, type: !138)
!1172 = !DILocalVariable(name: "c", scope: !1169, file: !2, line: 374, type: !4)
!1173 = !DILocalVariable(name: "c", scope: !1174, file: !2, line: 406, type: !4)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 405, column: 13)
!1175 = distinct !DILexicalBlock(scope: !1166, file: !2, line: 404, column: 15)
!1176 = !DILocation(line: 0, scope: !1099, inlinedAt: !1177)
!1177 = distinct !DILocation(line: 158, column: 11, scope: !1091)
!1178 = !DILocation(line: 256, column: 19, scope: !1099, inlinedAt: !1177)
!1179 = !DILocation(line: 264, column: 31, scope: !1180, inlinedAt: !1177)
!1180 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 264, column: 7)
!1181 = !DILocalVariable(name: "file", arg: 1, scope: !1182, file: !2, line: 168, type: !138)
!1182 = distinct !DISubprogram(name: "no_leading_hyphen", scope: !2, file: !2, line: 168, type: !1183, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1185)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!176, !138}
!1185 = !{!1181, !1186}
!1186 = !DILocalVariable(name: "p", scope: !1187, file: !2, line: 170, type: !138)
!1187 = distinct !DILexicalBlock(scope: !1182, file: !2, line: 170, column: 3)
!1188 = !DILocation(line: 0, scope: !1182, inlinedAt: !1189)
!1189 = distinct !DILocation(line: 264, column: 36, scope: !1180, inlinedAt: !1177)
!1190 = !DILocation(line: 0, scope: !1187, inlinedAt: !1189)
!1191 = !DILocation(line: 170, column: 36, scope: !1192, inlinedAt: !1189)
!1192 = distinct !DILexicalBlock(scope: !1187, file: !2, line: 170, column: 3)
!1193 = !DILocation(line: 170, column: 3, scope: !1187, inlinedAt: !1189)
!1194 = !DILocation(line: 170, column: 56, scope: !1192, inlinedAt: !1189)
!1195 = distinct !{!1195, !1193, !1196, !951}
!1196 = !DILocation(line: 176, column: 7, scope: !1187, inlinedAt: !1189)
!1197 = !DILocation(line: 171, column: 11, scope: !1198, inlinedAt: !1189)
!1198 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 171, column: 9)
!1199 = !DILocation(line: 171, column: 19, scope: !1198, inlinedAt: !1189)
!1200 = !DILocation(line: 171, column: 22, scope: !1198, inlinedAt: !1189)
!1201 = !DILocation(line: 171, column: 28, scope: !1198, inlinedAt: !1189)
!1202 = !DILocation(line: 171, column: 9, scope: !1192, inlinedAt: !1189)
!1203 = !DILocation(line: 173, column: 9, scope: !1204, inlinedAt: !1189)
!1204 = distinct !DILexicalBlock(scope: !1198, file: !2, line: 172, column: 7)
!1205 = !DILocation(line: 264, column: 7, scope: !1099, inlinedAt: !1177)
!1206 = !DILocation(line: 267, column: 32, scope: !1207, inlinedAt: !1177)
!1207 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 267, column: 7)
!1208 = !DILocation(line: 268, column: 7, scope: !1207, inlinedAt: !1177)
!1209 = !DILocation(line: 267, column: 7, scope: !1099, inlinedAt: !1177)
!1210 = !DILocation(line: 274, column: 7, scope: !1211, inlinedAt: !1177)
!1211 = distinct !DILexicalBlock(scope: !1207, file: !2, line: 269, column: 5)
!1212 = !DILocation(line: 275, column: 7, scope: !1211, inlinedAt: !1177)
!1213 = !DILocalVariable(name: "file", arg: 1, scope: !1214, file: !2, line: 185, type: !138)
!1214 = distinct !DISubprogram(name: "portable_chars_only", scope: !2, file: !2, line: 185, type: !1215, scopeLine: 186, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1217)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!176, !138, !135}
!1217 = !{!1213, !1218, !1219, !1220, !1221, !1234}
!1218 = !DILocalVariable(name: "filelen", arg: 2, scope: !1214, file: !2, line: 185, type: !135)
!1219 = !DILocalVariable(name: "validlen", scope: !1214, file: !2, line: 187, type: !135)
!1220 = !DILocalVariable(name: "invalid", scope: !1214, file: !2, line: 192, type: !138)
!1221 = !DILocalVariable(name: "mbstate", scope: !1222, file: !2, line: 196, type: !1224)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !2, line: 195, column: 5)
!1223 = distinct !DILexicalBlock(scope: !1214, file: !2, line: 194, column: 7)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !1227)
!1227 = !{!1228, !1229}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1226, file: !490, line: 15, baseType: !74, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1226, file: !490, line: 20, baseType: !1230, size: 32, offset: 32)
!1230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1226, file: !490, line: 16, size: 32, elements: !1231)
!1231 = !{!1232, !1233}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1230, file: !490, line: 18, baseType: !69, size: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1230, file: !490, line: 19, baseType: !61, size: 32)
!1234 = !DILocalVariable(name: "charlen", scope: !1222, file: !2, line: 197, type: !135)
!1235 = !DILocation(line: 0, scope: !1214, inlinedAt: !1236)
!1236 = distinct !DILocation(line: 280, column: 13, scope: !1237, inlinedAt: !1177)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !2, line: 280, column: 11)
!1238 = distinct !DILexicalBlock(scope: !1110, file: !2, line: 279, column: 5)
!1239 = !DILocation(line: 187, column: 21, scope: !1214, inlinedAt: !1236)
!1240 = !DILocation(line: 192, column: 30, scope: !1214, inlinedAt: !1236)
!1241 = !DILocation(line: 194, column: 7, scope: !1223, inlinedAt: !1236)
!1242 = !DILocation(line: 194, column: 7, scope: !1214, inlinedAt: !1236)
!1243 = !DILocation(line: 196, column: 7, scope: !1222, inlinedAt: !1236)
!1244 = !DILocation(line: 196, column: 17, scope: !1222, inlinedAt: !1236)
!1245 = !DILocalVariable(name: "ps", arg: 1, scope: !1246, file: !1247, line: 1135, type: !1250)
!1246 = distinct !DISubprogram(name: "mbszero", scope: !1247, file: !1247, line: 1135, type: !1248, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1251)
!1247 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1248 = !DISubroutineType(types: !1249)
!1249 = !{null, !1250}
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1251 = !{!1245}
!1252 = !DILocation(line: 0, scope: !1246, inlinedAt: !1253)
!1253 = distinct !DILocation(line: 196, column: 26, scope: !1222, inlinedAt: !1236)
!1254 = !DILocalVariable(name: "__dest", arg: 1, scope: !1255, file: !1256, line: 57, type: !133)
