; ModuleID = 'src/pinky.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }


!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 46, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!174 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!179 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!180 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !64, !69, !74, !79, !84, !89, !94, !99, !104, !181, !183, !188, !193, !198, !200, !202, !283, !288, !290, !295, !297, !299, !301, !303, !308, !310, !312, !314, !319, !324, !326, !328, !330, !332, !334, !336, !338, !343, !348, !350, !352, !354, !356, !358, !360, !365, !367, !369, !374, !379, !381, !383, !385, !387, !106, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !535, !537, !539, !541, !543, !545, !562, !564, !566, !568, !570, !593, !595, !600, !602, !604, !606, !608, !610, !612, !614, !619, !621}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !86, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 17)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 16)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 12)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !56, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "do_lookup", scope: !108, file: !2, line: 68, type: !178, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !204, file: !115, line: 575, type: !116, isLocal: true, isDefinition: true)
!204 = distinct !DISubprogram(name: "oputs_", scope: !115, file: !115, line: 573, type: !205, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !207)
!205 = !DISubroutineType(cc: DW_CC_nocall, types: !206)
!206 = !{null, !175, !175}
!207 = !{!208, !209, !210, !213, !214, !215, !216, !220, !221, !222, !223, !225, !277, !278, !279, !281, !282}
!208 = !DILocalVariable(name: "program", arg: 1, scope: !204, file: !115, line: 573, type: !175)
!209 = !DILocalVariable(name: "option", arg: 2, scope: !204, file: !115, line: 573, type: !175)
!210 = !DILocalVariable(name: "term", scope: !211, file: !115, line: 585, type: !175)
!211 = distinct !DILexicalBlock(scope: !212, file: !115, line: 582, column: 5)
!212 = distinct !DILexicalBlock(scope: !204, file: !115, line: 581, column: 7)
!213 = !DILocalVariable(name: "double_space", scope: !204, file: !115, line: 594, type: !178)
!214 = !DILocalVariable(name: "first_word", scope: !204, file: !115, line: 595, type: !175)
!215 = !DILocalVariable(name: "option_text", scope: !204, file: !115, line: 596, type: !175)
!216 = !DILocalVariable(name: "s", scope: !217, file: !115, line: 608, type: !175)
!217 = distinct !DILexicalBlock(scope: !218, file: !115, line: 605, column: 5)
!218 = distinct !DILexicalBlock(scope: !219, file: !115, line: 604, column: 12)
!219 = distinct !DILexicalBlock(scope: !204, file: !115, line: 597, column: 7)
!220 = !DILocalVariable(name: "spaces", scope: !217, file: !115, line: 609, type: !172)
!221 = !DILocalVariable(name: "anchor_len", scope: !204, file: !115, line: 620, type: !172)
!222 = !DILocalVariable(name: "desc_text", scope: !204, file: !115, line: 625, type: !175)
!223 = !DILocalVariable(name: "__ptr", scope: !224, file: !115, line: 644, type: !175)
!224 = distinct !DILexicalBlock(scope: !204, file: !115, line: 644, column: 3)
!225 = !DILocalVariable(name: "__stream", scope: !224, file: !115, line: 644, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !228, line: 7, baseType: !229)
!228 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !230, line: 49, size: 1728, elements: !231)
!230 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !249, !250, !251, !254, !255, !257, !258, !261, !263, !266, !269, !270, !271, !272, !273}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !229, file: !230, line: 51, baseType: !116, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !229, file: !230, line: 54, baseType: !169, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !229, file: !230, line: 55, baseType: !169, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !229, file: !230, line: 56, baseType: !169, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !229, file: !230, line: 57, baseType: !169, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !229, file: !230, line: 58, baseType: !169, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !229, file: !230, line: 59, baseType: !169, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !229, file: !230, line: 60, baseType: !169, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !229, file: !230, line: 61, baseType: !169, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !229, file: !230, line: 64, baseType: !169, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !229, file: !230, line: 65, baseType: !169, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !229, file: !230, line: 66, baseType: !169, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !229, file: !230, line: 68, baseType: !245, size: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !230, line: 36, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !229, file: !230, line: 70, baseType: !248, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !229, file: !230, line: 72, baseType: !116, size: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !229, file: !230, line: 73, baseType: !116, size: 32, offset: 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !229, file: !230, line: 74, baseType: !252, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !253, line: 152, baseType: !179)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !229, file: !230, line: 77, baseType: !171, size: 16, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !229, file: !230, line: 78, baseType: !256, size: 8, offset: 1040)
!256 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !229, file: !230, line: 79, baseType: !91, size: 8, offset: 1048)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !229, file: !230, line: 81, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !230, line: 43, baseType: null)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !229, file: !230, line: 89, baseType: !262, size: 64, offset: 1152)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !253, line: 153, baseType: !179)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !229, file: !230, line: 91, baseType: !264, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !230, line: 37, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !229, file: !230, line: 92, baseType: !267, size: 64, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !230, line: 38, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !229, file: !230, line: 93, baseType: !248, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !229, file: !230, line: 94, baseType: !170, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !229, file: !230, line: 95, baseType: !172, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !229, file: !230, line: 96, baseType: !116, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !229, file: !230, line: 98, baseType: !274, size: 160, offset: 1568)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 20)
!277 = !DILocalVariable(name: "__cnt", scope: !224, file: !115, line: 644, type: !172)
!278 = !DILocalVariable(name: "url_program", scope: !204, file: !115, line: 648, type: !175)
!279 = !DILocalVariable(name: "__ptr", scope: !280, file: !115, line: 686, type: !175)
!280 = distinct !DILexicalBlock(scope: !204, file: !115, line: 686, column: 3)
!281 = !DILocalVariable(name: "__stream", scope: !280, file: !115, line: 686, type: !226)
!282 = !DILocalVariable(name: "__cnt", scope: !280, file: !115, line: 686, type: !172)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !115, line: 585, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 5)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !115, line: 586, type: !285, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !115, line: 595, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 4)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !115, line: 620, type: !19, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !14, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !285, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !292, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 3)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !115, line: 650, type: !285, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !115, line: 652, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 7)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !115, line: 653, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !115, line: 654, type: !96, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !115, line: 655, type: !96, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !115, line: 656, type: !96, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !115, line: 657, type: !96, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !115, line: 663, type: !316, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !115, line: 664, type: !96, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !185, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 40)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 15)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !24, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !115, line: 679, type: !305, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !115, line: 683, type: !285, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !115, line: 688, type: !285, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !115, line: 691, type: !321, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !115, line: 839, type: !190, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !115, line: 840, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 22)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !115, line: 841, type: !345, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !115, line: 862, type: !292, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !115, line: 868, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 71)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !115, line: 875, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 27)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !39, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !195, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !316, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !285, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !321, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "do_short_format", scope: !108, file: !2, line: 65, type: !178, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "include_heading", scope: !108, file: !2, line: 49, type: !178, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "include_fullname", scope: !108, file: !2, line: 52, type: !178, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "include_where", scope: !108, file: !2, line: 72, type: !178, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "include_idle", scope: !108, file: !2, line: 46, type: !178, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "include_project", scope: !108, file: !2, line: 55, type: !178, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "include_plan", scope: !108, file: !2, line: 58, type: !178, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !108, file: !2, line: 62, type: !178, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !305, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 422, type: !345, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !195, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "time_format", scope: !108, file: !2, line: 77, type: !175, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "time_format_width", scope: !108, file: !2, line: 78, type: !116, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !285, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !316, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !285, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !19, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !285, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !19, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !285, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !19, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !285, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !292, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !19, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dev_dirfd", scope: !441, file: !2, line: 212, type: !116, isLocal: true, isDefinition: true)
!441 = distinct !DISubprogram(name: "print_entry", scope: !2, file: !2, line: 200, type: !442, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !473)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !136, line: 92, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !136, line: 65, size: 576, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !461, !465, !466, !468}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !447, file: !136, line: 69, baseType: !169, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !447, file: !136, line: 70, baseType: !169, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !447, file: !136, line: 71, baseType: !169, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !447, file: !136, line: 72, baseType: !169, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !447, file: !136, line: 74, baseType: !454, size: 128, offset: 256)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 11, size: 128, elements: !456)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !454, file: !455, line: 16, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !253, line: 160, baseType: !179)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !454, file: !455, line: 21, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !253, line: 197, baseType: !179)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !447, file: !136, line: 75, baseType: !462, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !463, line: 97, baseType: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !253, line: 154, baseType: !116)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !447, file: !136, line: 76, baseType: !462, size: 32, offset: 416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !447, file: !136, line: 77, baseType: !467, size: 16, offset: 448)
!467 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !447, file: !136, line: 79, baseType: !469, size: 64, offset: 480)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !136, line: 79, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !469, file: !136, line: 79, baseType: !116, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !469, file: !136, line: 79, baseType: !116, size: 32, offset: 32)
!473 = !{!474, !475, !476, !477, !478, !506, !509, !510, !511, !525, !529, !530, !533, !534}
!474 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !441, file: !2, line: 200, type: !444)
!475 = !DILocalVariable(name: "line", scope: !441, file: !2, line: 203, type: !169)
!476 = !DILocalVariable(name: "space", scope: !441, file: !2, line: 204, type: !169)
!477 = !DILocalVariable(name: "dirfd", scope: !441, file: !2, line: 207, type: !116)
!478 = !DILocalVariable(name: "stats", scope: !441, file: !2, line: 222, type: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !480, line: 26, size: 1152, elements: !481)
!480 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!481 = !{!482, !484, !486, !488, !490, !492, !494, !495, !496, !497, !499, !501, !502, !503, !504}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !479, file: !480, line: 31, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !253, line: 145, baseType: !174)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !479, file: !480, line: 36, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !253, line: 148, baseType: !174)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !479, file: !480, line: 44, baseType: !487, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !253, line: 151, baseType: !174)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !479, file: !480, line: 45, baseType: !489, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !253, line: 150, baseType: !111)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !479, file: !480, line: 47, baseType: !491, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !253, line: 146, baseType: !111)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !479, file: !480, line: 48, baseType: !493, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !253, line: 147, baseType: !111)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !479, file: !480, line: 50, baseType: !116, size: 32, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !479, file: !480, line: 52, baseType: !483, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !479, file: !480, line: 57, baseType: !252, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !479, file: !480, line: 61, baseType: !498, size: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !253, line: 175, baseType: !179)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !479, file: !480, line: 63, baseType: !500, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !253, line: 180, baseType: !179)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !479, file: !480, line: 74, baseType: !454, size: 128, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !479, file: !480, line: 75, baseType: !454, size: 128, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !479, file: !480, line: 76, baseType: !454, size: 128, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !479, file: !480, line: 89, baseType: !505, size: 192, offset: 960)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 192, elements: !306)
!506 = !DILocalVariable(name: "last_change", scope: !441, file: !2, line: 223, type: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !508, line: 10, baseType: !458)
!508 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!509 = !DILocalVariable(name: "mesg", scope: !441, file: !2, line: 224, type: !4)
!510 = !DILocalVariable(name: "ut_user", scope: !441, file: !2, line: 236, type: !169)
!511 = !DILocalVariable(name: "pw", scope: !512, file: !2, line: 244, type: !514)
!512 = distinct !DILexicalBlock(scope: !513, file: !2, line: 243, column: 5)
!513 = distinct !DILexicalBlock(scope: !441, file: !2, line: 242, column: 7)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !516, line: 49, size: 384, elements: !517)
!516 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!517 = !{!518, !519, !520, !521, !522, !523, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !515, file: !516, line: 51, baseType: !169, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !515, file: !516, line: 52, baseType: !169, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !515, file: !516, line: 54, baseType: !491, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !515, file: !516, line: 55, baseType: !493, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !515, file: !516, line: 56, baseType: !169, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !515, file: !516, line: 57, baseType: !169, size: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !515, file: !516, line: 58, baseType: !169, size: 64, offset: 320)
!525 = !DILocalVariable(name: "comma", scope: !526, file: !2, line: 250, type: !528)
!526 = distinct !DILexicalBlock(scope: !527, file: !2, line: 249, column: 9)
!527 = distinct !DILexicalBlock(scope: !512, file: !2, line: 245, column: 11)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!529 = !DILocalVariable(name: "result", scope: !526, file: !2, line: 255, type: !169)
!530 = !DILocalVariable(name: "ut_host", scope: !531, file: !2, line: 282, type: !169)
!531 = distinct !DILexicalBlock(scope: !532, file: !2, line: 281, column: 5)
!532 = distinct !DILexicalBlock(scope: !441, file: !2, line: 280, column: 7)
!533 = !DILocalVariable(name: "display", scope: !531, file: !2, line: 285, type: !169)
!534 = !DILocalVariable(name: "host", scope: !531, file: !2, line: 289, type: !169)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !285, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !19, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !195, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !96, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !19, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "now", scope: !547, file: !2, line: 158, type: !507, isLocal: true, isDefinition: true)
!547 = distinct !DISubprogram(name: "idle_string", scope: !2, file: !2, line: 156, type: !548, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{!175, !507}
!550 = !{!551, !552, !553, !556, !557}
!551 = !DILocalVariable(name: "when", arg: 1, scope: !547, file: !2, line: 156, type: !507)
!552 = !DILocalVariable(name: "seconds_idle", scope: !547, file: !2, line: 164, type: !507)
!553 = !DILocalVariable(name: "hours", scope: !554, file: !2, line: 169, type: !116)
!554 = distinct !DILexicalBlock(scope: !555, file: !2, line: 168, column: 5)
!555 = distinct !DILexicalBlock(scope: !547, file: !2, line: 167, column: 7)
!556 = !DILocalVariable(name: "minutes", scope: !554, file: !2, line: 170, type: !116)
!557 = !DILocalVariable(name: "days", scope: !558, file: !2, line: 175, type: !559)
!558 = distinct !DILexicalBlock(scope: !555, file: !2, line: 174, column: 5)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !560, line: 101, baseType: !561)
!560 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !253, line: 72, baseType: !179)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "buf", scope: !547, file: !2, line: 159, type: !362, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !19, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !96, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !285, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "buf", scope: !572, file: !2, line: 185, type: !9, isLocal: true, isDefinition: true)
!572 = distinct !DISubprogram(name: "time_string", scope: !2, file: !2, line: 183, type: !573, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !575)
!573 = !DISubroutineType(types: !574)
!574 = !{!175, !444}
!575 = !{!576, !577}
!576 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !572, file: !2, line: 183, type: !444)
!577 = !DILocalVariable(name: "tmp", scope: !572, file: !2, line: 186, type: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !580, line: 7, size: 448, elements: !581)
!580 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !579, file: !580, line: 9, baseType: !116, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !579, file: !580, line: 10, baseType: !116, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !579, file: !580, line: 11, baseType: !116, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !579, file: !580, line: 12, baseType: !116, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !579, file: !580, line: 13, baseType: !116, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !579, file: !580, line: 14, baseType: !116, size: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !579, file: !580, line: 15, baseType: !116, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !579, file: !580, line: 16, baseType: !116, size: 32, offset: 224)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !579, file: !580, line: 17, baseType: !116, size: 32, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !579, file: !580, line: 20, baseType: !179, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !579, file: !580, line: 21, baseType: !175, size: 64, offset: 384)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !115, line: 952, type: !195, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 13)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !19, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !345, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !285, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !2, line: 375, type: !195, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 376, type: !19, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !321, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !96, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 9)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !316, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !19, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 1024, elements: !293)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !626, line: 50, size: 256, elements: !627)
!626 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!627 = !{!628, !629, !630, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !626, line: 52, baseType: !175, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !625, file: !626, line: 55, baseType: !116, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !626, line: 56, baseType: !631, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !625, file: !626, line: 57, baseType: !116, size: 32, offset: 192)
!633 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!634 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!635 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!636 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!637 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!638 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!639 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!640 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!641 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 3, type: !345, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "Version", scope: !647, file: !644, line: 3, type: !175, isLocal: false, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !648, splitDebugInlining: false, nameTableKind: None)
!648 = !{!642, !645}
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "last_cherror", scope: !651, file: !652, line: 28, type: !116, isLocal: true, isDefinition: true)
!651 = distinct !DICompileUnit(language: DW_LANG_C11, file: !652, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !653, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/canon-host.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b27163e4eb904e69bce9c14960126cc5")
!653 = !{!654, !649}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "hints", scope: !656, file: !652, line: 63, type: !664, isLocal: true, isDefinition: true)
!656 = distinct !DISubprogram(name: "canon_host_r", scope: !652, file: !652, line: 61, type: !657, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !651, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{!169, !175, !631}
!659 = !{!660, !661, !662, !685, !686}
!660 = !DILocalVariable(name: "host", arg: 1, scope: !656, file: !652, line: 61, type: !175)
!661 = !DILocalVariable(name: "cherror", arg: 2, scope: !656, file: !652, line: 61, type: !631)
!662 = !DILocalVariable(name: "res", scope: !656, file: !652, line: 66, type: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !665, line: 565, size: 384, elements: !666)
!665 = !DIFile(filename: "/usr/include/netdb.h", directory: "", checksumkind: CSK_MD5, checksum: "dd84cdc2a8dcb66c232d326e9ca8b469")
!666 = !{!667, !668, !669, !670, !671, !675, !683, !684}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !664, file: !665, line: 567, baseType: !116, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !664, file: !665, line: 568, baseType: !116, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !664, file: !665, line: 569, baseType: !116, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !664, file: !665, line: 570, baseType: !116, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !664, file: !665, line: 571, baseType: !672, size: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !673, line: 33, baseType: !674)
!673 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !253, line: 210, baseType: !111)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !664, file: !665, line: 572, baseType: !676, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !673, line: 180, size: 128, elements: !678)
!678 = !{!679, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !677, file: !673, line: 182, baseType: !680, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !681, line: 28, baseType: !171)
!681 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !677, file: !673, line: 183, baseType: !86, size: 112, offset: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !664, file: !665, line: 573, baseType: !169, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !664, file: !665, line: 574, baseType: !663, size: 64, offset: 320)
!685 = !DILocalVariable(name: "status", scope: !656, file: !652, line: 67, type: !116)
!686 = !DILocalVariable(name: "retval", scope: !656, file: !652, line: 69, type: !169)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "file_name", scope: !689, file: !690, line: 45, type: !175, isLocal: true, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !691, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!691 = !{!692, !694, !696, !698, !687, !700}
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !690, line: 121, type: !316, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !690, line: 121, type: !195, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !690, line: 123, type: !316, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !690, line: 126, type: !305, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !689, file: !690, line: 55, type: !178, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !704, file: !705, line: 66, type: !751, isLocal: false, isDefinition: true)
!704 = distinct !DICompileUnit(language: DW_LANG_C11, file: !705, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !706, globals: !707, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!706 = !{!170, !177}
!707 = !{!708, !710, !730, !732, !734, !736, !702, !738, !740, !742, !744, !749}
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !705, line: 272, type: !285, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "old_file_name", scope: !712, file: !705, line: 304, type: !175, isLocal: true, isDefinition: true)
!712 = distinct !DISubprogram(name: "verror_at_line", scope: !705, file: !705, line: 298, type: !713, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !704, retainedNodes: !723)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !116, !116, !175, !111, !175, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !717)
!717 = !{!718, !720, !721, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !716, file: !719, baseType: !111, size: 32)
!719 = !DIFile(filename: "lib/error.c", directory: "/src")
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !716, file: !719, baseType: !111, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !716, file: !719, baseType: !170, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !716, file: !719, baseType: !170, size: 64, offset: 128)
!723 = !{!724, !725, !726, !727, !728, !729}
!724 = !DILocalVariable(name: "status", arg: 1, scope: !712, file: !705, line: 298, type: !116)
!725 = !DILocalVariable(name: "errnum", arg: 2, scope: !712, file: !705, line: 298, type: !116)
!726 = !DILocalVariable(name: "file_name", arg: 3, scope: !712, file: !705, line: 298, type: !175)
!727 = !DILocalVariable(name: "line_number", arg: 4, scope: !712, file: !705, line: 298, type: !111)
!728 = !DILocalVariable(name: "message", arg: 5, scope: !712, file: !705, line: 298, type: !175)
!729 = !DILocalVariable(name: "args", arg: 6, scope: !712, file: !705, line: 298, type: !715)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "old_line_number", scope: !712, file: !705, line: 305, type: !111, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !705, line: 338, type: !292, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !705, line: 346, type: !321, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !705, line: 346, type: !14, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "error_message_count", scope: !704, file: !705, line: 69, type: !111, isLocal: false, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !704, file: !705, line: 295, type: !116, isLocal: false, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !705, line: 208, type: !316, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !705, line: 208, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 21)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !705, line: 214, type: !285, isLocal: true, isDefinition: true)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !756, line: 35, type: !19, isLocal: true, isDefinition: true)
!756 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "program_name", scope: !759, file: !760, line: 31, type: !175, isLocal: false, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C11, file: !760, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !761, globals: !762, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!761 = !{!169}
!762 = !{!757, !763, !765}
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !760, line: 46, type: !321, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !760, line: 49, type: !292, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "utf07FF", scope: !769, file: !770, line: 46, type: !797, isLocal: true, isDefinition: true)
!769 = distinct !DISubprogram(name: "proper_name_lite", scope: !770, file: !770, line: 38, type: !771, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !773, retainedNodes: !775)
!770 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!771 = !DISubroutineType(types: !772)
!772 = !{!175, !175, !175}
!773 = distinct !DICompileUnit(language: DW_LANG_C11, file: !770, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !774, splitDebugInlining: false, nameTableKind: None)
!774 = !{!767}
!775 = !{!776, !777, !778, !779, !784}
!776 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !769, file: !770, line: 38, type: !175)
!777 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !769, file: !770, line: 38, type: !175)
!778 = !DILocalVariable(name: "translation", scope: !769, file: !770, line: 40, type: !175)
!779 = !DILocalVariable(name: "w", scope: !769, file: !770, line: 47, type: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !781, line: 37, baseType: !782)
!781 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !253, line: 57, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !253, line: 42, baseType: !111)
!784 = !DILocalVariable(name: "mbs", scope: !769, file: !770, line: 48, type: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !786, line: 6, baseType: !787)
!786 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !788, line: 21, baseType: !789)
!788 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 13, size: 64, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !789, file: !788, line: 15, baseType: !116, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !789, file: !788, line: 20, baseType: !793, size: 32, offset: 32)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !789, file: !788, line: 16, size: 32, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !793, file: !788, line: 18, baseType: !111, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !793, file: !788, line: 19, baseType: !292, size: 32)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 16, elements: !15)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !800, line: 78, type: !321, isLocal: true, isDefinition: true)
!800 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !800, line: 79, type: !19, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !800, line: 80, type: !597, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !800, line: 81, type: !597, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !800, line: 82, type: !274, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !800, line: 83, type: !14, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !800, line: 84, type: !321, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !800, line: 85, type: !316, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !800, line: 86, type: !316, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !800, line: 87, type: !321, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !821, file: !800, line: 76, type: !893, isLocal: false, isDefinition: true)
!821 = distinct !DICompileUnit(language: DW_LANG_C11, file: !800, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !822, retainedTypes: !828, globals: !829, splitDebugInlining: false, nameTableKind: None)
!822 = !{!142, !823, !120}
!823 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !143, line: 254, baseType: !111, size: 32, elements: !824)
!824 = !{!825, !826, !827}
!825 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!826 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!827 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!828 = !{!116, !171, !172}
!829 = !{!798, !801, !803, !805, !807, !809, !811, !813, !815, !817, !819, !830, !834, !844, !846, !851, !853, !855, !857, !859, !882, !889, !891}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !821, file: !800, line: 92, type: !832, isLocal: false, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 320, elements: !97)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !821, file: !800, line: 1040, type: !836, isLocal: false, isDefinition: true)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !800, line: 56, size: 448, elements: !837)
!837 = !{!838, !839, !840, !842, !843}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !836, file: !800, line: 59, baseType: !142, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !836, file: !800, line: 62, baseType: !116, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !836, file: !800, line: 66, baseType: !841, size: 256, offset: 64)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !322)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !836, file: !800, line: 69, baseType: !175, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !836, file: !800, line: 72, baseType: !175, size: 64, offset: 384)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !821, file: !800, line: 107, type: !836, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "slot0", scope: !821, file: !800, line: 831, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 256)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !800, line: 321, type: !14, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !800, line: 357, type: !14, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !800, line: 358, type: !14, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !800, line: 199, type: !316, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "quote", scope: !861, file: !800, line: 228, type: !880, isLocal: true, isDefinition: true)
!861 = distinct !DISubprogram(name: "gettext_quote", scope: !800, file: !800, line: 197, type: !862, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !821, retainedNodes: !864)
!862 = !DISubroutineType(types: !863)
!863 = !{!175, !175, !142}
!864 = !{!865, !866, !867, !868, !869}
!865 = !DILocalVariable(name: "msgid", arg: 1, scope: !861, file: !800, line: 197, type: !175)
!866 = !DILocalVariable(name: "s", arg: 2, scope: !861, file: !800, line: 197, type: !142)
!867 = !DILocalVariable(name: "translation", scope: !861, file: !800, line: 199, type: !175)
!868 = !DILocalVariable(name: "w", scope: !861, file: !800, line: 229, type: !780)
!869 = !DILocalVariable(name: "mbs", scope: !861, file: !800, line: 230, type: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !786, line: 6, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !788, line: 21, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 13, size: 64, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !872, file: !788, line: 15, baseType: !116, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !872, file: !788, line: 20, baseType: !876, size: 32, offset: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !872, file: !788, line: 16, size: 32, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !876, file: !788, line: 18, baseType: !111, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !876, file: !788, line: 19, baseType: !292, size: 32)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !881)
!881 = !{!16, !294}
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "slotvec", scope: !821, file: !800, line: 834, type: !884, isLocal: true, isDefinition: true)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !800, line: 823, size: 128, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !885, file: !800, line: 825, baseType: !172, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !885, file: !800, line: 826, baseType: !169, size: 64, offset: 64)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "nslots", scope: !821, file: !800, line: 832, type: !116, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "slotvec0", scope: !821, file: !800, line: 833, type: !885, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 704, elements: !895)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!895 = !{!896}
!896 = !DISubrange(count: 11)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !899, line: 347, type: !86, isLocal: true, isDefinition: true)
!899 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !899, line: 398, type: !616, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !899, line: 399, type: !14, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !899, line: 446, type: !316, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !899, line: 447, type: !91, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !910, line: 98, type: !911, isLocal: true, isDefinition: true)
!910 = !DIFile(filename: "./lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 29)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !910, line: 99, type: !911, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !910, line: 100, type: !746, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !910, line: 40, type: !597, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !910, line: 40, type: !305, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !924, line: 67, type: !195, isLocal: true, isDefinition: true)
!924 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !924, line: 69, type: !316, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !924, line: 83, type: !316, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !924, line: 83, type: !292, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !924, line: 85, type: !14, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !924, line: 88, type: !935, isLocal: true, isDefinition: true)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 171)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !924, line: 88, type: !940, isLocal: true, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 34)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !924, line: 105, type: !190, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !924, line: 109, type: !947, isLocal: true, isDefinition: true)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 23)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !924, line: 113, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 28)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !924, line: 120, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 32)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !924, line: 127, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 36)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !924, line: 134, type: !340, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !924, line: 142, type: !969, isLocal: true, isDefinition: true)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 44)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !924, line: 150, type: !974, isLocal: true, isDefinition: true)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !975)
!975 = !{!976}
!976 = !DISubrange(count: 48)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !924, line: 159, type: !51, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !924, line: 170, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 60)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !924, line: 248, type: !274, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !924, line: 248, type: !362, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !924, line: 254, type: !274, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !924, line: 254, type: !86, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !924, line: 254, type: !340, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !924, line: 259, type: !3, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !924, line: 259, type: !911, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1000, file: !1001, line: 26, type: !1003, isLocal: false, isDefinition: true)
!1000 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1001, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1002, splitDebugInlining: false, nameTableKind: None)
!1001 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1002 = !{!998}
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 376, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 47)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1008, file: !1009, line: 24, type: !1011, isLocal: false, isDefinition: true)
!1008 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1009, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1010, splitDebugInlining: false, nameTableKind: None)
!1009 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1010 = !{!1006}
!1011 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !1014, line: 34, type: !305, isLocal: true, isDefinition: true)
!1014 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !1014, line: 34, type: !316, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !1014, line: 34, type: !185, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !1021, line: 108, type: !91, isLocal: true, isDefinition: true)
!1021 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "internal_state", scope: !1024, file: !1021, line: 97, type: !1027, isLocal: true, isDefinition: true)
!1024 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1021, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1025, globals: !1026, splitDebugInlining: false, nameTableKind: None)
!1025 = !{!170, !172, !177}
!1026 = !{!1019, !1022}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !786, line: 6, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !788, line: 21, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 13, size: 64, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1029, file: !788, line: 15, baseType: !116, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1029, file: !788, line: 20, baseType: !1033, size: 32, offset: 32)
!1033 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1029, file: !788, line: 16, size: 32, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1033, file: !788, line: 18, baseType: !111, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1033, file: !788, line: 19, baseType: !292, size: 32)
!1037 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1038, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1039, splitDebugInlining: false, nameTableKind: None)
!1038 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1039 = !{!159}
!1040 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1041, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, splitDebugInlining: false, nameTableKind: None)
!1041 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!1042 = !{!170}
!1043 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1044, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, splitDebugInlining: false, nameTableKind: None)
!1044 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!1045 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1046, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1046 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1047 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1048, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1049, splitDebugInlining: false, nameTableKind: None)
!1048 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!1049 = !{!175}
!1050 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1051, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1051 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1052 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1053, splitDebugInlining: false, nameTableKind: None)
!1053 = !{!1054, !754}
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !756, line: 35, type: !14, isLocal: true, isDefinition: true)
!1056 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1057, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1058, splitDebugInlining: false, nameTableKind: None)
!1057 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!1058 = !{!559}
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !899, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1060, retainedTypes: !1061, globals: !1089, splitDebugInlining: false, nameTableKind: None)
!1060 = !{!135}
!1061 = !{!169, !170, !1062, !1088, !172}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !1065, line: 55, size: 3072, elements: !1066)
!1065 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1073, !1078, !1080, !1085, !1087}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1064, file: !1065, line: 57, baseType: !467, size: 16)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1064, file: !1065, line: 58, baseType: !464, size: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1064, file: !1065, line: 59, baseType: !957, size: 256, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1064, file: !1065, line: 61, baseType: !292, size: 32, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1064, file: !1065, line: 63, baseType: !957, size: 256, offset: 352)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1064, file: !1065, line: 65, baseType: !848, size: 2048, offset: 608)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1064, file: !1065, line: 67, baseType: !1074, size: 32, offset: 2656)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !1065, line: 42, size: 32, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1074, file: !1065, line: 45, baseType: !467, size: 16)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1074, file: !1065, line: 46, baseType: !467, size: 16, offset: 16)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1064, file: !1065, line: 74, baseType: !1079, size: 32, offset: 2688)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !253, line: 41, baseType: !116)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !1064, file: !1065, line: 79, baseType: !1081, size: 64, offset: 2720)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1065, line: 75, size: 64, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1081, file: !1065, line: 77, baseType: !1079, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1081, file: !1065, line: 78, baseType: !1079, size: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !1064, file: !1065, line: 84, baseType: !1086, size: 128, offset: 2784)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 128, elements: !293)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1064, file: !1065, line: 85, baseType: !274, size: 160, offset: 2912)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !560, line: 87, baseType: !179)
!1089 = !{!897, !900, !902, !904, !906, !908, !914, !916, !918, !920}
!1090 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1091, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1092, retainedTypes: !1097, splitDebugInlining: false, nameTableKind: None)
!1091 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!1092 = !{!1093}
!1093 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1094, line: 36, baseType: !111, size: 32, elements: !1095)
!1094 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!1095 = !{!1096}
!1096 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!1097 = !{!172}
!1098 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1099, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1099 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1100 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1101, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, splitDebugInlining: false, nameTableKind: None)
!1101 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1102 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1103, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, splitDebugInlining: false, nameTableKind: None)
!1103 = !DIFile(filename: "lib/time.c", directory: "/src", checksumkind: CSK_MD5, checksum: "402c2ccc7a3a90dfc8381b5d9f8bcf84")
!1104 = distinct !DICompileUnit(language: DW_LANG_C11, file: !924, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1105, retainedTypes: !1042, globals: !1109, splitDebugInlining: false, nameTableKind: None)
!1105 = !{!1106}
!1106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !924, line: 40, baseType: !111, size: 32, elements: !1107)
!1107 = !{!1108}
!1108 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1109 = !{!922, !925, !927, !929, !931, !933, !938, !943, !945, !950, !955, !960, !965, !967, !972, !977, !979, !984, !986, !988, !990, !992, !994, !996}
!1110 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1111, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1112, retainedTypes: !1143, splitDebugInlining: false, nameTableKind: None)
!1111 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1112 = !{!1113, !1125}
!1113 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1114, file: !1111, line: 188, baseType: !111, size: 32, elements: !1123)
!1114 = distinct !DISubprogram(name: "x2nrealloc", scope: !1111, file: !1111, line: 176, type: !1115, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1110, retainedNodes: !1118)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!170, !170, !1117, !172}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!1118 = !{!1119, !1120, !1121, !1122}
!1119 = !DILocalVariable(name: "p", arg: 1, scope: !1114, file: !1111, line: 176, type: !170)
!1120 = !DILocalVariable(name: "pn", arg: 2, scope: !1114, file: !1111, line: 176, type: !1117)
!1121 = !DILocalVariable(name: "s", arg: 3, scope: !1114, file: !1111, line: 176, type: !172)
!1122 = !DILocalVariable(name: "n", scope: !1114, file: !1111, line: 178, type: !172)
!1123 = !{!1124}
!1124 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1125 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1126, file: !1111, line: 228, baseType: !111, size: 32, elements: !1123)
!1126 = distinct !DISubprogram(name: "xpalloc", scope: !1111, file: !1111, line: 223, type: !1127, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1110, retainedNodes: !1133)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!170, !170, !1129, !1130, !1132, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1131, line: 130, baseType: !1132)
!1131 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !173, line: 35, baseType: !179)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142}
!1134 = !DILocalVariable(name: "pa", arg: 1, scope: !1126, file: !1111, line: 223, type: !170)
!1135 = !DILocalVariable(name: "pn", arg: 2, scope: !1126, file: !1111, line: 223, type: !1129)
!1136 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1126, file: !1111, line: 223, type: !1130)
!1137 = !DILocalVariable(name: "n_max", arg: 4, scope: !1126, file: !1111, line: 223, type: !1132)
!1138 = !DILocalVariable(name: "s", arg: 5, scope: !1126, file: !1111, line: 223, type: !1130)
!1139 = !DILocalVariable(name: "n0", scope: !1126, file: !1111, line: 230, type: !1130)
!1140 = !DILocalVariable(name: "n", scope: !1126, file: !1111, line: 237, type: !1130)
!1141 = !DILocalVariable(name: "nbytes", scope: !1126, file: !1111, line: 248, type: !1130)
!1142 = !DILocalVariable(name: "adjusted_nbytes", scope: !1126, file: !1111, line: 252, type: !1130)
!1143 = !{!169, !170, !178, !179, !174}
!1144 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1014, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1145, splitDebugInlining: false, nameTableKind: None)
!1145 = !{!1012, !1015, !1017}
!1146 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1147, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, splitDebugInlining: false, nameTableKind: None)
!1147 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1148 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1149, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!1149 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
