; ModuleID = 'src/printf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { x86_fp80 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s FORMAT [ARGUMENT]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [73 x i8] c"Print ARGUMENT(s) according to FORMAT, or execute according to OPTION:\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"printf\00", align 1, !dbg !17

!117 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!118 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !124, !126, !128, !133, !135, !140, !142, !147, !77, !149, !232, !237, !239, !244, !249, !254, !256, !258, !260, !262, !264, !266, !268, !273, !275, !277, !279, !281, !286, !291, !296, !301, !303, !305, !307, !309, !311, !316, !318, !320, !325, !330, !335, !340, !342, !344, !346, !348, !351, !356, !358, !363, !365, !367, !372, !374}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 709, type: !19, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 712, type: !64, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 14)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !74, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !2, line: 730, type: !74, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 747, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 53)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "exit_status", scope: !79, file: !2, line: 36, type: !114, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !151, file: !152, line: 575, type: !114, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "oputs_", scope: !152, file: !152, line: 573, type: !153, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !155)
!152 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!153 = !DISubroutineType(cc: DW_CC_nocall, types: !154)
!154 = !{null, !119, !119}
!155 = !{!156, !157, !158, !161, !162, !163, !164, !168, !169, !170, !171, !173, !226, !227, !228, !230, !231}
!156 = !DILocalVariable(name: "program", arg: 1, scope: !151, file: !152, line: 573, type: !119)
!157 = !DILocalVariable(name: "option", arg: 2, scope: !151, file: !152, line: 573, type: !119)
!158 = !DILocalVariable(name: "term", scope: !159, file: !152, line: 585, type: !119)
!159 = distinct !DILexicalBlock(scope: !160, file: !152, line: 582, column: 5)
!160 = distinct !DILexicalBlock(scope: !151, file: !152, line: 581, column: 7)
!161 = !DILocalVariable(name: "double_space", scope: !151, file: !152, line: 594, type: !122)
!162 = !DILocalVariable(name: "first_word", scope: !151, file: !152, line: 595, type: !119)
!163 = !DILocalVariable(name: "option_text", scope: !151, file: !152, line: 596, type: !119)
!164 = !DILocalVariable(name: "s", scope: !165, file: !152, line: 608, type: !119)
!165 = distinct !DILexicalBlock(scope: !166, file: !152, line: 605, column: 5)
!166 = distinct !DILexicalBlock(scope: !167, file: !152, line: 604, column: 12)
!167 = distinct !DILexicalBlock(scope: !151, file: !152, line: 597, column: 7)
!168 = !DILocalVariable(name: "spaces", scope: !165, file: !152, line: 609, type: !116)
!169 = !DILocalVariable(name: "anchor_len", scope: !151, file: !152, line: 620, type: !116)
!170 = !DILocalVariable(name: "desc_text", scope: !151, file: !152, line: 625, type: !119)
!171 = !DILocalVariable(name: "__ptr", scope: !172, file: !152, line: 644, type: !119)
!172 = distinct !DILexicalBlock(scope: !151, file: !152, line: 644, column: 3)
!173 = !DILocalVariable(name: "__stream", scope: !172, file: !152, line: 644, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !195, !197, !198, !199, !203, !204, !206, !207, !210, !212, !215, !218, !219, !220, !221, !222}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !178, line: 51, baseType: !114, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !178, line: 36, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !178, line: 70, baseType: !196, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !201, line: 152, baseType: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!202 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !178, line: 43, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !201, line: 153, baseType: !202)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !178, line: 37, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !178, line: 38, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !178, line: 93, baseType: !196, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 20)
!226 = !DILocalVariable(name: "__cnt", scope: !172, file: !152, line: 644, type: !116)
!227 = !DILocalVariable(name: "url_program", scope: !151, file: !152, line: 648, type: !119)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !152, line: 686, type: !119)
!229 = distinct !DILexicalBlock(scope: !151, file: !152, line: 686, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !152, line: 686, type: !174)
!231 = !DILocalVariable(name: "__cnt", scope: !229, file: !152, line: 686, type: !116)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !152, line: 585, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 5)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !152, line: 586, type: !234, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !152, line: 595, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 4)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !152, line: 620, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 6)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !152, line: 648, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !152, line: 648, type: !234, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !152, line: 649, type: !241, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !152, line: 649, type: !137, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !152, line: 650, type: !234, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !152, line: 651, type: !246, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !152, line: 651, type: !246, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !152, line: 652, type: !19, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !152, line: 653, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !152, line: 654, type: !64, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !152, line: 655, type: !64, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !152, line: 656, type: !64, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !152, line: 657, type: !64, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !152, line: 669, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 17)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !152, line: 669, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 40)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !152, line: 676, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 15)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !152, line: 676, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 61)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !152, line: 679, type: !137, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !152, line: 683, type: !234, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !152, line: 688, type: !234, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !152, line: 691, type: !270, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !152, line: 839, type: !74, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !152, line: 840, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 22)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !152, line: 841, type: !293, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !152, line: 862, type: !241, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !152, line: 868, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 71)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !152, line: 875, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 27)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !152, line: 877, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 51)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !152, line: 877, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 12)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !69, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 638, type: !313, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 662, type: !3, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !14, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !79, file: !2, line: 43, type: !350, isLocal: true, isDefinition: true)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 29)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !137, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 35)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !251, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !251, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 37)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 246, type: !337, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 41)
!379 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !382, line: 3, type: !293, isLocal: true, isDefinition: true)
!382 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "Version", scope: !385, file: !382, line: 3, type: !119, isLocal: false, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C11, file: !382, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !386, splitDebugInlining: false, nameTableKind: None)
!386 = !{!380, !383}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "file_name", scope: !389, file: !390, line: 45, type: !119, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !390, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!391 = !{!392, !394, !396, !398, !387, !400}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !19, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !337, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !390, line: 123, type: !19, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !390, line: 126, type: !137, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !389, file: !390, line: 55, type: !122, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !404, file: !405, line: 66, type: !451, isLocal: false, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C11, file: !405, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!406 = !{!112, !121}
!407 = !{!408, !410, !430, !432, !434, !436, !402, !438, !440, !442, !444, !449}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !405, line: 272, type: !234, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "old_file_name", scope: !412, file: !405, line: 304, type: !119, isLocal: true, isDefinition: true)
!412 = distinct !DISubprogram(name: "verror_at_line", scope: !405, file: !405, line: 298, type: !413, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !423)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !114, !114, !119, !83, !119, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !417)
!417 = !{!418, !420, !421, !422}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !416, file: !419, baseType: !83, size: 32)
!419 = !DIFile(filename: "lib/error.c", directory: "/src")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !416, file: !419, baseType: !83, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !416, file: !419, baseType: !112, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !416, file: !419, baseType: !112, size: 64, offset: 128)
!423 = !{!424, !425, !426, !427, !428, !429}
!424 = !DILocalVariable(name: "status", arg: 1, scope: !412, file: !405, line: 298, type: !114)
!425 = !DILocalVariable(name: "errnum", arg: 2, scope: !412, file: !405, line: 298, type: !114)
!426 = !DILocalVariable(name: "file_name", arg: 3, scope: !412, file: !405, line: 298, type: !119)
!427 = !DILocalVariable(name: "line_number", arg: 4, scope: !412, file: !405, line: 298, type: !83)
!428 = !DILocalVariable(name: "message", arg: 5, scope: !412, file: !405, line: 298, type: !119)
!429 = !DILocalVariable(name: "args", arg: 6, scope: !412, file: !405, line: 298, type: !415)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "old_line_number", scope: !412, file: !405, line: 305, type: !83, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !405, line: 338, type: !241, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !270, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !251, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "error_message_count", scope: !404, file: !405, line: 69, type: !83, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !404, file: !405, line: 295, type: !114, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !19, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 21)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !405, line: 214, type: !234, isLocal: true, isDefinition: true)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "program_name", scope: !456, file: !457, line: 31, type: !119, isLocal: false, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C11, file: !457, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !458, globals: !459, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!458 = !{!113}
!459 = !{!454, !460, !462}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !457, line: 46, type: !270, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !457, line: 49, type: !241, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "utf07FF", scope: !466, file: !467, line: 46, type: !494, isLocal: true, isDefinition: true)
!466 = distinct !DISubprogram(name: "proper_name_lite", scope: !467, file: !467, line: 38, type: !468, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !470, retainedNodes: !472)
!467 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!468 = !DISubroutineType(types: !469)
!469 = !{!119, !119, !119}
!470 = distinct !DICompileUnit(language: DW_LANG_C11, file: !467, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !471, splitDebugInlining: false, nameTableKind: None)
!471 = !{!464}
!472 = !{!473, !474, !475, !476, !481}
!473 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !466, file: !467, line: 38, type: !119)
!474 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !466, file: !467, line: 38, type: !119)
!475 = !DILocalVariable(name: "translation", scope: !466, file: !467, line: 40, type: !119)
!476 = !DILocalVariable(name: "w", scope: !466, file: !467, line: 47, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !478, line: 37, baseType: !479)
!478 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !201, line: 57, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !201, line: 42, baseType: !83)
!481 = !DILocalVariable(name: "mbs", scope: !466, file: !467, line: 48, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !483, line: 6, baseType: !484)
!483 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !485, line: 21, baseType: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !486, file: !485, line: 15, baseType: !114, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !486, file: !485, line: 20, baseType: !490, size: 32, offset: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !486, file: !485, line: 16, size: 32, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !490, file: !485, line: 18, baseType: !83, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !490, file: !485, line: 19, baseType: !241, size: 32)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 16, elements: !252)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !497, line: 78, type: !270, isLocal: true, isDefinition: true)
!497 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !497, line: 79, type: !246, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !497, line: 80, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 13)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !497, line: 81, type: !502, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !497, line: 82, type: !223, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !497, line: 83, type: !251, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !497, line: 84, type: !270, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !497, line: 85, type: !19, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !497, line: 86, type: !19, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !497, line: 87, type: !270, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !521, file: !497, line: 76, type: !593, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C11, file: !497, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !522, retainedTypes: !528, globals: !529, splitDebugInlining: false, nameTableKind: None)
!522 = !{!97, !523, !81}
!523 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !98, line: 254, baseType: !83, size: 32, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!526 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!527 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!528 = !{!114, !115, !116}
!529 = !{!495, !498, !500, !505, !507, !509, !511, !513, !515, !517, !519, !530, !534, !544, !546, !551, !553, !555, !557, !559, !582, !589, !591}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !521, file: !497, line: 92, type: !532, isLocal: false, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 320, elements: !65)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !521, file: !497, line: 1040, type: !536, isLocal: false, isDefinition: true)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !497, line: 56, size: 448, elements: !537)
!537 = !{!538, !539, !540, !542, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !536, file: !497, line: 59, baseType: !97, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !536, file: !497, line: 62, baseType: !114, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !536, file: !497, line: 66, baseType: !541, size: 256, offset: 64)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !271)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !536, file: !497, line: 69, baseType: !119, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !536, file: !497, line: 72, baseType: !119, size: 64, offset: 384)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !521, file: !497, line: 107, type: !536, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "slot0", scope: !521, file: !497, line: 831, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 256)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !497, line: 321, type: !251, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !497, line: 357, type: !251, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !497, line: 358, type: !251, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !497, line: 199, type: !19, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "quote", scope: !561, file: !497, line: 228, type: !580, isLocal: true, isDefinition: true)
!561 = distinct !DISubprogram(name: "gettext_quote", scope: !497, file: !497, line: 197, type: !562, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !521, retainedNodes: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{!119, !119, !97}
!564 = !{!565, !566, !567, !568, !569}
!565 = !DILocalVariable(name: "msgid", arg: 1, scope: !561, file: !497, line: 197, type: !119)
!566 = !DILocalVariable(name: "s", arg: 2, scope: !561, file: !497, line: 197, type: !97)
!567 = !DILocalVariable(name: "translation", scope: !561, file: !497, line: 199, type: !119)
!568 = !DILocalVariable(name: "w", scope: !561, file: !497, line: 229, type: !477)
!569 = !DILocalVariable(name: "mbs", scope: !561, file: !497, line: 230, type: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !483, line: 6, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !485, line: 21, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !572, file: !485, line: 15, baseType: !114, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !572, file: !485, line: 20, baseType: !576, size: 32, offset: 32)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !485, line: 16, size: 32, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !576, file: !485, line: 18, baseType: !83, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !576, file: !485, line: 19, baseType: !241, size: 32)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !581)
!581 = !{!253, !243}
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "slotvec", scope: !521, file: !497, line: 834, type: !584, isLocal: true, isDefinition: true)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !497, line: 823, size: 128, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !585, file: !497, line: 825, baseType: !116, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !585, file: !497, line: 826, baseType: !113, size: 64, offset: 64)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "nslots", scope: !521, file: !497, line: 832, type: !114, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "slotvec0", scope: !521, file: !497, line: 833, type: !585, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 704, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 11)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!597 = distinct !DIGlobalVariable(name: "initialized", scope: !598, file: !599, line: 71, type: !114, isLocal: true, isDefinition: true)
!598 = distinct !DISubprogram(name: "unicode_to_mb", scope: !599, file: !599, line: 64, type: !600, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !608, retainedNodes: !681)
!599 = !DIFile(filename: "lib/unicodeio.c", directory: "/src", checksumkind: CSK_MD5, checksum: "34bd73d3f6fd35e045c925e67e34cd2b")
!600 = !DISubroutineType(types: !601)
!601 = !{!202, !83, !602, !605, !112}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!202, !119, !116, !112}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!202, !83, !119, !112}
!608 = distinct !DICompileUnit(language: DW_LANG_C11, file: !599, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !609, globals: !648, splitDebugInlining: false, nameTableKind: None)
!609 = !{!610, !612, !613, !116, !614, !112}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !611, line: 29, baseType: !112)
!611 = !DIFile(filename: "/usr/include/iconv.h", directory: "", checksumkind: CSK_MD5, checksum: "694d7c23a6e081413ae05832107726a3")
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !616, file: !178, line: 51, baseType: !114, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !616, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !616, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !616, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !616, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !616, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !616, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !616, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !616, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !616, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !616, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !616, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !616, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !616, file: !178, line: 70, baseType: !632, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !616, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !616, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !616, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !616, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !616, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !616, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !616, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !616, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !616, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !616, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !616, file: !178, line: 93, baseType: !632, size: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !616, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !616, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !616, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !616, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!648 = !{!649, !650, !652, !654, !656, !658, !660, !665, !670, !675, !677, !679}
!649 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "is_utf8", scope: !598, file: !599, line: 72, type: !114, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "utf8_to_local", scope: !598, file: !599, line: 74, type: !610, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !599, line: 81, type: !246, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !599, line: 88, type: !246, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !599, line: 99, type: !19, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !599, line: 99, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 26)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !599, line: 109, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 23)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !599, line: 178, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 45)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !599, line: 180, type: !9, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !599, line: 195, type: !19, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !599, line: 197, type: !19, isLocal: true, isDefinition: true)
!681 = !{!682, !683, !684, !685, !686, !689, !690, !691, !697, !698, !699, !700, !701}
!682 = !DILocalVariable(name: "code", arg: 1, scope: !598, file: !599, line: 64, type: !83)
!683 = !DILocalVariable(name: "success", arg: 2, scope: !598, file: !599, line: 65, type: !602)
!684 = !DILocalVariable(name: "failure", arg: 3, scope: !598, file: !599, line: 67, type: !605)
!685 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !598, file: !599, line: 69, type: !112)
!686 = !DILocalVariable(name: "charset", scope: !687, file: !599, line: 79, type: !119)
!687 = distinct !DILexicalBlock(scope: !688, file: !599, line: 78, column: 5)
!688 = distinct !DILexicalBlock(scope: !598, file: !599, line: 77, column: 7)
!689 = !DILocalVariable(name: "inbuf", scope: !598, file: !599, line: 106, type: !246)
!690 = !DILocalVariable(name: "count", scope: !598, file: !599, line: 107, type: !114)
!691 = !DILocalVariable(name: "outbuf", scope: !692, file: !599, line: 114, type: !694)
!692 = distinct !DILexicalBlock(scope: !693, file: !599, line: 113, column: 5)
!693 = distinct !DILexicalBlock(scope: !598, file: !599, line: 112, column: 7)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 25)
!697 = !DILocalVariable(name: "inptr", scope: !692, file: !599, line: 115, type: !119)
!698 = !DILocalVariable(name: "inbytesleft", scope: !692, file: !599, line: 116, type: !116)
!699 = !DILocalVariable(name: "outptr", scope: !692, file: !599, line: 117, type: !113)
!700 = !DILocalVariable(name: "outbytesleft", scope: !692, file: !599, line: 118, type: !116)
!701 = !DILocalVariable(name: "res", scope: !692, file: !599, line: 121, type: !116)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !704, line: 67, type: !337, isLocal: true, isDefinition: true)
!704 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !704, line: 69, type: !19, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !704, line: 83, type: !19, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !704, line: 83, type: !241, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !704, line: 85, type: !251, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !704, line: 88, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 171)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !704, line: 88, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 34)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !704, line: 105, type: !74, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !704, line: 109, type: !667, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !704, line: 113, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 28)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !704, line: 120, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 32)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !704, line: 127, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 36)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !704, line: 134, type: !288, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !704, line: 142, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 44)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !704, line: 150, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 48)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !704, line: 159, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 52)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !704, line: 170, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 60)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !704, line: 248, type: !223, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !704, line: 248, type: !313, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !704, line: 254, type: !223, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !704, line: 254, type: !130, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !704, line: 254, type: !288, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !704, line: 259, type: !3, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !704, line: 259, type: !353, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !780, file: !781, line: 26, type: !783, isLocal: false, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !781, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !782, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!782 = !{!778}
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 376, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 47)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !788, line: 34, type: !137, isLocal: true, isDefinition: true)
!788 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !788, line: 34, type: !19, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !788, line: 34, type: !283, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "exit_failure", scope: !795, file: !796, line: 24, type: !798, isLocal: false, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C11, file: !796, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !797, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!797 = !{!793}
!798 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !801, line: 47, type: !19, isLocal: true, isDefinition: true)
!801 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !801, line: 47, type: !734, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !806, file: !832, line: 58, type: !833, isLocal: true, isDefinition: true)
!806 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !808, globals: !829, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!808 = !{!113, !809}
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !810, line: 24, baseType: !811)
!810 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !812, line: 41, baseType: !813)
!812 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !812, line: 27, size: 1856, elements: !815)
!815 = !{!816, !820, !823, !826, !827}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !814, file: !812, line: 30, baseType: !817, size: 832)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 832, elements: !503)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !812, line: 30, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !814, file: !812, line: 33, baseType: !821, size: 64, offset: 832)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !814, file: !812, line: 34, baseType: !824, size: 64, offset: 896)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !814, file: !812, line: 35, baseType: !824, size: 64, offset: 960)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !814, file: !812, line: 38, baseType: !828, size: 832, offset: 1024)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 832, elements: !503)
!829 = !{!830, !804}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !832, line: 66, type: !251, isLocal: true, isDefinition: true)
!832 = !DIFile(filename: "./lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!833 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !809)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !836, line: 35, type: !246, isLocal: true, isDefinition: true)
!836 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !839, line: 873, type: !59, isLocal: true, isDefinition: true)
!839 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !839, line: 1032, type: !246, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !844, line: 108, type: !59, isLocal: true, isDefinition: true)
!844 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "internal_state", scope: !847, file: !844, line: 97, type: !850, isLocal: true, isDefinition: true)
!847 = distinct !DICompileUnit(language: DW_LANG_C11, file: !844, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !848, globals: !849, splitDebugInlining: false, nameTableKind: None)
!848 = !{!112, !116, !121}
!849 = !{!842, !845}
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !483, line: 6, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !485, line: 21, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 64, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !852, file: !485, line: 15, baseType: !114, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !852, file: !485, line: 20, baseType: !856, size: 32, offset: 32)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !852, file: !485, line: 16, size: 32, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !856, file: !485, line: 18, baseType: !83, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !856, file: !485, line: 19, baseType: !241, size: 32)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !862, line: 4617, type: !241, isLocal: true, isDefinition: true)
!862 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !862, line: 5292, type: !246, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "decimal_format", scope: !867, file: !862, line: 5889, type: !1329, isLocal: true, isDefinition: true)
!867 = distinct !DISubprogram(name: "vasnprintf", scope: !862, file: !862, line: 2459, type: !868, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !879, retainedNodes: !1414)
!868 = !DISubroutineType(types: !869)
!869 = !{!113, !113, !870, !119, !871}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !873)
!873 = !{!874, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !872, file: !875, baseType: !83, size: 32)
!875 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src")
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !872, file: !875, baseType: !83, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !872, file: !875, baseType: !112, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !872, file: !875, baseType: !112, size: 64, offset: 128)
!879 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !880, retainedTypes: !1317, globals: !1326, splitDebugInlining: false, nameTableKind: None)
!880 = !{!881, !931}
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !882, line: 47, baseType: !83, size: 32, elements: !883)
!882 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!884 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!885 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!886 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!887 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!888 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!889 = !DIEnumerator(name: "TYPE_INT", value: 5)
!890 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!891 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!892 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!893 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!894 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!895 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!896 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!897 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!898 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!899 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!900 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!901 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!902 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!903 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!904 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!905 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!906 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!907 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!908 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!909 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!910 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!911 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!912 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!913 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!914 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!915 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!916 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!917 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!918 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!919 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!920 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!921 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!922 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!923 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!924 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!925 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!926 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!927 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!928 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!929 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!930 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !932, line: 41, baseType: !83, size: 32, elements: !933)
!932 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!934 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!935 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!936 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!937 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!938 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!939 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!940 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!941 = !DIEnumerator(name: "DAY_1", value: 131079)
!942 = !DIEnumerator(name: "DAY_2", value: 131080)
!943 = !DIEnumerator(name: "DAY_3", value: 131081)
!944 = !DIEnumerator(name: "DAY_4", value: 131082)
!945 = !DIEnumerator(name: "DAY_5", value: 131083)
!946 = !DIEnumerator(name: "DAY_6", value: 131084)
!947 = !DIEnumerator(name: "DAY_7", value: 131085)
!948 = !DIEnumerator(name: "ABMON_1", value: 131086)
!949 = !DIEnumerator(name: "ABMON_2", value: 131087)
!950 = !DIEnumerator(name: "ABMON_3", value: 131088)
!951 = !DIEnumerator(name: "ABMON_4", value: 131089)
!952 = !DIEnumerator(name: "ABMON_5", value: 131090)
!953 = !DIEnumerator(name: "ABMON_6", value: 131091)
!954 = !DIEnumerator(name: "ABMON_7", value: 131092)
!955 = !DIEnumerator(name: "ABMON_8", value: 131093)
!956 = !DIEnumerator(name: "ABMON_9", value: 131094)
!957 = !DIEnumerator(name: "ABMON_10", value: 131095)
!958 = !DIEnumerator(name: "ABMON_11", value: 131096)
!959 = !DIEnumerator(name: "ABMON_12", value: 131097)
!960 = !DIEnumerator(name: "MON_1", value: 131098)
!961 = !DIEnumerator(name: "MON_2", value: 131099)
!962 = !DIEnumerator(name: "MON_3", value: 131100)
!963 = !DIEnumerator(name: "MON_4", value: 131101)
!964 = !DIEnumerator(name: "MON_5", value: 131102)
!965 = !DIEnumerator(name: "MON_6", value: 131103)
!966 = !DIEnumerator(name: "MON_7", value: 131104)
!967 = !DIEnumerator(name: "MON_8", value: 131105)
!968 = !DIEnumerator(name: "MON_9", value: 131106)
!969 = !DIEnumerator(name: "MON_10", value: 131107)
!970 = !DIEnumerator(name: "MON_11", value: 131108)
!971 = !DIEnumerator(name: "MON_12", value: 131109)
!972 = !DIEnumerator(name: "AM_STR", value: 131110)
!973 = !DIEnumerator(name: "PM_STR", value: 131111)
!974 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!975 = !DIEnumerator(name: "D_FMT", value: 131113)
!976 = !DIEnumerator(name: "T_FMT", value: 131114)
!977 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!978 = !DIEnumerator(name: "ERA", value: 131116)
!979 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!980 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!981 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!982 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!983 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!984 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!985 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!986 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!987 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!988 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!989 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!990 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!991 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!992 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!993 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!994 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!995 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!996 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!997 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!998 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!999 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!1000 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!1001 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!1002 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!1003 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!1004 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!1005 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!1006 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!1007 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!1008 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!1009 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!1010 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!1011 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!1012 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!1013 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!1014 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!1015 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!1016 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!1017 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!1018 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!1019 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!1020 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!1021 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!1022 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!1023 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!1024 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!1025 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!1026 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!1027 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!1028 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!1029 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!1030 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!1031 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!1032 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!1033 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!1034 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!1035 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!1036 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!1037 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!1038 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!1039 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!1040 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!1041 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!1042 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!1043 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!1044 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!1045 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!1046 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!1047 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!1048 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!1049 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!1050 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!1051 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!1052 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!1053 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!1054 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!1055 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!1056 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!1057 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!1058 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!1059 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!1060 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!1061 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!1062 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!1063 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!1064 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!1065 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!1066 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!1067 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!1068 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!1069 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!1070 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!1071 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!1072 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!1073 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!1074 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!1075 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!1076 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!1077 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!1078 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!1079 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!1080 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!1081 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!1082 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!1083 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!1084 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!1085 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!1086 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!1087 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!1088 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!1089 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!1090 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!1091 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!1092 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!1093 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!1094 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!1095 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!1096 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!1097 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!1098 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!1099 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!1100 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!1101 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!1102 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!1103 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!1104 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!1105 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!1106 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!1107 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!1108 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!1109 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!1110 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!1111 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!1112 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!1113 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!1114 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!1115 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!1116 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!1117 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!1118 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!1119 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!1120 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!1121 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!1122 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!1123 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!1124 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!1125 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!1126 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!1127 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!1128 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!1129 = !DIEnumerator(name: "CODESET", value: 14)
!1130 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!1131 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!1132 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!1133 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!1134 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!1135 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!1136 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!1137 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!1138 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!1139 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!1140 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!1141 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!1142 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!1143 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!1144 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!1145 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!1146 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!1147 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!1148 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!1149 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!1150 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!1151 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!1152 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!1153 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!1154 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!1155 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!1156 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!1157 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!1158 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!1159 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!1160 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!1161 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!1162 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!1163 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!1164 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!1165 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!1166 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!1167 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!1168 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!1169 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!1170 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!1171 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!1172 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!1173 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!1174 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!1175 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!1176 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!1177 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!1178 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!1179 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!1180 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!1181 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!1182 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!1183 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!1184 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!1185 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!1186 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!1187 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!1188 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!1189 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!1190 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!1191 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!1192 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!1193 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!1194 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!1195 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!1196 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!1197 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!1198 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!1199 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!1200 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!1201 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!1202 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!1203 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!1204 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!1205 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!1206 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!1207 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!1208 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!1209 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!1210 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!1211 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!1212 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!1213 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!1214 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!1215 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!1216 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!1217 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!1218 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!1219 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!1220 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!1221 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!1222 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!1223 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!1224 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!1225 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!1226 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!1227 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!1228 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!1229 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!1230 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!1231 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!1232 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!1233 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!1234 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!1235 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!1236 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!1237 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!1238 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!1239 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!1240 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!1241 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!1242 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!1243 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!1244 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!1245 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!1246 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!1247 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!1248 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!1249 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!1250 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!1251 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!1252 = !DIEnumerator(name: "THOUSEP", value: 65537)
!1253 = !DIEnumerator(name: "__GROUPING", value: 65538)
!1254 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!1255 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!1256 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!1257 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!1258 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!1259 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!1260 = !DIEnumerator(name: "__YESSTR", value: 327682)
!1261 = !DIEnumerator(name: "__NOSTR", value: 327683)
!1262 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!1263 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!1264 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!1265 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!1266 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!1267 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!1268 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!1269 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!1270 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!1271 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!1272 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!1273 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
