; ModuleID = 'src/printenv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [164 x i8] c"Usage: %s [OPTION] [VARIABLE]...\0APrint the values of the specified environment VARIABLE(s).\0AIf no VARIABLE is specified, print name and value pairs for them all.\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [9 x i8] c"printenv\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [66 x i8] c"  -0, --null\0A         end each output line with NUL, not newline\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22

!78 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!79 = !DIEnumerator(name: "_ISspace", value: 8192)
!80 = !DIEnumerator(name: "_ISprint", value: 16384)
!81 = !DIEnumerator(name: "_ISgraph", value: 32768)
!82 = !DIEnumerator(name: "_ISblank", value: 1)
!83 = !DIEnumerator(name: "_IScntrl", value: 2)
!84 = !DIEnumerator(name: "_ISpunct", value: 4)
!85 = !DIEnumerator(name: "_ISalnum", value: 8)
!86 = !{!87, !88, !67, !89, !90, !93, !95}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!92 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!95 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !97, !102, !107, !112, !117, !200, !202, !204, !209, !211, !216, !218, !220, !225, !227, !229, !231, !236, !241, !243, !245, !247, !249, !251, !253, !255, !260, !265, !270, !272, !274, !276, !278, !280, !285, !287, !289, !294, !299, !304, !309, !311, !313, !57}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 14)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 16)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 17)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 5)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !119, file: !66, line: 575, type: !67, isLocal: true, isDefinition: true)
!119 = distinct !DISubprogram(name: "oputs_", scope: !66, file: !66, line: 573, type: !120, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !122)
!120 = !DISubroutineType(cc: DW_CC_nocall, types: !121)
!121 = !{null, !93, !93}
!122 = !{!123, !124, !125, !128, !130, !131, !132, !136, !137, !138, !139, !141, !194, !195, !196, !198, !199}
!123 = !DILocalVariable(name: "program", arg: 1, scope: !119, file: !66, line: 573, type: !93)
!124 = !DILocalVariable(name: "option", arg: 2, scope: !119, file: !66, line: 573, type: !93)
!125 = !DILocalVariable(name: "term", scope: !126, file: !66, line: 585, type: !93)
!126 = distinct !DILexicalBlock(scope: !127, file: !66, line: 582, column: 5)
!127 = distinct !DILexicalBlock(scope: !119, file: !66, line: 581, column: 7)
!128 = !DILocalVariable(name: "double_space", scope: !119, file: !66, line: 594, type: !129)
!129 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!130 = !DILocalVariable(name: "first_word", scope: !119, file: !66, line: 595, type: !93)
!131 = !DILocalVariable(name: "option_text", scope: !119, file: !66, line: 596, type: !93)
!132 = !DILocalVariable(name: "s", scope: !133, file: !66, line: 608, type: !93)
!133 = distinct !DILexicalBlock(scope: !134, file: !66, line: 605, column: 5)
!134 = distinct !DILexicalBlock(scope: !135, file: !66, line: 604, column: 12)
!135 = distinct !DILexicalBlock(scope: !119, file: !66, line: 597, column: 7)
!136 = !DILocalVariable(name: "spaces", scope: !133, file: !66, line: 609, type: !90)
!137 = !DILocalVariable(name: "anchor_len", scope: !119, file: !66, line: 620, type: !90)
!138 = !DILocalVariable(name: "desc_text", scope: !119, file: !66, line: 625, type: !93)
!139 = !DILocalVariable(name: "__ptr", scope: !140, file: !66, line: 644, type: !93)
!140 = distinct !DILexicalBlock(scope: !119, file: !66, line: 644, column: 3)
!141 = !DILocalVariable(name: "__stream", scope: !140, file: !66, line: 644, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !144, line: 7, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 49, size: 1728, elements: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !163, !165, !166, !167, !171, !172, !174, !175, !178, !180, !183, !186, !187, !188, !189, !190}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !145, file: !146, line: 51, baseType: !67, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !145, file: !146, line: 54, baseType: !87, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !145, file: !146, line: 55, baseType: !87, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !145, file: !146, line: 56, baseType: !87, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !145, file: !146, line: 57, baseType: !87, size: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !145, file: !146, line: 58, baseType: !87, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !145, file: !146, line: 59, baseType: !87, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !145, file: !146, line: 60, baseType: !87, size: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !145, file: !146, line: 61, baseType: !87, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !145, file: !146, line: 64, baseType: !87, size: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !145, file: !146, line: 65, baseType: !87, size: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !145, file: !146, line: 66, baseType: !87, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !145, file: !146, line: 68, baseType: !161, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !146, line: 36, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !145, file: !146, line: 70, baseType: !164, size: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !145, file: !146, line: 72, baseType: !67, size: 32, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !145, file: !146, line: 73, baseType: !67, size: 32, offset: 928)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !145, file: !146, line: 74, baseType: !168, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !169, line: 152, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!170 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !145, file: !146, line: 77, baseType: !89, size: 16, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !145, file: !146, line: 78, baseType: !173, size: 8, offset: 1040)
!173 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !145, file: !146, line: 79, baseType: !39, size: 8, offset: 1048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !145, file: !146, line: 81, baseType: !176, size: 64, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !146, line: 43, baseType: null)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !145, file: !146, line: 89, baseType: !179, size: 64, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !169, line: 153, baseType: !170)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !145, file: !146, line: 91, baseType: !181, size: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !146, line: 37, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !145, file: !146, line: 92, baseType: !184, size: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !146, line: 38, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !145, file: !146, line: 93, baseType: !164, size: 64, offset: 1344)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !145, file: !146, line: 94, baseType: !88, size: 64, offset: 1408)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !145, file: !146, line: 95, baseType: !90, size: 64, offset: 1472)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !145, file: !146, line: 96, baseType: !67, size: 32, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !145, file: !146, line: 98, baseType: !191, size: 160, offset: 1568)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 20)
!194 = !DILocalVariable(name: "__cnt", scope: !140, file: !66, line: 644, type: !90)
!195 = !DILocalVariable(name: "url_program", scope: !119, file: !66, line: 648, type: !93)
!196 = !DILocalVariable(name: "__ptr", scope: !197, file: !66, line: 686, type: !93)
!197 = distinct !DILexicalBlock(scope: !119, file: !66, line: 686, column: 3)
!198 = !DILocalVariable(name: "__stream", scope: !197, file: !66, line: 686, type: !142)
!199 = !DILocalVariable(name: "__cnt", scope: !197, file: !66, line: 686, type: !90)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !66, line: 585, type: !114, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !66, line: 586, type: !114, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !66, line: 595, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 4)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !66, line: 620, type: !54, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !66, line: 648, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 2)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !66, line: 648, type: !114, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !66, line: 649, type: !206, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !66, line: 649, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 3)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !66, line: 650, type: !114, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !66, line: 651, type: !54, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !66, line: 651, type: !54, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !66, line: 652, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 7)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !66, line: 653, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 8)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !66, line: 654, type: !44, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !66, line: 655, type: !44, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !66, line: 656, type: !44, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !66, line: 657, type: !44, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !66, line: 663, type: !233, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !66, line: 664, type: !44, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !66, line: 669, type: !109, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !66, line: 669, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 40)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !66, line: 676, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 15)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !66, line: 676, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 61)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !66, line: 679, type: !222, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !66, line: 683, type: !114, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !66, line: 688, type: !114, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !66, line: 691, type: !238, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !66, line: 839, type: !104, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !66, line: 840, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 22)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !66, line: 841, type: !262, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !66, line: 862, type: !206, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !66, line: 868, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 71)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !66, line: 875, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 27)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !66, line: 877, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 51)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !66, line: 877, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 12)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !114, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !114, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !238, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 1024, elements: !207)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !318, line: 50, size: 256, elements: !319)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!319 = !{!320, !321, !322, !324}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 52, baseType: !93, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !317, file: !318, line: 55, baseType: !67, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !318, line: 56, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !317, file: !318, line: 57, baseType: !67, size: 32, offset: 192)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !327, line: 3, type: !262, isLocal: true, isDefinition: true)
!327 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "Version", scope: !330, file: !327, line: 3, type: !93, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C11, file: !327, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !331, splitDebugInlining: false, nameTableKind: None)
!331 = !{!325, !328}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "file_name", scope: !334, file: !335, line: 45, type: !93, isLocal: true, isDefinition: true)
!334 = distinct !DICompileUnit(language: DW_LANG_C11, file: !335, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !336, splitDebugInlining: false, nameTableKind: None)
!335 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!336 = !{!337, !339, !341, !343, !332, !345}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !335, line: 121, type: !233, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !335, line: 121, type: !306, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !335, line: 123, type: !233, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !335, line: 126, type: !222, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !334, file: !335, line: 55, type: !129, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !349, file: !350, line: 66, type: !396, isLocal: false, isDefinition: true)
!349 = distinct !DICompileUnit(language: DW_LANG_C11, file: !350, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !351, globals: !352, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!351 = !{!88, !95}
!352 = !{!353, !355, !375, !377, !379, !381, !347, !383, !385, !387, !389, !394}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !350, line: 272, type: !114, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "old_file_name", scope: !357, file: !350, line: 304, type: !93, isLocal: true, isDefinition: true)
!357 = distinct !DISubprogram(name: "verror_at_line", scope: !350, file: !350, line: 298, type: !358, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !368)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !67, !67, !93, !62, !93, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !362)
!362 = !{!363, !365, !366, !367}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !361, file: !364, baseType: !62, size: 32)
!364 = !DIFile(filename: "lib/error.c", directory: "/src")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !361, file: !364, baseType: !62, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !361, file: !364, baseType: !88, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !361, file: !364, baseType: !88, size: 64, offset: 128)
!368 = !{!369, !370, !371, !372, !373, !374}
!369 = !DILocalVariable(name: "status", arg: 1, scope: !357, file: !350, line: 298, type: !67)
!370 = !DILocalVariable(name: "errnum", arg: 2, scope: !357, file: !350, line: 298, type: !67)
!371 = !DILocalVariable(name: "file_name", arg: 3, scope: !357, file: !350, line: 298, type: !93)
!372 = !DILocalVariable(name: "line_number", arg: 4, scope: !357, file: !350, line: 298, type: !62)
!373 = !DILocalVariable(name: "message", arg: 5, scope: !357, file: !350, line: 298, type: !93)
!374 = !DILocalVariable(name: "args", arg: 6, scope: !357, file: !350, line: 298, type: !360)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "old_line_number", scope: !357, file: !350, line: 305, type: !62, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !350, line: 338, type: !206, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !350, line: 346, type: !238, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !350, line: 346, type: !213, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "error_message_count", scope: !349, file: !350, line: 69, type: !62, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !349, file: !350, line: 295, type: !67, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !350, line: 208, type: !233, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !350, line: 208, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 21)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !350, line: 214, type: !114, isLocal: true, isDefinition: true)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{null}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "program_name", scope: !401, file: !402, line: 31, type: !93, isLocal: false, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C11, file: !402, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !403, globals: !404, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!403 = !{!87}
!404 = !{!399, !405, !407}
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !402, line: 46, type: !238, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !402, line: 49, type: !206, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "utf07FF", scope: !411, file: !412, line: 46, type: !439, isLocal: true, isDefinition: true)
!411 = distinct !DISubprogram(name: "proper_name_lite", scope: !412, file: !412, line: 38, type: !413, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !415, retainedNodes: !417)
!412 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!413 = !DISubroutineType(types: !414)
!414 = !{!93, !93, !93}
!415 = distinct !DICompileUnit(language: DW_LANG_C11, file: !412, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !416, splitDebugInlining: false, nameTableKind: None)
!416 = !{!409}
!417 = !{!418, !419, !420, !421, !426}
!418 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !411, file: !412, line: 38, type: !93)
!419 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !411, file: !412, line: 38, type: !93)
!420 = !DILocalVariable(name: "translation", scope: !411, file: !412, line: 40, type: !93)
!421 = !DILocalVariable(name: "w", scope: !411, file: !412, line: 47, type: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !423, line: 37, baseType: !424)
!423 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !169, line: 57, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !169, line: 42, baseType: !62)
!426 = !DILocalVariable(name: "mbs", scope: !411, file: !412, line: 48, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !428, line: 6, baseType: !429)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !430, line: 21, baseType: !431)
!430 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 13, size: 64, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !431, file: !430, line: 15, baseType: !67, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !431, file: !430, line: 20, baseType: !435, size: 32, offset: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !431, file: !430, line: 16, size: 32, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !435, file: !430, line: 18, baseType: !62, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !435, file: !430, line: 19, baseType: !206, size: 32)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 16, elements: !214)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !442, line: 78, type: !238, isLocal: true, isDefinition: true)
!442 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !442, line: 79, type: !54, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !442, line: 80, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 13)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !442, line: 81, type: !447, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !442, line: 82, type: !191, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !442, line: 83, type: !213, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !442, line: 84, type: !238, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !442, line: 85, type: !233, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !442, line: 86, type: !233, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !442, line: 87, type: !238, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !466, file: !442, line: 76, type: !552, isLocal: false, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C11, file: !442, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !467, retainedTypes: !487, globals: !488, splitDebugInlining: false, nameTableKind: None)
!467 = !{!468, !482, !71}
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !469, line: 42, baseType: !62, size: 32, elements: !470)
!469 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!471 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!472 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!473 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!474 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!475 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!476 = !DIEnumerator(name: "c_quoting_style", value: 5)
!477 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!478 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!479 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!480 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!481 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !469, line: 254, baseType: !62, size: 32, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!485 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!486 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!487 = !{!67, !89, !90}
!488 = !{!440, !443, !445, !450, !452, !454, !456, !458, !460, !462, !464, !489, !493, !503, !505, !510, !512, !514, !516, !518, !541, !548, !550}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !466, file: !442, line: 92, type: !491, isLocal: false, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 320, elements: !45)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !466, file: !442, line: 1040, type: !495, isLocal: false, isDefinition: true)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !442, line: 56, size: 448, elements: !496)
!496 = !{!497, !498, !499, !501, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !495, file: !442, line: 59, baseType: !468, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !442, line: 62, baseType: !67, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !495, file: !442, line: 66, baseType: !500, size: 256, offset: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !239)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !495, file: !442, line: 69, baseType: !93, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !495, file: !442, line: 72, baseType: !93, size: 64, offset: 384)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !466, file: !442, line: 107, type: !495, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "slot0", scope: !466, file: !442, line: 831, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 256)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !442, line: 321, type: !213, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !442, line: 357, type: !213, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !442, line: 358, type: !213, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !442, line: 199, type: !233, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "quote", scope: !520, file: !442, line: 228, type: !539, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "gettext_quote", scope: !442, file: !442, line: 197, type: !521, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !466, retainedNodes: !523)
!521 = !DISubroutineType(types: !522)
!522 = !{!93, !93, !468}
!523 = !{!524, !525, !526, !527, !528}
!524 = !DILocalVariable(name: "msgid", arg: 1, scope: !520, file: !442, line: 197, type: !93)
!525 = !DILocalVariable(name: "s", arg: 2, scope: !520, file: !442, line: 197, type: !468)
!526 = !DILocalVariable(name: "translation", scope: !520, file: !442, line: 199, type: !93)
!527 = !DILocalVariable(name: "w", scope: !520, file: !442, line: 229, type: !422)
!528 = !DILocalVariable(name: "mbs", scope: !520, file: !442, line: 230, type: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !428, line: 6, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !430, line: 21, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 13, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !531, file: !430, line: 15, baseType: !67, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !531, file: !430, line: 20, baseType: !535, size: 32, offset: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !531, file: !430, line: 16, size: 32, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !535, file: !430, line: 18, baseType: !62, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !535, file: !430, line: 19, baseType: !206, size: 32)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, elements: !540)
!540 = !{!215, !208}
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "slotvec", scope: !466, file: !442, line: 834, type: !543, isLocal: true, isDefinition: true)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !442, line: 823, size: 128, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !442, line: 825, baseType: !90, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !544, file: !442, line: 826, baseType: !87, size: 64, offset: 64)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "nslots", scope: !466, file: !442, line: 832, type: !67, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "slotvec0", scope: !466, file: !442, line: 833, type: !544, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 704, elements: !554)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!554 = !{!555}
!555 = !DISubrange(count: 11)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !558, line: 67, type: !306, isLocal: true, isDefinition: true)
!558 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !558, line: 69, type: !233, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !558, line: 83, type: !233, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !558, line: 83, type: !206, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !558, line: 85, type: !213, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !558, line: 88, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 171)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !558, line: 88, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 34)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !558, line: 105, type: !104, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !558, line: 109, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 23)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !558, line: 113, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 28)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !558, line: 120, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 32)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !558, line: 127, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 36)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !558, line: 134, type: !257, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !558, line: 142, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 44)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !558, line: 150, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 48)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !558, line: 159, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 52)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !558, line: 170, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 60)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !558, line: 248, type: !191, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !558, line: 248, type: !282, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !558, line: 254, type: !191, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !558, line: 254, type: !99, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !558, line: 254, type: !257, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !558, line: 259, type: !3, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !558, line: 259, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 29)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !640, file: !641, line: 26, type: !643, isLocal: false, isDefinition: true)
!640 = distinct !DICompileUnit(language: DW_LANG_C11, file: !641, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !642, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!642 = !{!638}
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 376, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 47)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "exit_failure", scope: !648, file: !649, line: 24, type: !651, isLocal: false, isDefinition: true)
!648 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !650, splitDebugInlining: false, nameTableKind: None)
!649 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!650 = !{!646}
!651 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !654, line: 34, type: !222, isLocal: true, isDefinition: true)
!654 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !654, line: 34, type: !233, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !654, line: 34, type: !109, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !661, line: 108, type: !39, isLocal: true, isDefinition: true)
!661 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "internal_state", scope: !664, file: !661, line: 97, type: !667, isLocal: true, isDefinition: true)
!664 = distinct !DICompileUnit(language: DW_LANG_C11, file: !661, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !665, globals: !666, splitDebugInlining: false, nameTableKind: None)
!665 = !{!88, !90, !95}
!666 = !{!659, !662}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !428, line: 6, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !430, line: 21, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 13, size: 64, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !669, file: !430, line: 15, baseType: !67, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !669, file: !430, line: 20, baseType: !673, size: 32, offset: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !430, line: 16, size: 32, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !673, file: !430, line: 18, baseType: !62, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !673, file: !430, line: 19, baseType: !206, size: 32)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !679, line: 35, type: !54, isLocal: true, isDefinition: true)
!679 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!680 = distinct !DICompileUnit(language: DW_LANG_C11, file: !681, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!682 = distinct !DICompileUnit(language: DW_LANG_C11, file: !558, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !683, retainedTypes: !687, globals: !688, splitDebugInlining: false, nameTableKind: None)
!683 = !{!684}
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !558, line: 40, baseType: !62, size: 32, elements: !685)
!685 = !{!686}
!686 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!687 = !{!88}
!688 = !{!556, !559, !561, !563, !565, !567, !572, !577, !579, !584, !589, !594, !599, !601, !606, !611, !616, !621, !623, !625, !627, !629, !631, !633}
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !691, retainedTypes: !722, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!691 = !{!692, !704}
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !693, file: !690, line: 188, baseType: !62, size: 32, elements: !702)
!693 = distinct !DISubprogram(name: "x2nrealloc", scope: !690, file: !690, line: 176, type: !694, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !697)
!694 = !DISubroutineType(types: !695)
!695 = !{!88, !88, !696, !90}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!697 = !{!698, !699, !700, !701}
!698 = !DILocalVariable(name: "p", arg: 1, scope: !693, file: !690, line: 176, type: !88)
!699 = !DILocalVariable(name: "pn", arg: 2, scope: !693, file: !690, line: 176, type: !696)
!700 = !DILocalVariable(name: "s", arg: 3, scope: !693, file: !690, line: 176, type: !90)
!701 = !DILocalVariable(name: "n", scope: !693, file: !690, line: 178, type: !90)
!702 = !{!703}
!703 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !705, file: !690, line: 228, baseType: !62, size: 32, elements: !702)
!705 = distinct !DISubprogram(name: "xpalloc", scope: !690, file: !690, line: 223, type: !706, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !712)
!706 = !DISubroutineType(types: !707)
!707 = !{!88, !88, !708, !709, !711, !709}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !710, line: 130, baseType: !711)
!710 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !91, line: 35, baseType: !170)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721}
!713 = !DILocalVariable(name: "pa", arg: 1, scope: !705, file: !690, line: 223, type: !88)
!714 = !DILocalVariable(name: "pn", arg: 2, scope: !705, file: !690, line: 223, type: !708)
!715 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !705, file: !690, line: 223, type: !709)
!716 = !DILocalVariable(name: "n_max", arg: 4, scope: !705, file: !690, line: 223, type: !711)
!717 = !DILocalVariable(name: "s", arg: 5, scope: !705, file: !690, line: 223, type: !709)
!718 = !DILocalVariable(name: "n0", scope: !705, file: !690, line: 230, type: !709)
!719 = !DILocalVariable(name: "n", scope: !705, file: !690, line: 237, type: !709)
!720 = !DILocalVariable(name: "nbytes", scope: !705, file: !690, line: 248, type: !709)
!721 = !DILocalVariable(name: "adjusted_nbytes", scope: !705, file: !690, line: 252, type: !709)
!722 = !{!87, !88, !129, !170, !92}
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !654, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !724, splitDebugInlining: false, nameTableKind: None)
!724 = !{!652, !655, !657}
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !730, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !732, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!733 = distinct !DICompileUnit(language: DW_LANG_C11, file: !734, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !735, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!735 = !{!129, !92, !88}
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !679, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !737, splitDebugInlining: false, nameTableKind: None)
!737 = !{!738, !677}
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !679, line: 35, type: !213, isLocal: true, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !741, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!742 = distinct !DICompileUnit(language: DW_LANG_C11, file: !743, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!743 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!744 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!745 = !{i32 7, !"Dwarf Version", i32 5}
!746 = !{i32 2, !"Debug Info Version", i32 3}
!747 = !{i32 1, !"wchar_size", i32 4}
!748 = !{i32 8, !"PIC Level", i32 2}
!749 = !{i32 7, !"PIE Level", i32 2}
!750 = !{i32 7, !"uwtable", i32 2}
!751 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 56, type: !752, scopeLine: 57, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !67}
!754 = !{!755}
!755 = !DILocalVariable(name: "status", arg: 1, scope: !751, file: !2, line: 56, type: !67)
!756 = !DILocation(line: 0, scope: !751)
!757 = !DILocation(line: 58, column: 14, scope: !758)
!758 = distinct !DILexicalBlock(scope: !751, file: !2, line: 58, column: 7)
!759 = !DILocation(line: 58, column: 7, scope: !751)
!760 = !DILocation(line: 59, column: 5, scope: !761)
!761 = distinct !DILexicalBlock(scope: !758, file: !2, line: 59, column: 5)
!762 = !{!763, !763, i64 0}
!763 = !{!"any pointer", !764, i64 0}
!764 = !{!"omnipotent char", !765, i64 0}
!765 = !{!"Simple C/C++ TBAA"}
!766 = !DILocation(line: 62, column: 7, scope: !767)
!767 = distinct !DILexicalBlock(scope: !758, file: !2, line: 61, column: 5)
!768 = !DILocation(line: 69, column: 7, scope: !767)
!769 = !DILocation(line: 73, column: 7, scope: !767)
!770 = !DILocation(line: 74, column: 7, scope: !767)
!771 = !DILocation(line: 75, column: 7, scope: !767)
!772 = !DILocalVariable(name: "program", arg: 1, scope: !773, file: !66, line: 836, type: !93)
!773 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !66, file: !66, line: 836, type: !774, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !93}
!776 = !{!772, !777, !784, !785, !787, !788}
!777 = !DILocalVariable(name: "infomap", scope: !773, file: !66, line: 838, type: !778)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 896, elements: !234)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !773, file: !66, line: 838, size: 128, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !780, file: !66, line: 838, baseType: !93, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !780, file: !66, line: 838, baseType: !93, size: 64, offset: 64)
!784 = !DILocalVariable(name: "node", scope: !773, file: !66, line: 848, type: !93)
!785 = !DILocalVariable(name: "map_prog", scope: !773, file: !66, line: 849, type: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!787 = !DILocalVariable(name: "lc_messages", scope: !773, file: !66, line: 861, type: !93)
!788 = !DILocalVariable(name: "url_program", scope: !773, file: !66, line: 874, type: !93)
!789 = !DILocation(line: 0, scope: !773, inlinedAt: !790)
!790 = distinct !DILocation(line: 76, column: 7, scope: !767)
!791 = !DILocation(line: 857, column: 3, scope: !773, inlinedAt: !790)
!792 = !DILocation(line: 861, column: 29, scope: !773, inlinedAt: !790)
!793 = !DILocation(line: 862, column: 7, scope: !794, inlinedAt: !790)
!794 = distinct !DILexicalBlock(scope: !773, file: !66, line: 862, column: 7)
!795 = !DILocation(line: 862, column: 19, scope: !794, inlinedAt: !790)
!796 = !DILocation(line: 862, column: 22, scope: !794, inlinedAt: !790)
!797 = !DILocation(line: 862, column: 7, scope: !773, inlinedAt: !790)
!798 = !DILocation(line: 868, column: 7, scope: !799, inlinedAt: !790)
!799 = distinct !DILexicalBlock(scope: !794, file: !66, line: 863, column: 5)
!800 = !DILocation(line: 870, column: 5, scope: !799, inlinedAt: !790)
!801 = !DILocation(line: 875, column: 3, scope: !773, inlinedAt: !790)
!802 = !DILocation(line: 877, column: 3, scope: !773, inlinedAt: !790)
!803 = !DILocation(line: 78, column: 3, scope: !751)
!804 = !DISubprogram(name: "dcgettext", scope: !805, file: !805, line: 51, type: !806, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!805 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!806 = !DISubroutineType(types: !807)
!807 = !{!87, !93, !93, !67}
!808 = !{}
!809 = !DISubprogram(name: "__fprintf_chk", scope: !810, file: !810, line: 93, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!810 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!811 = !DISubroutineType(types: !812)
!812 = !{!67, !813, !67, !814, null}
!813 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !142)
!814 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !93)
!815 = !DISubprogram(name: "__printf_chk", scope: !810, file: !810, line: 95, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!816 = !DISubroutineType(types: !817)
!817 = !{!67, !67, !814, null}
!818 = !DILocation(line: 0, scope: !119)
!819 = !DILocation(line: 581, column: 7, scope: !127)
!820 = !{!821, !821, i64 0}
!821 = !{!"int", !764, i64 0}
!822 = !DILocation(line: 581, column: 19, scope: !127)
!823 = !DILocation(line: 581, column: 7, scope: !119)
!824 = !DILocation(line: 585, column: 26, scope: !126)
!825 = !DILocation(line: 0, scope: !126)
!826 = !DILocation(line: 586, column: 23, scope: !126)
!827 = !DILocation(line: 586, column: 28, scope: !126)
!828 = !DILocation(line: 586, column: 32, scope: !126)
!829 = !{!764, !764, i64 0}
!830 = !DILocation(line: 586, column: 38, scope: !126)
!831 = !DILocalVariable(name: "__s1", arg: 1, scope: !832, file: !833, line: 1359, type: !93)
!832 = distinct !DISubprogram(name: "streq", scope: !833, file: !833, line: 1359, type: !834, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !836)
!833 = !DIFile(filename: "./lib/string.h", directory: "/src")
!834 = !DISubroutineType(types: !835)
!835 = !{!129, !93, !93}
!836 = !{!831, !837}
!837 = !DILocalVariable(name: "__s2", arg: 2, scope: !832, file: !833, line: 1359, type: !93)
!838 = !DILocation(line: 0, scope: !832, inlinedAt: !839)
!839 = distinct !DILocation(line: 586, column: 41, scope: !126)
!840 = !DILocation(line: 1361, column: 11, scope: !832, inlinedAt: !839)
!841 = !DILocation(line: 1361, column: 10, scope: !832, inlinedAt: !839)
!842 = !DILocation(line: 586, column: 19, scope: !126)
!843 = !DILocation(line: 587, column: 5, scope: !126)
!844 = !DILocation(line: 588, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !119, file: !66, line: 588, column: 7)
!846 = !DILocation(line: 588, column: 7, scope: !119)
!847 = !DILocation(line: 590, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !845, file: !66, line: 589, column: 5)
!849 = !DILocation(line: 591, column: 7, scope: !848)
!850 = !DILocation(line: 595, column: 37, scope: !119)
!851 = !DILocation(line: 595, column: 35, scope: !119)
!852 = !DILocation(line: 596, column: 29, scope: !119)
!853 = !DILocation(line: 597, column: 8, scope: !135)
!854 = !DILocation(line: 597, column: 7, scope: !119)
!855 = !DILocation(line: 604, column: 24, scope: !134)
!856 = !DILocation(line: 604, column: 12, scope: !135)
!857 = !DILocation(line: 0, scope: !133)
!858 = !DILocation(line: 610, column: 16, scope: !133)
!859 = !DILocation(line: 610, column: 7, scope: !133)
!860 = !DILocation(line: 611, column: 21, scope: !133)
!861 = !{!862, !862, i64 0}
!862 = !{!"short", !764, i64 0}
!863 = !DILocation(line: 611, column: 19, scope: !133)
!864 = !DILocation(line: 611, column: 16, scope: !133)
!865 = !DILocation(line: 610, column: 30, scope: !133)
!866 = distinct !{!866, !859, !860, !867}
!867 = !{!"llvm.loop.mustprogress"}
!868 = !DILocation(line: 612, column: 18, scope: !869)
!869 = distinct !DILexicalBlock(scope: !133, file: !66, line: 612, column: 11)
!870 = !DILocation(line: 612, column: 11, scope: !133)
!871 = !DILocation(line: 618, column: 5, scope: !133)
!872 = !DILocation(line: 620, column: 23, scope: !119)
!873 = !DILocation(line: 625, column: 39, scope: !119)
!874 = !DILocation(line: 626, column: 3, scope: !119)
!875 = !DILocation(line: 626, column: 10, scope: !119)
!876 = !DILocation(line: 626, column: 21, scope: !119)
!877 = !DILocation(line: 628, column: 44, scope: !878)
!878 = distinct !DILexicalBlock(scope: !879, file: !66, line: 628, column: 11)
!879 = distinct !DILexicalBlock(scope: !119, file: !66, line: 627, column: 5)
!880 = !DILocation(line: 628, column: 32, scope: !878)
!881 = !DILocation(line: 628, column: 49, scope: !878)
!882 = !DILocation(line: 628, column: 11, scope: !879)
!883 = !DILocation(line: 630, column: 11, scope: !884)
!884 = distinct !DILexicalBlock(scope: !879, file: !66, line: 630, column: 11)
!885 = !DILocation(line: 630, column: 11, scope: !879)
!886 = !DILocation(line: 632, column: 26, scope: !887)
!887 = distinct !DILexicalBlock(scope: !888, file: !66, line: 632, column: 15)
!888 = distinct !DILexicalBlock(scope: !884, file: !66, line: 631, column: 9)
!889 = !DILocation(line: 632, column: 34, scope: !887)
!890 = !DILocation(line: 632, column: 37, scope: !887)
!891 = !DILocation(line: 632, column: 15, scope: !888)
!892 = !DILocation(line: 636, column: 16, scope: !893)
!893 = distinct !DILexicalBlock(scope: !888, file: !66, line: 636, column: 15)
!894 = !DILocation(line: 636, column: 29, scope: !893)
!895 = !DILocation(line: 640, column: 16, scope: !879)
!896 = distinct !{!896, !874, !897, !867}
!897 = !DILocation(line: 641, column: 5, scope: !119)
!898 = !DILocation(line: 644, column: 3, scope: !119)
!899 = !DILocation(line: 0, scope: !832, inlinedAt: !900)
!900 = distinct !DILocation(line: 648, column: 31, scope: !119)
!901 = !DILocation(line: 0, scope: !832, inlinedAt: !902)
!902 = distinct !DILocation(line: 649, column: 31, scope: !119)
!903 = !DILocation(line: 0, scope: !832, inlinedAt: !904)
!904 = distinct !DILocation(line: 650, column: 31, scope: !119)
!905 = !DILocation(line: 0, scope: !832, inlinedAt: !906)
!906 = distinct !DILocation(line: 651, column: 31, scope: !119)
!907 = !DILocation(line: 0, scope: !832, inlinedAt: !908)
!908 = distinct !DILocation(line: 652, column: 31, scope: !119)
!909 = !DILocation(line: 0, scope: !832, inlinedAt: !910)
!910 = distinct !DILocation(line: 653, column: 31, scope: !119)
!911 = !DILocation(line: 0, scope: !832, inlinedAt: !912)
!912 = distinct !DILocation(line: 654, column: 31, scope: !119)
!913 = !DILocation(line: 0, scope: !832, inlinedAt: !914)
!914 = distinct !DILocation(line: 655, column: 31, scope: !119)
!915 = !DILocation(line: 0, scope: !832, inlinedAt: !916)
!916 = distinct !DILocation(line: 656, column: 31, scope: !119)
!917 = !DILocation(line: 0, scope: !832, inlinedAt: !918)
!918 = distinct !DILocation(line: 657, column: 31, scope: !119)
!919 = !DILocation(line: 663, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !119, file: !66, line: 663, column: 7)
!921 = !DILocation(line: 664, column: 7, scope: !920)
!922 = !DILocation(line: 664, column: 10, scope: !920)
!923 = !DILocation(line: 663, column: 7, scope: !119)
!924 = !DILocation(line: 669, column: 7, scope: !925)
!925 = distinct !DILexicalBlock(scope: !920, file: !66, line: 665, column: 5)
!926 = !DILocation(line: 671, column: 5, scope: !925)
!927 = !DILocation(line: 676, column: 7, scope: !928)
!928 = distinct !DILexicalBlock(scope: !920, file: !66, line: 673, column: 5)
!929 = !DILocation(line: 679, column: 3, scope: !119)
!930 = !DILocation(line: 683, column: 3, scope: !119)
!931 = !DILocation(line: 686, column: 3, scope: !119)
!932 = !DILocation(line: 688, column: 3, scope: !119)
!933 = !DILocation(line: 691, column: 3, scope: !119)
!934 = !DILocation(line: 695, column: 3, scope: !119)
!935 = !DILocation(line: 696, column: 1, scope: !119)
!936 = !DISubprogram(name: "setlocale", scope: !937, file: !937, line: 122, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!937 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!938 = !DISubroutineType(types: !939)
!939 = !{!87, !67, !93}
!940 = !DISubprogram(name: "strncmp", scope: !941, file: !941, line: 159, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!941 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!942 = !DISubroutineType(types: !943)
!943 = !{!67, !93, !93, !90}
!944 = !DISubprogram(name: "fputs_unlocked", scope: !945, file: !945, line: 691, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!945 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!946 = !DISubroutineType(types: !947)
!947 = !{!67, !814, !813}
!948 = !DISubprogram(name: "exit", scope: !949, file: !949, line: 624, type: !752, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !808)
!949 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!950 = !DISubprogram(name: "getenv", scope: !949, file: !949, line: 641, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!951 = !DISubroutineType(types: !952)
!952 = !{!87, !93}
!953 = !DISubprogram(name: "strcmp", scope: !941, file: !941, line: 156, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!954 = !DISubroutineType(types: !955)
!955 = !{!67, !93, !93}
!956 = !DISubprogram(name: "strspn", scope: !941, file: !941, line: 297, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!957 = !DISubroutineType(types: !958)
!958 = !{!92, !93, !93}
!959 = !DISubprogram(name: "strchr", scope: !941, file: !941, line: 246, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!960 = !DISubroutineType(types: !961)
!961 = !{!87, !93, !67}
!962 = !DISubprogram(name: "__ctype_b_loc", scope: !72, file: !72, line: 79, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!963 = !DISubroutineType(types: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!968 = !DISubprogram(name: "strcspn", scope: !941, file: !941, line: 293, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!969 = !DISubprogram(name: "fwrite_unlocked", scope: !945, file: !945, line: 704, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!970 = !DISubroutineType(types: !971)
!971 = !{!90, !972, !90, !90, !813}
!972 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!975 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 82, type: !976, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !979)
!976 = !DISubroutineType(types: !977)
!977 = !{!67, !67, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!979 = !{!980, !981, !982, !983, !984, !985, !989, !991, !993, !996, !998, !1001}
!980 = !DILocalVariable(name: "argc", arg: 1, scope: !975, file: !2, line: 82, type: !67)
!981 = !DILocalVariable(name: "argv", arg: 2, scope: !975, file: !2, line: 82, type: !978)
!982 = !DILocalVariable(name: "opt_nul_terminate_output", scope: !975, file: !2, line: 84, type: !129)
!983 = !DILocalVariable(name: "optc", scope: !975, file: !2, line: 95, type: !67)
!984 = !DILocalVariable(name: "ok", scope: !975, file: !2, line: 110, type: !129)
!985 = !DILocalVariable(name: "env", scope: !986, file: !2, line: 113, type: !978)
!986 = distinct !DILexicalBlock(scope: !987, file: !2, line: 113, column: 7)
!987 = distinct !DILexicalBlock(scope: !988, file: !2, line: 112, column: 5)
!988 = distinct !DILexicalBlock(scope: !975, file: !2, line: 111, column: 7)
!989 = !DILocalVariable(name: "matches", scope: !990, file: !2, line: 119, type: !67)
!990 = distinct !DILexicalBlock(scope: !988, file: !2, line: 118, column: 5)
!991 = !DILocalVariable(name: "i", scope: !992, file: !2, line: 121, type: !67)
!992 = distinct !DILexicalBlock(scope: !990, file: !2, line: 121, column: 7)
!993 = !DILocalVariable(name: "matched", scope: !994, file: !2, line: 123, type: !129)
!994 = distinct !DILexicalBlock(scope: !995, file: !2, line: 122, column: 9)
!995 = distinct !DILexicalBlock(scope: !992, file: !2, line: 121, column: 7)
!996 = !DILocalVariable(name: "env", scope: !997, file: !2, line: 129, type: !978)
!997 = distinct !DILexicalBlock(scope: !994, file: !2, line: 129, column: 11)
!998 = !DILocalVariable(name: "ep", scope: !999, file: !2, line: 131, type: !93)
!999 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 130, column: 13)
!1000 = distinct !DILexicalBlock(scope: !997, file: !2, line: 129, column: 11)
!1001 = !DILocalVariable(name: "ap", scope: !999, file: !2, line: 132, type: !93)
!1002 = !DILocation(line: 0, scope: !975)
!1003 = !DILocation(line: 87, column: 21, scope: !975)
!1004 = !DILocation(line: 87, column: 3, scope: !975)
!1005 = !DILocation(line: 88, column: 3, scope: !975)
!1006 = !DILocation(line: 89, column: 3, scope: !975)
!1007 = !DILocation(line: 90, column: 3, scope: !975)
!1008 = !DILocalVariable(name: "status", arg: 1, scope: !1009, file: !66, line: 102, type: !67)
!1009 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !66, file: !66, line: 102, type: !752, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1010)
!1010 = !{!1008}
!1011 = !DILocation(line: 0, scope: !1009, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 92, column: 3, scope: !975)
!1013 = !DILocation(line: 105, column: 18, scope: !1014, inlinedAt: !1012)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !66, line: 104, column: 7)
!1015 = !DILocation(line: 93, column: 3, scope: !975)
!1016 = !DILocation(line: 96, column: 18, scope: !975)
!1017 = !DILocation(line: 96, column: 3, scope: !975)
!1018 = distinct !{!1018, !1017, !1019, !867, !1020}
!1019 = !DILocation(line: 108, column: 5, scope: !975)
!1020 = !{!"llvm.loop.peeled.count", i32 1}
!1021 = !DILocation(line: 103, column: 9, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !2, line: 99, column: 9)
!1023 = distinct !DILexicalBlock(scope: !975, file: !2, line: 97, column: 5)
!1024 = !DILocation(line: 104, column: 9, scope: !1022)
!1025 = !DILocation(line: 106, column: 11, scope: !1022)
!1026 = !DILocation(line: 111, column: 7, scope: !988)
!1027 = !DILocation(line: 111, column: 14, scope: !988)
!1028 = !DILocation(line: 111, column: 7, scope: !975)
!1029 = !DILocation(line: 121, column: 7, scope: !992)
!1030 = !DILocation(line: 113, column: 25, scope: !986)
!1031 = !DILocation(line: 0, scope: !986)
!1032 = !DILocation(line: 113, column: 34, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !986, file: !2, line: 113, column: 7)
!1034 = !DILocation(line: 113, column: 39, scope: !1033)
!1035 = !DILocation(line: 113, column: 7, scope: !986)
!1036 = !DILocation(line: 114, column: 9, scope: !1033)
!1037 = !DILocation(line: 113, column: 48, scope: !1033)
!1038 = distinct !{!1038, !1035, !1039, !867}
!1039 = !DILocation(line: 114, column: 9, scope: !986)
!1040 = !DILocation(line: 148, column: 31, scope: !990)
!1041 = !DILocation(line: 148, column: 29, scope: !990)
!1042 = !DILocation(line: 148, column: 21, scope: !990)
!1043 = !DILocation(line: 151, column: 10, scope: !975)
!1044 = !DILocation(line: 0, scope: !992)
!1045 = !DILocation(line: 0, scope: !990)
!1046 = !DILocation(line: 0, scope: !994)
!1047 = !DILocation(line: 126, column: 23, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !994, file: !2, line: 126, column: 15)
!1049 = !DILocation(line: 126, column: 15, scope: !1048)
!1050 = !DILocation(line: 126, column: 15, scope: !994)
!1051 = !DILocation(line: 129, column: 29, scope: !997)
!1052 = !DILocation(line: 0, scope: !997)
!1053 = !DILocation(line: 129, column: 38, scope: !1000)
!1054 = !DILocation(line: 129, column: 11, scope: !997)
!1055 = !DILocation(line: 145, column: 22, scope: !994)
!1056 = !DILocation(line: 145, column: 19, scope: !994)
!1057 = !DILocation(line: 146, column: 9, scope: !995)
!1058 = !DILocation(line: 0, scope: !999)
!1059 = !DILocation(line: 133, column: 22, scope: !999)
!1060 = !DILocation(line: 133, column: 26, scope: !999)
!1061 = !DILocation(line: 133, column: 34, scope: !999)
!1062 = !DILocation(line: 132, column: 32, scope: !999)
!1063 = !DILocation(line: 133, column: 37, scope: !999)
!1064 = !DILocation(line: 133, column: 41, scope: !999)
!1065 = !DILocation(line: 133, column: 49, scope: !999)
!1066 = !DILocation(line: 133, column: 55, scope: !999)
!1067 = !DILocation(line: 133, column: 64, scope: !999)
!1068 = !DILocation(line: 133, column: 58, scope: !999)
!1069 = !DILocation(line: 133, column: 15, scope: !999)
!1070 = !DILocation(line: 135, column: 23, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 135, column: 23)
!1072 = distinct !DILexicalBlock(scope: !999, file: !2, line: 134, column: 17)
!1073 = !DILocation(line: 135, column: 34, scope: !1071)
!1074 = !DILocation(line: 135, column: 37, scope: !1071)
!1075 = !DILocation(line: 135, column: 41, scope: !1071)
!1076 = !DILocation(line: 135, column: 23, scope: !1072)
!1077 = !DILocation(line: 137, column: 23, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1071, file: !2, line: 136, column: 21)
!1079 = !DILocation(line: 140, column: 23, scope: !1078)
!1080 = distinct !{!1080, !1069, !1081, !867}
!1081 = !DILocation(line: 142, column: 17, scope: !999)
!1082 = !DILocation(line: 129, column: 44, scope: !1000)
!1083 = distinct !{!1083, !1054, !1084, !867}
!1084 = !DILocation(line: 143, column: 13, scope: !997)
!1085 = !DILocation(line: 121, column: 38, scope: !995)
!1086 = !DILocation(line: 121, column: 30, scope: !995)
!1087 = distinct !{!1087, !1029, !1088, !867}
!1088 = !DILocation(line: 146, column: 9, scope: !992)
!1089 = !DILocation(line: 152, column: 1, scope: !975)
!1090 = !DISubprogram(name: "bindtextdomain", scope: !805, file: !805, line: 86, type: !1091, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!87, !93, !93}
!1093 = !DISubprogram(name: "textdomain", scope: !805, file: !805, line: 82, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!1094 = !DISubprogram(name: "atexit", scope: !949, file: !949, line: 602, type: !1095, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!67, !396}
!1097 = !DISubprogram(name: "getopt_long", scope: !318, file: !318, line: 66, type: !1098, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!67, !67, !1100, !93, !1102, !323}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!1103 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !335, file: !335, line: 50, type: !774, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !334, retainedNodes: !1104)
!1104 = !{!1105}
!1105 = !DILocalVariable(name: "file", arg: 1, scope: !1103, file: !335, line: 50, type: !93)
!1106 = !DILocation(line: 0, scope: !1103)
!1107 = !DILocation(line: 52, column: 13, scope: !1103)
!1108 = !DILocation(line: 53, column: 1, scope: !1103)
!1109 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !335, file: !335, line: 87, type: !1110, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !334, retainedNodes: !1112)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !129}
!1112 = !{!1113}
!1113 = !DILocalVariable(name: "ignore", arg: 1, scope: !1109, file: !335, line: 87, type: !129)
!1114 = !DILocation(line: 0, scope: !1109)
!1115 = !DILocation(line: 89, column: 16, scope: !1109)
!1116 = !{!1117, !1117, i64 0}
!1117 = !{!"_Bool", !764, i64 0}
!1118 = !DILocation(line: 90, column: 1, scope: !1109)
!1119 = distinct !DISubprogram(name: "close_stdout", scope: !335, file: !335, line: 116, type: !397, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !334, retainedNodes: !1120)
!1120 = !{!1121}
!1121 = !DILocalVariable(name: "write_error", scope: !1122, file: !335, line: 121, type: !93)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !335, line: 120, column: 5)
!1123 = distinct !DILexicalBlock(scope: !1119, file: !335, line: 118, column: 7)
!1124 = !DILocation(line: 118, column: 21, scope: !1123)
!1125 = !DILocation(line: 118, column: 7, scope: !1123)
!1126 = !DILocation(line: 118, column: 29, scope: !1123)
!1127 = !DILocation(line: 119, column: 7, scope: !1123)
!1128 = !DILocation(line: 119, column: 12, scope: !1123)
!1129 = !{i8 0, i8 2}
!1130 = !DILocation(line: 119, column: 25, scope: !1123)
!1131 = !DILocation(line: 119, column: 28, scope: !1123)
!1132 = !DILocation(line: 119, column: 34, scope: !1123)
!1133 = !DILocation(line: 118, column: 7, scope: !1119)
!1134 = !DILocation(line: 121, column: 33, scope: !1122)
!1135 = !DILocation(line: 0, scope: !1122)
!1136 = !DILocation(line: 122, column: 11, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1122, file: !335, line: 122, column: 11)
!1138 = !DILocation(line: 0, scope: !1137)
!1139 = !DILocation(line: 122, column: 11, scope: !1122)
!1140 = !DILocation(line: 123, column: 9, scope: !1137)
!1141 = !DILocation(line: 126, column: 9, scope: !1137)
!1142 = !DILocation(line: 128, column: 14, scope: !1122)
!1143 = !DILocation(line: 128, column: 7, scope: !1122)
!1144 = !DILocation(line: 133, column: 42, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1119, file: !335, line: 133, column: 7)
!1146 = !DILocation(line: 133, column: 28, scope: !1145)
!1147 = !DILocation(line: 133, column: 50, scope: !1145)
!1148 = !DILocation(line: 133, column: 7, scope: !1119)
!1149 = !DILocation(line: 134, column: 12, scope: !1145)
!1150 = !DILocation(line: 134, column: 5, scope: !1145)
!1151 = !DILocation(line: 135, column: 1, scope: !1119)
!1152 = !DISubprogram(name: "__errno_location", scope: !1153, file: !1153, line: 37, type: !1154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !808)
!1153 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!323}
!1156 = !DISubprogram(name: "_exit", scope: !1157, file: !1157, line: 624, type: !752, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !808)
!1157 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1158 = distinct !DISubprogram(name: "verror", scope: !350, file: !350, line: 251, type: !1159, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1161)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !67, !67, !93, !360}
!1161 = !{!1162, !1163, !1164, !1165}
!1162 = !DILocalVariable(name: "status", arg: 1, scope: !1158, file: !350, line: 251, type: !67)
!1163 = !DILocalVariable(name: "errnum", arg: 2, scope: !1158, file: !350, line: 251, type: !67)
!1164 = !DILocalVariable(name: "message", arg: 3, scope: !1158, file: !350, line: 251, type: !93)
!1165 = !DILocalVariable(name: "args", arg: 4, scope: !1158, file: !350, line: 251, type: !360)
!1166 = !DILocation(line: 0, scope: !1158)
!1167 = !DILocation(line: 261, column: 3, scope: !1158)
!1168 = !DILocation(line: 265, column: 7, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1158, file: !350, line: 265, column: 7)
!1170 = !DILocation(line: 265, column: 7, scope: !1158)
!1171 = !DILocation(line: 266, column: 5, scope: !1169)
!1172 = !DILocation(line: 272, column: 7, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1169, file: !350, line: 268, column: 5)
!1174 = !DILocation(line: 276, column: 3, scope: !1158)
!1175 = !DILocation(line: 282, column: 1, scope: !1158)
!1176 = distinct !DISubprogram(name: "flush_stdout", scope: !350, file: !350, line: 163, type: !397, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1177)
!1177 = !{!1178}
!1178 = !DILocalVariable(name: "stdout_fd", scope: !1176, file: !350, line: 166, type: !67)
!1179 = !DILocation(line: 0, scope: !1176)
!1180 = !DILocalVariable(name: "fd", arg: 1, scope: !1181, file: !350, line: 145, type: !67)
!1181 = distinct !DISubprogram(name: "is_open", scope: !350, file: !350, line: 145, type: !1182, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1184)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!67, !67}
!1184 = !{!1180}
!1185 = !DILocation(line: 0, scope: !1181, inlinedAt: !1186)
!1186 = distinct !DILocation(line: 182, column: 25, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1176, file: !350, line: 182, column: 7)
!1188 = !DILocation(line: 157, column: 15, scope: !1181, inlinedAt: !1186)
!1189 = !DILocation(line: 157, column: 12, scope: !1181, inlinedAt: !1186)
!1190 = !DILocation(line: 182, column: 7, scope: !1176)
!1191 = !DILocation(line: 184, column: 5, scope: !1187)
!1192 = !DILocation(line: 185, column: 1, scope: !1176)
!1193 = distinct !DISubprogram(name: "error_tail", scope: !350, file: !350, line: 219, type: !1159, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1194)
!1194 = !{!1195, !1196, !1197, !1198}
!1195 = !DILocalVariable(name: "status", arg: 1, scope: !1193, file: !350, line: 219, type: !67)
!1196 = !DILocalVariable(name: "errnum", arg: 2, scope: !1193, file: !350, line: 219, type: !67)
!1197 = !DILocalVariable(name: "message", arg: 3, scope: !1193, file: !350, line: 219, type: !93)
!1198 = !DILocalVariable(name: "args", arg: 4, scope: !1193, file: !350, line: 219, type: !360)
!1199 = !DILocation(line: 0, scope: !1193)
!1200 = !DILocation(line: 229, column: 13, scope: !1193)
!1201 = !DILocalVariable(name: "__stream", arg: 1, scope: !1202, file: !810, line: 132, type: !1205)
!1202 = distinct !DISubprogram(name: "vfprintf", scope: !810, file: !810, line: 132, type: !1203, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1240)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!67, !1205, !814, !360}
!1205 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !144, line: 7, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 49, size: 1728, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1208, file: !146, line: 51, baseType: !67, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1208, file: !146, line: 54, baseType: !87, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1208, file: !146, line: 55, baseType: !87, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1208, file: !146, line: 56, baseType: !87, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1208, file: !146, line: 57, baseType: !87, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1208, file: !146, line: 58, baseType: !87, size: 64, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1208, file: !146, line: 59, baseType: !87, size: 64, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1208, file: !146, line: 60, baseType: !87, size: 64, offset: 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1208, file: !146, line: 61, baseType: !87, size: 64, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1208, file: !146, line: 64, baseType: !87, size: 64, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1208, file: !146, line: 65, baseType: !87, size: 64, offset: 640)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1208, file: !146, line: 66, baseType: !87, size: 64, offset: 704)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1208, file: !146, line: 68, baseType: !161, size: 64, offset: 768)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1208, file: !146, line: 70, baseType: !1224, size: 64, offset: 832)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1208, file: !146, line: 72, baseType: !67, size: 32, offset: 896)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1208, file: !146, line: 73, baseType: !67, size: 32, offset: 928)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1208, file: !146, line: 74, baseType: !168, size: 64, offset: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1208, file: !146, line: 77, baseType: !89, size: 16, offset: 1024)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1208, file: !146, line: 78, baseType: !173, size: 8, offset: 1040)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1208, file: !146, line: 79, baseType: !39, size: 8, offset: 1048)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1208, file: !146, line: 81, baseType: !176, size: 64, offset: 1088)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1208, file: !146, line: 89, baseType: !179, size: 64, offset: 1152)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1208, file: !146, line: 91, baseType: !181, size: 64, offset: 1216)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1208, file: !146, line: 92, baseType: !184, size: 64, offset: 1280)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1208, file: !146, line: 93, baseType: !1224, size: 64, offset: 1344)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1208, file: !146, line: 94, baseType: !88, size: 64, offset: 1408)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1208, file: !146, line: 95, baseType: !90, size: 64, offset: 1472)
