; ModuleID = 'src/ptx.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.regex_data = type { ptr, %struct.re_pattern_buffer, [256 x i8] }
%struct.re_pattern_buffer = type { ptr, i64, i64, i64, ptr, ptr, i64, i8 }
%struct.WORD_TABLE = type { ptr, i64, i64 }
%struct.re_registers = type { i32, ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.BLOCK = type { ptr, ptr }
%struct.WORD = type { ptr, i64 }
%struct.OCCURS = type { %struct.WORD, i64, i64, i64, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [91 x i8] c"Usage: %s [OPTION]... [INPUT]...   (without -G)\0A  or:  %s -G [OPTION]... [INPUT [OUTPUT]]\0A\00", align 1, !dbg !7

!114 = distinct !DIGlobalVariable(name: "long_options", scope: !115, file: !2, line: 1755, type: !683, isLocal: true, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !116, retainedTypes: !170, globals: !205, splitDebugInlining: false, nameTableKind: None)
!116 = !{!117, !126, !132, !135, !141, !155}
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !118, line: 30, baseType: !119, size: 32, elements: !120)
!118 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!122 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!123 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!124 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!125 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Format", file: !2, line: 62, baseType: !119, size: 32, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIEnumerator(name: "UNKNOWN_FORMAT", value: 0)
!129 = !DIEnumerator(name: "DUMB_FORMAT", value: 1)
!130 = !DIEnumerator(name: "ROFF_FORMAT", value: 2)
!131 = !DIEnumerator(name: "TEX_FORMAT", value: 3)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1749, baseType: !119, size: 32, elements: !133)
!133 = !{!134}
!134 = !DIEnumerator(name: "FORMAT_OPTION", value: 128)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 337, baseType: !137, size: 32, elements: !138)
!136 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !{!139, !140}
!139 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!140 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !142, line: 42, baseType: !119, size: 32, elements: !143)
!142 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!144 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!145 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!146 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!147 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!148 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!149 = !DIEnumerator(name: "c_quoting_style", value: 5)
!150 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!151 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!152 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!153 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!154 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !156, line: 46, baseType: !119, size: 32, elements: !157)
!156 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!158 = !DIEnumerator(name: "_ISupper", value: 256)
!159 = !DIEnumerator(name: "_ISlower", value: 512)
!160 = !DIEnumerator(name: "_ISalpha", value: 1024)
!161 = !DIEnumerator(name: "_ISdigit", value: 2048)
!162 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!163 = !DIEnumerator(name: "_ISspace", value: 8192)
!164 = !DIEnumerator(name: "_ISprint", value: 16384)
!165 = !DIEnumerator(name: "_ISgraph", value: 32768)
!166 = !DIEnumerator(name: "_ISblank", value: 1)
!167 = !DIEnumerator(name: "_IScntrl", value: 2)
!168 = !DIEnumerator(name: "_ISpunct", value: 4)
!169 = !DIEnumerator(name: "_ISalnum", value: 8)
!170 = !{!171, !173, !174, !137, !175, !176, !179, !181, !182}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!175 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !177, line: 46, baseType: !178)
!177 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!178 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCCURS", file: !2, line: 230, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 222, size: 384, elements: !186)
!186 = !{!187, !197, !198, !199, !204}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !185, file: !2, line: 224, baseType: !188, size: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !2, line: 117, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 112, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !189, file: !2, line: 114, baseType: !173, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !2, line: 115, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !194, line: 130, baseType: !195)
!194 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !177, line: 35, baseType: !196)
!196 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !185, file: !2, line: 225, baseType: !195, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !185, file: !2, line: 226, baseType: !195, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !185, file: !2, line: 227, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !201, line: 101, baseType: !202)
!201 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !203, line: 72, baseType: !196)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "file_index", scope: !185, file: !2, line: 228, baseType: !137, size: 32, offset: 320)
!205 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !59, !64, !66, !68, !70, !72, !74, !79, !81, !83, !88, !93, !98, !103, !108, !206, !211, !216, !221, !226, !228, !233, !238, !240, !245, !247, !279, !281, !283, !285, !294, !296, !298, !300, !303, !306, !314, !317, !322, !327, !408, !413, !415, !417, !422, !424, !426, !428, !430, !432, !434, !436, !441, !446, !448, !450, !452, !454, !456, !458, !460, !465, !470, !475, !477, !479, !481, !483, !488, !490, !492, !494, !496, !498, !503, !508, !510, !515, !517, !519, !521, !523, !525, !527, !529, !531, !533, !535, !537, !542, !544, !546, !548, !113, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !580, !584, !586, !588, !592, !597, !599, !602, !607, !609, !614, !624, !629, !631, !633, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 22)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1858, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 23)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1902, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 9)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 14)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !100, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 17)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1939, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 2)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1965, type: !235, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1966, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 3)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1974, type: !230, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "context_regex", scope: !115, file: !2, line: 98, type: !249, isLocal: true, isDefinition: true)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regex_data", file: !2, line: 88, size: 2624, elements: !250)
!250 = !{!251, !252, !275}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !249, file: !2, line: 91, baseType: !179, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !249, file: !2, line: 94, baseType: !253, size: 512, offset: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !254, line: 413, size: 512, elements: !255)
!254 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!255 = !{!256, !259, !261, !262, !264, !265, !267, !268, !269, !270, !271, !272, !273, !274}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !253, file: !254, line: 417, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !254, line: 417, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !253, file: !254, line: 420, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !254, line: 56, baseType: !178)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !253, file: !254, line: 423, baseType: !260, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !253, file: !254, line: 426, baseType: !263, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !254, line: 71, baseType: !178)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !253, file: !254, line: 431, baseType: !173, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !253, file: !254, line: 437, baseType: !266, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !253, file: !254, line: 440, baseType: !176, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !253, file: !254, line: 446, baseType: !119, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !253, file: !254, line: 457, baseType: !119, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !253, file: !254, line: 461, baseType: !119, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !253, file: !254, line: 465, baseType: !119, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !253, file: !254, line: 469, baseType: !119, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !253, file: !254, line: 472, baseType: !119, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !253, file: !254, line: 475, baseType: !119, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !249, file: !2, line: 95, baseType: !276, size: 2048, offset: 576)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "word_regex", scope: !115, file: !2, line: 99, type: !249, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "maximum_word_length", scope: !115, file: !2, line: 146, type: !193, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "reference_max_width", scope: !115, file: !2, line: 149, type: !193, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "ignore_table", scope: !115, file: !2, line: 153, type: !287, isLocal: true, isDefinition: true)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD_TABLE", file: !2, line: 125, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 119, size: 192, elements: !289)
!289 = !{!290, !292, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !288, file: !2, line: 121, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !288, file: !2, line: 122, baseType: !193, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !288, file: !2, line: 123, baseType: !193, size: 64, offset: 128)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "only_table", scope: !115, file: !2, line: 154, type: !287, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "number_input_files", scope: !115, file: !2, line: 158, type: !137, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "total_line_count", scope: !115, file: !2, line: 159, type: !200, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "input_file_name", scope: !115, file: !2, line: 160, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "file_line_count", scope: !115, file: !2, line: 161, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "text_buffers", scope: !115, file: !2, line: 163, type: !308, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLOCK", file: !2, line: 110, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 105, size: 128, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !310, file: !2, line: 107, baseType: !173, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !310, file: !2, line: 108, baseType: !173, size: 64, offset: 64)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "number_of_occurs", scope: !115, file: !2, line: 237, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !96)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !136, line: 729, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 56)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !136, line: 736, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 75)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !329, file: !136, line: 575, type: !137, isLocal: true, isDefinition: true)
!329 = distinct !DISubprogram(name: "oputs_", scope: !136, file: !136, line: 573, type: !330, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !332)
!330 = !DISubroutineType(cc: DW_CC_nocall, types: !331)
!331 = !{null, !179, !179}
!332 = !{!333, !334, !335, !338, !340, !341, !342, !346, !347, !348, !349, !351, !402, !403, !404, !406, !407}
!333 = !DILocalVariable(name: "program", arg: 1, scope: !329, file: !136, line: 573, type: !179)
!334 = !DILocalVariable(name: "option", arg: 2, scope: !329, file: !136, line: 573, type: !179)
!335 = !DILocalVariable(name: "term", scope: !336, file: !136, line: 585, type: !179)
!336 = distinct !DILexicalBlock(scope: !337, file: !136, line: 582, column: 5)
!337 = distinct !DILexicalBlock(scope: !329, file: !136, line: 581, column: 7)
!338 = !DILocalVariable(name: "double_space", scope: !329, file: !136, line: 594, type: !339)
!339 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!340 = !DILocalVariable(name: "first_word", scope: !329, file: !136, line: 595, type: !179)
!341 = !DILocalVariable(name: "option_text", scope: !329, file: !136, line: 596, type: !179)
!342 = !DILocalVariable(name: "s", scope: !343, file: !136, line: 608, type: !179)
!343 = distinct !DILexicalBlock(scope: !344, file: !136, line: 605, column: 5)
!344 = distinct !DILexicalBlock(scope: !345, file: !136, line: 604, column: 12)
!345 = distinct !DILexicalBlock(scope: !329, file: !136, line: 597, column: 7)
!346 = !DILocalVariable(name: "spaces", scope: !343, file: !136, line: 609, type: !176)
!347 = !DILocalVariable(name: "anchor_len", scope: !329, file: !136, line: 620, type: !176)
!348 = !DILocalVariable(name: "desc_text", scope: !329, file: !136, line: 625, type: !179)
!349 = !DILocalVariable(name: "__ptr", scope: !350, file: !136, line: 644, type: !179)
!350 = distinct !DILexicalBlock(scope: !329, file: !136, line: 644, column: 3)
!351 = !DILocalVariable(name: "__stream", scope: !350, file: !136, line: 644, type: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !354, line: 7, baseType: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !356, line: 49, size: 1728, elements: !357)
!356 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !373, !375, !376, !377, !379, !380, !382, !383, !386, !388, !391, !394, !395, !396, !397, !398}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !355, file: !356, line: 51, baseType: !137, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !355, file: !356, line: 54, baseType: !173, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !355, file: !356, line: 55, baseType: !173, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !355, file: !356, line: 56, baseType: !173, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !355, file: !356, line: 57, baseType: !173, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !355, file: !356, line: 58, baseType: !173, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !355, file: !356, line: 59, baseType: !173, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !355, file: !356, line: 60, baseType: !173, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !355, file: !356, line: 61, baseType: !173, size: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !355, file: !356, line: 64, baseType: !173, size: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !355, file: !356, line: 65, baseType: !173, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !355, file: !356, line: 66, baseType: !173, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !355, file: !356, line: 68, baseType: !371, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !356, line: 36, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !355, file: !356, line: 70, baseType: !374, size: 64, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !355, file: !356, line: 72, baseType: !137, size: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !355, file: !356, line: 73, baseType: !137, size: 32, offset: 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !355, file: !356, line: 74, baseType: !378, size: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !203, line: 152, baseType: !196)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !355, file: !356, line: 77, baseType: !175, size: 16, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !355, file: !356, line: 78, baseType: !381, size: 8, offset: 1040)
!381 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !355, file: !356, line: 79, baseType: !95, size: 8, offset: 1048)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !355, file: !356, line: 81, baseType: !384, size: 64, offset: 1088)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !356, line: 43, baseType: null)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !355, file: !356, line: 89, baseType: !387, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !203, line: 153, baseType: !196)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !355, file: !356, line: 91, baseType: !389, size: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !356, line: 37, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !355, file: !356, line: 92, baseType: !392, size: 64, offset: 1280)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !356, line: 38, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !355, file: !356, line: 93, baseType: !374, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !355, file: !356, line: 94, baseType: !174, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !355, file: !356, line: 95, baseType: !176, size: 64, offset: 1472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !355, file: !356, line: 96, baseType: !137, size: 32, offset: 1536)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !355, file: !356, line: 98, baseType: !399, size: 160, offset: 1568)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 20)
!402 = !DILocalVariable(name: "__cnt", scope: !350, file: !136, line: 644, type: !176)
!403 = !DILocalVariable(name: "url_program", scope: !329, file: !136, line: 648, type: !179)
!404 = !DILocalVariable(name: "__ptr", scope: !405, file: !136, line: 686, type: !179)
!405 = distinct !DILexicalBlock(scope: !329, file: !136, line: 686, column: 3)
!406 = !DILocalVariable(name: "__stream", scope: !405, file: !136, line: 686, type: !352)
!407 = !DILocalVariable(name: "__cnt", scope: !405, file: !136, line: 686, type: !176)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !136, line: 585, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 5)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !136, line: 586, type: !410, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !136, line: 595, type: !19, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !136, line: 620, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 6)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !136, line: 648, type: !235, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !136, line: 648, type: !410, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !136, line: 649, type: !19, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !136, line: 649, type: !242, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !136, line: 650, type: !410, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !136, line: 651, type: !419, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !136, line: 651, type: !419, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !136, line: 652, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 7)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !136, line: 653, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 8)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !136, line: 654, type: !100, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !136, line: 655, type: !100, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !136, line: 656, type: !100, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !136, line: 657, type: !100, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !136, line: 663, type: !438, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !136, line: 664, type: !100, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !136, line: 669, type: !230, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !136, line: 669, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 40)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !136, line: 676, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 15)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !136, line: 676, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 61)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !136, line: 679, type: !242, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !136, line: 683, type: !410, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !136, line: 688, type: !410, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !136, line: 691, type: !443, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !136, line: 839, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 16)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !136, line: 840, type: !208, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !136, line: 841, type: !467, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !136, line: 862, type: !19, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !136, line: 868, type: !54, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !136, line: 875, type: !110, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !136, line: 877, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 51)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !136, line: 877, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 12)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1757, type: !467, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1758, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 11)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1759, type: !485, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1760, type: !505, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1761, type: !218, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1762, type: !505, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1763, type: !512, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1764, type: !100, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1765, type: !512, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1766, type: !485, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1767, type: !438, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1768, type: !485, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1769, type: !505, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1770, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 13)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1771, type: !419, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1772, type: !505, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1773, type: !410, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1774, type: !443, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "gnu_extensions", scope: !115, file: !2, line: 70, type: !339, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "break_file", scope: !115, file: !2, line: 83, type: !179, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "ignore_case", scope: !115, file: !2, line: 82, type: !339, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "gap_size", scope: !115, file: !2, line: 75, type: !193, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "ignore_file", scope: !115, file: !2, line: 85, type: !179, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "only_file", scope: !115, file: !2, line: 84, type: !179, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "input_reference", scope: !115, file: !2, line: 72, type: !339, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "line_width", scope: !115, file: !2, line: 74, type: !193, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "auto_reference", scope: !115, file: !2, line: 71, type: !339, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !235, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "truncation_string", scope: !115, file: !2, line: 76, type: !179, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !242, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "macro_name", scope: !115, file: !2, line: 78, type: !179, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "output_format", scope: !115, file: !2, line: 79, type: !126, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "right_reference", scope: !115, file: !2, line: 73, type: !339, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "format_vals", scope: !115, file: !2, line: 1783, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 64, elements: !236)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1780, type: !410, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1780, type: !19, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "format_args", scope: !115, file: !2, line: 1778, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 192, elements: !243)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !2, line: 442, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 32)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 444, type: !235, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "folded_chars", scope: !115, file: !2, line: 130, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, elements: !277)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 19)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "word_fastmap", scope: !115, file: !2, line: 143, type: !276, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 793, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 57)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "context_regs", scope: !115, file: !2, line: 133, type: !616, isLocal: true, isDefinition: true)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !254, line: 497, size: 192, elements: !617)
!617 = !{!618, !620, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !616, file: !254, line: 499, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !254, line: 55, baseType: !119)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !616, file: !254, line: 500, baseType: !621, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !254, line: 490, baseType: !137)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !616, file: !254, line: 501, baseType: !621, size: 64, offset: 128)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 286, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 36)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "word_regs", scope: !115, file: !2, line: 136, type: !616, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "occurs_alloc", scope: !115, file: !2, line: 236, type: !316, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "occurs_table", scope: !115, file: !2, line: 235, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 64, elements: !96)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1081, type: !19, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1194, type: !218, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "reference", scope: !115, file: !2, line: 277, type: !309, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "half_line_width", scope: !115, file: !2, line: 246, type: !193, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "before_max_width", scope: !115, file: !2, line: 250, type: !195, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "keyafter_max_width", scope: !115, file: !2, line: 254, type: !195, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "truncation_string_length", scope: !115, file: !2, line: 257, type: !193, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "edited_flag", scope: !115, file: !2, line: 243, type: !276, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "tail", scope: !115, file: !2, line: 265, type: !309, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "tail_truncation", scope: !115, file: !2, line: 266, type: !339, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "head", scope: !115, file: !2, line: 274, type: !309, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "head_truncation", scope: !115, file: !2, line: 275, type: !339, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1395, type: !410, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "keyafter", scope: !115, file: !2, line: 271, type: !309, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "keyafter_truncation", scope: !115, file: !2, line: 272, type: !339, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "before", scope: !115, file: !2, line: 268, type: !309, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "before_truncation", scope: !115, file: !2, line: 269, type: !339, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1040, type: !419, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1045, type: !539, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1420, type: !419, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1428, type: !242, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1473, type: !410, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1476, type: !242, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 4864, elements: !605)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !686, line: 50, size: 256, elements: !687)
!686 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!687 = !{!688, !689, !690, !692}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !686, line: 52, baseType: !179, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !685, file: !686, line: 55, baseType: !137, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !685, file: !686, line: 56, baseType: !691, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !685, file: !686, line: 57, baseType: !137, size: 32, offset: 192)
!693 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!694 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!695 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!696 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!697 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!698 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!699 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!700 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!701 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!702 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!703 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!704 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!705 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!706 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!707 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !710, line: 3, type: !467, isLocal: true, isDefinition: true)
!710 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "Version", scope: !713, file: !710, line: 3, type: !179, isLocal: false, isDefinition: true)
!713 = distinct !DICompileUnit(language: DW_LANG_C11, file: !710, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !714, splitDebugInlining: false, nameTableKind: None)
!714 = !{!708, !711}
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !717, file: !718, line: 65, type: !740, isLocal: false, isDefinition: true)
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !718, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !720, globals: !721, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!719 = !{!141}
!720 = !{!174, !179, !181}
!721 = !{!715, !722, !724, !726, !731, !736, !738}
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !718, line: 141, type: !438, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !718, line: 141, type: !110, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !718, line: 142, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 29)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !718, line: 160, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 21)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !718, line: 165, type: !443, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !718, line: 170, type: !410, isLocal: true, isDefinition: true)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !741, line: 69, baseType: !742)
!741 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null}
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "file_name", scope: !747, file: !748, line: 45, type: !179, isLocal: true, isDefinition: true)
!747 = distinct !DICompileUnit(language: DW_LANG_C11, file: !748, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !749, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!749 = !{!750, !752, !754, !756, !745, !758}
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !748, line: 121, type: !438, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !748, line: 121, type: !505, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !748, line: 123, type: !438, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !748, line: 126, type: !242, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !747, file: !748, line: 55, type: !339, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !762, file: !763, line: 66, type: !742, isLocal: false, isDefinition: true)
!762 = distinct !DICompileUnit(language: DW_LANG_C11, file: !763, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !764, globals: !765, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!764 = !{!174, !181}
!765 = !{!766, !768, !788, !790, !792, !794, !760, !796, !798, !800, !802, !804}
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !763, line: 272, type: !410, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "old_file_name", scope: !770, file: !763, line: 304, type: !179, isLocal: true, isDefinition: true)
!770 = distinct !DISubprogram(name: "verror_at_line", scope: !763, file: !763, line: 298, type: !771, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !762, retainedNodes: !781)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !137, !137, !179, !119, !179, !773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !775)
!775 = !{!776, !778, !779, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !774, file: !777, baseType: !119, size: 32)
!777 = !DIFile(filename: "lib/error.c", directory: "/src")
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !774, file: !777, baseType: !119, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !774, file: !777, baseType: !174, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !774, file: !777, baseType: !174, size: 64, offset: 128)
!781 = !{!782, !783, !784, !785, !786, !787}
!782 = !DILocalVariable(name: "status", arg: 1, scope: !770, file: !763, line: 298, type: !137)
!783 = !DILocalVariable(name: "errnum", arg: 2, scope: !770, file: !763, line: 298, type: !137)
!784 = !DILocalVariable(name: "file_name", arg: 3, scope: !770, file: !763, line: 298, type: !179)
!785 = !DILocalVariable(name: "line_number", arg: 4, scope: !770, file: !763, line: 298, type: !119)
!786 = !DILocalVariable(name: "message", arg: 5, scope: !770, file: !763, line: 298, type: !179)
!787 = !DILocalVariable(name: "args", arg: 6, scope: !770, file: !763, line: 298, type: !773)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "old_line_number", scope: !770, file: !763, line: 305, type: !119, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !763, line: 338, type: !19, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !763, line: 346, type: !443, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !763, line: 346, type: !235, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "error_message_count", scope: !762, file: !763, line: 69, type: !119, isLocal: false, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !762, file: !763, line: 295, type: !137, isLocal: false, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !763, line: 208, type: !438, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !763, line: 208, type: !733, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !763, line: 214, type: !410, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !808, line: 40, type: !100, isLocal: true, isDefinition: true)
!808 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "program_name", scope: !811, file: !812, line: 31, type: !179, isLocal: false, isDefinition: true)
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !813, globals: !814, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!813 = !{!173}
!814 = !{!809, !815, !817}
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !812, line: 46, type: !443, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !812, line: 49, type: !19, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "utf07FF", scope: !821, file: !822, line: 46, type: !849, isLocal: true, isDefinition: true)
!821 = distinct !DISubprogram(name: "proper_name_lite", scope: !822, file: !822, line: 38, type: !823, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !825, retainedNodes: !827)
!822 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!823 = !DISubroutineType(types: !824)
!824 = !{!179, !179, !179}
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !822, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !826, splitDebugInlining: false, nameTableKind: None)
!826 = !{!819}
!827 = !{!828, !829, !830, !831, !836}
!828 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !821, file: !822, line: 38, type: !179)
!829 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !821, file: !822, line: 38, type: !179)
!830 = !DILocalVariable(name: "translation", scope: !821, file: !822, line: 40, type: !179)
!831 = !DILocalVariable(name: "w", scope: !821, file: !822, line: 47, type: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !833, line: 37, baseType: !834)
!833 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !203, line: 57, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !203, line: 42, baseType: !119)
!836 = !DILocalVariable(name: "mbs", scope: !821, file: !822, line: 48, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !838, line: 6, baseType: !839)
!838 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !840, line: 21, baseType: !841)
!840 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !840, line: 13, size: 64, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !841, file: !840, line: 15, baseType: !137, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !841, file: !840, line: 20, baseType: !845, size: 32, offset: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !840, line: 16, size: 32, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !845, file: !840, line: 18, baseType: !119, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !845, file: !840, line: 19, baseType: !19, size: 32)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 16, elements: !236)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !852, line: 78, type: !443, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !852, line: 79, type: !419, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !852, line: 80, type: !539, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !852, line: 81, type: !539, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !852, line: 82, type: !399, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !852, line: 83, type: !235, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !852, line: 84, type: !443, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !852, line: 85, type: !438, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !852, line: 86, type: !438, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !852, line: 87, type: !443, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !873, file: !852, line: 76, type: !942, isLocal: false, isDefinition: true)
!873 = distinct !DICompileUnit(language: DW_LANG_C11, file: !852, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !874, retainedTypes: !880, globals: !881, splitDebugInlining: false, nameTableKind: None)
!874 = !{!141, !875, !155}
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !142, line: 254, baseType: !119, size: 32, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!878 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!879 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!880 = !{!137, !175, !176}
!881 = !{!850, !853, !855, !857, !859, !861, !863, !865, !867, !869, !871, !882, !886, !896, !898, !900, !902, !904, !906, !908, !931, !938, !940}
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !873, file: !852, line: 92, type: !884, isLocal: false, isDefinition: true)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 320, elements: !101)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !873, file: !852, line: 1040, type: !888, isLocal: false, isDefinition: true)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !852, line: 56, size: 448, elements: !889)
!889 = !{!890, !891, !892, !894, !895}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !888, file: !852, line: 59, baseType: !141, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !888, file: !852, line: 62, baseType: !137, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !888, file: !852, line: 66, baseType: !893, size: 256, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 256, elements: !444)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !888, file: !852, line: 69, baseType: !179, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !888, file: !852, line: 72, baseType: !179, size: 64, offset: 384)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !873, file: !852, line: 107, type: !888, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "slot0", scope: !873, file: !852, line: 831, type: !276, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !852, line: 321, type: !235, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !852, line: 357, type: !235, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !852, line: 358, type: !235, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !852, line: 199, type: !438, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "quote", scope: !910, file: !852, line: 228, type: !929, isLocal: true, isDefinition: true)
!910 = distinct !DISubprogram(name: "gettext_quote", scope: !852, file: !852, line: 197, type: !911, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !873, retainedNodes: !913)
!911 = !DISubroutineType(types: !912)
!912 = !{!179, !179, !141}
!913 = !{!914, !915, !916, !917, !918}
!914 = !DILocalVariable(name: "msgid", arg: 1, scope: !910, file: !852, line: 197, type: !179)
!915 = !DILocalVariable(name: "s", arg: 2, scope: !910, file: !852, line: 197, type: !141)
!916 = !DILocalVariable(name: "translation", scope: !910, file: !852, line: 199, type: !179)
!917 = !DILocalVariable(name: "w", scope: !910, file: !852, line: 229, type: !832)
!918 = !DILocalVariable(name: "mbs", scope: !910, file: !852, line: 230, type: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !838, line: 6, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !840, line: 21, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !840, line: 13, size: 64, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !921, file: !840, line: 15, baseType: !137, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !921, file: !840, line: 20, baseType: !925, size: 32, offset: 32)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !921, file: !840, line: 16, size: 32, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !925, file: !840, line: 18, baseType: !119, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !925, file: !840, line: 19, baseType: !19, size: 32)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 64, elements: !930)
!930 = !{!237, !21}
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "slotvec", scope: !873, file: !852, line: 834, type: !933, isLocal: true, isDefinition: true)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !852, line: 823, size: 128, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !934, file: !852, line: 825, baseType: !176, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !934, file: !852, line: 826, baseType: !173, size: 64, offset: 64)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "nslots", scope: !873, file: !852, line: 832, type: !137, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "slotvec0", scope: !873, file: !852, line: 833, type: !934, isLocal: true, isDefinition: true)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 704, elements: !513)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !945, line: 192, type: !19, isLocal: true, isDefinition: true)
!945 = !DIFile(filename: "lib/read-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5e61a5e6b0c83d68cde0efd76e0ac088")
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !945, line: 192, type: !242, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !950, line: 67, type: !505, isLocal: true, isDefinition: true)
!950 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !950, line: 69, type: !438, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !950, line: 83, type: !438, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !950, line: 83, type: !19, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !950, line: 85, type: !235, isLocal: true, isDefinition: true)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !950, line: 88, type: !961, isLocal: true, isDefinition: true)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 171)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !950, line: 88, type: !966, isLocal: true, isDefinition: true)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 34)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !950, line: 105, type: !485, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !950, line: 109, type: !213, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !950, line: 113, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 28)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !950, line: 120, type: !594, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !950, line: 127, type: !626, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !950, line: 134, type: !462, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !950, line: 142, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 44)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !950, line: 150, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 48)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !950, line: 159, type: !996, isLocal: true, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 52)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !950, line: 170, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 60)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !950, line: 248, type: !399, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !950, line: 248, type: !208, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !950, line: 254, type: !399, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !950, line: 254, type: !223, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !950, line: 254, type: !462, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !950, line: 259, type: !3, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !950, line: 259, type: !728, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1020, file: !1021, line: 26, type: !1023, isLocal: false, isDefinition: true)
!1020 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1021, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1022, splitDebugInlining: false, nameTableKind: None)
!1021 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1022 = !{!1018}
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 376, elements: !1024)
!1024 = !{!1025}
!1025 = !DISubrange(count: 47)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1028, file: !1029, line: 24, type: !1031, isLocal: false, isDefinition: true)
!1028 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!1029 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1030 = !{!1026}
!1031 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 34, type: !242, isLocal: true, isDefinition: true)
!1034 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 34, type: !438, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 34, type: !230, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 108, type: !95, isLocal: true, isDefinition: true)
!1041 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "internal_state", scope: !1044, file: !1041, line: 97, type: !1047, isLocal: true, isDefinition: true)
!1044 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1041, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1045, globals: !1046, splitDebugInlining: false, nameTableKind: None)
!1045 = !{!174, !176, !181}
!1046 = !{!1039, !1042}
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !838, line: 6, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !840, line: 21, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !840, line: 13, size: 64, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1049, file: !840, line: 15, baseType: !137, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1049, file: !840, line: 20, baseType: !1053, size: 32, offset: 32)
!1053 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1049, file: !840, line: 16, size: 32, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1053, file: !840, line: 18, baseType: !119, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1053, file: !840, line: 19, baseType: !19, size: 32)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1059, line: 35, type: !419, isLocal: true, isDefinition: true)
!1059 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1060 = distinct !DICompileUnit(language: DW_LANG_C11, file: !808, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1061, splitDebugInlining: false, nameTableKind: None)
!1061 = !{!806}
!1062 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1063, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1063 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1064 = distinct !DICompileUnit(language: DW_LANG_C11, file: !945, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1065, globals: !1066, splitDebugInlining: false, nameTableKind: None)
!1065 = !{!174, !178}
!1066 = !{!943, !946}
!1067 = distinct !DICompileUnit(language: DW_LANG_C11, file: !950, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1068, retainedTypes: !1072, globals: !1073, splitDebugInlining: false, nameTableKind: None)
!1068 = !{!1069}
!1069 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !950, line: 40, baseType: !119, size: 32, elements: !1070)
!1070 = !{!1071}
!1071 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1072 = !{!174}
!1073 = !{!948, !951, !953, !955, !957, !959, !964, !969, !971, !973, !978, !980, !982, !984, !989, !994, !999, !1004, !1006, !1008, !1010, !1012, !1014, !1016}
!1074 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1075, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1076, retainedTypes: !1104, splitDebugInlining: false, nameTableKind: None)
!1075 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1076 = !{!1077, !1089}
!1077 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1078, file: !1075, line: 188, baseType: !119, size: 32, elements: !1087)
!1078 = distinct !DISubprogram(name: "x2nrealloc", scope: !1075, file: !1075, line: 176, type: !1079, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1074, retainedNodes: !1082)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!174, !174, !1081, !176}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!1082 = !{!1083, !1084, !1085, !1086}
!1083 = !DILocalVariable(name: "p", arg: 1, scope: !1078, file: !1075, line: 176, type: !174)
!1084 = !DILocalVariable(name: "pn", arg: 2, scope: !1078, file: !1075, line: 176, type: !1081)
!1085 = !DILocalVariable(name: "s", arg: 3, scope: !1078, file: !1075, line: 176, type: !176)
!1086 = !DILocalVariable(name: "n", scope: !1078, file: !1075, line: 178, type: !176)
!1087 = !{!1088}
!1088 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1089 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1090, file: !1075, line: 228, baseType: !119, size: 32, elements: !1087)
!1090 = distinct !DISubprogram(name: "xpalloc", scope: !1075, file: !1075, line: 223, type: !1091, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1074, retainedNodes: !1094)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!174, !174, !1093, !193, !195, !193}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103}
!1095 = !DILocalVariable(name: "pa", arg: 1, scope: !1090, file: !1075, line: 223, type: !174)
!1096 = !DILocalVariable(name: "pn", arg: 2, scope: !1090, file: !1075, line: 223, type: !1093)
!1097 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1090, file: !1075, line: 223, type: !193)
!1098 = !DILocalVariable(name: "n_max", arg: 4, scope: !1090, file: !1075, line: 223, type: !195)
!1099 = !DILocalVariable(name: "s", arg: 5, scope: !1090, file: !1075, line: 223, type: !193)
!1100 = !DILocalVariable(name: "n0", scope: !1090, file: !1075, line: 230, type: !193)
!1101 = !DILocalVariable(name: "n", scope: !1090, file: !1075, line: 237, type: !193)
!1102 = !DILocalVariable(name: "nbytes", scope: !1090, file: !1075, line: 248, type: !193)
!1103 = !DILocalVariable(name: "adjusted_nbytes", scope: !1090, file: !1075, line: 252, type: !193)
!1104 = !{!173, !174, !339, !196, !178}
!1105 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1034, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1106, splitDebugInlining: false, nameTableKind: None)
!1106 = !{!1032, !1035, !1037}
!1107 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1108, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1109, retainedTypes: !1110, splitDebugInlining: false, nameTableKind: None)
!1108 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1109 = !{!117}
!1110 = !{!339, !196, !178, !200}
!1111 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1112, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1072, splitDebugInlining: false, nameTableKind: None)
!1112 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1113 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1114, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1114 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1115 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1116, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1116 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1117 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1118, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1072, splitDebugInlining: false, nameTableKind: None)
!1118 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1119 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1120, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1072, splitDebugInlining: false, nameTableKind: None)
!1120 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1121 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1122, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1122 = !DIFile(filename: "lib/memset_explicit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5aa0e831d3f4d1a5017c23894634ef8c")
!1123 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1124, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1125, splitDebugInlining: false, nameTableKind: None)
!1124 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1125 = !{!339, !178, !174}
!1126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1059, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1127, splitDebugInlining: false, nameTableKind: None)
!1127 = !{!1128, !1057}
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !1059, line: 35, type: !235, isLocal: true, isDefinition: true)
!1130 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1131, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
