; ModuleID = 'src/pwd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.file_name = type { ptr, i64, ptr }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [60 x i8] c"Print the full filename of the current working directory.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"pwd\00", align 1, !dbg !17

!110 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!111 = !DIEnumerator(name: "c_quoting_style", value: 5)
!112 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!113 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!114 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!115 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!116 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 120, baseType: !89, size: 32, elements: !118)
!118 = !{!119}
!119 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!120 = !{!121, !122, !83, !123, !124, !127, !129}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 46, baseType: !126)
!125 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!126 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !131, !136, !141, !146, !229, !234, !236, !238, !243, !248, !250, !252, !254, !256, !258, !260, !265, !270, !272, !274, !276, !278, !280, !282, !287, !292, !297, !302, !304, !306, !308, !310, !312, !317, !319, !321, !326, !331, !336, !341, !343, !348, !350, !77, !352, !354, !356, !358, !363, !365, !370, !372, !377, !379, !384, !389}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 14)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 13)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 30)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !148, file: !82, line: 575, type: !83, isLocal: true, isDefinition: true)
!148 = distinct !DISubprogram(name: "oputs_", scope: !82, file: !82, line: 573, type: !149, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !151)
!149 = !DISubroutineType(cc: DW_CC_nocall, types: !150)
!150 = !{null, !127, !127}
!151 = !{!152, !153, !154, !157, !159, !160, !161, !165, !166, !167, !168, !170, !223, !224, !225, !227, !228}
!152 = !DILocalVariable(name: "program", arg: 1, scope: !148, file: !82, line: 573, type: !127)
!153 = !DILocalVariable(name: "option", arg: 2, scope: !148, file: !82, line: 573, type: !127)
!154 = !DILocalVariable(name: "term", scope: !155, file: !82, line: 585, type: !127)
!155 = distinct !DILexicalBlock(scope: !156, file: !82, line: 582, column: 5)
!156 = distinct !DILexicalBlock(scope: !148, file: !82, line: 581, column: 7)
!157 = !DILocalVariable(name: "double_space", scope: !148, file: !82, line: 594, type: !158)
!158 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!159 = !DILocalVariable(name: "first_word", scope: !148, file: !82, line: 595, type: !127)
!160 = !DILocalVariable(name: "option_text", scope: !148, file: !82, line: 596, type: !127)
!161 = !DILocalVariable(name: "s", scope: !162, file: !82, line: 608, type: !127)
!162 = distinct !DILexicalBlock(scope: !163, file: !82, line: 605, column: 5)
!163 = distinct !DILexicalBlock(scope: !164, file: !82, line: 604, column: 12)
!164 = distinct !DILexicalBlock(scope: !148, file: !82, line: 597, column: 7)
!165 = !DILocalVariable(name: "spaces", scope: !162, file: !82, line: 609, type: !124)
!166 = !DILocalVariable(name: "anchor_len", scope: !148, file: !82, line: 620, type: !124)
!167 = !DILocalVariable(name: "desc_text", scope: !148, file: !82, line: 625, type: !127)
!168 = !DILocalVariable(name: "__ptr", scope: !169, file: !82, line: 644, type: !127)
!169 = distinct !DILexicalBlock(scope: !148, file: !82, line: 644, column: 3)
!170 = !DILocalVariable(name: "__stream", scope: !169, file: !82, line: 644, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !173, line: 7, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !175, line: 49, size: 1728, elements: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !192, !194, !195, !196, !200, !201, !203, !204, !207, !209, !212, !215, !216, !217, !218, !219}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !174, file: !175, line: 51, baseType: !83, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !174, file: !175, line: 54, baseType: !122, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !174, file: !175, line: 55, baseType: !122, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !174, file: !175, line: 56, baseType: !122, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !174, file: !175, line: 57, baseType: !122, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !174, file: !175, line: 58, baseType: !122, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !174, file: !175, line: 59, baseType: !122, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !174, file: !175, line: 60, baseType: !122, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !174, file: !175, line: 61, baseType: !122, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !174, file: !175, line: 64, baseType: !122, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !174, file: !175, line: 65, baseType: !122, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !174, file: !175, line: 66, baseType: !122, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !174, file: !175, line: 68, baseType: !190, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !175, line: 36, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !174, file: !175, line: 70, baseType: !193, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !174, file: !175, line: 72, baseType: !83, size: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !174, file: !175, line: 73, baseType: !83, size: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !174, file: !175, line: 74, baseType: !197, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !198, line: 152, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!199 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !174, file: !175, line: 77, baseType: !123, size: 16, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !174, file: !175, line: 78, baseType: !202, size: 8, offset: 1040)
!202 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !174, file: !175, line: 79, baseType: !59, size: 8, offset: 1048)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !175, line: 81, baseType: !205, size: 64, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !175, line: 43, baseType: null)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !174, file: !175, line: 89, baseType: !208, size: 64, offset: 1152)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !198, line: 153, baseType: !199)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !174, file: !175, line: 91, baseType: !210, size: 64, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !175, line: 37, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !174, file: !175, line: 92, baseType: !213, size: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !175, line: 38, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !174, file: !175, line: 93, baseType: !193, size: 64, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !174, file: !175, line: 94, baseType: !121, size: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !174, file: !175, line: 95, baseType: !124, size: 64, offset: 1472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !174, file: !175, line: 96, baseType: !83, size: 32, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !174, file: !175, line: 98, baseType: !220, size: 160, offset: 1568)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 20)
!223 = !DILocalVariable(name: "__cnt", scope: !169, file: !82, line: 644, type: !124)
!224 = !DILocalVariable(name: "url_program", scope: !148, file: !82, line: 648, type: !127)
!225 = !DILocalVariable(name: "__ptr", scope: !226, file: !82, line: 686, type: !127)
!226 = distinct !DILexicalBlock(scope: !148, file: !82, line: 686, column: 3)
!227 = !DILocalVariable(name: "__stream", scope: !226, file: !82, line: 686, type: !171)
!228 = !DILocalVariable(name: "__cnt", scope: !226, file: !82, line: 686, type: !124)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !82, line: 585, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !82, line: 586, type: !231, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !82, line: 595, type: !19, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !82, line: 620, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 6)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 2)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !231, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !19, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !74, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !82, line: 650, type: !231, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !240, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !240, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !82, line: 652, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 7)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !82, line: 653, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 8)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !82, line: 654, type: !64, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !82, line: 655, type: !64, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !82, line: 656, type: !64, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !82, line: 657, type: !64, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !82, line: 663, type: !262, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !82, line: 664, type: !64, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 17)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 40)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 15)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 61)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !82, line: 679, type: !74, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !82, line: 683, type: !231, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !82, line: 688, type: !231, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !82, line: 691, type: !267, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !82, line: 839, type: !54, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !82, line: 840, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 22)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !82, line: 841, type: !294, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !82, line: 862, type: !19, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !82, line: 868, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 71)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !82, line: 875, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 27)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 51)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 12)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !267, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 42, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 9)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !231, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !267, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !19, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !74, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 313, type: !245, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 31)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !245, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 18)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !74, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 25)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !314, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 21)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 57)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !2, line: 134, type: !19, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 1280, elements: !232)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !394, line: 50, size: 256, elements: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!395 = !{!396, !397, !398, !400}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !393, file: !394, line: 52, baseType: !127, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !393, file: !394, line: 55, baseType: !83, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !394, line: 56, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !393, file: !394, line: 57, baseType: !83, size: 32, offset: 192)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !403, line: 3, type: !294, isLocal: true, isDefinition: true)
!403 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "Version", scope: !406, file: !403, line: 3, type: !127, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C11, file: !403, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !407, splitDebugInlining: false, nameTableKind: None)
!407 = !{!401, !404}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "file_name", scope: !410, file: !411, line: 45, type: !127, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !412, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!412 = !{!413, !415, !417, !419, !408, !421}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !411, line: 121, type: !262, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !411, line: 121, type: !338, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !411, line: 123, type: !262, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !411, line: 126, type: !74, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !410, file: !411, line: 55, type: !158, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !425, file: !426, line: 66, type: !469, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C11, file: !426, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !427, globals: !428, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!427 = !{!121, !129}
!428 = !{!429, !431, !451, !453, !455, !457, !423, !459, !461, !463, !465, !467}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !426, line: 272, type: !231, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "old_file_name", scope: !433, file: !426, line: 304, type: !127, isLocal: true, isDefinition: true)
!433 = distinct !DISubprogram(name: "verror_at_line", scope: !426, file: !426, line: 298, type: !434, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !425, retainedNodes: !444)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !83, !83, !127, !89, !127, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !438)
!438 = !{!439, !441, !442, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !437, file: !440, baseType: !89, size: 32)
!440 = !DIFile(filename: "lib/error.c", directory: "/src")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !437, file: !440, baseType: !89, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !437, file: !440, baseType: !121, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !437, file: !440, baseType: !121, size: 64, offset: 128)
!444 = !{!445, !446, !447, !448, !449, !450}
!445 = !DILocalVariable(name: "status", arg: 1, scope: !433, file: !426, line: 298, type: !83)
!446 = !DILocalVariable(name: "errnum", arg: 2, scope: !433, file: !426, line: 298, type: !83)
!447 = !DILocalVariable(name: "file_name", arg: 3, scope: !433, file: !426, line: 298, type: !127)
!448 = !DILocalVariable(name: "line_number", arg: 4, scope: !433, file: !426, line: 298, type: !89)
!449 = !DILocalVariable(name: "message", arg: 5, scope: !433, file: !426, line: 298, type: !127)
!450 = !DILocalVariable(name: "args", arg: 6, scope: !433, file: !426, line: 298, type: !436)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "old_line_number", scope: !433, file: !426, line: 305, type: !89, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !426, line: 338, type: !19, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !426, line: 346, type: !267, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !426, line: 346, type: !245, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "error_message_count", scope: !425, file: !426, line: 69, type: !89, isLocal: false, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !425, file: !426, line: 295, type: !83, isLocal: false, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !426, line: 208, type: !262, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !426, line: 208, type: !381, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !426, line: 214, type: !231, isLocal: true, isDefinition: true)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{null}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "program_name", scope: !474, file: !475, line: 31, type: !127, isLocal: false, isDefinition: true)
!474 = distinct !DICompileUnit(language: DW_LANG_C11, file: !475, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !476, globals: !477, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!476 = !{!122}
!477 = !{!472, !478, !480}
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !475, line: 46, type: !267, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !475, line: 49, type: !19, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "utf07FF", scope: !484, file: !485, line: 46, type: !512, isLocal: true, isDefinition: true)
!484 = distinct !DISubprogram(name: "proper_name_lite", scope: !485, file: !485, line: 38, type: !486, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !488, retainedNodes: !490)
!485 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!486 = !DISubroutineType(types: !487)
!487 = !{!127, !127, !127}
!488 = distinct !DICompileUnit(language: DW_LANG_C11, file: !485, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !489, splitDebugInlining: false, nameTableKind: None)
!489 = !{!482}
!490 = !{!491, !492, !493, !494, !499}
!491 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !484, file: !485, line: 38, type: !127)
!492 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !484, file: !485, line: 38, type: !127)
!493 = !DILocalVariable(name: "translation", scope: !484, file: !485, line: 40, type: !127)
!494 = !DILocalVariable(name: "w", scope: !484, file: !485, line: 47, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !496, line: 37, baseType: !497)
!496 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !198, line: 57, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !198, line: 42, baseType: !89)
!499 = !DILocalVariable(name: "mbs", scope: !484, file: !485, line: 48, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !501, line: 6, baseType: !502)
!501 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !503, line: 21, baseType: !504)
!503 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 13, size: 64, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !504, file: !503, line: 15, baseType: !83, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !504, file: !503, line: 20, baseType: !508, size: 32, offset: 32)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !504, file: !503, line: 16, size: 32, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !508, file: !503, line: 18, baseType: !89, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !508, file: !503, line: 19, baseType: !19, size: 32)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 16, elements: !246)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !515, line: 78, type: !267, isLocal: true, isDefinition: true)
!515 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !515, line: 79, type: !240, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !515, line: 80, type: !138, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !515, line: 81, type: !138, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !515, line: 82, type: !220, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !515, line: 83, type: !245, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !515, line: 84, type: !267, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !515, line: 85, type: !262, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !515, line: 86, type: !262, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !515, line: 87, type: !267, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !536, file: !515, line: 76, type: !608, isLocal: false, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C11, file: !515, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !537, retainedTypes: !543, globals: !544, splitDebugInlining: false, nameTableKind: None)
!537 = !{!103, !538, !87}
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !104, line: 254, baseType: !89, size: 32, elements: !539)
!539 = !{!540, !541, !542}
!540 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!541 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!542 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!543 = !{!83, !123, !124}
!544 = !{!513, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !545, !549, !559, !561, !566, !568, !570, !572, !574, !597, !604, !606}
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !536, file: !515, line: 92, type: !547, isLocal: false, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 320, elements: !65)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !536, file: !515, line: 1040, type: !551, isLocal: false, isDefinition: true)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !515, line: 56, size: 448, elements: !552)
!552 = !{!553, !554, !555, !557, !558}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !551, file: !515, line: 59, baseType: !103, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !551, file: !515, line: 62, baseType: !83, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !551, file: !515, line: 66, baseType: !556, size: 256, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 256, elements: !268)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !551, file: !515, line: 69, baseType: !127, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !551, file: !515, line: 72, baseType: !127, size: 64, offset: 384)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !536, file: !515, line: 107, type: !551, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "slot0", scope: !536, file: !515, line: 831, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 256)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !515, line: 321, type: !245, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !515, line: 357, type: !245, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !515, line: 358, type: !245, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !515, line: 199, type: !262, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "quote", scope: !576, file: !515, line: 228, type: !595, isLocal: true, isDefinition: true)
!576 = distinct !DISubprogram(name: "gettext_quote", scope: !515, file: !515, line: 197, type: !577, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !536, retainedNodes: !579)
!577 = !DISubroutineType(types: !578)
!578 = !{!127, !127, !103}
!579 = !{!580, !581, !582, !583, !584}
!580 = !DILocalVariable(name: "msgid", arg: 1, scope: !576, file: !515, line: 197, type: !127)
!581 = !DILocalVariable(name: "s", arg: 2, scope: !576, file: !515, line: 197, type: !103)
!582 = !DILocalVariable(name: "translation", scope: !576, file: !515, line: 199, type: !127)
!583 = !DILocalVariable(name: "w", scope: !576, file: !515, line: 229, type: !495)
!584 = !DILocalVariable(name: "mbs", scope: !576, file: !515, line: 230, type: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !501, line: 6, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !503, line: 21, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 13, size: 64, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !587, file: !503, line: 15, baseType: !83, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !587, file: !503, line: 20, baseType: !591, size: 32, offset: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !587, file: !503, line: 16, size: 32, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !591, file: !503, line: 18, baseType: !89, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !591, file: !503, line: 19, baseType: !19, size: 32)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 64, elements: !596)
!596 = !{!247, !21}
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "slotvec", scope: !536, file: !515, line: 834, type: !599, isLocal: true, isDefinition: true)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !515, line: 823, size: 128, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !600, file: !515, line: 825, baseType: !124, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !600, file: !515, line: 826, baseType: !122, size: 64, offset: 64)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "nslots", scope: !536, file: !515, line: 832, type: !83, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "slotvec0", scope: !536, file: !515, line: 833, type: !600, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 704, elements: !610)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!610 = !{!611}
!611 = !DISubrange(count: 11)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !614, line: 32, type: !245, isLocal: true, isDefinition: true)
!614 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !617, line: 67, type: !338, isLocal: true, isDefinition: true)
!617 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !617, line: 69, type: !262, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !617, line: 83, type: !262, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !617, line: 83, type: !19, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !617, line: 85, type: !245, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !617, line: 88, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 171)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !617, line: 88, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 34)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !617, line: 105, type: !54, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !617, line: 109, type: !9, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !617, line: 113, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 28)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !617, line: 120, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 32)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !617, line: 127, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 36)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !617, line: 134, type: !289, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !617, line: 142, type: !44, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !617, line: 150, type: !29, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !617, line: 159, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 52)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !617, line: 170, type: !14, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !617, line: 248, type: !220, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !617, line: 248, type: !314, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !617, line: 254, type: !220, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !617, line: 254, type: !133, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !617, line: 254, type: !289, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !617, line: 259, type: !3, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !617, line: 259, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 29)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !687, file: !688, line: 26, type: !690, isLocal: false, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !689, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!689 = !{!685}
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 376, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 47)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "exit_failure", scope: !695, file: !696, line: 24, type: !698, isLocal: false, isDefinition: true)
!695 = distinct !DICompileUnit(language: DW_LANG_C11, file: !696, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !697, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!697 = !{!693}
!698 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !83)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !701, line: 34, type: !74, isLocal: true, isDefinition: true)
!701 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !701, line: 34, type: !262, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !701, line: 34, type: !284, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !708, line: 108, type: !59, isLocal: true, isDefinition: true)
!708 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "internal_state", scope: !711, file: !708, line: 97, type: !714, isLocal: true, isDefinition: true)
!711 = distinct !DICompileUnit(language: DW_LANG_C11, file: !708, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !712, globals: !713, splitDebugInlining: false, nameTableKind: None)
!712 = !{!121, !124, !129}
!713 = !{!706, !709}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !501, line: 6, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !503, line: 21, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 13, size: 64, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !716, file: !503, line: 15, baseType: !83, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !716, file: !503, line: 20, baseType: !720, size: 32, offset: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !716, file: !503, line: 16, size: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !720, file: !503, line: 18, baseType: !89, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !720, file: !503, line: 19, baseType: !19, size: 32)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !726, line: 35, type: !240, isLocal: true, isDefinition: true)
!726 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !614, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !730, splitDebugInlining: false, nameTableKind: None)
!730 = !{!612}
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !617, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !732, retainedTypes: !736, globals: !737, splitDebugInlining: false, nameTableKind: None)
!732 = !{!733}
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 40, baseType: !89, size: 32, elements: !734)
!734 = !{!735}
!735 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!736 = !{!121}
!737 = !{!615, !618, !620, !622, !624, !626, !631, !636, !638, !640, !645, !650, !655, !657, !659, !661, !666, !668, !670, !672, !674, !676, !678, !680}
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !739, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !740, retainedTypes: !771, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!740 = !{!741, !753}
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !742, file: !739, line: 188, baseType: !89, size: 32, elements: !751)
!742 = distinct !DISubprogram(name: "x2nrealloc", scope: !739, file: !739, line: 176, type: !743, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !738, retainedNodes: !746)
!743 = !DISubroutineType(types: !744)
!744 = !{!121, !121, !745, !124}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!746 = !{!747, !748, !749, !750}
!747 = !DILocalVariable(name: "p", arg: 1, scope: !742, file: !739, line: 176, type: !121)
!748 = !DILocalVariable(name: "pn", arg: 2, scope: !742, file: !739, line: 176, type: !745)
!749 = !DILocalVariable(name: "s", arg: 3, scope: !742, file: !739, line: 176, type: !124)
!750 = !DILocalVariable(name: "n", scope: !742, file: !739, line: 178, type: !124)
!751 = !{!752}
!752 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !754, file: !739, line: 228, baseType: !89, size: 32, elements: !751)
!754 = distinct !DISubprogram(name: "xpalloc", scope: !739, file: !739, line: 223, type: !755, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !738, retainedNodes: !761)
!755 = !DISubroutineType(types: !756)
!756 = !{!121, !121, !757, !758, !760, !758}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !759, line: 130, baseType: !760)
!759 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !125, line: 35, baseType: !199)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770}
!762 = !DILocalVariable(name: "pa", arg: 1, scope: !754, file: !739, line: 223, type: !121)
!763 = !DILocalVariable(name: "pn", arg: 2, scope: !754, file: !739, line: 223, type: !757)
!764 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !754, file: !739, line: 223, type: !758)
!765 = !DILocalVariable(name: "n_max", arg: 4, scope: !754, file: !739, line: 223, type: !760)
!766 = !DILocalVariable(name: "s", arg: 5, scope: !754, file: !739, line: 223, type: !758)
!767 = !DILocalVariable(name: "n0", scope: !754, file: !739, line: 230, type: !758)
!768 = !DILocalVariable(name: "n", scope: !754, file: !739, line: 237, type: !758)
!769 = !DILocalVariable(name: "nbytes", scope: !754, file: !739, line: 248, type: !758)
!770 = !DILocalVariable(name: "adjusted_nbytes", scope: !754, file: !739, line: 252, type: !758)
!771 = !{!122, !121, !158, !199, !126}
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !773, splitDebugInlining: false, nameTableKind: None)
!773 = !{!699, !702, !704}
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/xgetcwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3727157833d2e1ec9b24b353bc14eccb")
!776 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!778 = distinct !DICompileUnit(language: DW_LANG_C11, file: !779, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !781, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !736, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!782 = distinct !DICompileUnit(language: DW_LANG_C11, file: !783, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !736, splitDebugInlining: false, nameTableKind: None)
!783 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!784 = distinct !DICompileUnit(language: DW_LANG_C11, file: !785, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !786, splitDebugInlining: false, nameTableKind: None)
!785 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!786 = !{!158, !126, !121}
!787 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !788, splitDebugInlining: false, nameTableKind: None)
!788 = !{!789, !724}
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !726, line: 35, type: !245, isLocal: true, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C11, file: !792, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!793 = distinct !DICompileUnit(language: DW_LANG_C11, file: !794, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !736, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!795 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!796 = !{i32 7, !"Dwarf Version", i32 5}
!797 = !{i32 2, !"Debug Info Version", i32 3}
!798 = !{i32 1, !"wchar_size", i32 4}
!799 = !{i32 8, !"PIC Level", i32 2}
!800 = !{i32 7, !"PIE Level", i32 2}
!801 = !{i32 7, !"uwtable", i32 2}
!802 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 49, type: !803, scopeLine: 50, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !83}
!805 = !{!806}
!806 = !DILocalVariable(name: "status", arg: 1, scope: !802, file: !2, line: 49, type: !83)
!807 = !DILocation(line: 0, scope: !802)
!808 = !DILocation(line: 51, column: 14, scope: !809)
!809 = distinct !DILexicalBlock(scope: !802, file: !2, line: 51, column: 7)
!810 = !DILocation(line: 51, column: 7, scope: !802)
!811 = !DILocation(line: 52, column: 5, scope: !812)
!812 = distinct !DILexicalBlock(scope: !809, file: !2, line: 52, column: 5)
!813 = !{!814, !814, i64 0}
!814 = !{!"any pointer", !815, i64 0}
!815 = !{!"omnipotent char", !816, i64 0}
!816 = !{!"Simple C/C++ TBAA"}
!817 = !DILocation(line: 55, column: 7, scope: !818)
!818 = distinct !DILexicalBlock(scope: !809, file: !2, line: 54, column: 5)
!819 = !DILocation(line: 56, column: 7, scope: !818)
!820 = !DILocation(line: 60, column: 7, scope: !818)
!821 = !DILocation(line: 64, column: 7, scope: !818)
!822 = !DILocation(line: 68, column: 7, scope: !818)
!823 = !DILocation(line: 69, column: 7, scope: !818)
!824 = !DILocation(line: 70, column: 7, scope: !818)
!825 = !DILocation(line: 73, column: 7, scope: !818)
!826 = !DILocalVariable(name: "program", arg: 1, scope: !827, file: !82, line: 836, type: !127)
!827 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !82, file: !82, line: 836, type: !828, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !127}
!830 = !{!826, !831, !838, !839, !841, !842}
!831 = !DILocalVariable(name: "infomap", scope: !827, file: !82, line: 838, type: !832)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 896, elements: !263)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !827, file: !82, line: 838, size: 128, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !834, file: !82, line: 838, baseType: !127, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !834, file: !82, line: 838, baseType: !127, size: 64, offset: 64)
!838 = !DILocalVariable(name: "node", scope: !827, file: !82, line: 848, type: !127)
!839 = !DILocalVariable(name: "map_prog", scope: !827, file: !82, line: 849, type: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!841 = !DILocalVariable(name: "lc_messages", scope: !827, file: !82, line: 861, type: !127)
!842 = !DILocalVariable(name: "url_program", scope: !827, file: !82, line: 874, type: !127)
!843 = !DILocation(line: 0, scope: !827, inlinedAt: !844)
!844 = distinct !DILocation(line: 74, column: 7, scope: !818)
!845 = !DILocation(line: 857, column: 3, scope: !827, inlinedAt: !844)
!846 = !DILocation(line: 861, column: 29, scope: !827, inlinedAt: !844)
!847 = !DILocation(line: 862, column: 7, scope: !848, inlinedAt: !844)
!848 = distinct !DILexicalBlock(scope: !827, file: !82, line: 862, column: 7)
!849 = !DILocation(line: 862, column: 19, scope: !848, inlinedAt: !844)
!850 = !DILocation(line: 862, column: 22, scope: !848, inlinedAt: !844)
!851 = !DILocation(line: 862, column: 7, scope: !827, inlinedAt: !844)
!852 = !DILocation(line: 868, column: 7, scope: !853, inlinedAt: !844)
!853 = distinct !DILexicalBlock(scope: !848, file: !82, line: 863, column: 5)
!854 = !DILocation(line: 870, column: 5, scope: !853, inlinedAt: !844)
!855 = !DILocation(line: 875, column: 3, scope: !827, inlinedAt: !844)
!856 = !DILocation(line: 877, column: 3, scope: !827, inlinedAt: !844)
!857 = !DILocation(line: 76, column: 3, scope: !802)
!858 = !DISubprogram(name: "dcgettext", scope: !859, file: !859, line: 51, type: !860, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!859 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!860 = !DISubroutineType(types: !861)
!861 = !{!122, !127, !127, !83}
!862 = !{}
!863 = !DISubprogram(name: "__fprintf_chk", scope: !864, file: !864, line: 93, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!864 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!865 = !DISubroutineType(types: !866)
!866 = !{!83, !867, !83, !868, null}
!867 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !171)
!868 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !127)
!869 = !DISubprogram(name: "__printf_chk", scope: !864, file: !864, line: 95, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!870 = !DISubroutineType(types: !871)
!871 = !{!83, !83, !868, null}
!872 = !DISubprogram(name: "fputs_unlocked", scope: !873, file: !873, line: 691, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!873 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!874 = !DISubroutineType(types: !875)
!875 = !{!83, !868, !867}
!876 = !DILocation(line: 0, scope: !148)
!877 = !DILocation(line: 581, column: 7, scope: !156)
!878 = !{!879, !879, i64 0}
!879 = !{!"int", !815, i64 0}
!880 = !DILocation(line: 581, column: 19, scope: !156)
!881 = !DILocation(line: 581, column: 7, scope: !148)
!882 = !DILocation(line: 585, column: 26, scope: !155)
!883 = !DILocation(line: 0, scope: !155)
!884 = !DILocation(line: 586, column: 23, scope: !155)
!885 = !DILocation(line: 586, column: 28, scope: !155)
!886 = !DILocation(line: 586, column: 32, scope: !155)
!887 = !{!815, !815, i64 0}
!888 = !DILocation(line: 586, column: 38, scope: !155)
!889 = !DILocalVariable(name: "__s1", arg: 1, scope: !890, file: !891, line: 1359, type: !127)
!890 = distinct !DISubprogram(name: "streq", scope: !891, file: !891, line: 1359, type: !892, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !894)
!891 = !DIFile(filename: "./lib/string.h", directory: "/src")
!892 = !DISubroutineType(types: !893)
!893 = !{!158, !127, !127}
!894 = !{!889, !895}
!895 = !DILocalVariable(name: "__s2", arg: 2, scope: !890, file: !891, line: 1359, type: !127)
!896 = !DILocation(line: 0, scope: !890, inlinedAt: !897)
!897 = distinct !DILocation(line: 586, column: 41, scope: !155)
!898 = !DILocation(line: 1361, column: 11, scope: !890, inlinedAt: !897)
!899 = !DILocation(line: 1361, column: 10, scope: !890, inlinedAt: !897)
!900 = !DILocation(line: 586, column: 19, scope: !155)
!901 = !DILocation(line: 587, column: 5, scope: !155)
!902 = !DILocation(line: 588, column: 7, scope: !903)
!903 = distinct !DILexicalBlock(scope: !148, file: !82, line: 588, column: 7)
!904 = !DILocation(line: 588, column: 7, scope: !148)
!905 = !DILocation(line: 590, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !903, file: !82, line: 589, column: 5)
!907 = !DILocation(line: 591, column: 7, scope: !906)
!908 = !DILocation(line: 595, column: 37, scope: !148)
!909 = !DILocation(line: 595, column: 35, scope: !148)
!910 = !DILocation(line: 596, column: 29, scope: !148)
!911 = !DILocation(line: 597, column: 8, scope: !164)
!912 = !DILocation(line: 597, column: 7, scope: !148)
!913 = !DILocation(line: 604, column: 24, scope: !163)
!914 = !DILocation(line: 604, column: 12, scope: !164)
!915 = !DILocation(line: 0, scope: !162)
!916 = !DILocation(line: 610, column: 16, scope: !162)
!917 = !DILocation(line: 610, column: 7, scope: !162)
!918 = !DILocation(line: 611, column: 21, scope: !162)
!919 = !{!920, !920, i64 0}
!920 = !{!"short", !815, i64 0}
!921 = !DILocation(line: 611, column: 19, scope: !162)
!922 = !DILocation(line: 611, column: 16, scope: !162)
!923 = !DILocation(line: 610, column: 30, scope: !162)
!924 = distinct !{!924, !917, !918, !925}
!925 = !{!"llvm.loop.mustprogress"}
!926 = !DILocation(line: 612, column: 18, scope: !927)
!927 = distinct !DILexicalBlock(scope: !162, file: !82, line: 612, column: 11)
!928 = !DILocation(line: 612, column: 11, scope: !162)
!929 = !DILocation(line: 618, column: 5, scope: !162)
!930 = !DILocation(line: 620, column: 23, scope: !148)
!931 = !DILocation(line: 625, column: 39, scope: !148)
!932 = !DILocation(line: 626, column: 3, scope: !148)
!933 = !DILocation(line: 626, column: 10, scope: !148)
!934 = !DILocation(line: 626, column: 21, scope: !148)
!935 = !DILocation(line: 628, column: 44, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !82, line: 628, column: 11)
!937 = distinct !DILexicalBlock(scope: !148, file: !82, line: 627, column: 5)
!938 = !DILocation(line: 628, column: 32, scope: !936)
!939 = !DILocation(line: 628, column: 49, scope: !936)
!940 = !DILocation(line: 628, column: 11, scope: !937)
!941 = !DILocation(line: 630, column: 11, scope: !942)
!942 = distinct !DILexicalBlock(scope: !937, file: !82, line: 630, column: 11)
!943 = !DILocation(line: 630, column: 11, scope: !937)
!944 = !DILocation(line: 632, column: 26, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !82, line: 632, column: 15)
!946 = distinct !DILexicalBlock(scope: !942, file: !82, line: 631, column: 9)
!947 = !DILocation(line: 632, column: 34, scope: !945)
!948 = !DILocation(line: 632, column: 37, scope: !945)
!949 = !DILocation(line: 632, column: 15, scope: !946)
!950 = !DILocation(line: 636, column: 16, scope: !951)
!951 = distinct !DILexicalBlock(scope: !946, file: !82, line: 636, column: 15)
!952 = !DILocation(line: 636, column: 29, scope: !951)
!953 = !DILocation(line: 640, column: 16, scope: !937)
!954 = distinct !{!954, !932, !955, !925}
!955 = !DILocation(line: 641, column: 5, scope: !148)
!956 = !DILocation(line: 644, column: 3, scope: !148)
!957 = !DILocation(line: 0, scope: !890, inlinedAt: !958)
!958 = distinct !DILocation(line: 648, column: 31, scope: !148)
!959 = !DILocation(line: 0, scope: !890, inlinedAt: !960)
!960 = distinct !DILocation(line: 649, column: 31, scope: !148)
!961 = !DILocation(line: 0, scope: !890, inlinedAt: !962)
!962 = distinct !DILocation(line: 650, column: 31, scope: !148)
!963 = !DILocation(line: 0, scope: !890, inlinedAt: !964)
!964 = distinct !DILocation(line: 651, column: 31, scope: !148)
!965 = !DILocation(line: 0, scope: !890, inlinedAt: !966)
!966 = distinct !DILocation(line: 652, column: 31, scope: !148)
!967 = !DILocation(line: 0, scope: !890, inlinedAt: !968)
!968 = distinct !DILocation(line: 653, column: 31, scope: !148)
!969 = !DILocation(line: 0, scope: !890, inlinedAt: !970)
!970 = distinct !DILocation(line: 654, column: 31, scope: !148)
!971 = !DILocation(line: 0, scope: !890, inlinedAt: !972)
!972 = distinct !DILocation(line: 655, column: 31, scope: !148)
!973 = !DILocation(line: 0, scope: !890, inlinedAt: !974)
!974 = distinct !DILocation(line: 656, column: 31, scope: !148)
!975 = !DILocation(line: 0, scope: !890, inlinedAt: !976)
!976 = distinct !DILocation(line: 657, column: 31, scope: !148)
!977 = !DILocation(line: 663, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !148, file: !82, line: 663, column: 7)
!979 = !DILocation(line: 664, column: 7, scope: !978)
!980 = !DILocation(line: 664, column: 10, scope: !978)
!981 = !DILocation(line: 663, column: 7, scope: !148)
!982 = !DILocation(line: 669, column: 7, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !82, line: 665, column: 5)
!984 = !DILocation(line: 671, column: 5, scope: !983)
!985 = !DILocation(line: 676, column: 7, scope: !986)
!986 = distinct !DILexicalBlock(scope: !978, file: !82, line: 673, column: 5)
!987 = !DILocation(line: 679, column: 3, scope: !148)
!988 = !DILocation(line: 683, column: 3, scope: !148)
!989 = !DILocation(line: 686, column: 3, scope: !148)
!990 = !DILocation(line: 688, column: 3, scope: !148)
!991 = !DILocation(line: 691, column: 3, scope: !148)
!992 = !DILocation(line: 695, column: 3, scope: !148)
!993 = !DILocation(line: 696, column: 1, scope: !148)
!994 = !DISubprogram(name: "setlocale", scope: !995, file: !995, line: 122, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!995 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!996 = !DISubroutineType(types: !997)
!997 = !{!122, !83, !127}
!998 = !DISubprogram(name: "strncmp", scope: !999, file: !999, line: 159, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!999 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!83, !127, !127, !124}
!1002 = !DISubprogram(name: "exit", scope: !1003, file: !1003, line: 624, type: !803, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1003 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1004 = !DISubprogram(name: "getenv", scope: !1003, file: !1003, line: 641, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!122, !127}
!1007 = !DISubprogram(name: "strcmp", scope: !999, file: !999, line: 156, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!83, !127, !127}
!1010 = !DISubprogram(name: "strspn", scope: !999, file: !999, line: 297, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!126, !127, !127}
!1013 = !DISubprogram(name: "strchr", scope: !999, file: !999, line: 246, type: !1014, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!122, !127, !83}
!1016 = !DISubprogram(name: "__ctype_b_loc", scope: !88, file: !88, line: 79, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!1022 = !DISubprogram(name: "strcspn", scope: !999, file: !999, line: 293, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1023 = !DISubprogram(name: "fwrite_unlocked", scope: !873, file: !873, line: 704, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !862)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!124, !1026, !124, !124, !867}
!1026 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1029 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 320, type: !1030, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1033)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!83, !83, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!1033 = !{!1034, !1035, !1036, !1037, !1039, !1042, !1043}
!1034 = !DILocalVariable(name: "argc", arg: 1, scope: !1029, file: !2, line: 320, type: !83)
!1035 = !DILocalVariable(name: "argv", arg: 2, scope: !1029, file: !2, line: 320, type: !1032)
!1036 = !DILocalVariable(name: "logical", scope: !1029, file: !2, line: 325, type: !158)
!1037 = !DILocalVariable(name: "c", scope: !1038, file: !2, line: 337, type: !83)
!1038 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 336, column: 5)
!1039 = !DILocalVariable(name: "wd", scope: !1040, file: !2, line: 363, type: !127)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 362, column: 5)
!1041 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 361, column: 7)
!1042 = !DILocalVariable(name: "wd", scope: !1029, file: !2, line: 371, type: !122)
!1043 = !DILocalVariable(name: "file_name", scope: !1044, file: !2, line: 379, type: !1046)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !2, line: 378, column: 5)
!1045 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 372, column: 7)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !2, line: 32, size: 192, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1047, file: !2, line: 34, baseType: !122, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !1047, file: !2, line: 35, baseType: !758, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1047, file: !2, line: 36, baseType: !122, size: 64, offset: 128)
!1052 = !DILocation(line: 0, scope: !1029)
!1053 = !DILocation(line: 325, column: 19, scope: !1029)
!1054 = !DILocation(line: 325, column: 46, scope: !1029)
!1055 = !DILocation(line: 325, column: 8, scope: !1029)
!1056 = !DILocation(line: 328, column: 21, scope: !1029)
!1057 = !DILocation(line: 328, column: 3, scope: !1029)
!1058 = !DILocation(line: 329, column: 3, scope: !1029)
!1059 = !DILocation(line: 330, column: 3, scope: !1029)
!1060 = !DILocation(line: 331, column: 3, scope: !1029)
!1061 = !DILocation(line: 333, column: 3, scope: !1029)
!1062 = !DILocation(line: 335, column: 3, scope: !1029)
!1063 = !DILocation(line: 337, column: 15, scope: !1038)
!1064 = !DILocation(line: 0, scope: !1038)
!1065 = !DILocation(line: 338, column: 11, scope: !1038)
!1066 = !DILocation(line: 347, column: 11, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1038, file: !2, line: 341, column: 9)
!1068 = !DILocation(line: 349, column: 9, scope: !1067)
!1069 = !DILocation(line: 351, column: 9, scope: !1067)
!1070 = !DILocation(line: 354, column: 11, scope: !1067)
!1071 = !DILocation(line: 358, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 358, column: 7)
!1073 = !DILocation(line: 358, column: 14, scope: !1072)
!1074 = !DILocation(line: 358, column: 7, scope: !1029)
!1075 = !DILocation(line: 359, column: 5, scope: !1072)
!1076 = !DILocation(line: 361, column: 7, scope: !1041)
!1077 = !DILocation(line: 361, column: 7, scope: !1029)
!1078 = !DILocation(line: 296, column: 20, scope: !1079, inlinedAt: !1121)
!1079 = distinct !DISubprogram(name: "logical_getcwd", scope: !2, file: !2, line: 294, type: !1080, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1082)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!127}
!1082 = !{!1083, !1084, !1085, !1120}
!1083 = !DILocalVariable(name: "wd", scope: !1079, file: !2, line: 296, type: !127)
!1084 = !DILocalVariable(name: "p", scope: !1079, file: !2, line: 301, type: !127)
!1085 = !DILocalVariable(name: "st1", scope: !1079, file: !2, line: 311, type: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1087, line: 26, size: 1152, elements: !1088)
!1087 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1088 = !{!1089, !1091, !1093, !1095, !1097, !1099, !1101, !1102, !1103, !1104, !1106, !1108, !1116, !1117, !1118}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1086, file: !1087, line: 31, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !198, line: 145, baseType: !126)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1086, file: !1087, line: 36, baseType: !1092, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !198, line: 148, baseType: !126)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1086, file: !1087, line: 44, baseType: !1094, size: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !198, line: 151, baseType: !126)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1086, file: !1087, line: 45, baseType: !1096, size: 32, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !198, line: 150, baseType: !89)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1086, file: !1087, line: 47, baseType: !1098, size: 32, offset: 224)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !198, line: 146, baseType: !89)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1086, file: !1087, line: 48, baseType: !1100, size: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !198, line: 147, baseType: !89)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1086, file: !1087, line: 50, baseType: !83, size: 32, offset: 288)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1086, file: !1087, line: 52, baseType: !1090, size: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1086, file: !1087, line: 57, baseType: !197, size: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1086, file: !1087, line: 61, baseType: !1105, size: 64, offset: 448)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !198, line: 175, baseType: !199)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1086, file: !1087, line: 63, baseType: !1107, size: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !198, line: 180, baseType: !199)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1086, file: !1087, line: 74, baseType: !1109, size: 128, offset: 576)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1110, line: 11, size: 128, elements: !1111)
!1110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1111 = !{!1112, !1114}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1109, file: !1110, line: 16, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !198, line: 160, baseType: !199)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1109, file: !1110, line: 21, baseType: !1115, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !198, line: 197, baseType: !199)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1086, file: !1087, line: 75, baseType: !1109, size: 128, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1086, file: !1087, line: 76, baseType: !1109, size: 128, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1086, file: !1087, line: 89, baseType: !1119, size: 192, offset: 960)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 192, elements: !75)
!1120 = !DILocalVariable(name: "st2", scope: !1079, file: !2, line: 312, type: !1086)
!1121 = distinct !DILocation(line: 363, column: 24, scope: !1040)
!1122 = !DILocation(line: 0, scope: !1079, inlinedAt: !1121)
!1123 = !DILocation(line: 299, column: 8, scope: !1124, inlinedAt: !1121)
!1124 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 299, column: 7)
!1125 = !DILocation(line: 299, column: 11, scope: !1124, inlinedAt: !1121)
!1126 = !DILocation(line: 299, column: 14, scope: !1124, inlinedAt: !1121)
!1127 = !DILocation(line: 299, column: 20, scope: !1124, inlinedAt: !1121)
!1128 = !DILocation(line: 299, column: 7, scope: !1079, inlinedAt: !1121)
!1129 = !DILocation(line: 302, column: 15, scope: !1079, inlinedAt: !1121)
!1130 = !DILocation(line: 302, column: 3, scope: !1079, inlinedAt: !1121)
!1131 = !DILocation(line: 304, column: 12, scope: !1132, inlinedAt: !1121)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 304, column: 11)
!1133 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 303, column: 5)
!1134 = !DILocation(line: 304, column: 17, scope: !1132, inlinedAt: !1121)
!1135 = !DILocation(line: 305, column: 32, scope: !1132, inlinedAt: !1121)
!1136 = !DILocation(line: 305, column: 37, scope: !1132, inlinedAt: !1121)
!1137 = !DILocation(line: 307, column: 8, scope: !1133, inlinedAt: !1121)
!1138 = distinct !{!1138, !1130, !1139, !925}
!1139 = !DILocation(line: 308, column: 5, scope: !1079, inlinedAt: !1121)
!1140 = !DILocation(line: 311, column: 3, scope: !1079, inlinedAt: !1121)
!1141 = !DILocation(line: 311, column: 15, scope: !1079, inlinedAt: !1121)
!1142 = !DILocation(line: 312, column: 3, scope: !1079, inlinedAt: !1121)
!1143 = !DILocation(line: 312, column: 15, scope: !1079, inlinedAt: !1121)
!1144 = !DILocation(line: 313, column: 7, scope: !1145, inlinedAt: !1121)
!1145 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 313, column: 7)
!1146 = !DILocation(line: 313, column: 23, scope: !1145, inlinedAt: !1121)
!1147 = !DILocation(line: 313, column: 28, scope: !1145, inlinedAt: !1121)
!1148 = !DILocation(line: 313, column: 31, scope: !1145, inlinedAt: !1121)
!1149 = !DILocation(line: 313, column: 48, scope: !1145, inlinedAt: !1121)
!1150 = !DILocation(line: 313, column: 53, scope: !1145, inlinedAt: !1121)
!1151 = !DILocalVariable(name: "a", arg: 1, scope: !1152, file: !1153, line: 86, type: !1156)
!1152 = distinct !DISubprogram(name: "psame_inode", scope: !1153, file: !1153, line: 86, type: !1154, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1158)
!1153 = !DIFile(filename: "./lib/same-inode.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6a49db1c884e7bc93549038e7fb28788")
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!158, !1156, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1158 = !{!1151, !1159}
!1159 = !DILocalVariable(name: "b", arg: 2, scope: !1152, file: !1153, line: 86, type: !1156)
!1160 = !DILocation(line: 0, scope: !1152, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 313, column: 56, scope: !1145, inlinedAt: !1121)
!1162 = !DILocation(line: 90, column: 14, scope: !1152, inlinedAt: !1161)
!1163 = !{!1164, !1165, i64 0}
!1164 = !{!"stat", !1165, i64 0, !1165, i64 8, !1165, i64 16, !879, i64 24, !879, i64 28, !879, i64 32, !879, i64 36, !1165, i64 40, !1165, i64 48, !1165, i64 56, !1165, i64 64, !1166, i64 72, !1166, i64 88, !1166, i64 104, !815, i64 120}
!1165 = !{!"long", !815, i64 0}
!1166 = !{!"timespec", !1165, i64 0, !1165, i64 8}
!1167 = !{!1164, !1165, i64 8}
!1168 = !DILocation(line: 313, column: 7, scope: !1079, inlinedAt: !1121)
!1169 = !DILocation(line: 316, column: 1, scope: !1079, inlinedAt: !1121)
!1170 = !DILocation(line: 0, scope: !1040)
!1171 = !DILocation(line: 364, column: 11, scope: !1040)
!1172 = !DILocation(line: 366, column: 11, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 365, column: 9)
!1174 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 364, column: 11)
!1175 = !DILocation(line: 371, column: 14, scope: !1029)
!1176 = !DILocation(line: 372, column: 10, scope: !1045)
!1177 = !DILocation(line: 372, column: 7, scope: !1029)
!1178 = !DILocation(line: 374, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1045, file: !2, line: 373, column: 5)
!1180 = !DILocation(line: 375, column: 7, scope: !1179)
!1181 = !DILocation(line: 376, column: 5, scope: !1179)
!1182 = !DILocation(line: 89, column: 25, scope: !1183, inlinedAt: !1189)
!1183 = distinct !DISubprogram(name: "file_name_init", scope: !2, file: !2, line: 87, type: !1184, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1186)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!1046}
!1186 = !{!1187, !1188}
!1187 = !DILocalVariable(name: "p", scope: !1183, file: !2, line: 89, type: !1046)
!1188 = !DILocalVariable(name: "init_alloc", scope: !1183, file: !2, line: 93, type: !83)
!1189 = distinct !DILocation(line: 379, column: 37, scope: !1044)
!1190 = !DILocation(line: 0, scope: !1183, inlinedAt: !1189)
!1191 = !DILocation(line: 94, column: 6, scope: !1183, inlinedAt: !1189)
!1192 = !DILocation(line: 94, column: 14, scope: !1183, inlinedAt: !1189)
!1193 = !{!1194, !1165, i64 8}
!1194 = !{!"file_name", !814, i64 0, !1165, i64 8, !814, i64 16}
!1195 = !DILocation(line: 96, column: 12, scope: !1183, inlinedAt: !1189)
!1196 = !DILocation(line: 96, column: 10, scope: !1183, inlinedAt: !1189)
!1197 = !{!1194, !814, i64 0}
!1198 = !DILocation(line: 97, column: 34, scope: !1183, inlinedAt: !1189)
!1199 = !DILocation(line: 97, column: 6, scope: !1183, inlinedAt: !1189)
!1200 = !DILocation(line: 97, column: 12, scope: !1183, inlinedAt: !1189)
!1201 = !{!1194, !814, i64 16}
!1202 = !DILocation(line: 98, column: 15, scope: !1183, inlinedAt: !1189)
!1203 = !DILocation(line: 0, scope: !1044)
!1204 = !DILocalVariable(name: "file_name", arg: 1, scope: !1205, file: !2, line: 262, type: !1046)
!1205 = distinct !DISubprogram(name: "robust_getcwd", scope: !2, file: !2, line: 262, type: !1206, scopeLine: 263, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1208)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !1046}
!1208 = !{!1204, !1209, !1210, !1219, !1221}
!1209 = !DILocalVariable(name: "height", scope: !1205, file: !2, line: 264, type: !124)
!1210 = !DILocalVariable(name: "dev_ino_buf", scope: !1205, file: !2, line: 265, type: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !1212, line: 30, size: 128, elements: !1213)
!1212 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!1213 = !{!1214, !1217}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1211, file: !1212, line: 32, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !1216, line: 47, baseType: !1092)
!1216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1211, file: !1212, line: 33, baseType: !1218, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !1216, line: 59, baseType: !1090)
!1219 = !DILocalVariable(name: "root_dev_ino", scope: !1205, file: !2, line: 266, type: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1221 = !DILocalVariable(name: "dot_sb", scope: !1205, file: !2, line: 272, type: !1086)
!1222 = !DILocation(line: 0, scope: !1205, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 380, column: 7, scope: !1044)
!1224 = !DILocation(line: 265, column: 3, scope: !1205, inlinedAt: !1223)
!1225 = !DILocation(line: 265, column: 18, scope: !1205, inlinedAt: !1223)
!1226 = !DILocation(line: 266, column: 34, scope: !1205, inlinedAt: !1223)
!1227 = !DILocation(line: 268, column: 20, scope: !1228, inlinedAt: !1223)
!1228 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 268, column: 7)
!1229 = !DILocation(line: 268, column: 7, scope: !1205, inlinedAt: !1223)
!1230 = !DILocation(line: 269, column: 5, scope: !1228, inlinedAt: !1223)
!1231 = !DILocation(line: 272, column: 3, scope: !1205, inlinedAt: !1223)
!1232 = !DILocation(line: 272, column: 15, scope: !1205, inlinedAt: !1223)
!1233 = !DILocation(line: 273, column: 7, scope: !1234, inlinedAt: !1223)
!1234 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 273, column: 7)
!1235 = !DILocation(line: 273, column: 27, scope: !1234, inlinedAt: !1223)
!1236 = !DILocation(line: 273, column: 7, scope: !1205, inlinedAt: !1223)
!1237 = !DILocation(line: 279, column: 11, scope: !1238, inlinedAt: !1223)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !2, line: 279, column: 11)
!1239 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 277, column: 5)
!1240 = !{!1241, !1165, i64 8}
!1241 = !{!"dev_ino", !1165, i64 0, !1165, i64 8}
!1242 = !{!1241, !1165, i64 0}
!1243 = !DILocation(line: 279, column: 11, scope: !1239, inlinedAt: !1223)
!1244 = !DILocation(line: 274, column: 5, scope: !1234, inlinedAt: !1223)
!1245 = !DILocation(line: 282, column: 49, scope: !1239, inlinedAt: !1223)
!1246 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !1247, file: !2, line: 153, type: !1250)
