; ModuleID = 'src/realpath.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.10 }
%union.anon.10 = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.realpath_bufs = type { %struct.scratch_buffer, %struct.scratch_buffer, %struct.scratch_buffer }
%struct.scratch_buffer = type { ptr, i64, %union.anon }
%union.anon = type { %struct.max_align_t, [992 x i8] }
%struct.max_align_t = type { i64, x86_fp80 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.F_triple = type { ptr, i64, i64 }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!153 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !44, !49, !51, !56, !61, !66, !71, !76, !81, !86, !91, !155, !160, !162, !167, !172, !177, !180, !182, !184, !186, !268, !273, !275, !280, !285, !290, !292, !294, !296, !298, !300, !302, !307, !312, !314, !316, !318, !320, !322, !324, !329, !331, !333, !335, !337, !339, !341, !343, !345, !350, !352, !354, !359, !364, !369, !374, !379, !381, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !93, !406, !408, !410}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 14)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !157, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 261, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 16)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "logical", scope: !95, file: !2, line: 40, type: !179, isLocal: true, isDefinition: true)
!179 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "use_nuls", scope: !95, file: !2, line: 41, type: !179, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "can_relative_to", scope: !95, file: !2, line: 42, type: !151, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "can_relative_base", scope: !95, file: !2, line: 43, type: !151, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !188, file: !110, line: 575, type: !111, isLocal: true, isDefinition: true)
!188 = distinct !DISubprogram(name: "oputs_", scope: !110, file: !110, line: 573, type: !189, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !191)
!189 = !DISubroutineType(cc: DW_CC_nocall, types: !190)
!190 = !{null, !151, !151}
!191 = !{!192, !193, !194, !197, !198, !199, !200, !204, !205, !206, !207, !209, !262, !263, !264, !266, !267}
!192 = !DILocalVariable(name: "program", arg: 1, scope: !188, file: !110, line: 573, type: !151)
!193 = !DILocalVariable(name: "option", arg: 2, scope: !188, file: !110, line: 573, type: !151)
!194 = !DILocalVariable(name: "term", scope: !195, file: !110, line: 585, type: !151)
!195 = distinct !DILexicalBlock(scope: !196, file: !110, line: 582, column: 5)
!196 = distinct !DILexicalBlock(scope: !188, file: !110, line: 581, column: 7)
!197 = !DILocalVariable(name: "double_space", scope: !188, file: !110, line: 594, type: !179)
!198 = !DILocalVariable(name: "first_word", scope: !188, file: !110, line: 595, type: !151)
!199 = !DILocalVariable(name: "option_text", scope: !188, file: !110, line: 596, type: !151)
!200 = !DILocalVariable(name: "s", scope: !201, file: !110, line: 608, type: !151)
!201 = distinct !DILexicalBlock(scope: !202, file: !110, line: 605, column: 5)
!202 = distinct !DILexicalBlock(scope: !203, file: !110, line: 604, column: 12)
!203 = distinct !DILexicalBlock(scope: !188, file: !110, line: 597, column: 7)
!204 = !DILocalVariable(name: "spaces", scope: !201, file: !110, line: 609, type: !148)
!205 = !DILocalVariable(name: "anchor_len", scope: !188, file: !110, line: 620, type: !148)
!206 = !DILocalVariable(name: "desc_text", scope: !188, file: !110, line: 625, type: !151)
!207 = !DILocalVariable(name: "__ptr", scope: !208, file: !110, line: 644, type: !151)
!208 = distinct !DILexicalBlock(scope: !188, file: !110, line: 644, column: 3)
!209 = !DILocalVariable(name: "__stream", scope: !208, file: !110, line: 644, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !212, line: 7, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !214, line: 49, size: 1728, elements: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !231, !233, !234, !235, !239, !240, !242, !243, !246, !248, !251, !254, !255, !256, !257, !258}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !213, file: !214, line: 51, baseType: !111, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !213, file: !214, line: 54, baseType: !145, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !213, file: !214, line: 55, baseType: !145, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !213, file: !214, line: 56, baseType: !145, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !213, file: !214, line: 57, baseType: !145, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !213, file: !214, line: 58, baseType: !145, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !213, file: !214, line: 59, baseType: !145, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !213, file: !214, line: 60, baseType: !145, size: 64, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !213, file: !214, line: 61, baseType: !145, size: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !213, file: !214, line: 64, baseType: !145, size: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !213, file: !214, line: 65, baseType: !145, size: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !213, file: !214, line: 66, baseType: !145, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !213, file: !214, line: 68, baseType: !229, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !214, line: 36, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !213, file: !214, line: 70, baseType: !232, size: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !213, file: !214, line: 72, baseType: !111, size: 32, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !213, file: !214, line: 73, baseType: !111, size: 32, offset: 928)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !213, file: !214, line: 74, baseType: !236, size: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !237, line: 152, baseType: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!238 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !213, file: !214, line: 77, baseType: !147, size: 16, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !213, file: !214, line: 78, baseType: !241, size: 8, offset: 1040)
!241 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !213, file: !214, line: 79, baseType: !78, size: 8, offset: 1048)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !213, file: !214, line: 81, baseType: !244, size: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !214, line: 43, baseType: null)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !213, file: !214, line: 89, baseType: !247, size: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !237, line: 153, baseType: !238)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !213, file: !214, line: 91, baseType: !249, size: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !214, line: 37, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !213, file: !214, line: 92, baseType: !252, size: 64, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !214, line: 38, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !213, file: !214, line: 93, baseType: !232, size: 64, offset: 1344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !213, file: !214, line: 94, baseType: !146, size: 64, offset: 1408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !213, file: !214, line: 95, baseType: !148, size: 64, offset: 1472)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !213, file: !214, line: 96, baseType: !111, size: 32, offset: 1536)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !213, file: !214, line: 98, baseType: !259, size: 160, offset: 1568)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 20)
!262 = !DILocalVariable(name: "__cnt", scope: !208, file: !110, line: 644, type: !148)
!263 = !DILocalVariable(name: "url_program", scope: !188, file: !110, line: 648, type: !151)
!264 = !DILocalVariable(name: "__ptr", scope: !265, file: !110, line: 686, type: !151)
!265 = distinct !DILexicalBlock(scope: !188, file: !110, line: 686, column: 3)
!266 = !DILocalVariable(name: "__stream", scope: !265, file: !110, line: 686, type: !210)
!267 = !DILocalVariable(name: "__cnt", scope: !265, file: !110, line: 686, type: !148)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !110, line: 585, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 5)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !110, line: 586, type: !270, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !110, line: 595, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 4)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !110, line: 620, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 6)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !110, line: 648, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 2)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !110, line: 648, type: !270, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !110, line: 649, type: !277, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !110, line: 649, type: !174, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !110, line: 650, type: !270, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !110, line: 651, type: !282, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !110, line: 651, type: !282, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !110, line: 652, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 7)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !110, line: 653, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 8)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !110, line: 654, type: !83, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !110, line: 655, type: !83, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !110, line: 656, type: !83, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !110, line: 657, type: !83, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !110, line: 663, type: !304, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !110, line: 664, type: !83, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !110, line: 669, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 17)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !110, line: 669, type: !14, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !110, line: 676, type: !164, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !110, line: 676, type: !46, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !110, line: 679, type: !174, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !110, line: 683, type: !270, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !110, line: 688, type: !270, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !110, line: 691, type: !309, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !110, line: 839, type: !169, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !110, line: 840, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 22)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !110, line: 841, type: !164, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !110, line: 862, type: !277, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !110, line: 868, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 71)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !110, line: 875, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 27)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !110, line: 877, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 51)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !110, line: 877, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 12)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 47, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 13)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !347, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 21)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !371, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !157, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !282, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !282, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !371, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !2, line: 55, type: !270, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !309, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !19, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !270, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !309, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "verbose", scope: !95, file: !2, line: 39, type: !179, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !164, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !110, line: 952, type: !371, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 3584, elements: !158)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !415, line: 50, size: 256, elements: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!416 = !{!417, !418, !419, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !414, file: !415, line: 52, baseType: !151, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !414, file: !415, line: 55, baseType: !111, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !414, file: !415, line: 56, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !414, file: !415, line: 57, baseType: !111, size: 32, offset: 192)
!422 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!423 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!424 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !427, line: 110, type: !174, isLocal: true, isDefinition: true)
!427 = !DIFile(filename: "src/relpath.c", directory: "/src", checksumkind: CSK_MD5, checksum: "16c7701de380a03fd2bfbb50611956cf")
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !427, line: 114, type: !277, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !427, line: 119, type: !287, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !427, line: 125, type: !287, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !427, line: 130, type: !174, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !427, line: 130, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 25)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !443, line: 3, type: !164, isLocal: true, isDefinition: true)
!443 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "Version", scope: !446, file: !443, line: 3, type: !151, isLocal: false, isDefinition: true)
!446 = distinct !DICompileUnit(language: DW_LANG_C11, file: !443, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !447, splitDebugInlining: false, nameTableKind: None)
!447 = !{!441, !444}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !450, line: 360, type: !287, isLocal: true, isDefinition: true)
!450 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !450, line: 436, type: !287, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "file_name", scope: !455, file: !456, line: 45, type: !151, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C11, file: !456, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !457, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!457 = !{!458, !460, !462, !464, !453, !466}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !456, line: 121, type: !304, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !456, line: 121, type: !371, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !456, line: 123, type: !304, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !456, line: 126, type: !174, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !455, file: !456, line: 55, type: !179, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !470, file: !471, line: 66, type: !514, isLocal: false, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C11, file: !471, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !472, globals: !473, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!472 = !{!146, !153}
!473 = !{!474, !476, !496, !498, !500, !502, !468, !504, !506, !508, !510, !512}
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !471, line: 272, type: !270, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "old_file_name", scope: !478, file: !471, line: 304, type: !151, isLocal: true, isDefinition: true)
!478 = distinct !DISubprogram(name: "verror_at_line", scope: !471, file: !471, line: 298, type: !479, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !470, retainedNodes: !489)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !111, !111, !151, !99, !151, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !483)
!483 = !{!484, !486, !487, !488}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !482, file: !485, baseType: !99, size: 32)
!485 = !DIFile(filename: "lib/error.c", directory: "/src")
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !482, file: !485, baseType: !99, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !482, file: !485, baseType: !146, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !482, file: !485, baseType: !146, size: 64, offset: 128)
!489 = !{!490, !491, !492, !493, !494, !495}
!490 = !DILocalVariable(name: "status", arg: 1, scope: !478, file: !471, line: 298, type: !111)
!491 = !DILocalVariable(name: "errnum", arg: 2, scope: !478, file: !471, line: 298, type: !111)
!492 = !DILocalVariable(name: "file_name", arg: 3, scope: !478, file: !471, line: 298, type: !151)
!493 = !DILocalVariable(name: "line_number", arg: 4, scope: !478, file: !471, line: 298, type: !99)
!494 = !DILocalVariable(name: "message", arg: 5, scope: !478, file: !471, line: 298, type: !151)
!495 = !DILocalVariable(name: "args", arg: 6, scope: !478, file: !471, line: 298, type: !481)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "old_line_number", scope: !478, file: !471, line: 305, type: !99, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !471, line: 338, type: !277, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !471, line: 346, type: !309, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !471, line: 346, type: !287, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "error_message_count", scope: !470, file: !471, line: 69, type: !99, isLocal: false, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !470, file: !471, line: 295, type: !111, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !471, line: 208, type: !304, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !471, line: 208, type: !383, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !471, line: 214, type: !270, isLocal: true, isDefinition: true)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{null}
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !519, line: 226, type: !88, isLocal: true, isDefinition: true)
!519 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !519, line: 227, type: !88, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !519, line: 228, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 33)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !519, line: 231, type: !88, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "default_tuning", scope: !531, file: !519, line: 134, type: !535, isLocal: true, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C11, file: !519, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !532, globals: !534, splitDebugInlining: false, nameTableKind: None)
!532 = !{!150, !146, !533, !148}
!533 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!534 = !{!517, !520, !522, !527, !529}
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !537, line: 52, baseType: !538)
!537 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !537, line: 40, size: 160, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !538, file: !537, line: 45, baseType: !533, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !538, file: !537, line: 46, baseType: !533, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !538, file: !537, line: 47, baseType: !533, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !538, file: !537, line: 48, baseType: !533, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !538, file: !537, line: 49, baseType: !179, size: 8, offset: 128)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "program_name", scope: !547, file: !548, line: 31, type: !151, isLocal: false, isDefinition: true)
!547 = distinct !DICompileUnit(language: DW_LANG_C11, file: !548, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !549, globals: !550, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!549 = !{!145}
!550 = !{!545, !551, !553}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !548, line: 46, type: !309, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !548, line: 49, type: !277, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "utf07FF", scope: !557, file: !558, line: 46, type: !585, isLocal: true, isDefinition: true)
!557 = distinct !DISubprogram(name: "proper_name_lite", scope: !558, file: !558, line: 38, type: !559, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !561, retainedNodes: !563)
!558 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!559 = !DISubroutineType(types: !560)
!560 = !{!151, !151, !151}
!561 = distinct !DICompileUnit(language: DW_LANG_C11, file: !558, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !562, splitDebugInlining: false, nameTableKind: None)
!562 = !{!555}
!563 = !{!564, !565, !566, !567, !572}
!564 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !557, file: !558, line: 38, type: !151)
!565 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !557, file: !558, line: 38, type: !151)
!566 = !DILocalVariable(name: "translation", scope: !557, file: !558, line: 40, type: !151)
!567 = !DILocalVariable(name: "w", scope: !557, file: !558, line: 47, type: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !569, line: 37, baseType: !570)
!569 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !237, line: 57, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !237, line: 42, baseType: !99)
!572 = !DILocalVariable(name: "mbs", scope: !557, file: !558, line: 48, type: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !574, line: 6, baseType: !575)
!574 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !576, line: 21, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !576, line: 13, size: 64, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !577, file: !576, line: 15, baseType: !111, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !577, file: !576, line: 20, baseType: !581, size: 32, offset: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !576, line: 16, size: 32, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !581, file: !576, line: 18, baseType: !99, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !581, file: !576, line: 19, baseType: !277, size: 32)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16, elements: !288)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !588, line: 78, type: !309, isLocal: true, isDefinition: true)
!588 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !588, line: 79, type: !282, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !588, line: 80, type: !376, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !588, line: 81, type: !376, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !588, line: 82, type: !259, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !588, line: 83, type: !287, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !588, line: 84, type: !309, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !588, line: 85, type: !304, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !588, line: 86, type: !304, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !588, line: 87, type: !309, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !609, file: !588, line: 76, type: !681, isLocal: false, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C11, file: !588, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !610, retainedTypes: !616, globals: !617, splitDebugInlining: false, nameTableKind: None)
!610 = !{!115, !611, !129}
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !116, line: 254, baseType: !99, size: 32, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!614 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!615 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!616 = !{!111, !147, !148}
!617 = !{!586, !589, !591, !593, !595, !597, !599, !601, !603, !605, !607, !618, !622, !632, !634, !639, !641, !643, !645, !647, !670, !677, !679}
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !609, file: !588, line: 92, type: !620, isLocal: false, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 320, elements: !84)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !609, file: !588, line: 1040, type: !624, isLocal: false, isDefinition: true)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !588, line: 56, size: 448, elements: !625)
!625 = !{!626, !627, !628, !630, !631}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !624, file: !588, line: 59, baseType: !115, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !624, file: !588, line: 62, baseType: !111, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !624, file: !588, line: 66, baseType: !629, size: 256, offset: 64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !310)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !624, file: !588, line: 69, baseType: !151, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !624, file: !588, line: 72, baseType: !151, size: 64, offset: 384)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !609, file: !588, line: 107, type: !624, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "slot0", scope: !609, file: !588, line: 831, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 256)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !588, line: 321, type: !287, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !588, line: 357, type: !287, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !588, line: 358, type: !287, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !588, line: 199, type: !304, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "quote", scope: !649, file: !588, line: 228, type: !668, isLocal: true, isDefinition: true)
!649 = distinct !DISubprogram(name: "gettext_quote", scope: !588, file: !588, line: 197, type: !650, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !609, retainedNodes: !652)
!650 = !DISubroutineType(types: !651)
!651 = !{!151, !151, !115}
!652 = !{!653, !654, !655, !656, !657}
!653 = !DILocalVariable(name: "msgid", arg: 1, scope: !649, file: !588, line: 197, type: !151)
!654 = !DILocalVariable(name: "s", arg: 2, scope: !649, file: !588, line: 197, type: !115)
!655 = !DILocalVariable(name: "translation", scope: !649, file: !588, line: 199, type: !151)
!656 = !DILocalVariable(name: "w", scope: !649, file: !588, line: 229, type: !568)
!657 = !DILocalVariable(name: "mbs", scope: !649, file: !588, line: 230, type: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !574, line: 6, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !576, line: 21, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !576, line: 13, size: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !660, file: !576, line: 15, baseType: !111, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !660, file: !576, line: 20, baseType: !664, size: 32, offset: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !576, line: 16, size: 32, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !664, file: !576, line: 18, baseType: !99, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !664, file: !576, line: 19, baseType: !277, size: 32)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !669)
!669 = !{!289, !279}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "slotvec", scope: !609, file: !588, line: 834, type: !672, isLocal: true, isDefinition: true)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !588, line: 823, size: 128, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !673, file: !588, line: 825, baseType: !148, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !673, file: !588, line: 826, baseType: !145, size: 64, offset: 64)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "nslots", scope: !609, file: !588, line: 832, type: !111, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "slotvec0", scope: !609, file: !588, line: 833, type: !673, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 704, elements: !683)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!683 = !{!684}
!684 = !DISubrange(count: 11)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !687, line: 67, type: !371, isLocal: true, isDefinition: true)
!687 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !687, line: 69, type: !304, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !687, line: 83, type: !304, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !687, line: 83, type: !277, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !687, line: 85, type: !287, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !687, line: 88, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 171)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !687, line: 88, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 34)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !687, line: 105, type: !169, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !687, line: 109, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 23)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !687, line: 113, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 28)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !687, line: 120, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 32)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !687, line: 127, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 36)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !687, line: 134, type: !14, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !687, line: 142, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 44)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !687, line: 150, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 48)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !687, line: 159, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 52)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !687, line: 170, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 60)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !687, line: 248, type: !259, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !687, line: 248, type: !347, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !687, line: 254, type: !259, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !687, line: 254, type: !157, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !687, line: 254, type: !14, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !687, line: 259, type: !3, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !687, line: 259, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 29)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !769, file: !770, line: 26, type: !772, isLocal: false, isDefinition: true)
!769 = distinct !DICompileUnit(language: DW_LANG_C11, file: !770, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !771, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!771 = !{!767}
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 376, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 47)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "exit_failure", scope: !777, file: !778, line: 24, type: !780, isLocal: false, isDefinition: true)
!777 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !779, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!779 = !{!775}
!780 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !783, line: 34, type: !174, isLocal: true, isDefinition: true)
!783 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !783, line: 34, type: !304, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !783, line: 34, type: !326, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !790, line: 108, type: !78, isLocal: true, isDefinition: true)
!790 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "internal_state", scope: !793, file: !790, line: 97, type: !796, isLocal: true, isDefinition: true)
!793 = distinct !DICompileUnit(language: DW_LANG_C11, file: !790, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !794, globals: !795, splitDebugInlining: false, nameTableKind: None)
!794 = !{!146, !148, !153}
!795 = !{!788, !791}
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !574, line: 6, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !576, line: 21, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !576, line: 13, size: 64, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !798, file: !576, line: 15, baseType: !111, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !798, file: !576, line: 20, baseType: !802, size: 32, offset: 32)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !798, file: !576, line: 16, size: 32, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !802, file: !576, line: 18, baseType: !99, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !802, file: !576, line: 19, baseType: !277, size: 32)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !808, line: 35, type: !282, isLocal: true, isDefinition: true)
!808 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !427, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !810, splitDebugInlining: false, nameTableKind: None)
!810 = !{!425, !428, !430, !432, !434, !436}
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !450, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !812, retainedTypes: !813, globals: !814, splitDebugInlining: false, nameTableKind: None)
!812 = !{!97}
!813 = !{!146}
!814 = !{!448, !451, !815}
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "dir_suffix", scope: !811, file: !450, line: 110, type: !585, isLocal: true, isDefinition: true)
!817 = distinct !DICompileUnit(language: DW_LANG_C11, file: !818, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !819, splitDebugInlining: false, nameTableKind: None)
!818 = !DIFile(filename: "lib/file-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3d320575da71636c49afc307306f1ac8")
!819 = !{!146, !145}
!820 = distinct !DICompileUnit(language: DW_LANG_C11, file: !821, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!822 = distinct !DICompileUnit(language: DW_LANG_C11, file: !823, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!824 = distinct !DICompileUnit(language: DW_LANG_C11, file: !825, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !813, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "lib/malloc/scratch_buffer_grow.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fba9c701dee3b47e5d1bcebea676b381")
!826 = distinct !DICompileUnit(language: DW_LANG_C11, file: !827, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !813, splitDebugInlining: false, nameTableKind: None)
!827 = !DIFile(filename: "lib/malloc/scratch_buffer_grow_preserve.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d5c2d2ce24447f49ca86e9062884c18e")
!828 = distinct !DICompileUnit(language: DW_LANG_C11, file: !829, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "lib/hashcode-named-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b790eeaa7481543bca54c360cbd0d96")
!830 = distinct !DICompileUnit(language: DW_LANG_C11, file: !831, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!831 = !DIFile(filename: "lib/hashcode-string2.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bb7d3d21b3889da1083126079aac0c8f")
!832 = distinct !DICompileUnit(language: DW_LANG_C11, file: !833, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!833 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!834 = distinct !DICompileUnit(language: DW_LANG_C11, file: !687, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !835, retainedTypes: !813, globals: !839, splitDebugInlining: false, nameTableKind: None)
!835 = !{!836}
!836 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !687, line: 40, baseType: !99, size: 32, elements: !837)
!837 = !{!838}
!838 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!839 = !{!685, !688, !690, !692, !694, !696, !701, !706, !708, !713, !718, !723, !728, !730, !735, !740, !745, !750, !752, !754, !756, !758, !760, !762}
!840 = distinct !DICompileUnit(language: DW_LANG_C11, file: !841, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !873, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!842 = !{!843, !855}
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !844, file: !841, line: 188, baseType: !99, size: 32, elements: !853)
!844 = distinct !DISubprogram(name: "x2nrealloc", scope: !841, file: !841, line: 176, type: !845, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !840, retainedNodes: !848)
!845 = !DISubroutineType(types: !846)
!846 = !{!146, !146, !847, !148}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!848 = !{!849, !850, !851, !852}
!849 = !DILocalVariable(name: "p", arg: 1, scope: !844, file: !841, line: 176, type: !146)
!850 = !DILocalVariable(name: "pn", arg: 2, scope: !844, file: !841, line: 176, type: !847)
!851 = !DILocalVariable(name: "s", arg: 3, scope: !844, file: !841, line: 176, type: !148)
!852 = !DILocalVariable(name: "n", scope: !844, file: !841, line: 178, type: !148)
!853 = !{!854}
!854 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !856, file: !841, line: 228, baseType: !99, size: 32, elements: !853)
!856 = distinct !DISubprogram(name: "xpalloc", scope: !841, file: !841, line: 223, type: !857, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !840, retainedNodes: !863)
!857 = !DISubroutineType(types: !858)
!858 = !{!146, !146, !859, !860, !862, !860}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !861, line: 130, baseType: !862)
!861 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !149, line: 35, baseType: !238)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872}
!864 = !DILocalVariable(name: "pa", arg: 1, scope: !856, file: !841, line: 223, type: !146)
!865 = !DILocalVariable(name: "pn", arg: 2, scope: !856, file: !841, line: 223, type: !859)
!866 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !856, file: !841, line: 223, type: !860)
!867 = !DILocalVariable(name: "n_max", arg: 4, scope: !856, file: !841, line: 223, type: !862)
!868 = !DILocalVariable(name: "s", arg: 5, scope: !856, file: !841, line: 223, type: !860)
!869 = !DILocalVariable(name: "n0", scope: !856, file: !841, line: 230, type: !860)
!870 = !DILocalVariable(name: "n", scope: !856, file: !841, line: 237, type: !860)
!871 = !DILocalVariable(name: "nbytes", scope: !856, file: !841, line: 248, type: !860)
!872 = !DILocalVariable(name: "adjusted_nbytes", scope: !856, file: !841, line: 252, type: !860)
!873 = !{!145, !146, !179, !238, !150}
!874 = distinct !DICompileUnit(language: DW_LANG_C11, file: !783, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !875, splitDebugInlining: false, nameTableKind: None)
!875 = !{!781, !784, !786}
!876 = distinct !DICompileUnit(language: DW_LANG_C11, file: !877, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!878 = distinct !DICompileUnit(language: DW_LANG_C11, file: !879, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!880 = distinct !DICompileUnit(language: DW_LANG_C11, file: !881, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !813, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!882 = distinct !DICompileUnit(language: DW_LANG_C11, file: !883, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !813, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!884 = distinct !DICompileUnit(language: DW_LANG_C11, file: !885, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !886, splitDebugInlining: false, nameTableKind: None)
!885 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!886 = !{!179, !150, !146}
!887 = distinct !DICompileUnit(language: DW_LANG_C11, file: !808, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !888, splitDebugInlining: false, nameTableKind: None)
!888 = !{!889, !806}
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !808, line: 35, type: !287, isLocal: true, isDefinition: true)
!891 = distinct !DICompileUnit(language: DW_LANG_C11, file: !892, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!893 = distinct !DICompileUnit(language: DW_LANG_C11, file: !894, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !813, splitDebugInlining: false, nameTableKind: None)
!894 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!895 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!896 = !{i32 7, !"Dwarf Version", i32 5}
!897 = !{i32 2, !"Debug Info Version", i32 3}
!898 = !{i32 1, !"wchar_size", i32 4}
!899 = !{i32 8, !"PIC Level", i32 2}
!900 = !{i32 7, !"PIE Level", i32 2}
!901 = !{i32 7, !"uwtable", i32 2}
!902 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 64, type: !903, scopeLine: 65, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !111}
!905 = !{!906}
!906 = !DILocalVariable(name: "status", arg: 1, scope: !902, file: !2, line: 64, type: !111)
!907 = !DILocation(line: 0, scope: !902)
!908 = !DILocation(line: 66, column: 14, scope: !909)
!909 = distinct !DILexicalBlock(scope: !902, file: !2, line: 66, column: 7)
!910 = !DILocation(line: 66, column: 7, scope: !902)
!911 = !DILocation(line: 67, column: 5, scope: !912)
!912 = distinct !DILexicalBlock(scope: !909, file: !2, line: 67, column: 5)
!913 = !{!914, !914, i64 0}
!914 = !{!"any pointer", !915, i64 0}
!915 = !{!"omnipotent char", !916, i64 0}
!916 = !{!"Simple C/C++ TBAA"}
!917 = !DILocation(line: 70, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !909, file: !2, line: 69, column: 5)
!919 = !DILocation(line: 71, column: 7, scope: !918)
!920 = !DILocation(line: 74, column: 7, scope: !918)
!921 = !DILocation(line: 78, column: 7, scope: !918)
!922 = !DILocation(line: 81, column: 7, scope: !918)
!923 = !DILocation(line: 85, column: 7, scope: !918)
!924 = !DILocation(line: 88, column: 7, scope: !918)
!925 = !DILocation(line: 91, column: 7, scope: !918)
!926 = !DILocation(line: 94, column: 7, scope: !918)
!927 = !DILocation(line: 97, column: 7, scope: !918)
!928 = !DILocation(line: 100, column: 7, scope: !918)
!929 = !DILocation(line: 103, column: 7, scope: !918)
!930 = !DILocation(line: 106, column: 7, scope: !918)
!931 = !DILocation(line: 107, column: 7, scope: !918)
!932 = !DILocalVariable(name: "program", arg: 1, scope: !933, file: !110, line: 836, type: !151)
!933 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !110, file: !110, line: 836, type: !934, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !151}
!936 = !{!932, !937, !944, !945, !947, !948}
!937 = !DILocalVariable(name: "infomap", scope: !933, file: !110, line: 838, type: !938)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 896, elements: !305)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !933, file: !110, line: 838, size: 128, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !940, file: !110, line: 838, baseType: !151, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !940, file: !110, line: 838, baseType: !151, size: 64, offset: 64)
!944 = !DILocalVariable(name: "node", scope: !933, file: !110, line: 848, type: !151)
!945 = !DILocalVariable(name: "map_prog", scope: !933, file: !110, line: 849, type: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!947 = !DILocalVariable(name: "lc_messages", scope: !933, file: !110, line: 861, type: !151)
!948 = !DILocalVariable(name: "url_program", scope: !933, file: !110, line: 874, type: !151)
!949 = !DILocation(line: 0, scope: !933, inlinedAt: !950)
!950 = distinct !DILocation(line: 108, column: 7, scope: !918)
!951 = !DILocation(line: 857, column: 3, scope: !933, inlinedAt: !950)
!952 = !DILocation(line: 861, column: 29, scope: !933, inlinedAt: !950)
!953 = !DILocation(line: 862, column: 7, scope: !954, inlinedAt: !950)
!954 = distinct !DILexicalBlock(scope: !933, file: !110, line: 862, column: 7)
!955 = !DILocation(line: 862, column: 19, scope: !954, inlinedAt: !950)
!956 = !DILocation(line: 862, column: 22, scope: !954, inlinedAt: !950)
!957 = !DILocation(line: 862, column: 7, scope: !933, inlinedAt: !950)
!958 = !DILocation(line: 868, column: 7, scope: !959, inlinedAt: !950)
!959 = distinct !DILexicalBlock(scope: !954, file: !110, line: 863, column: 5)
!960 = !DILocation(line: 870, column: 5, scope: !959, inlinedAt: !950)
!961 = !DILocation(line: 875, column: 3, scope: !933, inlinedAt: !950)
!962 = !DILocation(line: 877, column: 3, scope: !933, inlinedAt: !950)
!963 = !DILocation(line: 110, column: 3, scope: !902)
!964 = !DISubprogram(name: "dcgettext", scope: !965, file: !965, line: 51, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!965 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!966 = !DISubroutineType(types: !967)
!967 = !{!145, !151, !151, !111}
!968 = !{}
!969 = !DISubprogram(name: "__fprintf_chk", scope: !970, file: !970, line: 93, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!970 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!971 = !DISubroutineType(types: !972)
!972 = !{!111, !973, !111, !974, null}
!973 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !210)
!974 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!975 = !DISubprogram(name: "__printf_chk", scope: !970, file: !970, line: 95, type: !976, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!976 = !DISubroutineType(types: !977)
!977 = !{!111, !111, !974, null}
!978 = !DISubprogram(name: "fputs_unlocked", scope: !979, file: !979, line: 691, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!979 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!980 = !DISubroutineType(types: !981)
!981 = !{!111, !974, !973}
!982 = !DILocation(line: 0, scope: !188)
!983 = !DILocation(line: 581, column: 7, scope: !196)
!984 = !{!985, !985, i64 0}
!985 = !{!"int", !915, i64 0}
!986 = !DILocation(line: 581, column: 19, scope: !196)
!987 = !DILocation(line: 581, column: 7, scope: !188)
!988 = !DILocation(line: 585, column: 26, scope: !195)
!989 = !DILocation(line: 0, scope: !195)
!990 = !DILocation(line: 586, column: 23, scope: !195)
!991 = !DILocation(line: 586, column: 28, scope: !195)
!992 = !DILocation(line: 586, column: 32, scope: !195)
!993 = !{!915, !915, i64 0}
!994 = !DILocation(line: 586, column: 38, scope: !195)
!995 = !DILocalVariable(name: "__s1", arg: 1, scope: !996, file: !997, line: 1359, type: !151)
!996 = distinct !DISubprogram(name: "streq", scope: !997, file: !997, line: 1359, type: !998, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1000)
!997 = !DIFile(filename: "./lib/string.h", directory: "/src")
!998 = !DISubroutineType(types: !999)
!999 = !{!179, !151, !151}
!1000 = !{!995, !1001}
!1001 = !DILocalVariable(name: "__s2", arg: 2, scope: !996, file: !997, line: 1359, type: !151)
!1002 = !DILocation(line: 0, scope: !996, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 586, column: 41, scope: !195)
!1004 = !DILocation(line: 1361, column: 11, scope: !996, inlinedAt: !1003)
!1005 = !DILocation(line: 1361, column: 10, scope: !996, inlinedAt: !1003)
!1006 = !DILocation(line: 586, column: 19, scope: !195)
!1007 = !DILocation(line: 587, column: 5, scope: !195)
!1008 = !DILocation(line: 588, column: 7, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !188, file: !110, line: 588, column: 7)
!1010 = !DILocation(line: 588, column: 7, scope: !188)
!1011 = !DILocation(line: 590, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1009, file: !110, line: 589, column: 5)
!1013 = !DILocation(line: 591, column: 7, scope: !1012)
!1014 = !DILocation(line: 595, column: 37, scope: !188)
!1015 = !DILocation(line: 595, column: 35, scope: !188)
!1016 = !DILocation(line: 596, column: 29, scope: !188)
!1017 = !DILocation(line: 597, column: 8, scope: !203)
!1018 = !DILocation(line: 597, column: 7, scope: !188)
!1019 = !DILocation(line: 604, column: 24, scope: !202)
!1020 = !DILocation(line: 604, column: 12, scope: !203)
!1021 = !DILocation(line: 0, scope: !201)
!1022 = !DILocation(line: 610, column: 16, scope: !201)
!1023 = !DILocation(line: 610, column: 7, scope: !201)
!1024 = !DILocation(line: 611, column: 21, scope: !201)
!1025 = !{!1026, !1026, i64 0}
!1026 = !{!"short", !915, i64 0}
!1027 = !DILocation(line: 611, column: 19, scope: !201)
!1028 = !DILocation(line: 611, column: 16, scope: !201)
!1029 = !DILocation(line: 610, column: 30, scope: !201)
!1030 = distinct !{!1030, !1023, !1024, !1031}
!1031 = !{!"llvm.loop.mustprogress"}
!1032 = !DILocation(line: 612, column: 18, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !201, file: !110, line: 612, column: 11)
!1034 = !DILocation(line: 612, column: 11, scope: !201)
!1035 = !DILocation(line: 618, column: 5, scope: !201)
!1036 = !DILocation(line: 620, column: 23, scope: !188)
!1037 = !DILocation(line: 625, column: 39, scope: !188)
!1038 = !DILocation(line: 626, column: 3, scope: !188)
!1039 = !DILocation(line: 626, column: 10, scope: !188)
!1040 = !DILocation(line: 626, column: 21, scope: !188)
!1041 = !DILocation(line: 628, column: 44, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !110, line: 628, column: 11)
!1043 = distinct !DILexicalBlock(scope: !188, file: !110, line: 627, column: 5)
!1044 = !DILocation(line: 628, column: 32, scope: !1042)
!1045 = !DILocation(line: 628, column: 49, scope: !1042)
!1046 = !DILocation(line: 628, column: 11, scope: !1043)
!1047 = !DILocation(line: 630, column: 11, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1043, file: !110, line: 630, column: 11)
!1049 = !DILocation(line: 630, column: 11, scope: !1043)
!1050 = !DILocation(line: 632, column: 26, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !110, line: 632, column: 15)
!1052 = distinct !DILexicalBlock(scope: !1048, file: !110, line: 631, column: 9)
!1053 = !DILocation(line: 632, column: 34, scope: !1051)
!1054 = !DILocation(line: 632, column: 37, scope: !1051)
!1055 = !DILocation(line: 632, column: 15, scope: !1052)
!1056 = !DILocation(line: 636, column: 16, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1052, file: !110, line: 636, column: 15)
!1058 = !DILocation(line: 636, column: 29, scope: !1057)
!1059 = !DILocation(line: 640, column: 16, scope: !1043)
!1060 = distinct !{!1060, !1038, !1061, !1031}
!1061 = !DILocation(line: 641, column: 5, scope: !188)
!1062 = !DILocation(line: 644, column: 3, scope: !188)
!1063 = !DILocation(line: 0, scope: !996, inlinedAt: !1064)
!1064 = distinct !DILocation(line: 648, column: 31, scope: !188)
!1065 = !DILocation(line: 0, scope: !996, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 649, column: 31, scope: !188)
!1067 = !DILocation(line: 0, scope: !996, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 650, column: 31, scope: !188)
!1069 = !DILocation(line: 0, scope: !996, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 651, column: 31, scope: !188)
!1071 = !DILocation(line: 0, scope: !996, inlinedAt: !1072)
!1072 = distinct !DILocation(line: 652, column: 31, scope: !188)
!1073 = !DILocation(line: 0, scope: !996, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 653, column: 31, scope: !188)
!1075 = !DILocation(line: 0, scope: !996, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 654, column: 31, scope: !188)
!1077 = !DILocation(line: 0, scope: !996, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 655, column: 31, scope: !188)
!1079 = !DILocation(line: 0, scope: !996, inlinedAt: !1080)
!1080 = distinct !DILocation(line: 656, column: 31, scope: !188)
!1081 = !DILocation(line: 0, scope: !996, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 657, column: 31, scope: !188)
!1083 = !DILocation(line: 663, column: 7, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !188, file: !110, line: 663, column: 7)
!1085 = !DILocation(line: 664, column: 7, scope: !1084)
!1086 = !DILocation(line: 664, column: 10, scope: !1084)
!1087 = !DILocation(line: 663, column: 7, scope: !188)
!1088 = !DILocation(line: 669, column: 7, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1084, file: !110, line: 665, column: 5)
!1090 = !DILocation(line: 671, column: 5, scope: !1089)
!1091 = !DILocation(line: 676, column: 7, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1084, file: !110, line: 673, column: 5)
!1093 = !DILocation(line: 679, column: 3, scope: !188)
!1094 = !DILocation(line: 683, column: 3, scope: !188)
!1095 = !DILocation(line: 686, column: 3, scope: !188)
!1096 = !DILocation(line: 688, column: 3, scope: !188)
!1097 = !DILocation(line: 691, column: 3, scope: !188)
!1098 = !DILocation(line: 695, column: 3, scope: !188)
!1099 = !DILocation(line: 696, column: 1, scope: !188)
!1100 = !DISubprogram(name: "setlocale", scope: !1101, file: !1101, line: 122, type: !1102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1101 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!145, !111, !151}
!1104 = !DISubprogram(name: "strncmp", scope: !1105, file: !1105, line: 159, type: !1106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1105 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!111, !151, !151, !148}
!1108 = !DISubprogram(name: "exit", scope: !1109, file: !1109, line: 624, type: !903, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1109 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1110 = !DISubprogram(name: "getenv", scope: !1109, file: !1109, line: 641, type: !1111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!145, !151}
!1113 = !DISubprogram(name: "strcmp", scope: !1105, file: !1105, line: 156, type: !1114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!111, !151, !151}
!1116 = !DISubprogram(name: "strspn", scope: !1105, file: !1105, line: 297, type: !1117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!150, !151, !151}
!1119 = !DISubprogram(name: "strchr", scope: !1105, file: !1105, line: 246, type: !1120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!145, !151, !111}
!1122 = !DISubprogram(name: "__ctype_b_loc", scope: !130, file: !130, line: 79, type: !1123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!1128 = !DISubprogram(name: "strcspn", scope: !1105, file: !1105, line: 293, type: !1117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1129 = !DISubprogram(name: "fwrite_unlocked", scope: !979, file: !979, line: 704, type: !1130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !968)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!148, !1132, !148, !148, !973}
!1132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1135 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 194, type: !1136, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1139)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!111, !111, !1138}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1148, !1149}
!1140 = !DILocalVariable(name: "argc", arg: 1, scope: !1135, file: !2, line: 194, type: !111)
!1141 = !DILocalVariable(name: "argv", arg: 2, scope: !1135, file: !2, line: 194, type: !1138)
!1142 = !DILocalVariable(name: "ok", scope: !1135, file: !2, line: 196, type: !179)
!1143 = !DILocalVariable(name: "can_mode", scope: !1135, file: !2, line: 197, type: !111)
!1144 = !DILocalVariable(name: "relative_to", scope: !1135, file: !2, line: 198, type: !151)
!1145 = !DILocalVariable(name: "relative_base", scope: !1135, file: !2, line: 199, type: !151)
!1146 = !DILocalVariable(name: "c", scope: !1147, file: !2, line: 211, type: !111)
!1147 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 210, column: 5)
!1148 = !DILocalVariable(name: "need_dir", scope: !1135, file: !2, line: 268, type: !179)
!1149 = !DILocalVariable(name: "base", scope: !1150, file: !2, line: 281, type: !145)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !2, line: 280, column: 5)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !2, line: 279, column: 12)
!1152 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 277, column: 7)
!1153 = !DILocation(line: 0, scope: !1135)
!1154 = !DILocation(line: 202, column: 21, scope: !1135)
!1155 = !DILocation(line: 202, column: 3, scope: !1135)
!1156 = !DILocation(line: 203, column: 3, scope: !1135)
!1157 = !DILocation(line: 204, column: 3, scope: !1135)
!1158 = !DILocation(line: 205, column: 3, scope: !1135)
!1159 = !DILocation(line: 207, column: 3, scope: !1135)
!1160 = !DILocation(line: 209, column: 3, scope: !1135)
!1161 = !DILocation(line: 198, column: 15, scope: !1135)
!1162 = !DILocation(line: 199, column: 15, scope: !1135)
!1163 = !DILocation(line: 197, column: 7, scope: !1135)
!1164 = !DILocation(line: 211, column: 15, scope: !1147)
!1165 = !DILocation(line: 0, scope: !1147)
!1166 = !DILocation(line: 212, column: 11, scope: !1147)
!1167 = !DILocation(line: 217, column: 20, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 215, column: 9)
!1169 = !DILocation(line: 218, column: 20, scope: !1168)
!1170 = !DILocation(line: 219, column: 11, scope: !1168)
!1171 = !DILocation(line: 221, column: 20, scope: !1168)
!1172 = !DILocation(line: 223, column: 11, scope: !1168)
!1173 = !DILocation(line: 225, column: 20, scope: !1168)
!1174 = !DILocation(line: 226, column: 20, scope: !1168)
!1175 = !DILocation(line: 227, column: 11, scope: !1168)
!1176 = !DILocation(line: 229, column: 20, scope: !1168)
!1177 = !DILocation(line: 230, column: 19, scope: !1168)
!1178 = !DILocation(line: 231, column: 11, scope: !1168)
!1179 = !DILocation(line: 233, column: 20, scope: !1168)
!1180 = !DILocation(line: 234, column: 19, scope: !1168)
!1181 = !DILocation(line: 235, column: 11, scope: !1168)
!1182 = !DILocation(line: 237, column: 20, scope: !1168)
!1183 = !DILocation(line: 238, column: 19, scope: !1168)
!1184 = !DILocation(line: 239, column: 11, scope: !1168)
!1185 = !DILocation(line: 241, column: 19, scope: !1168)
!1186 = !DILocation(line: 242, column: 11, scope: !1168)
!1187 = !DILocation(line: 244, column: 20, scope: !1168)
!1188 = !DILocation(line: 245, column: 11, scope: !1168)
!1189 = !DILocation(line: 247, column: 25, scope: !1168)
!1190 = !DILocation(line: 248, column: 11, scope: !1168)
!1191 = !DILocation(line: 250, column: 27, scope: !1168)
!1192 = !DILocation(line: 251, column: 11, scope: !1168)
!1193 = !DILocation(line: 252, column: 9, scope: !1168)
!1194 = !DILocation(line: 253, column: 9, scope: !1168)
!1195 = !DILocation(line: 255, column: 11, scope: !1168)
!1196 = !DILocation(line: 259, column: 7, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 259, column: 7)
!1198 = !DILocation(line: 259, column: 14, scope: !1197)
!1199 = !DILocation(line: 259, column: 7, scope: !1135)
!1200 = !DILocation(line: 261, column: 7, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !2, line: 260, column: 5)
!1202 = !DILocation(line: 262, column: 7, scope: !1201)
!1203 = !DILocation(line: 265, column: 7, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 265, column: 7)
!1205 = !DILocation(line: 265, column: 21, scope: !1204)
!1206 = !DILocation(line: 268, column: 29, scope: !1135)
!1207 = !DILocation(line: 268, column: 46, scope: !1135)
!1208 = !DILocation(line: 269, column: 7, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 269, column: 7)
!1210 = !DILocation(line: 269, column: 7, scope: !1135)
!1211 = !DILocalVariable(name: "fname", arg: 1, scope: !1212, file: !2, line: 116, type: !151)
!1212 = distinct !DISubprogram(name: "realpath_canon", scope: !2, file: !2, line: 116, type: !1120, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1213)
!1213 = !{!1211, !1214, !1215, !1216}
!1214 = !DILocalVariable(name: "can_mode", arg: 2, scope: !1212, file: !2, line: 116, type: !111)
!1215 = !DILocalVariable(name: "can_fname", scope: !1212, file: !2, line: 118, type: !145)
!1216 = !DILocalVariable(name: "can_fname2", scope: !1217, file: !2, line: 122, type: !145)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !2, line: 120, column: 5)
!1218 = distinct !DILexicalBlock(scope: !1212, file: !2, line: 119, column: 7)
!1219 = !DILocation(line: 0, scope: !1212, inlinedAt: !1220)
!1220 = distinct !DILocation(line: 271, column: 25, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1209, file: !2, line: 270, column: 5)
!1222 = !DILocation(line: 118, column: 21, scope: !1212, inlinedAt: !1220)
!1223 = !DILocation(line: 119, column: 7, scope: !1218, inlinedAt: !1220)
!1224 = !DILocation(line: 119, column: 15, scope: !1218, inlinedAt: !1220)
!1225 = !DILocation(line: 121, column: 16, scope: !1217, inlinedAt: !1220)
!1226 = !DILocation(line: 122, column: 26, scope: !1217, inlinedAt: !1220)
!1227 = !DILocation(line: 0, scope: !1217, inlinedAt: !1220)
!1228 = !DILocation(line: 123, column: 7, scope: !1217, inlinedAt: !1220)
!1229 = !DILocation(line: 271, column: 23, scope: !1221)
!1230 = !DILocation(line: 272, column: 12, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 272, column: 11)
!1232 = !DILocation(line: 272, column: 11, scope: !1221)
!1233 = !DILocation(line: 273, column: 9, scope: !1231)
!1234 = !DILocation(line: 274, column: 20, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 274, column: 11)
!1236 = !DILocalVariable(name: "path", arg: 1, scope: !1237, file: !2, line: 159, type: !151)
!1237 = distinct !DISubprogram(name: "isdir", scope: !2, file: !2, line: 159, type: !1238, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1240)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!179, !151}
!1240 = !{!1236, !1241}
!1241 = !DILocalVariable(name: "sb", scope: !1237, file: !2, line: 161, type: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1243, line: 26, size: 1152, elements: !1244)
!1243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1244 = !{!1245, !1247, !1249, !1251, !1253, !1255, !1257, !1258, !1259, !1260, !1262, !1264, !1272, !1273, !1274}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1242, file: !1243, line: 31, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !237, line: 145, baseType: !150)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1242, file: !1243, line: 36, baseType: !1248, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !237, line: 148, baseType: !150)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1242, file: !1243, line: 44, baseType: !1250, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !237, line: 151, baseType: !150)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1242, file: !1243, line: 45, baseType: !1252, size: 32, offset: 192)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !237, line: 150, baseType: !99)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1242, file: !1243, line: 47, baseType: !1254, size: 32, offset: 224)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !237, line: 146, baseType: !99)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1242, file: !1243, line: 48, baseType: !1256, size: 32, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !237, line: 147, baseType: !99)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1242, file: !1243, line: 50, baseType: !111, size: 32, offset: 288)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1242, file: !1243, line: 52, baseType: !1246, size: 64, offset: 320)
