; ModuleID = 'src/rmdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [48 x i8] c"Remove the DIRECTORY(ies), if they are empty.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"rmdir\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [95 x i8] c"      --ignore-fail-on-non-empty\0A         ignore each failure to remove a non-empty directory\0A\00", align 1, !dbg !22

!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !126, !131, !136, !138, !143, !145, !150, !153, !155, !157, !236, !241, !243, !248, !250, !255, !257, !259, !261, !263, !265, !267, !272, !277, !279, !281, !283, !285, !287, !289, !294, !299, !304, !309, !311, !313, !315, !317, !319, !324, !326, !328, !333, !338, !343, !348, !353, !355, !357, !359, !361, !67, !363}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 14)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 16)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !133, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 242, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 23)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !14, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 20)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "remove_empty_parents", scope: !69, file: !2, line: 40, type: !152, isLocal: true, isDefinition: true)
!152 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "ignore_fail_on_non_empty", scope: !69, file: !2, line: 44, type: !152, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "verbose", scope: !69, file: !2, line: 47, type: !152, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !159, file: !76, line: 575, type: !77, isLocal: true, isDefinition: true)
!159 = distinct !DISubprogram(name: "oputs_", scope: !76, file: !76, line: 573, type: !160, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !162)
!160 = !DISubroutineType(cc: DW_CC_nocall, types: !161)
!161 = !{null, !122, !122}
!162 = !{!163, !164, !165, !168, !169, !170, !171, !175, !176, !177, !178, !180, !230, !231, !232, !234, !235}
!163 = !DILocalVariable(name: "program", arg: 1, scope: !159, file: !76, line: 573, type: !122)
!164 = !DILocalVariable(name: "option", arg: 2, scope: !159, file: !76, line: 573, type: !122)
!165 = !DILocalVariable(name: "term", scope: !166, file: !76, line: 585, type: !122)
!166 = distinct !DILexicalBlock(scope: !167, file: !76, line: 582, column: 5)
!167 = distinct !DILexicalBlock(scope: !159, file: !76, line: 581, column: 7)
!168 = !DILocalVariable(name: "double_space", scope: !159, file: !76, line: 594, type: !152)
!169 = !DILocalVariable(name: "first_word", scope: !159, file: !76, line: 595, type: !122)
!170 = !DILocalVariable(name: "option_text", scope: !159, file: !76, line: 596, type: !122)
!171 = !DILocalVariable(name: "s", scope: !172, file: !76, line: 608, type: !122)
!172 = distinct !DILexicalBlock(scope: !173, file: !76, line: 605, column: 5)
!173 = distinct !DILexicalBlock(scope: !174, file: !76, line: 604, column: 12)
!174 = distinct !DILexicalBlock(scope: !159, file: !76, line: 597, column: 7)
!175 = !DILocalVariable(name: "spaces", scope: !172, file: !76, line: 609, type: !119)
!176 = !DILocalVariable(name: "anchor_len", scope: !159, file: !76, line: 620, type: !119)
!177 = !DILocalVariable(name: "desc_text", scope: !159, file: !76, line: 625, type: !122)
!178 = !DILocalVariable(name: "__ptr", scope: !179, file: !76, line: 644, type: !122)
!179 = distinct !DILexicalBlock(scope: !159, file: !76, line: 644, column: 3)
!180 = !DILocalVariable(name: "__stream", scope: !179, file: !76, line: 644, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !183, line: 7, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !185, line: 49, size: 1728, elements: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !204, !205, !206, !210, !211, !213, !214, !217, !219, !222, !225, !226, !227, !228, !229}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !184, file: !185, line: 51, baseType: !77, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !184, file: !185, line: 54, baseType: !116, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !184, file: !185, line: 55, baseType: !116, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !184, file: !185, line: 56, baseType: !116, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !184, file: !185, line: 57, baseType: !116, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !184, file: !185, line: 58, baseType: !116, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !184, file: !185, line: 59, baseType: !116, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !184, file: !185, line: 60, baseType: !116, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !184, file: !185, line: 61, baseType: !116, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !184, file: !185, line: 64, baseType: !116, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !184, file: !185, line: 65, baseType: !116, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !184, file: !185, line: 66, baseType: !116, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !184, file: !185, line: 68, baseType: !200, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !185, line: 36, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !184, file: !185, line: 70, baseType: !203, size: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !184, file: !185, line: 72, baseType: !77, size: 32, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !184, file: !185, line: 73, baseType: !77, size: 32, offset: 928)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !184, file: !185, line: 74, baseType: !207, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !208, line: 152, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!209 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !184, file: !185, line: 77, baseType: !118, size: 16, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !184, file: !185, line: 78, baseType: !212, size: 8, offset: 1040)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !184, file: !185, line: 79, baseType: !49, size: 8, offset: 1048)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !184, file: !185, line: 81, baseType: !215, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !185, line: 43, baseType: null)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !184, file: !185, line: 89, baseType: !218, size: 64, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !208, line: 153, baseType: !209)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !184, file: !185, line: 91, baseType: !220, size: 64, offset: 1216)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !185, line: 37, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !184, file: !185, line: 92, baseType: !223, size: 64, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !185, line: 38, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !184, file: !185, line: 93, baseType: !203, size: 64, offset: 1344)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !184, file: !185, line: 94, baseType: !117, size: 64, offset: 1408)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !184, file: !185, line: 95, baseType: !119, size: 64, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !184, file: !185, line: 96, baseType: !77, size: 32, offset: 1536)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !184, file: !185, line: 98, baseType: !147, size: 160, offset: 1568)
!230 = !DILocalVariable(name: "__cnt", scope: !179, file: !76, line: 644, type: !119)
!231 = !DILocalVariable(name: "url_program", scope: !159, file: !76, line: 648, type: !122)
!232 = !DILocalVariable(name: "__ptr", scope: !233, file: !76, line: 686, type: !122)
!233 = distinct !DILexicalBlock(scope: !159, file: !76, line: 686, column: 3)
!234 = !DILocalVariable(name: "__stream", scope: !233, file: !76, line: 686, type: !181)
!235 = !DILocalVariable(name: "__cnt", scope: !233, file: !76, line: 686, type: !119)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !76, line: 585, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 5)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !76, line: 586, type: !238, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !76, line: 595, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 4)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !76, line: 620, type: !19, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !238, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !245, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !64, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !76, line: 650, type: !238, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !19, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !19, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !76, line: 652, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 7)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !76, line: 653, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 8)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !76, line: 654, type: !54, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !76, line: 655, type: !54, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !76, line: 656, type: !54, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !76, line: 657, type: !54, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !76, line: 663, type: !269, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !76, line: 664, type: !54, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 17)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 40)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 15)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 61)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !76, line: 679, type: !64, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !76, line: 683, type: !238, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !76, line: 688, type: !238, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !76, line: 691, type: !274, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !76, line: 839, type: !133, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !76, line: 840, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 22)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !76, line: 841, type: !301, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !76, line: 862, type: !245, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !76, line: 868, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 71)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !76, line: 875, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 27)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 51)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 12)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 25)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !238, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !274, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !274, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !238, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !274, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 30)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 1792, elements: !270)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !371, line: 50, size: 256, elements: !372)
!371 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!372 = !{!373, !374, !375, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !371, line: 52, baseType: !122, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !370, file: !371, line: 55, baseType: !77, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !371, line: 56, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !370, file: !371, line: 57, baseType: !77, size: 32, offset: 192)
!378 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!379 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !383, line: 32, type: !64, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !386, line: 3, type: !301, isLocal: true, isDefinition: true)
!386 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "Version", scope: !389, file: !386, line: 3, type: !122, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !386, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !390, splitDebugInlining: false, nameTableKind: None)
!390 = !{!384, !387}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "file_name", scope: !393, file: !394, line: 45, type: !122, isLocal: true, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C11, file: !394, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !395, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!395 = !{!396, !398, !400, !402, !391, !404}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !394, line: 121, type: !269, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !394, line: 121, type: !345, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !394, line: 123, type: !269, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !394, line: 126, type: !64, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !393, file: !394, line: 55, type: !152, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !408, file: !409, line: 66, type: !455, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, globals: !411, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!410 = !{!117, !124}
!411 = !{!412, !414, !434, !436, !438, !440, !406, !442, !444, !446, !448, !453}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !409, line: 272, type: !238, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "old_file_name", scope: !416, file: !409, line: 304, type: !122, isLocal: true, isDefinition: true)
!416 = distinct !DISubprogram(name: "verror_at_line", scope: !409, file: !409, line: 298, type: !417, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !427)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !77, !77, !122, !72, !122, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !421)
!421 = !{!422, !424, !425, !426}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !420, file: !423, baseType: !72, size: 32)
!423 = !DIFile(filename: "lib/error.c", directory: "/src")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !420, file: !423, baseType: !72, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !420, file: !423, baseType: !117, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !420, file: !423, baseType: !117, size: 64, offset: 128)
!427 = !{!428, !429, !430, !431, !432, !433}
!428 = !DILocalVariable(name: "status", arg: 1, scope: !416, file: !409, line: 298, type: !77)
!429 = !DILocalVariable(name: "errnum", arg: 2, scope: !416, file: !409, line: 298, type: !77)
!430 = !DILocalVariable(name: "file_name", arg: 3, scope: !416, file: !409, line: 298, type: !122)
!431 = !DILocalVariable(name: "line_number", arg: 4, scope: !416, file: !409, line: 298, type: !72)
!432 = !DILocalVariable(name: "message", arg: 5, scope: !416, file: !409, line: 298, type: !122)
!433 = !DILocalVariable(name: "args", arg: 6, scope: !416, file: !409, line: 298, type: !419)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "old_line_number", scope: !416, file: !409, line: 305, type: !72, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !409, line: 338, type: !245, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !409, line: 346, type: !274, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !409, line: 346, type: !252, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "error_message_count", scope: !408, file: !409, line: 69, type: !72, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !408, file: !409, line: 295, type: !77, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !409, line: 208, type: !269, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !409, line: 208, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 21)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !409, line: 214, type: !238, isLocal: true, isDefinition: true)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "program_name", scope: !460, file: !461, line: 31, type: !122, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !461, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !462, globals: !463, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!462 = !{!116}
!463 = !{!458, !464, !466}
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !461, line: 46, type: !274, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !461, line: 49, type: !245, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "utf07FF", scope: !470, file: !471, line: 46, type: !498, isLocal: true, isDefinition: true)
!470 = distinct !DISubprogram(name: "proper_name_lite", scope: !471, file: !471, line: 38, type: !472, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !474, retainedNodes: !476)
!471 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!472 = !DISubroutineType(types: !473)
!473 = !{!122, !122, !122}
!474 = distinct !DICompileUnit(language: DW_LANG_C11, file: !471, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !475, splitDebugInlining: false, nameTableKind: None)
!475 = !{!468}
!476 = !{!477, !478, !479, !480, !485}
!477 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !470, file: !471, line: 38, type: !122)
!478 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !470, file: !471, line: 38, type: !122)
!479 = !DILocalVariable(name: "translation", scope: !470, file: !471, line: 40, type: !122)
!480 = !DILocalVariable(name: "w", scope: !470, file: !471, line: 47, type: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !482, line: 37, baseType: !483)
!482 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !208, line: 57, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !208, line: 42, baseType: !72)
!485 = !DILocalVariable(name: "mbs", scope: !470, file: !471, line: 48, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !487, line: 6, baseType: !488)
!487 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !489, line: 21, baseType: !490)
!489 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 13, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !490, file: !489, line: 15, baseType: !77, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !490, file: !489, line: 20, baseType: !494, size: 32, offset: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !489, line: 16, size: 32, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !494, file: !489, line: 18, baseType: !72, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !494, file: !489, line: 19, baseType: !245, size: 32)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 16, elements: !253)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !501, line: 78, type: !274, isLocal: true, isDefinition: true)
!501 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !501, line: 79, type: !19, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !501, line: 80, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 13)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !501, line: 81, type: !506, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !501, line: 82, type: !147, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !501, line: 83, type: !252, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !501, line: 84, type: !274, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !501, line: 85, type: !269, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !501, line: 86, type: !269, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !501, line: 87, type: !274, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !525, file: !501, line: 76, type: !597, isLocal: false, isDefinition: true)
!525 = distinct !DICompileUnit(language: DW_LANG_C11, file: !501, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !526, retainedTypes: !532, globals: !533, splitDebugInlining: false, nameTableKind: None)
!526 = !{!81, !527, !95}
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !82, line: 254, baseType: !72, size: 32, elements: !528)
!528 = !{!529, !530, !531}
!529 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!530 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!531 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!532 = !{!77, !118, !119}
!533 = !{!499, !502, !504, !509, !511, !513, !515, !517, !519, !521, !523, !534, !538, !548, !550, !555, !557, !559, !561, !563, !586, !593, !595}
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !525, file: !501, line: 92, type: !536, isLocal: false, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 320, elements: !55)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !525, file: !501, line: 1040, type: !540, isLocal: false, isDefinition: true)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !501, line: 56, size: 448, elements: !541)
!541 = !{!542, !543, !544, !546, !547}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !540, file: !501, line: 59, baseType: !81, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !501, line: 62, baseType: !77, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !540, file: !501, line: 66, baseType: !545, size: 256, offset: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !275)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !540, file: !501, line: 69, baseType: !122, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !540, file: !501, line: 72, baseType: !122, size: 64, offset: 384)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !525, file: !501, line: 107, type: !540, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "slot0", scope: !525, file: !501, line: 831, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 256)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !501, line: 321, type: !252, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !501, line: 357, type: !252, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !501, line: 358, type: !252, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !501, line: 199, type: !269, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "quote", scope: !565, file: !501, line: 228, type: !584, isLocal: true, isDefinition: true)
!565 = distinct !DISubprogram(name: "gettext_quote", scope: !501, file: !501, line: 197, type: !566, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !525, retainedNodes: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!122, !122, !81}
!568 = !{!569, !570, !571, !572, !573}
!569 = !DILocalVariable(name: "msgid", arg: 1, scope: !565, file: !501, line: 197, type: !122)
!570 = !DILocalVariable(name: "s", arg: 2, scope: !565, file: !501, line: 197, type: !81)
!571 = !DILocalVariable(name: "translation", scope: !565, file: !501, line: 199, type: !122)
!572 = !DILocalVariable(name: "w", scope: !565, file: !501, line: 229, type: !481)
!573 = !DILocalVariable(name: "mbs", scope: !565, file: !501, line: 230, type: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !487, line: 6, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !489, line: 21, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 13, size: 64, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !576, file: !489, line: 15, baseType: !77, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !576, file: !489, line: 20, baseType: !580, size: 32, offset: 32)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !576, file: !489, line: 16, size: 32, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !580, file: !489, line: 18, baseType: !72, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !580, file: !489, line: 19, baseType: !245, size: 32)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !585)
!585 = !{!254, !247}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "slotvec", scope: !525, file: !501, line: 834, type: !588, isLocal: true, isDefinition: true)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !501, line: 823, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !589, file: !501, line: 825, baseType: !119, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !589, file: !501, line: 826, baseType: !116, size: 64, offset: 64)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "nslots", scope: !525, file: !501, line: 832, type: !77, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "slotvec0", scope: !525, file: !501, line: 833, type: !589, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 704, elements: !599)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!599 = !{!600}
!600 = !DISubrange(count: 11)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !603, line: 67, type: !345, isLocal: true, isDefinition: true)
!603 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !603, line: 69, type: !269, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !603, line: 83, type: !269, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !603, line: 83, type: !245, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !603, line: 85, type: !252, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !603, line: 88, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 171)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !603, line: 88, type: !619, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 34)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !603, line: 105, type: !133, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !603, line: 109, type: !140, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !603, line: 113, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 28)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !603, line: 120, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 32)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !603, line: 127, type: !9, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !603, line: 134, type: !296, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !603, line: 142, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 44)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !603, line: 150, type: !14, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !603, line: 159, type: !649, isLocal: true, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 52)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !603, line: 170, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 60)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !603, line: 248, type: !147, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !603, line: 248, type: !321, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !603, line: 254, type: !147, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !603, line: 254, type: !128, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !603, line: 254, type: !296, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !603, line: 259, type: !3, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !603, line: 259, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 29)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !676, file: !677, line: 26, type: !679, isLocal: false, isDefinition: true)
!676 = distinct !DICompileUnit(language: DW_LANG_C11, file: !677, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !678, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!678 = !{!674}
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 376, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 47)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "exit_failure", scope: !684, file: !685, line: 24, type: !687, isLocal: false, isDefinition: true)
!684 = distinct !DICompileUnit(language: DW_LANG_C11, file: !685, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !686, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!686 = !{!682}
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !690, line: 34, type: !64, isLocal: true, isDefinition: true)
!690 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !690, line: 34, type: !269, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !690, line: 34, type: !291, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !697, line: 108, type: !49, isLocal: true, isDefinition: true)
!697 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "internal_state", scope: !700, file: !697, line: 97, type: !703, isLocal: true, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !697, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !701, globals: !702, splitDebugInlining: false, nameTableKind: None)
!701 = !{!117, !119, !124}
!702 = !{!695, !698}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !487, line: 6, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !489, line: 21, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 13, size: 64, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !705, file: !489, line: 15, baseType: !77, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !705, file: !489, line: 20, baseType: !709, size: 32, offset: 32)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !489, line: 16, size: 32, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !709, file: !489, line: 18, baseType: !72, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !709, file: !489, line: 19, baseType: !245, size: 32)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !715, line: 35, type: !19, isLocal: true, isDefinition: true)
!715 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !383, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !717, globals: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !{!124}
!718 = !{!381}
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !722, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !603, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !724, retainedTypes: !728, globals: !729, splitDebugInlining: false, nameTableKind: None)
!724 = !{!725}
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 40, baseType: !72, size: 32, elements: !726)
!726 = !{!727}
!727 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!728 = !{!117}
!729 = !{!601, !604, !606, !608, !610, !612, !617, !622, !624, !626, !631, !636, !638, !640, !645, !647, !652, !657, !659, !661, !663, !665, !667, !669}
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !732, retainedTypes: !763, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!732 = !{!733, !745}
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !734, file: !731, line: 188, baseType: !72, size: 32, elements: !743)
!734 = distinct !DISubprogram(name: "x2nrealloc", scope: !731, file: !731, line: 176, type: !735, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !730, retainedNodes: !738)
!735 = !DISubroutineType(types: !736)
!736 = !{!117, !117, !737, !119}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!738 = !{!739, !740, !741, !742}
!739 = !DILocalVariable(name: "p", arg: 1, scope: !734, file: !731, line: 176, type: !117)
!740 = !DILocalVariable(name: "pn", arg: 2, scope: !734, file: !731, line: 176, type: !737)
!741 = !DILocalVariable(name: "s", arg: 3, scope: !734, file: !731, line: 176, type: !119)
!742 = !DILocalVariable(name: "n", scope: !734, file: !731, line: 178, type: !119)
!743 = !{!744}
!744 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !746, file: !731, line: 228, baseType: !72, size: 32, elements: !743)
!746 = distinct !DISubprogram(name: "xpalloc", scope: !731, file: !731, line: 223, type: !747, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !730, retainedNodes: !753)
!747 = !DISubroutineType(types: !748)
!748 = !{!117, !117, !749, !750, !752, !750}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !751, line: 130, baseType: !752)
!751 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !120, line: 35, baseType: !209)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762}
!754 = !DILocalVariable(name: "pa", arg: 1, scope: !746, file: !731, line: 223, type: !117)
!755 = !DILocalVariable(name: "pn", arg: 2, scope: !746, file: !731, line: 223, type: !749)
!756 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !746, file: !731, line: 223, type: !750)
!757 = !DILocalVariable(name: "n_max", arg: 4, scope: !746, file: !731, line: 223, type: !752)
!758 = !DILocalVariable(name: "s", arg: 5, scope: !746, file: !731, line: 223, type: !750)
!759 = !DILocalVariable(name: "n0", scope: !746, file: !731, line: 230, type: !750)
!760 = !DILocalVariable(name: "n", scope: !746, file: !731, line: 237, type: !750)
!761 = !DILocalVariable(name: "nbytes", scope: !746, file: !731, line: 248, type: !750)
!762 = !DILocalVariable(name: "adjusted_nbytes", scope: !746, file: !731, line: 252, type: !750)
!763 = !{!116, !117, !152, !209, !121}
!764 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !765, splitDebugInlining: false, nameTableKind: None)
!765 = !{!688, !691, !693}
!766 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !462, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!770 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !773, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !728, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !728, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!776 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !778, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!778 = !{!152, !121, !117}
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !780, splitDebugInlining: false, nameTableKind: None)
!780 = !{!781, !713}
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !715, line: 35, type: !252, isLocal: true, isDefinition: true)
!783 = distinct !DICompileUnit(language: DW_LANG_C11, file: !784, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !728, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!787 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!788 = !{i32 7, !"Dwarf Version", i32 5}
!789 = !{i32 2, !"Debug Info Version", i32 3}
!790 = !{i32 1, !"wchar_size", i32 4}
!791 = !{i32 8, !"PIC Level", i32 2}
!792 = !{i32 7, !"PIE Level", i32 2}
!793 = !{i32 7, !"uwtable", i32 2}
!794 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 166, type: !795, scopeLine: 167, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !77}
!797 = !{!798}
!798 = !DILocalVariable(name: "status", arg: 1, scope: !794, file: !2, line: 166, type: !77)
!799 = !DILocation(line: 0, scope: !794)
!800 = !DILocation(line: 168, column: 14, scope: !801)
!801 = distinct !DILexicalBlock(scope: !794, file: !2, line: 168, column: 7)
!802 = !DILocation(line: 168, column: 7, scope: !794)
!803 = !DILocation(line: 169, column: 5, scope: !804)
!804 = distinct !DILexicalBlock(scope: !801, file: !2, line: 169, column: 5)
!805 = !{!806, !806, i64 0}
!806 = !{!"any pointer", !807, i64 0}
!807 = !{!"omnipotent char", !808, i64 0}
!808 = !{!"Simple C/C++ TBAA"}
!809 = !DILocation(line: 172, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !801, file: !2, line: 171, column: 5)
!811 = !DILocation(line: 173, column: 7, scope: !810)
!812 = !DILocation(line: 177, column: 7, scope: !810)
!813 = !DILocation(line: 181, column: 7, scope: !810)
!814 = !DILocation(line: 186, column: 7, scope: !810)
!815 = !DILocation(line: 190, column: 7, scope: !810)
!816 = !DILocation(line: 191, column: 7, scope: !810)
!817 = !DILocalVariable(name: "program", arg: 1, scope: !818, file: !76, line: 836, type: !122)
!818 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !76, file: !76, line: 836, type: !819, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !122}
!821 = !{!817, !822, !829, !830, !832, !833}
!822 = !DILocalVariable(name: "infomap", scope: !818, file: !76, line: 838, type: !823)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 896, elements: !270)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !818, file: !76, line: 838, size: 128, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !825, file: !76, line: 838, baseType: !122, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !825, file: !76, line: 838, baseType: !122, size: 64, offset: 64)
!829 = !DILocalVariable(name: "node", scope: !818, file: !76, line: 848, type: !122)
!830 = !DILocalVariable(name: "map_prog", scope: !818, file: !76, line: 849, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!832 = !DILocalVariable(name: "lc_messages", scope: !818, file: !76, line: 861, type: !122)
!833 = !DILocalVariable(name: "url_program", scope: !818, file: !76, line: 874, type: !122)
!834 = !DILocation(line: 0, scope: !818, inlinedAt: !835)
!835 = distinct !DILocation(line: 192, column: 7, scope: !810)
!836 = !DILocation(line: 857, column: 3, scope: !818, inlinedAt: !835)
!837 = !DILocation(line: 861, column: 29, scope: !818, inlinedAt: !835)
!838 = !DILocation(line: 862, column: 7, scope: !839, inlinedAt: !835)
!839 = distinct !DILexicalBlock(scope: !818, file: !76, line: 862, column: 7)
!840 = !DILocation(line: 862, column: 19, scope: !839, inlinedAt: !835)
!841 = !DILocation(line: 862, column: 22, scope: !839, inlinedAt: !835)
!842 = !DILocation(line: 862, column: 7, scope: !818, inlinedAt: !835)
!843 = !DILocation(line: 868, column: 7, scope: !844, inlinedAt: !835)
!844 = distinct !DILexicalBlock(scope: !839, file: !76, line: 863, column: 5)
!845 = !DILocation(line: 870, column: 5, scope: !844, inlinedAt: !835)
!846 = !DILocation(line: 875, column: 3, scope: !818, inlinedAt: !835)
!847 = !DILocation(line: 877, column: 3, scope: !818, inlinedAt: !835)
!848 = !DILocation(line: 194, column: 3, scope: !794)
!849 = !DISubprogram(name: "dcgettext", scope: !850, file: !850, line: 51, type: !851, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!850 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!851 = !DISubroutineType(types: !852)
!852 = !{!116, !122, !122, !77}
!853 = !{}
!854 = !DISubprogram(name: "__fprintf_chk", scope: !855, file: !855, line: 93, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!855 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!856 = !DISubroutineType(types: !857)
!857 = !{!77, !858, !77, !859, null}
!858 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !181)
!859 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !122)
!860 = !DISubprogram(name: "__printf_chk", scope: !855, file: !855, line: 95, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!861 = !DISubroutineType(types: !862)
!862 = !{!77, !77, !859, null}
!863 = !DISubprogram(name: "fputs_unlocked", scope: !864, file: !864, line: 691, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!864 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!865 = !DISubroutineType(types: !866)
!866 = !{!77, !859, !858}
!867 = !DILocation(line: 0, scope: !159)
!868 = !DILocation(line: 581, column: 7, scope: !167)
!869 = !{!870, !870, i64 0}
!870 = !{!"int", !807, i64 0}
!871 = !DILocation(line: 581, column: 19, scope: !167)
!872 = !DILocation(line: 581, column: 7, scope: !159)
!873 = !DILocation(line: 585, column: 26, scope: !166)
!874 = !DILocation(line: 0, scope: !166)
!875 = !DILocation(line: 586, column: 23, scope: !166)
!876 = !DILocation(line: 586, column: 28, scope: !166)
!877 = !DILocation(line: 586, column: 32, scope: !166)
!878 = !{!807, !807, i64 0}
!879 = !DILocation(line: 586, column: 38, scope: !166)
!880 = !DILocalVariable(name: "__s1", arg: 1, scope: !881, file: !882, line: 1359, type: !122)
!881 = distinct !DISubprogram(name: "streq", scope: !882, file: !882, line: 1359, type: !883, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !885)
!882 = !DIFile(filename: "./lib/string.h", directory: "/src")
!883 = !DISubroutineType(types: !884)
!884 = !{!152, !122, !122}
!885 = !{!880, !886}
!886 = !DILocalVariable(name: "__s2", arg: 2, scope: !881, file: !882, line: 1359, type: !122)
!887 = !DILocation(line: 0, scope: !881, inlinedAt: !888)
!888 = distinct !DILocation(line: 586, column: 41, scope: !166)
!889 = !DILocation(line: 1361, column: 11, scope: !881, inlinedAt: !888)
!890 = !DILocation(line: 1361, column: 10, scope: !881, inlinedAt: !888)
!891 = !DILocation(line: 586, column: 19, scope: !166)
!892 = !DILocation(line: 587, column: 5, scope: !166)
!893 = !DILocation(line: 588, column: 7, scope: !894)
!894 = distinct !DILexicalBlock(scope: !159, file: !76, line: 588, column: 7)
!895 = !DILocation(line: 588, column: 7, scope: !159)
!896 = !DILocation(line: 590, column: 7, scope: !897)
!897 = distinct !DILexicalBlock(scope: !894, file: !76, line: 589, column: 5)
!898 = !DILocation(line: 591, column: 7, scope: !897)
!899 = !DILocation(line: 595, column: 37, scope: !159)
!900 = !DILocation(line: 595, column: 35, scope: !159)
!901 = !DILocation(line: 596, column: 29, scope: !159)
!902 = !DILocation(line: 597, column: 8, scope: !174)
!903 = !DILocation(line: 597, column: 7, scope: !159)
!904 = !DILocation(line: 604, column: 24, scope: !173)
!905 = !DILocation(line: 604, column: 12, scope: !174)
!906 = !DILocation(line: 0, scope: !172)
!907 = !DILocation(line: 610, column: 16, scope: !172)
!908 = !DILocation(line: 610, column: 7, scope: !172)
!909 = !DILocation(line: 611, column: 21, scope: !172)
!910 = !{!911, !911, i64 0}
!911 = !{!"short", !807, i64 0}
!912 = !DILocation(line: 611, column: 19, scope: !172)
!913 = !DILocation(line: 611, column: 16, scope: !172)
!914 = !DILocation(line: 610, column: 30, scope: !172)
!915 = distinct !{!915, !908, !909, !916}
!916 = !{!"llvm.loop.mustprogress"}
!917 = !DILocation(line: 612, column: 18, scope: !918)
!918 = distinct !DILexicalBlock(scope: !172, file: !76, line: 612, column: 11)
!919 = !DILocation(line: 612, column: 11, scope: !172)
!920 = !DILocation(line: 618, column: 5, scope: !172)
!921 = !DILocation(line: 620, column: 23, scope: !159)
!922 = !DILocation(line: 625, column: 39, scope: !159)
!923 = !DILocation(line: 626, column: 3, scope: !159)
!924 = !DILocation(line: 626, column: 10, scope: !159)
!925 = !DILocation(line: 626, column: 21, scope: !159)
!926 = !DILocation(line: 628, column: 44, scope: !927)
!927 = distinct !DILexicalBlock(scope: !928, file: !76, line: 628, column: 11)
!928 = distinct !DILexicalBlock(scope: !159, file: !76, line: 627, column: 5)
!929 = !DILocation(line: 628, column: 32, scope: !927)
!930 = !DILocation(line: 628, column: 49, scope: !927)
!931 = !DILocation(line: 628, column: 11, scope: !928)
!932 = !DILocation(line: 630, column: 11, scope: !933)
!933 = distinct !DILexicalBlock(scope: !928, file: !76, line: 630, column: 11)
!934 = !DILocation(line: 630, column: 11, scope: !928)
!935 = !DILocation(line: 632, column: 26, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !76, line: 632, column: 15)
!937 = distinct !DILexicalBlock(scope: !933, file: !76, line: 631, column: 9)
!938 = !DILocation(line: 632, column: 34, scope: !936)
!939 = !DILocation(line: 632, column: 37, scope: !936)
!940 = !DILocation(line: 632, column: 15, scope: !937)
!941 = !DILocation(line: 636, column: 16, scope: !942)
!942 = distinct !DILexicalBlock(scope: !937, file: !76, line: 636, column: 15)
!943 = !DILocation(line: 636, column: 29, scope: !942)
!944 = !DILocation(line: 640, column: 16, scope: !928)
!945 = distinct !{!945, !923, !946, !916}
!946 = !DILocation(line: 641, column: 5, scope: !159)
!947 = !DILocation(line: 644, column: 3, scope: !159)
!948 = !DILocation(line: 0, scope: !881, inlinedAt: !949)
!949 = distinct !DILocation(line: 648, column: 31, scope: !159)
!950 = !DILocation(line: 0, scope: !881, inlinedAt: !951)
!951 = distinct !DILocation(line: 649, column: 31, scope: !159)
!952 = !DILocation(line: 0, scope: !881, inlinedAt: !953)
!953 = distinct !DILocation(line: 650, column: 31, scope: !159)
!954 = !DILocation(line: 0, scope: !881, inlinedAt: !955)
!955 = distinct !DILocation(line: 651, column: 31, scope: !159)
!956 = !DILocation(line: 0, scope: !881, inlinedAt: !957)
!957 = distinct !DILocation(line: 652, column: 31, scope: !159)
!958 = !DILocation(line: 0, scope: !881, inlinedAt: !959)
!959 = distinct !DILocation(line: 653, column: 31, scope: !159)
!960 = !DILocation(line: 0, scope: !881, inlinedAt: !961)
!961 = distinct !DILocation(line: 654, column: 31, scope: !159)
!962 = !DILocation(line: 0, scope: !881, inlinedAt: !963)
!963 = distinct !DILocation(line: 655, column: 31, scope: !159)
!964 = !DILocation(line: 0, scope: !881, inlinedAt: !965)
!965 = distinct !DILocation(line: 656, column: 31, scope: !159)
!966 = !DILocation(line: 0, scope: !881, inlinedAt: !967)
!967 = distinct !DILocation(line: 657, column: 31, scope: !159)
!968 = !DILocation(line: 663, column: 7, scope: !969)
!969 = distinct !DILexicalBlock(scope: !159, file: !76, line: 663, column: 7)
!970 = !DILocation(line: 664, column: 7, scope: !969)
!971 = !DILocation(line: 664, column: 10, scope: !969)
!972 = !DILocation(line: 663, column: 7, scope: !159)
!973 = !DILocation(line: 669, column: 7, scope: !974)
!974 = distinct !DILexicalBlock(scope: !969, file: !76, line: 665, column: 5)
!975 = !DILocation(line: 671, column: 5, scope: !974)
!976 = !DILocation(line: 676, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !969, file: !76, line: 673, column: 5)
!978 = !DILocation(line: 679, column: 3, scope: !159)
!979 = !DILocation(line: 683, column: 3, scope: !159)
!980 = !DILocation(line: 686, column: 3, scope: !159)
!981 = !DILocation(line: 688, column: 3, scope: !159)
!982 = !DILocation(line: 691, column: 3, scope: !159)
!983 = !DILocation(line: 695, column: 3, scope: !159)
!984 = !DILocation(line: 696, column: 1, scope: !159)
!985 = !DISubprogram(name: "setlocale", scope: !986, file: !986, line: 122, type: !987, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!986 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!987 = !DISubroutineType(types: !988)
!988 = !{!116, !77, !122}
!989 = !DISubprogram(name: "strncmp", scope: !990, file: !990, line: 159, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!990 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!991 = !DISubroutineType(types: !992)
!992 = !{!77, !122, !122, !119}
!993 = !DISubprogram(name: "exit", scope: !994, file: !994, line: 624, type: !795, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !853)
!994 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!995 = !DISubprogram(name: "getenv", scope: !994, file: !994, line: 641, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!996 = !DISubroutineType(types: !997)
!997 = !{!116, !122}
!998 = !DISubprogram(name: "strcmp", scope: !990, file: !990, line: 156, type: !999, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!77, !122, !122}
!1001 = !DISubprogram(name: "strspn", scope: !990, file: !990, line: 297, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!121, !122, !122}
!1004 = !DISubprogram(name: "strchr", scope: !990, file: !990, line: 246, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!116, !122, !77}
!1007 = !DISubprogram(name: "__ctype_b_loc", scope: !96, file: !96, line: 79, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!1013 = !DISubprogram(name: "strcspn", scope: !990, file: !990, line: 293, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1014 = !DISubprogram(name: "fwrite_unlocked", scope: !864, file: !864, line: 704, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!119, !1017, !119, !119, !858}
!1017 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1020 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 198, type: !1021, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1024)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!77, !77, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1033, !1036, !1037, !1040, !1077, !1078}
!1025 = !DILocalVariable(name: "argc", arg: 1, scope: !1020, file: !2, line: 198, type: !77)
!1026 = !DILocalVariable(name: "argv", arg: 2, scope: !1020, file: !2, line: 198, type: !1023)
!1027 = !DILocalVariable(name: "optc", scope: !1020, file: !2, line: 208, type: !77)
!1028 = !DILocalVariable(name: "ok", scope: !1020, file: !2, line: 235, type: !152)
!1029 = !DILocalVariable(name: "dir", scope: !1030, file: !2, line: 238, type: !116)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !2, line: 237, column: 5)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !2, line: 236, column: 3)
!1032 = distinct !DILexicalBlock(scope: !1020, file: !2, line: 236, column: 3)
!1033 = !DILocalVariable(name: "rmdir_errno", scope: !1034, file: !2, line: 246, type: !77)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 245, column: 9)
!1035 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 244, column: 11)
!1036 = !DILocalVariable(name: "custom_error", scope: !1034, file: !2, line: 255, type: !152)
!1037 = !DILocalVariable(name: "last_unix_slash", scope: !1038, file: !2, line: 258, type: !122)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !2, line: 257, column: 13)
!1039 = distinct !DILexicalBlock(scope: !1034, file: !2, line: 256, column: 15)
!1040 = !DILocalVariable(name: "st", scope: !1041, file: !2, line: 261, type: !1043)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !2, line: 260, column: 17)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !2, line: 259, column: 19)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1044, line: 26, size: 1152, elements: !1045)
!1044 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1045 = !{!1046, !1048, !1050, !1052, !1054, !1056, !1058, !1059, !1060, !1061, !1063, !1065, !1073, !1074, !1075}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1043, file: !1044, line: 31, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !208, line: 145, baseType: !121)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1043, file: !1044, line: 36, baseType: !1049, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !208, line: 148, baseType: !121)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1043, file: !1044, line: 44, baseType: !1051, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !208, line: 151, baseType: !121)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1043, file: !1044, line: 45, baseType: !1053, size: 32, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !208, line: 150, baseType: !72)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1043, file: !1044, line: 47, baseType: !1055, size: 32, offset: 224)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !208, line: 146, baseType: !72)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1043, file: !1044, line: 48, baseType: !1057, size: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !208, line: 147, baseType: !72)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1043, file: !1044, line: 50, baseType: !77, size: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1043, file: !1044, line: 52, baseType: !1047, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1043, file: !1044, line: 57, baseType: !207, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1043, file: !1044, line: 61, baseType: !1062, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !208, line: 175, baseType: !209)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1043, file: !1044, line: 63, baseType: !1064, size: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !208, line: 180, baseType: !209)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1043, file: !1044, line: 74, baseType: !1066, size: 128, offset: 576)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1067, line: 11, size: 128, elements: !1068)
!1067 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1068 = !{!1069, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1066, file: !1067, line: 16, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !208, line: 160, baseType: !209)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1066, file: !1067, line: 21, baseType: !1072, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !208, line: 197, baseType: !209)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1043, file: !1044, line: 75, baseType: !1066, size: 128, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1043, file: !1044, line: 76, baseType: !1066, size: 128, offset: 832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1043, file: !1044, line: 89, baseType: !1076, size: 192, offset: 960)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 192, elements: !65)
!1077 = !DILocalVariable(name: "ret", scope: !1041, file: !2, line: 262, type: !77)
!1078 = !DILocalVariable(name: "dir_arg", scope: !1079, file: !2, line: 268, type: !116)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !2, line: 266, column: 21)
!1080 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 264, column: 23)
!1081 = !DILocation(line: 0, scope: !1020)
!1082 = !DILocation(line: 201, column: 21, scope: !1020)
!1083 = !DILocation(line: 201, column: 3, scope: !1020)
!1084 = !DILocation(line: 202, column: 3, scope: !1020)
!1085 = !DILocation(line: 203, column: 3, scope: !1020)
!1086 = !DILocation(line: 204, column: 3, scope: !1020)
!1087 = !DILocation(line: 206, column: 3, scope: !1020)
!1088 = !DILocation(line: 209, column: 3, scope: !1020)
!1089 = !DILocation(line: 209, column: 18, scope: !1020)
!1090 = !DILocation(line: 218, column: 11, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !2, line: 212, column: 9)
!1092 = distinct !DILexicalBlock(scope: !1020, file: !2, line: 210, column: 5)
!1093 = !DILocation(line: 221, column: 11, scope: !1091)
!1094 = !DILocation(line: 222, column: 9, scope: !1091)
!1095 = !DILocation(line: 223, column: 9, scope: !1091)
!1096 = !DILocation(line: 225, column: 11, scope: !1091)
!1097 = !DILocation(line: 0, scope: !1091)
!1098 = distinct !{!1098, !1088, !1099, !916}
!1099 = !DILocation(line: 227, column: 5, scope: !1020)
!1100 = !DILocation(line: 229, column: 7, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1020, file: !2, line: 229, column: 7)
!1102 = !DILocation(line: 229, column: 14, scope: !1101)
!1103 = !DILocation(line: 229, column: 7, scope: !1020)
!1104 = !DILocation(line: 236, column: 17, scope: !1031)
!1105 = !DILocation(line: 236, column: 3, scope: !1032)
!1106 = !DILocation(line: 231, column: 7, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 230, column: 5)
!1108 = !DILocation(line: 232, column: 7, scope: !1107)
!1109 = !DILocation(line: 238, column: 19, scope: !1030)
!1110 = !DILocation(line: 0, scope: !1030)
!1111 = !DILocation(line: 241, column: 11, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 241, column: 11)
!1113 = !DILocation(line: 241, column: 11, scope: !1030)
!1114 = !DILocation(line: 242, column: 23, scope: !1112)
!1115 = !DILocation(line: 242, column: 31, scope: !1112)
!1116 = !DILocation(line: 242, column: 60, scope: !1112)
!1117 = !DILocation(line: 242, column: 9, scope: !1112)
!1118 = !DILocation(line: 244, column: 11, scope: !1035)
!1119 = !DILocation(line: 244, column: 23, scope: !1035)
!1120 = !DILocation(line: 244, column: 11, scope: !1030)
!1121 = !DILocation(line: 246, column: 29, scope: !1034)
!1122 = !DILocation(line: 0, scope: !1034)
!1123 = !DILocation(line: 247, column: 15, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1034, file: !2, line: 247, column: 15)
!1125 = !DILocation(line: 247, column: 15, scope: !1034)
!1126 = !DILocation(line: 256, column: 27, scope: !1039)
!1127 = !DILocation(line: 256, column: 15, scope: !1034)
!1128 = !DILocation(line: 258, column: 45, scope: !1038)
!1129 = !DILocation(line: 0, scope: !1038)
!1130 = !DILocation(line: 259, column: 19, scope: !1042)
!1131 = !DILocation(line: 259, column: 35, scope: !1042)
!1132 = !DILocation(line: 259, column: 57, scope: !1042)
!1133 = !DILocation(line: 259, column: 39, scope: !1042)
!1134 = !DILocation(line: 259, column: 62, scope: !1042)
!1135 = !DILocation(line: 259, column: 19, scope: !1038)
!1136 = !DILocation(line: 261, column: 19, scope: !1041)
!1137 = !DILocation(line: 261, column: 31, scope: !1041)
!1138 = !DILocation(line: 262, column: 29, scope: !1041)
!1139 = !DILocation(line: 0, scope: !1041)
!1140 = !DILocation(line: 264, column: 33, scope: !1080)
!1141 = !DILocation(line: 264, column: 36, scope: !1080)
!1142 = !DILocation(line: 264, column: 42, scope: !1080)
!1143 = !DILocation(line: 265, column: 23, scope: !1080)
!1144 = !DILocation(line: 265, column: 39, scope: !1080)
!1145 = !{!1146, !870, i64 24}
!1146 = !{!"stat", !1147, i64 0, !1147, i64 8, !1147, i64 16, !870, i64 24, !870, i64 28, !870, i64 32, !870, i64 36, !1147, i64 40, !1147, i64 48, !1147, i64 56, !1147, i64 64, !1148, i64 72, !1148, i64 88, !1148, i64 104, !807, i64 120}
!1147 = !{!"long", !807, i64 0}
!1148 = !{!"timespec", !1147, i64 0, !1147, i64 8}
!1149 = !DILocation(line: 264, column: 23, scope: !1041)
!1150 = !DILocation(line: 268, column: 39, scope: !1079)
!1151 = !DILocation(line: 0, scope: !1079)
!1152 = !DILocation(line: 269, column: 23, scope: !1079)
!1153 = !DILocalVariable(name: "filename", arg: 1, scope: !1154, file: !1155, line: 49, type: !122)
!1154 = distinct !DISubprogram(name: "issymlink", scope: !1155, file: !1155, line: 49, type: !1156, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1158)
!1155 = !DIFile(filename: "./lib/issymlink.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3ed5fe5c76158b7c9a68dd013fb9e151")
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!77, !122}
!1158 = !{!1153, !1159}
!1159 = !DILocalVariable(name: "linkbuf", scope: !1154, file: !1155, line: 51, type: !49)
!1160 = !DILocation(line: 0, scope: !1154, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 270, column: 27, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 270, column: 27)
!1163 = !DILocation(line: 51, column: 3, scope: !1154, inlinedAt: !1161)
!1164 = !DILocation(line: 51, column: 8, scope: !1154, inlinedAt: !1161)
!1165 = !DILocation(line: 52, column: 7, scope: !1166, inlinedAt: !1161)
!1166 = distinct !DILexicalBlock(scope: !1154, file: !1155, line: 52, column: 7)
!1167 = !DILocation(line: 52, column: 54, scope: !1166, inlinedAt: !1161)
!1168 = !DILocation(line: 58, column: 1, scope: !1154, inlinedAt: !1161)
!1169 = !DILocation(line: 52, column: 7, scope: !1154, inlinedAt: !1161)
!1170 = !DILocation(line: 272, column: 27, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1162, file: !2, line: 271, column: 25)
!1172 = !DILocation(line: 278, column: 23, scope: !1079)
!1173 = !DILocation(line: 280, column: 17, scope: !1042)
!1174 = !DILocation(line: 283, column: 15, scope: !1034)
!1175 = !DILocation(line: 284, column: 13, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1034, file: !2, line: 283, column: 15)
!1177 = !DILocation(line: 288, column: 16, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 288, column: 16)
!1179 = !DILocation(line: 288, column: 16, scope: !1035)
!1180 = !DILocalVariable(name: "dir", arg: 1, scope: !1181, file: !2, line: 113, type: !116)
!1181 = distinct !DISubprogram(name: "remove_parents", scope: !2, file: !2, line: 113, type: !1182, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1184)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!152, !116}
!1184 = !{!1180, !1185, !1186, !1188, !1189}
!1185 = !DILocalVariable(name: "ok", scope: !1181, file: !2, line: 115, type: !152)
!1186 = !DILocalVariable(name: "slash", scope: !1187, file: !2, line: 120, type: !116)
!1187 = distinct !DILexicalBlock(scope: !1181, file: !2, line: 119, column: 5)
!1188 = !DILocalVariable(name: "rmdir_errno", scope: !1187, file: !2, line: 134, type: !77)
!1189 = !DILocalVariable(name: "error_msg", scope: !1190, file: !2, line: 145, type: !122)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !2, line: 144, column: 13)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 139, column: 15)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !2, line: 137, column: 9)
!1193 = distinct !DILexicalBlock(scope: !1187, file: !2, line: 136, column: 11)
!1194 = !DILocation(line: 0, scope: !1181, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 290, column: 17, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1178, file: !2, line: 289, column: 9)
!1197 = !DILocation(line: 117, column: 3, scope: !1181, inlinedAt: !1195)
!1198 = !DILocation(line: 118, column: 3, scope: !1181, inlinedAt: !1195)
!1199 = !DILocation(line: 120, column: 21, scope: !1187, inlinedAt: !1195)
!1200 = !DILocation(line: 0, scope: !1187, inlinedAt: !1195)
!1201 = !DILocation(line: 121, column: 17, scope: !1202, inlinedAt: !1195)
!1202 = distinct !DILexicalBlock(scope: !1187, file: !2, line: 121, column: 11)
!1203 = !DILocation(line: 121, column: 11, scope: !1187, inlinedAt: !1195)
!1204 = !DILocation(line: 125, column: 20, scope: !1187, inlinedAt: !1195)
!1205 = !DILocation(line: 125, column: 26, scope: !1187, inlinedAt: !1195)
!1206 = !DILocation(line: 125, column: 7, scope: !1187, inlinedAt: !1195)
!1207 = !DILocation(line: 125, column: 29, scope: !1187, inlinedAt: !1195)
!1208 = !DILocation(line: 125, column: 36, scope: !1187, inlinedAt: !1195)
!1209 = !DILocation(line: 126, column: 9, scope: !1187, inlinedAt: !1195)
!1210 = distinct !{!1210, !1206, !1211, !916}
!1211 = !DILocation(line: 126, column: 11, scope: !1187, inlinedAt: !1195)
!1212 = !DILocation(line: 127, column: 7, scope: !1187, inlinedAt: !1195)
!1213 = !DILocation(line: 127, column: 16, scope: !1187, inlinedAt: !1195)
!1214 = !DILocation(line: 130, column: 11, scope: !1215, inlinedAt: !1195)
!1215 = distinct !DILexicalBlock(scope: !1187, file: !2, line: 130, column: 11)
!1216 = !DILocation(line: 130, column: 11, scope: !1187, inlinedAt: !1195)
!1217 = !DILocation(line: 131, column: 23, scope: !1215, inlinedAt: !1195)
!1218 = !DILocation(line: 131, column: 31, scope: !1215, inlinedAt: !1195)
!1219 = !DILocation(line: 131, column: 60, scope: !1215, inlinedAt: !1195)
!1220 = !DILocation(line: 131, column: 9, scope: !1215, inlinedAt: !1195)
!1221 = !DILocation(line: 133, column: 13, scope: !1187, inlinedAt: !1195)
!1222 = !DILocation(line: 133, column: 25, scope: !1187, inlinedAt: !1195)
!1223 = !DILocation(line: 134, column: 25, scope: !1187, inlinedAt: !1195)
!1224 = !DILocation(line: 136, column: 11, scope: !1187, inlinedAt: !1195)
!1225 = !DILocation(line: 139, column: 15, scope: !1191, inlinedAt: !1195)
!1226 = !DILocation(line: 139, column: 15, scope: !1192, inlinedAt: !1195)
!1227 = !DILocation(line: 146, column: 31, scope: !1228, inlinedAt: !1195)
!1228 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 146, column: 19)
!1229 = !DILocation(line: 0, scope: !1190, inlinedAt: !1195)
!1230 = !DILocation(line: 157, column: 15, scope: !1190, inlinedAt: !1195)
!1231 = !DILocation(line: 290, column: 14, scope: !1196)
!1232 = !DILocation(line: 291, column: 9, scope: !1196)
!1233 = !DILocation(line: 235, column: 8, scope: !1020)
!1234 = !DILocation(line: 236, column: 25, scope: !1031)
!1235 = distinct !{!1235, !1105, !1236, !916}
!1236 = !DILocation(line: 292, column: 5, scope: !1032)
!1237 = !DILocation(line: 294, column: 10, scope: !1020)
!1238 = !DILocation(line: 295, column: 1, scope: !1020)
!1239 = !DISubprogram(name: "bindtextdomain", scope: !850, file: !850, line: 86, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!116, !122, !122}
!1242 = !DISubprogram(name: "textdomain", scope: !850, file: !850, line: 82, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1243 = !DISubprogram(name: "atexit", scope: !994, file: !994, line: 602, type: !1244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!77, !455}
!1246 = !DISubprogram(name: "getopt_long", scope: !371, file: !371, line: 66, type: !1247, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!77, !77, !1249, !122, !1251, !376}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!1252 = !DISubprogram(name: "rmdir", scope: !1253, file: !1253, line: 867, type: !1156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1253 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1254 = !DISubprogram(name: "__errno_location", scope: !1255, file: !1255, line: 37, type: !1256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1255 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!376}
