; ModuleID = 'src/seq.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.operand = type { x86_fp80, i64, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.9 }
%union.anon.9 = type { x86_fp80 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [104 x i8] c"Usage: %s [OPTION]... LAST\0A  or:  %s [OPTION]... FIRST LAST\0A  or:  %s [OPTION]... FIRST INCREMENT LAST\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [58 x i8] c"Print numbers from FIRST to LAST, in steps of INCREMENT.\0A\00", align 1, !dbg !12

!161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 15)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 606, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 16)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !2, line: 612, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 17)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !2, line: 622, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 69)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 2)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 668, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 33)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 685, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 6)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 688, type: !19, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "equal_width", scope: !64, file: !2, line: 55, type: !111, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !67, line: 736, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 75)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !206, file: !67, line: 575, type: !68, isLocal: true, isDefinition: true)
!206 = distinct !DISubprogram(name: "oputs_", scope: !67, file: !67, line: 573, type: !207, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !209)
!207 = !DISubroutineType(cc: DW_CC_nocall, types: !208)
!208 = !{null, !92, !92}
!209 = !{!210, !211, !212, !215, !216, !217, !218, !222, !223, !224, !225, !227, !278, !279, !280, !282, !283}
!210 = !DILocalVariable(name: "program", arg: 1, scope: !206, file: !67, line: 573, type: !92)
!211 = !DILocalVariable(name: "option", arg: 2, scope: !206, file: !67, line: 573, type: !92)
!212 = !DILocalVariable(name: "term", scope: !213, file: !67, line: 585, type: !92)
!213 = distinct !DILexicalBlock(scope: !214, file: !67, line: 582, column: 5)
!214 = distinct !DILexicalBlock(scope: !206, file: !67, line: 581, column: 7)
!215 = !DILocalVariable(name: "double_space", scope: !206, file: !67, line: 594, type: !111)
!216 = !DILocalVariable(name: "first_word", scope: !206, file: !67, line: 595, type: !92)
!217 = !DILocalVariable(name: "option_text", scope: !206, file: !67, line: 596, type: !92)
!218 = !DILocalVariable(name: "s", scope: !219, file: !67, line: 608, type: !92)
!219 = distinct !DILexicalBlock(scope: !220, file: !67, line: 605, column: 5)
!220 = distinct !DILexicalBlock(scope: !221, file: !67, line: 604, column: 12)
!221 = distinct !DILexicalBlock(scope: !206, file: !67, line: 597, column: 7)
!222 = !DILocalVariable(name: "spaces", scope: !219, file: !67, line: 609, type: !137)
!223 = !DILocalVariable(name: "anchor_len", scope: !206, file: !67, line: 620, type: !137)
!224 = !DILocalVariable(name: "desc_text", scope: !206, file: !67, line: 625, type: !92)
!225 = !DILocalVariable(name: "__ptr", scope: !226, file: !67, line: 644, type: !92)
!226 = distinct !DILexicalBlock(scope: !206, file: !67, line: 644, column: 3)
!227 = !DILocalVariable(name: "__stream", scope: !226, file: !67, line: 644, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !230, line: 7, baseType: !231)
!230 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !232, line: 49, size: 1728, elements: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !249, !251, !252, !253, !255, !256, !258, !259, !262, !264, !267, !270, !271, !272, !273, !274}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !231, file: !232, line: 51, baseType: !68, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !231, file: !232, line: 54, baseType: !114, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !231, file: !232, line: 55, baseType: !114, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !231, file: !232, line: 56, baseType: !114, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !231, file: !232, line: 57, baseType: !114, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !231, file: !232, line: 58, baseType: !114, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !231, file: !232, line: 59, baseType: !114, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !231, file: !232, line: 60, baseType: !114, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !231, file: !232, line: 61, baseType: !114, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !231, file: !232, line: 64, baseType: !114, size: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !231, file: !232, line: 65, baseType: !114, size: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !231, file: !232, line: 66, baseType: !114, size: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !231, file: !232, line: 68, baseType: !247, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !232, line: 36, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !231, file: !232, line: 70, baseType: !250, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !231, file: !232, line: 72, baseType: !68, size: 32, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !231, file: !232, line: 73, baseType: !68, size: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !231, file: !232, line: 74, baseType: !254, size: 64, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !108)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !231, file: !232, line: 77, baseType: !136, size: 16, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !231, file: !232, line: 78, baseType: !257, size: 8, offset: 1040)
!257 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !231, file: !232, line: 79, baseType: !59, size: 8, offset: 1048)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !231, file: !232, line: 81, baseType: !260, size: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !232, line: 43, baseType: null)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !231, file: !232, line: 89, baseType: !263, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !108)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !231, file: !232, line: 91, baseType: !265, size: 64, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !232, line: 37, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !231, file: !232, line: 92, baseType: !268, size: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !232, line: 38, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !231, file: !232, line: 93, baseType: !250, size: 64, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !231, file: !232, line: 94, baseType: !135, size: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !231, file: !232, line: 95, baseType: !137, size: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !231, file: !232, line: 96, baseType: !68, size: 32, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !231, file: !232, line: 98, baseType: !275, size: 160, offset: 1568)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 20)
!278 = !DILocalVariable(name: "__cnt", scope: !226, file: !67, line: 644, type: !137)
!279 = !DILocalVariable(name: "url_program", scope: !206, file: !67, line: 648, type: !92)
!280 = !DILocalVariable(name: "__ptr", scope: !281, file: !67, line: 686, type: !92)
!281 = distinct !DILexicalBlock(scope: !206, file: !67, line: 686, column: 3)
!282 = !DILocalVariable(name: "__stream", scope: !281, file: !67, line: 686, type: !228)
!283 = !DILocalVariable(name: "__cnt", scope: !281, file: !67, line: 686, type: !137)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !67, line: 585, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 5)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !67, line: 586, type: !286, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !67, line: 595, type: !19, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !67, line: 620, type: !192, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !67, line: 648, type: !182, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !67, line: 648, type: !286, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !67, line: 649, type: !19, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !67, line: 649, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 3)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !67, line: 650, type: !286, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !67, line: 651, type: !192, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !67, line: 651, type: !192, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !67, line: 652, type: !152, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !67, line: 653, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 8)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !67, line: 654, type: !142, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !67, line: 655, type: !142, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !67, line: 656, type: !142, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !67, line: 657, type: !142, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !67, line: 663, type: !152, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !67, line: 664, type: !142, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !67, line: 669, type: !172, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !67, line: 669, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 40)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !162, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 61)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !67, line: 679, type: !303, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !67, line: 683, type: !286, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !67, line: 688, type: !286, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !67, line: 691, type: !316, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !67, line: 839, type: !167, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !67, line: 840, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 22)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !67, line: 841, type: !162, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !67, line: 862, type: !19, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !67, line: 868, type: !24, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !67, line: 875, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 27)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 51)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 12)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !378, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !152, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !142, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !286, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !316, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "long_options", scope: !64, file: !2, line: 64, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 1536, elements: !193)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !396, line: 50, size: 256, elements: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!397 = !{!398, !399, !400, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !396, line: 52, baseType: !92, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !395, file: !396, line: 55, baseType: !68, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !396, line: 56, baseType: !401, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !395, file: !396, line: 57, baseType: !68, size: 32, offset: 192)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !182, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "separator", scope: !64, file: !2, line: 58, type: !92, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 30)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !152, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 11)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 21)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 9)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 37)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !431, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !67, line: 952, type: !378, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "terminator", scope: !64, file: !2, line: 62, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 16, elements: !183)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 36)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !147, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 13)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !303, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !303, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "format_buf", scope: !459, file: !2, line: 375, type: !484, isLocal: true, isDefinition: true)
!459 = distinct !DISubprogram(name: "get_default_format", scope: !2, file: !2, line: 373, type: !460, scopeLine: 374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !469)
!460 = !DISubroutineType(types: !461)
!461 = !{!92, !462, !462, !462}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "operand", file: !2, line: 143, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "operand", file: !2, line: 128, size: 256, elements: !464)
!464 = !{!465, !467, !468}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !463, file: !2, line: 131, baseType: !466, size: 128)
!466 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !463, file: !2, line: 137, baseType: !137, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !463, file: !2, line: 141, baseType: !68, size: 32, offset: 192)
!469 = !{!470, !471, !472, !473, !474, !479, !480, !481}
!470 = !DILocalVariable(name: "first", arg: 1, scope: !459, file: !2, line: 373, type: !462)
!471 = !DILocalVariable(name: "step", arg: 2, scope: !459, file: !2, line: 373, type: !462)
!472 = !DILocalVariable(name: "last", arg: 3, scope: !459, file: !2, line: 373, type: !462)
!473 = !DILocalVariable(name: "prec", scope: !459, file: !2, line: 377, type: !68)
!474 = !DILocalVariable(name: "first_width", scope: !475, file: !2, line: 384, type: !137)
!475 = distinct !DILexicalBlock(scope: !476, file: !2, line: 382, column: 9)
!476 = distinct !DILexicalBlock(scope: !477, file: !2, line: 381, column: 11)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 380, column: 5)
!478 = distinct !DILexicalBlock(scope: !459, file: !2, line: 379, column: 7)
!479 = !DILocalVariable(name: "last_width", scope: !475, file: !2, line: 386, type: !137)
!480 = !DILocalVariable(name: "width", scope: !475, file: !2, line: 393, type: !137)
!481 = !DILocalVariable(name: "w", scope: !482, file: !2, line: 396, type: !68)
!482 = distinct !DILexicalBlock(scope: !483, file: !2, line: 395, column: 13)
!483 = distinct !DILexicalBlock(scope: !475, file: !2, line: 394, column: 15)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 28)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 397, type: !416, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !316, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !2, line: 408, type: !19, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !2, line: 334, type: !182, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3, type: !162, isLocal: true, isDefinition: true)
!498 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "Version", scope: !501, file: !498, line: 3, type: !92, isLocal: false, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C11, file: !498, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !502, splitDebugInlining: false, nameTableKind: None)
!502 = !{!496, !499}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "file_name", scope: !505, file: !506, line: 45, type: !92, isLocal: true, isDefinition: true)
!505 = distinct !DICompileUnit(language: DW_LANG_C11, file: !506, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !507, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!507 = !{!508, !510, !512, !514, !503, !516}
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !506, line: 121, type: !152, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !506, line: 121, type: !378, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !506, line: 123, type: !152, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !506, line: 126, type: !303, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !505, file: !506, line: 55, type: !111, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !520, file: !521, line: 66, type: !564, isLocal: false, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C11, file: !521, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !522, globals: !523, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!522 = !{!135, !138}
!523 = !{!524, !526, !546, !548, !550, !552, !518, !554, !556, !558, !560, !562}
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !521, line: 272, type: !286, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "old_file_name", scope: !528, file: !521, line: 304, type: !92, isLocal: true, isDefinition: true)
!528 = distinct !DISubprogram(name: "verror_at_line", scope: !521, file: !521, line: 298, type: !529, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !520, retainedNodes: !539)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !68, !68, !92, !74, !92, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !533)
!533 = !{!534, !536, !537, !538}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !532, file: !535, baseType: !74, size: 32)
!535 = !DIFile(filename: "lib/error.c", directory: "/src")
!536 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !532, file: !535, baseType: !74, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !532, file: !535, baseType: !135, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !532, file: !535, baseType: !135, size: 64, offset: 128)
!539 = !{!540, !541, !542, !543, !544, !545}
!540 = !DILocalVariable(name: "status", arg: 1, scope: !528, file: !521, line: 298, type: !68)
!541 = !DILocalVariable(name: "errnum", arg: 2, scope: !528, file: !521, line: 298, type: !68)
!542 = !DILocalVariable(name: "file_name", arg: 3, scope: !528, file: !521, line: 298, type: !92)
!543 = !DILocalVariable(name: "line_number", arg: 4, scope: !528, file: !521, line: 298, type: !74)
!544 = !DILocalVariable(name: "message", arg: 5, scope: !528, file: !521, line: 298, type: !92)
!545 = !DILocalVariable(name: "args", arg: 6, scope: !528, file: !521, line: 298, type: !531)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "old_line_number", scope: !528, file: !521, line: 305, type: !74, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !521, line: 338, type: !19, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !521, line: 346, type: !316, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !521, line: 346, type: !182, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "error_message_count", scope: !520, file: !521, line: 69, type: !74, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !520, file: !521, line: 295, type: !68, isLocal: false, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !521, line: 208, type: !152, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !521, line: 208, type: !421, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !521, line: 214, type: !286, isLocal: true, isDefinition: true)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null}
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "program_name", scope: !569, file: !570, line: 31, type: !92, isLocal: false, isDefinition: true)
!569 = distinct !DICompileUnit(language: DW_LANG_C11, file: !570, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !571, globals: !572, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!571 = !{!114}
!572 = !{!567, !573, !575}
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !570, line: 46, type: !316, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !570, line: 49, type: !19, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "utf07FF", scope: !579, file: !580, line: 46, type: !440, isLocal: true, isDefinition: true)
!579 = distinct !DISubprogram(name: "proper_name_lite", scope: !580, file: !580, line: 38, type: !581, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !583, retainedNodes: !585)
!580 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!581 = !DISubroutineType(types: !582)
!582 = !{!92, !92, !92}
!583 = distinct !DICompileUnit(language: DW_LANG_C11, file: !580, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !584, splitDebugInlining: false, nameTableKind: None)
!584 = !{!577}
!585 = !{!586, !587, !588, !589, !594}
!586 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !579, file: !580, line: 38, type: !92)
!587 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !579, file: !580, line: 38, type: !92)
!588 = !DILocalVariable(name: "translation", scope: !579, file: !580, line: 40, type: !92)
!589 = !DILocalVariable(name: "w", scope: !579, file: !580, line: 47, type: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !591, line: 37, baseType: !592)
!591 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !97, line: 57, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !97, line: 42, baseType: !74)
!594 = !DILocalVariable(name: "mbs", scope: !579, file: !580, line: 48, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !596, line: 6, baseType: !597)
!596 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !598, line: 21, baseType: !599)
!598 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 13, size: 64, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !599, file: !598, line: 15, baseType: !68, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !599, file: !598, line: 20, baseType: !603, size: 32, offset: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !599, file: !598, line: 16, size: 32, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !603, file: !598, line: 18, baseType: !74, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !603, file: !598, line: 19, baseType: !19, size: 32)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !609, line: 78, type: !316, isLocal: true, isDefinition: true)
!609 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !609, line: 79, type: !192, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !609, line: 80, type: !450, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !609, line: 81, type: !450, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !609, line: 82, type: !275, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !609, line: 83, type: !182, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !609, line: 84, type: !316, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !609, line: 85, type: !152, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !609, line: 86, type: !152, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !609, line: 87, type: !316, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !630, file: !609, line: 76, type: !716, isLocal: false, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C11, file: !609, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !631, retainedTypes: !651, globals: !652, splitDebugInlining: false, nameTableKind: None)
!631 = !{!632, !646, !72}
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !633, line: 42, baseType: !74, size: 32, elements: !634)
!633 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!635 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!636 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!637 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!638 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!639 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!640 = !DIEnumerator(name: "c_quoting_style", value: 5)
!641 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!642 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!643 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!644 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!645 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !633, line: 254, baseType: !74, size: 32, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!649 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!650 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!651 = !{!68, !136, !137}
!652 = !{!607, !610, !612, !614, !616, !618, !620, !622, !624, !626, !628, !653, !657, !667, !669, !674, !676, !678, !680, !682, !705, !712, !714}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !630, file: !609, line: 92, type: !655, isLocal: false, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 320, elements: !143)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !630, file: !609, line: 1040, type: !659, isLocal: false, isDefinition: true)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !609, line: 56, size: 448, elements: !660)
!660 = !{!661, !662, !663, !665, !666}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !659, file: !609, line: 59, baseType: !632, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !659, file: !609, line: 62, baseType: !68, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !659, file: !609, line: 66, baseType: !664, size: 256, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !317)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !659, file: !609, line: 69, baseType: !92, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !659, file: !609, line: 72, baseType: !92, size: 64, offset: 384)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !630, file: !609, line: 107, type: !659, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "slot0", scope: !630, file: !609, line: 831, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 256)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !609, line: 321, type: !182, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !609, line: 357, type: !182, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !609, line: 358, type: !182, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !609, line: 199, type: !152, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "quote", scope: !684, file: !609, line: 228, type: !703, isLocal: true, isDefinition: true)
!684 = distinct !DISubprogram(name: "gettext_quote", scope: !609, file: !609, line: 197, type: !685, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !630, retainedNodes: !687)
!685 = !DISubroutineType(types: !686)
!686 = !{!92, !92, !632}
!687 = !{!688, !689, !690, !691, !692}
!688 = !DILocalVariable(name: "msgid", arg: 1, scope: !684, file: !609, line: 197, type: !92)
!689 = !DILocalVariable(name: "s", arg: 2, scope: !684, file: !609, line: 197, type: !632)
!690 = !DILocalVariable(name: "translation", scope: !684, file: !609, line: 199, type: !92)
!691 = !DILocalVariable(name: "w", scope: !684, file: !609, line: 229, type: !590)
!692 = !DILocalVariable(name: "mbs", scope: !684, file: !609, line: 230, type: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !596, line: 6, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !598, line: 21, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 13, size: 64, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !695, file: !598, line: 15, baseType: !68, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !695, file: !598, line: 20, baseType: !699, size: 32, offset: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !695, file: !598, line: 16, size: 32, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !699, file: !598, line: 18, baseType: !74, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !699, file: !598, line: 19, baseType: !19, size: 32)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 64, elements: !704)
!704 = !{!184, !21}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "slotvec", scope: !630, file: !609, line: 834, type: !707, isLocal: true, isDefinition: true)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !609, line: 823, size: 128, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !708, file: !609, line: 825, baseType: !137, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !708, file: !609, line: 826, baseType: !114, size: 64, offset: 64)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "nslots", scope: !630, file: !609, line: 832, type: !68, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "slotvec0", scope: !630, file: !609, line: 833, type: !708, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 704, elements: !417)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !720, line: 67, type: !378, isLocal: true, isDefinition: true)
!720 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !720, line: 69, type: !152, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !720, line: 83, type: !152, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !720, line: 83, type: !19, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !720, line: 85, type: !182, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !720, line: 88, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 171)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !720, line: 88, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 34)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !720, line: 105, type: !167, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !720, line: 109, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 23)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !720, line: 113, type: !484, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !720, line: 120, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 32)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !720, line: 127, type: !443, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !720, line: 134, type: !335, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !720, line: 142, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 44)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !720, line: 150, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 48)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !720, line: 159, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 52)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !720, line: 170, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 60)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !720, line: 248, type: !275, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !720, line: 248, type: !357, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !720, line: 254, type: !275, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !720, line: 254, type: !157, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !720, line: 254, type: !335, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !720, line: 259, type: !3, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !720, line: 259, type: !791, isLocal: true, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 29)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !796, file: !797, line: 26, type: !799, isLocal: false, isDefinition: true)
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !798, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!798 = !{!794}
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 376, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 47)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "exit_failure", scope: !804, file: !805, line: 24, type: !807, isLocal: false, isDefinition: true)
!804 = distinct !DICompileUnit(language: DW_LANG_C11, file: !805, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !806, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!806 = !{!802}
!807 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !810, line: 34, type: !303, isLocal: true, isDefinition: true)
!810 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !810, line: 34, type: !152, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !810, line: 34, type: !172, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !817, file: !843, line: 58, type: !844, isLocal: true, isDefinition: true)
!817 = distinct !DICompileUnit(language: DW_LANG_C11, file: !818, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !819, globals: !840, splitDebugInlining: false, nameTableKind: None)
!818 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!819 = !{!114, !820}
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !821, line: 24, baseType: !822)
!821 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !823, line: 41, baseType: !824)
!823 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !823, line: 27, size: 1856, elements: !826)
!826 = !{!827, !831, !834, !837, !838}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !825, file: !823, line: 30, baseType: !828, size: 832)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 832, elements: !451)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !823, line: 30, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !825, file: !823, line: 33, baseType: !832, size: 64, offset: 832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !825, file: !823, line: 34, baseType: !835, size: 64, offset: 896)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !825, file: !823, line: 35, baseType: !835, size: 64, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !825, file: !823, line: 38, baseType: !839, size: 832, offset: 1024)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 832, elements: !451)
!840 = !{!841, !815}
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !843, line: 66, type: !182, isLocal: true, isDefinition: true)
!843 = !DIFile(filename: "./lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!844 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !820)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !847, line: 108, type: !59, isLocal: true, isDefinition: true)
!847 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "internal_state", scope: !850, file: !847, line: 97, type: !853, isLocal: true, isDefinition: true)
!850 = distinct !DICompileUnit(language: DW_LANG_C11, file: !847, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !851, globals: !852, splitDebugInlining: false, nameTableKind: None)
!851 = !{!135, !137, !138}
!852 = !{!845, !848}
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !596, line: 6, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !598, line: 21, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 13, size: 64, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !855, file: !598, line: 15, baseType: !68, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !855, file: !598, line: 20, baseType: !859, size: 32, offset: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !598, line: 16, size: 32, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !859, file: !598, line: 18, baseType: !74, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !859, file: !598, line: 19, baseType: !19, size: 32)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !865, line: 121, type: !303, isLocal: true, isDefinition: true)
!865 = !DIFile(filename: "lib/xvasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "52fb1fd224f1e06f67bcb38ca55c75a7")
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !865, line: 124, type: !868, isLocal: true, isDefinition: true)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 41)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !873, line: 4617, type: !19, isLocal: true, isDefinition: true)
!873 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !873, line: 5292, type: !192, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "decimal_format", scope: !878, file: !873, line: 5889, type: !1339, isLocal: true, isDefinition: true)
!878 = distinct !DISubprogram(name: "vasnprintf", scope: !873, file: !873, line: 2459, type: !879, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !890, retainedNodes: !1424)
!879 = !DISubroutineType(types: !880)
!880 = !{!114, !114, !881, !92, !882}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !884)
!884 = !{!885, !887, !888, !889}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !883, file: !886, baseType: !74, size: 32)
!886 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src")
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !883, file: !886, baseType: !74, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !883, file: !886, baseType: !135, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !883, file: !886, baseType: !135, size: 64, offset: 128)
!890 = distinct !DICompileUnit(language: DW_LANG_C11, file: !873, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !891, retainedTypes: !1328, globals: !1336, splitDebugInlining: false, nameTableKind: None)
!891 = !{!892, !942}
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 47, baseType: !74, size: 32, elements: !894)
!893 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!895 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!896 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!897 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!898 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!899 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!900 = !DIEnumerator(name: "TYPE_INT", value: 5)
!901 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!902 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!903 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!904 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!905 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!906 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!907 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!908 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!909 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!910 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!911 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!912 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!913 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!914 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!915 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!916 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!917 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!918 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!919 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!920 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!921 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!922 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!923 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!924 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!925 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!926 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!927 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!928 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!929 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!930 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!931 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!932 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!933 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!934 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!935 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!936 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!937 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!938 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!939 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!940 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!941 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !943, line: 41, baseType: !74, size: 32, elements: !944)
!943 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!945 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!946 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!947 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!948 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!949 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!950 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!951 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!952 = !DIEnumerator(name: "DAY_1", value: 131079)
!953 = !DIEnumerator(name: "DAY_2", value: 131080)
!954 = !DIEnumerator(name: "DAY_3", value: 131081)
!955 = !DIEnumerator(name: "DAY_4", value: 131082)
!956 = !DIEnumerator(name: "DAY_5", value: 131083)
!957 = !DIEnumerator(name: "DAY_6", value: 131084)
!958 = !DIEnumerator(name: "DAY_7", value: 131085)
!959 = !DIEnumerator(name: "ABMON_1", value: 131086)
!960 = !DIEnumerator(name: "ABMON_2", value: 131087)
!961 = !DIEnumerator(name: "ABMON_3", value: 131088)
!962 = !DIEnumerator(name: "ABMON_4", value: 131089)
!963 = !DIEnumerator(name: "ABMON_5", value: 131090)
!964 = !DIEnumerator(name: "ABMON_6", value: 131091)
!965 = !DIEnumerator(name: "ABMON_7", value: 131092)
!966 = !DIEnumerator(name: "ABMON_8", value: 131093)
!967 = !DIEnumerator(name: "ABMON_9", value: 131094)
!968 = !DIEnumerator(name: "ABMON_10", value: 131095)
!969 = !DIEnumerator(name: "ABMON_11", value: 131096)
!970 = !DIEnumerator(name: "ABMON_12", value: 131097)
!971 = !DIEnumerator(name: "MON_1", value: 131098)
!972 = !DIEnumerator(name: "MON_2", value: 131099)
!973 = !DIEnumerator(name: "MON_3", value: 131100)
!974 = !DIEnumerator(name: "MON_4", value: 131101)
!975 = !DIEnumerator(name: "MON_5", value: 131102)
!976 = !DIEnumerator(name: "MON_6", value: 131103)
!977 = !DIEnumerator(name: "MON_7", value: 131104)
!978 = !DIEnumerator(name: "MON_8", value: 131105)
!979 = !DIEnumerator(name: "MON_9", value: 131106)
!980 = !DIEnumerator(name: "MON_10", value: 131107)
!981 = !DIEnumerator(name: "MON_11", value: 131108)
!982 = !DIEnumerator(name: "MON_12", value: 131109)
!983 = !DIEnumerator(name: "AM_STR", value: 131110)
!984 = !DIEnumerator(name: "PM_STR", value: 131111)
!985 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!986 = !DIEnumerator(name: "D_FMT", value: 131113)
!987 = !DIEnumerator(name: "T_FMT", value: 131114)
!988 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!989 = !DIEnumerator(name: "ERA", value: 131116)
!990 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!991 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!992 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!993 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!994 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!995 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!996 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!997 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!998 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!999 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!1000 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!1001 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!1002 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!1003 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!1004 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!1005 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!1006 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!1007 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!1008 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!1009 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!1010 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!1011 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!1012 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!1013 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!1014 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!1015 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!1016 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!1017 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!1018 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!1019 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!1020 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!1021 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!1022 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!1023 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!1024 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!1025 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!1026 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!1027 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!1028 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!1029 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!1030 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!1031 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!1032 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!1033 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!1034 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!1035 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!1036 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!1037 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!1038 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!1039 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!1040 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!1041 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!1042 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!1043 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!1044 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!1045 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!1046 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!1047 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!1048 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!1049 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!1050 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!1051 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!1052 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!1053 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!1054 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!1055 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!1056 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!1057 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!1058 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!1059 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!1060 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!1061 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!1062 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!1063 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!1064 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!1065 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!1066 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!1067 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!1068 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!1069 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!1070 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!1071 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!1072 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!1073 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!1074 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!1075 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!1076 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!1077 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!1078 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!1079 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!1080 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!1081 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!1082 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!1083 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!1084 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!1085 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!1086 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!1087 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!1088 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!1089 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!1090 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!1091 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!1092 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!1093 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!1094 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!1095 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!1096 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!1097 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!1098 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!1099 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!1100 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!1101 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!1102 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!1103 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!1104 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!1105 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!1106 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!1107 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!1108 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!1109 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!1110 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!1111 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!1112 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!1113 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!1114 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!1115 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!1116 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!1117 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!1118 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!1119 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!1120 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!1121 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!1122 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!1123 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!1124 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!1125 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!1126 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!1127 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!1128 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!1129 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!1130 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!1131 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!1132 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!1133 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!1134 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!1135 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!1136 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!1137 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!1138 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!1139 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!1140 = !DIEnumerator(name: "CODESET", value: 14)
!1141 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!1142 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!1143 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!1144 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!1145 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!1146 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!1147 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!1148 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!1149 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!1150 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!1151 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!1152 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!1153 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!1154 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!1155 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!1156 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!1157 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!1158 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!1159 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!1160 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!1161 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!1162 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!1163 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!1164 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!1165 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!1166 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!1167 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!1168 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!1169 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!1170 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!1171 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!1172 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!1173 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!1174 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!1175 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!1176 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!1177 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!1178 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!1179 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!1180 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!1181 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!1182 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!1183 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!1184 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!1185 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!1186 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!1187 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!1188 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!1189 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!1190 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!1191 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!1192 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!1193 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!1194 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!1195 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!1196 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!1197 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!1198 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!1199 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!1200 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!1201 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!1202 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!1203 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!1204 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!1205 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!1206 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!1207 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!1208 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!1209 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!1210 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!1211 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!1212 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!1213 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!1214 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!1215 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!1216 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!1217 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!1218 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!1219 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!1220 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!1221 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!1222 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!1223 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!1224 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!1225 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!1226 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!1227 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!1228 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!1229 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!1230 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!1231 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!1232 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!1233 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!1234 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!1235 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!1236 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!1237 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!1238 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!1239 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!1240 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!1241 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!1242 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!1243 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!1244 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!1245 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!1246 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!1247 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!1248 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!1249 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!1250 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!1251 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!1252 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!1253 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!1254 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!1255 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!1256 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!1257 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!1258 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!1259 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!1260 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!1261 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!1262 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!1263 = !DIEnumerator(name: "THOUSEP", value: 65537)
!1264 = !DIEnumerator(name: "__GROUPING", value: 65538)
!1265 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!1266 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!1267 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!1268 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!1269 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!1270 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!1271 = !DIEnumerator(name: "__YESSTR", value: 327682)
!1272 = !DIEnumerator(name: "__NOSTR", value: 327683)
!1273 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!1274 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!1275 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!1276 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!1277 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!1278 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!1279 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!1280 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!1281 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!1282 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!1283 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!1284 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!1285 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!1286 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!1287 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!1288 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!1289 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!1290 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!1291 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!1292 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!1293 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!1294 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!1295 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!1296 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!1297 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!1298 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!1299 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!1300 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!1301 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!1302 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!1303 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!1304 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!1305 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!1306 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!1307 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!1308 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!1309 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!1310 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!1311 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!1312 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!1313 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!1314 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!1315 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!1316 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!1317 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!1318 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!1319 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!1320 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!1321 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!1322 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!1323 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!1324 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!1325 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!1326 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!1327 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!1328 = !{!114, !137, !135, !92, !74, !466, !68, !1329, !108, !1330, !1331, !1332, !1334}
!1329 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_limb_t", file: !873, line: 700, baseType: !74)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_twolimb_t", file: !873, line: 704, baseType: !1333)
!1333 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!1336 = !{!871, !874, !876, !1337, !1340}
!1337 = !DIGlobalVariableExpression(var: !1338, expr: !DIExpression())
!1338 = distinct !DIGlobalVariable(name: "decimal_format", scope: !878, file: !873, line: 6151, type: !1339, isLocal: true, isDefinition: true)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 48, elements: !193)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(name: "small_pow5", scope: !1342, file: !873, line: 1479, type: !1423, isLocal: true, isDefinition: true)
!1342 = distinct !DISubprogram(name: "scale10_round_decimal_decoded", scope: !873, file: !873, line: 1443, type: !1343, scopeLine: 1444, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !890, retainedNodes: !1350)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!114, !68, !1345, !135, !68}
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpn_t", file: !873, line: 713, baseType: !1346)
