; ModuleID = 'src/shuf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.linebuffer = type { i64, i64, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.randint_source = type { ptr, i64, i64 }
%struct.randread_source = type { ptr, ptr, ptr, %union.anon.6 }
%union.anon.6 = type { %struct.isaac }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%union.anon.0 = type { [256 x i64] }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 33)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 503, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 17)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 528, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 2)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !212, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 530, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 3)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 556, type: !71, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 11)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 577, type: !212, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 19)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !98, line: 729, type: !34, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !98, line: 736, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 75)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !245, file: !98, line: 575, type: !99, isLocal: true, isDefinition: true)
!245 = distinct !DISubprogram(name: "oputs_", scope: !98, file: !98, line: 573, type: !246, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !248)
!246 = !DISubroutineType(cc: DW_CC_nocall, types: !247)
!247 = !{null, !151, !151}
!248 = !{!249, !250, !251, !254, !256, !257, !258, !262, !263, !264, !265, !267, !314, !315, !316, !318, !319}
!249 = !DILocalVariable(name: "program", arg: 1, scope: !245, file: !98, line: 573, type: !151)
!250 = !DILocalVariable(name: "option", arg: 2, scope: !245, file: !98, line: 573, type: !151)
!251 = !DILocalVariable(name: "term", scope: !252, file: !98, line: 585, type: !151)
!252 = distinct !DILexicalBlock(scope: !253, file: !98, line: 582, column: 5)
!253 = distinct !DILexicalBlock(scope: !245, file: !98, line: 581, column: 7)
!254 = !DILocalVariable(name: "double_space", scope: !245, file: !98, line: 594, type: !255)
!255 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!256 = !DILocalVariable(name: "first_word", scope: !245, file: !98, line: 595, type: !151)
!257 = !DILocalVariable(name: "option_text", scope: !245, file: !98, line: 596, type: !151)
!258 = !DILocalVariable(name: "s", scope: !259, file: !98, line: 608, type: !151)
!259 = distinct !DILexicalBlock(scope: !260, file: !98, line: 605, column: 5)
!260 = distinct !DILexicalBlock(scope: !261, file: !98, line: 604, column: 12)
!261 = distinct !DILexicalBlock(scope: !245, file: !98, line: 597, column: 7)
!262 = !DILocalVariable(name: "spaces", scope: !259, file: !98, line: 609, type: !148)
!263 = !DILocalVariable(name: "anchor_len", scope: !245, file: !98, line: 620, type: !148)
!264 = !DILocalVariable(name: "desc_text", scope: !245, file: !98, line: 625, type: !151)
!265 = !DILocalVariable(name: "__ptr", scope: !266, file: !98, line: 644, type: !151)
!266 = distinct !DILexicalBlock(scope: !245, file: !98, line: 644, column: 3)
!267 = !DILocalVariable(name: "__stream", scope: !266, file: !98, line: 644, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !270, line: 7, baseType: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !272, line: 49, size: 1728, elements: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !289, !291, !292, !293, !294, !295, !297, !298, !301, !303, !306, !309, !310, !311, !312, !313}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !271, file: !272, line: 51, baseType: !99, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !271, file: !272, line: 54, baseType: !145, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !271, file: !272, line: 55, baseType: !145, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !271, file: !272, line: 56, baseType: !145, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !271, file: !272, line: 57, baseType: !145, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !271, file: !272, line: 58, baseType: !145, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !271, file: !272, line: 59, baseType: !145, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !271, file: !272, line: 60, baseType: !145, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !271, file: !272, line: 61, baseType: !145, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !271, file: !272, line: 64, baseType: !145, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !271, file: !272, line: 65, baseType: !145, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !271, file: !272, line: 66, baseType: !145, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !271, file: !272, line: 68, baseType: !287, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !272, line: 36, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !271, file: !272, line: 70, baseType: !290, size: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !271, file: !272, line: 72, baseType: !99, size: 32, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !271, file: !272, line: 73, baseType: !99, size: 32, offset: 928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !271, file: !272, line: 74, baseType: !156, size: 64, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !271, file: !272, line: 77, baseType: !147, size: 16, offset: 1024)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !271, file: !272, line: 78, baseType: !296, size: 8, offset: 1040)
!296 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !271, file: !272, line: 79, baseType: !66, size: 8, offset: 1048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !271, file: !272, line: 81, baseType: !299, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !272, line: 43, baseType: null)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !271, file: !272, line: 89, baseType: !302, size: 64, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !157, line: 153, baseType: !158)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !271, file: !272, line: 91, baseType: !304, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !272, line: 37, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !271, file: !272, line: 92, baseType: !307, size: 64, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !272, line: 38, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !271, file: !272, line: 93, baseType: !290, size: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !271, file: !272, line: 94, baseType: !146, size: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !271, file: !272, line: 95, baseType: !148, size: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !271, file: !272, line: 96, baseType: !99, size: 32, offset: 1536)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !271, file: !272, line: 98, baseType: !172, size: 160, offset: 1568)
!314 = !DILocalVariable(name: "__cnt", scope: !266, file: !98, line: 644, type: !148)
!315 = !DILocalVariable(name: "url_program", scope: !245, file: !98, line: 648, type: !151)
!316 = !DILocalVariable(name: "__ptr", scope: !317, file: !98, line: 686, type: !151)
!317 = distinct !DILexicalBlock(scope: !245, file: !98, line: 686, column: 3)
!318 = !DILocalVariable(name: "__stream", scope: !317, file: !98, line: 686, type: !268)
!319 = !DILocalVariable(name: "__cnt", scope: !317, file: !98, line: 686, type: !148)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !98, line: 585, type: !19, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !98, line: 586, type: !19, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !98, line: 595, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 4)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !98, line: 620, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 6)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !98, line: 648, type: !212, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !98, line: 648, type: !19, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !98, line: 649, type: !326, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !98, line: 649, type: !219, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !98, line: 650, type: !19, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !98, line: 651, type: !331, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !98, line: 651, type: !331, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !98, line: 652, type: !167, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !98, line: 653, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !98, line: 654, type: !71, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !98, line: 655, type: !71, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !98, line: 656, type: !71, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !98, line: 657, type: !71, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !98, line: 663, type: !167, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !98, line: 664, type: !71, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !98, line: 669, type: !207, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !98, line: 669, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 40)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !98, line: 676, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 15)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !98, line: 676, type: !24, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !98, line: 679, type: !219, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !98, line: 683, type: !19, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !98, line: 688, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !98, line: 691, type: !352, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !98, line: 839, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 16)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !98, line: 840, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 22)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !98, line: 841, type: !376, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !98, line: 862, type: !326, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !98, line: 868, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 71)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !98, line: 875, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 27)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !98, line: 877, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 51)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !98, line: 877, type: !197, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !19, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !197, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !226, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !167, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !192, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !167, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !391, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !19, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !352, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 21)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !98, line: 952, type: !197, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 2560, elements: !72)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !448, line: 50, size: 256, elements: !449)
!448 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!449 = !{!450, !451, !452, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !448, line: 52, baseType: !151, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !447, file: !448, line: 55, baseType: !99, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !448, line: 56, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !447, file: !448, line: 57, baseType: !99, size: 32, offset: 192)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !457, line: 3, type: !376, isLocal: true, isDefinition: true)
!457 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "Version", scope: !460, file: !457, line: 3, type: !151, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !457, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !461, splitDebugInlining: false, nameTableKind: None)
!461 = !{!455, !458}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "file_name", scope: !464, file: !465, line: 45, type: !151, isLocal: true, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C11, file: !465, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !466, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!466 = !{!467, !469, !471, !473, !462, !475}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !167, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !197, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !465, line: 123, type: !167, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !465, line: 126, type: !219, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !464, file: !465, line: 55, type: !255, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !479, file: !480, line: 66, type: !523, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C11, file: !480, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!481 = !{!146, !153}
!482 = !{!483, !485, !505, !507, !509, !511, !477, !513, !515, !517, !519, !521}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !480, line: 272, type: !19, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "old_file_name", scope: !487, file: !480, line: 304, type: !151, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "verror_at_line", scope: !480, file: !480, line: 298, type: !488, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !498)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !99, !99, !151, !87, !151, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !492)
!492 = !{!493, !495, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !491, file: !494, baseType: !87, size: 32)
!494 = !DIFile(filename: "lib/error.c", directory: "/src")
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !491, file: !494, baseType: !87, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !491, file: !494, baseType: !146, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !491, file: !494, baseType: !146, size: 64, offset: 128)
!498 = !{!499, !500, !501, !502, !503, !504}
!499 = !DILocalVariable(name: "status", arg: 1, scope: !487, file: !480, line: 298, type: !99)
!500 = !DILocalVariable(name: "errnum", arg: 2, scope: !487, file: !480, line: 298, type: !99)
!501 = !DILocalVariable(name: "file_name", arg: 3, scope: !487, file: !480, line: 298, type: !151)
!502 = !DILocalVariable(name: "line_number", arg: 4, scope: !487, file: !480, line: 298, type: !87)
!503 = !DILocalVariable(name: "message", arg: 5, scope: !487, file: !480, line: 298, type: !151)
!504 = !DILocalVariable(name: "args", arg: 6, scope: !487, file: !480, line: 298, type: !490)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "old_line_number", scope: !487, file: !480, line: 305, type: !87, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !480, line: 338, type: !326, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !352, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !212, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "error_message_count", scope: !479, file: !480, line: 69, type: !87, isLocal: false, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !479, file: !480, line: 295, type: !99, isLocal: false, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !167, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !440, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !480, line: 214, type: !19, isLocal: true, isDefinition: true)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !528, line: 40, type: !71, isLocal: true, isDefinition: true)
!528 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "program_name", scope: !531, file: !532, line: 31, type: !151, isLocal: false, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C11, file: !532, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !533, globals: !534, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!533 = !{!145}
!534 = !{!529, !535, !537}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !532, line: 46, type: !352, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !532, line: 49, type: !326, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "utf07FF", scope: !541, file: !542, line: 46, type: !569, isLocal: true, isDefinition: true)
!541 = distinct !DISubprogram(name: "proper_name_lite", scope: !542, file: !542, line: 38, type: !543, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !545, retainedNodes: !547)
!542 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!543 = !DISubroutineType(types: !544)
!544 = !{!151, !151, !151}
!545 = distinct !DICompileUnit(language: DW_LANG_C11, file: !542, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !546, splitDebugInlining: false, nameTableKind: None)
!546 = !{!539}
!547 = !{!548, !549, !550, !551, !556}
!548 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !541, file: !542, line: 38, type: !151)
!549 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !541, file: !542, line: 38, type: !151)
!550 = !DILocalVariable(name: "translation", scope: !541, file: !542, line: 40, type: !151)
!551 = !DILocalVariable(name: "w", scope: !541, file: !542, line: 47, type: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !553, line: 37, baseType: !554)
!553 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !157, line: 57, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !157, line: 42, baseType: !87)
!556 = !DILocalVariable(name: "mbs", scope: !541, file: !542, line: 48, type: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !558, line: 6, baseType: !559)
!558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !560, line: 21, baseType: !561)
!560 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 13, size: 64, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !561, file: !560, line: 15, baseType: !99, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !561, file: !560, line: 20, baseType: !565, size: 32, offset: 32)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !560, line: 16, size: 32, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !565, file: !560, line: 18, baseType: !87, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !565, file: !560, line: 19, baseType: !326, size: 32)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16, elements: !213)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !572, line: 78, type: !352, isLocal: true, isDefinition: true)
!572 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !572, line: 79, type: !331, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !572, line: 80, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 13)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !572, line: 81, type: !577, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !572, line: 82, type: !172, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !572, line: 83, type: !212, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !572, line: 84, type: !352, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !572, line: 85, type: !167, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !572, line: 86, type: !167, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !572, line: 87, type: !352, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !596, file: !572, line: 76, type: !668, isLocal: false, isDefinition: true)
!596 = distinct !DICompileUnit(language: DW_LANG_C11, file: !572, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !597, retainedTypes: !603, globals: !604, splitDebugInlining: false, nameTableKind: None)
!597 = !{!103, !598, !129}
!598 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !104, line: 254, baseType: !87, size: 32, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!601 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!602 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!603 = !{!99, !147, !148}
!604 = !{!570, !573, !575, !580, !582, !584, !586, !588, !590, !592, !594, !605, !609, !619, !621, !626, !628, !630, !632, !634, !657, !664, !666}
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !596, file: !572, line: 92, type: !607, isLocal: false, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 320, elements: !72)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !596, file: !572, line: 1040, type: !611, isLocal: false, isDefinition: true)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !572, line: 56, size: 448, elements: !612)
!612 = !{!613, !614, !615, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !611, file: !572, line: 59, baseType: !103, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !611, file: !572, line: 62, baseType: !99, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !611, file: !572, line: 66, baseType: !616, size: 256, offset: 64)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, elements: !353)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !611, file: !572, line: 69, baseType: !151, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !611, file: !572, line: 72, baseType: !151, size: 64, offset: 384)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !596, file: !572, line: 107, type: !611, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "slot0", scope: !596, file: !572, line: 831, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 256)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !572, line: 321, type: !212, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !572, line: 357, type: !212, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !572, line: 358, type: !212, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !572, line: 199, type: !167, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "quote", scope: !636, file: !572, line: 228, type: !655, isLocal: true, isDefinition: true)
!636 = distinct !DISubprogram(name: "gettext_quote", scope: !572, file: !572, line: 197, type: !637, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !596, retainedNodes: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!151, !151, !103}
!639 = !{!640, !641, !642, !643, !644}
!640 = !DILocalVariable(name: "msgid", arg: 1, scope: !636, file: !572, line: 197, type: !151)
!641 = !DILocalVariable(name: "s", arg: 2, scope: !636, file: !572, line: 197, type: !103)
!642 = !DILocalVariable(name: "translation", scope: !636, file: !572, line: 199, type: !151)
!643 = !DILocalVariable(name: "w", scope: !636, file: !572, line: 229, type: !552)
!644 = !DILocalVariable(name: "mbs", scope: !636, file: !572, line: 230, type: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !558, line: 6, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !560, line: 21, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 13, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !647, file: !560, line: 15, baseType: !99, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !647, file: !560, line: 20, baseType: !651, size: 32, offset: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !647, file: !560, line: 16, size: 32, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !651, file: !560, line: 18, baseType: !87, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !651, file: !560, line: 19, baseType: !326, size: 32)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !656)
!656 = !{!214, !328}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "slotvec", scope: !596, file: !572, line: 834, type: !659, isLocal: true, isDefinition: true)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !572, line: 823, size: 128, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !572, line: 825, baseType: !148, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !660, file: !572, line: 826, baseType: !145, size: 64, offset: 64)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "nslots", scope: !596, file: !572, line: 832, type: !99, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "slotvec0", scope: !596, file: !572, line: 833, type: !660, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 704, elements: !227)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !672, line: 183, type: !219, isLocal: true, isDefinition: true)
!672 = !DIFile(filename: "lib/randread.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2a439877b8fd91186e97781a416043df")
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !672, line: 107, type: !577, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !672, line: 107, type: !376, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !672, line: 107, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 272, elements: !188)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !672, line: 108, type: !391, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !672, line: 108, type: !376, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !686, line: 192, type: !326, isLocal: true, isDefinition: true)
!686 = !DIFile(filename: "lib/read-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5e61a5e6b0c83d68cde0efd76e0ac088")
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !686, line: 192, type: !219, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !691, line: 67, type: !197, isLocal: true, isDefinition: true)
!691 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !691, line: 69, type: !167, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !691, line: 83, type: !167, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !691, line: 83, type: !326, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !691, line: 85, type: !212, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !691, line: 88, type: !702, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 171)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !691, line: 88, type: !187, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !691, line: 105, type: !391, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !691, line: 109, type: !177, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !691, line: 113, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 28)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !691, line: 120, type: !182, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !691, line: 127, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 36)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !691, line: 134, type: !371, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !691, line: 142, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 44)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !691, line: 150, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 48)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !691, line: 159, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 52)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !691, line: 170, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 60)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !691, line: 248, type: !172, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !691, line: 248, type: !396, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !691, line: 254, type: !172, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !691, line: 254, type: !192, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !691, line: 254, type: !371, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !691, line: 259, type: !3, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !691, line: 259, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 29)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !764, file: !765, line: 26, type: !767, isLocal: false, isDefinition: true)
!764 = distinct !DICompileUnit(language: DW_LANG_C11, file: !765, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !766, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!766 = !{!762}
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 376, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 47)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "exit_failure", scope: !772, file: !773, line: 24, type: !775, isLocal: false, isDefinition: true)
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !773, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !774, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!774 = !{!770}
!775 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !778, line: 34, type: !219, isLocal: true, isDefinition: true)
!778 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !778, line: 34, type: !167, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !778, line: 34, type: !207, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !785, line: 226, type: !76, isLocal: true, isDefinition: true)
!785 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !785, line: 227, type: !76, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !785, line: 228, type: !202, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !785, line: 231, type: !76, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "default_tuning", scope: !794, file: !785, line: 134, type: !798, isLocal: true, isDefinition: true)
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !785, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, globals: !797, splitDebugInlining: false, nameTableKind: None)
!795 = !{!150, !146, !796, !148}
!796 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!797 = !{!783, !786, !788, !790, !792}
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !800, line: 52, baseType: !801)
!800 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !800, line: 40, size: 160, elements: !802)
!802 = !{!803, !804, !805, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !801, file: !800, line: 45, baseType: !796, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !801, file: !800, line: 46, baseType: !796, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !801, file: !800, line: 47, baseType: !796, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !801, file: !800, line: 48, baseType: !796, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !801, file: !800, line: 49, baseType: !255, size: 8, offset: 128)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !810, line: 108, type: !66, isLocal: true, isDefinition: true)
!810 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "internal_state", scope: !813, file: !810, line: 97, type: !816, isLocal: true, isDefinition: true)
!813 = distinct !DICompileUnit(language: DW_LANG_C11, file: !810, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !814, globals: !815, splitDebugInlining: false, nameTableKind: None)
!814 = !{!146, !148, !153}
!815 = !{!808, !811}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !558, line: 6, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !560, line: 21, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 13, size: 64, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !818, file: !560, line: 15, baseType: !99, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !818, file: !560, line: 20, baseType: !822, size: 32, offset: 32)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !818, file: !560, line: 16, size: 32, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !822, file: !560, line: 18, baseType: !87, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !822, file: !560, line: 19, baseType: !326, size: 32)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !828, file: !829, line: 506, type: !99, isLocal: true, isDefinition: true)
!828 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !829, file: !829, line: 485, type: !830, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !832, retainedNodes: !834)
!829 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!830 = !DISubroutineType(types: !831)
!831 = !{!99, !99, !99}
!832 = distinct !DICompileUnit(language: DW_LANG_C11, file: !829, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !833, splitDebugInlining: false, nameTableKind: None)
!833 = !{!826}
!834 = !{!835, !836, !837, !838, !841}
!835 = !DILocalVariable(name: "fd", arg: 1, scope: !828, file: !829, line: 485, type: !99)
!836 = !DILocalVariable(name: "target", arg: 2, scope: !828, file: !829, line: 485, type: !99)
!837 = !DILocalVariable(name: "result", scope: !828, file: !829, line: 487, type: !99)
!838 = !DILocalVariable(name: "flags", scope: !839, file: !829, line: 530, type: !99)
!839 = distinct !DILexicalBlock(scope: !840, file: !829, line: 529, column: 5)
!840 = distinct !DILexicalBlock(scope: !828, file: !829, line: 528, column: 7)
!841 = !DILocalVariable(name: "saved_errno", scope: !842, file: !829, line: 533, type: !99)
!842 = distinct !DILexicalBlock(scope: !843, file: !829, line: 532, column: 9)
!843 = distinct !DILexicalBlock(scope: !839, file: !829, line: 531, column: 11)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !846, line: 35, type: !331, isLocal: true, isDefinition: true)
!846 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!847 = distinct !DICompileUnit(language: DW_LANG_C11, file: !848, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !849, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!849 = !{!117}
!850 = distinct !DICompileUnit(language: DW_LANG_C11, file: !851, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!851 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!852 = distinct !DICompileUnit(language: DW_LANG_C11, file: !853, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !854, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!854 = !{!146}
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !856, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!857 = distinct !DICompileUnit(language: DW_LANG_C11, file: !528, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !858, splitDebugInlining: false, nameTableKind: None)
!858 = !{!526}
!859 = distinct !DICompileUnit(language: DW_LANG_C11, file: !860, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !854, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!861 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!863 = distinct !DICompileUnit(language: DW_LANG_C11, file: !864, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !865, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !867, line: 102, baseType: !868)
!867 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !157, line: 73, baseType: !150)
!869 = distinct !DICompileUnit(language: DW_LANG_C11, file: !870, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !871, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "lib/linebuffer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d85d9b8947aefddab7f1bb42f1d43333")
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!873 = distinct !DICompileUnit(language: DW_LANG_C11, file: !874, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!874 = !DIFile(filename: "lib/randint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "11f435a81221ba750eb474b22ae06eb8")
!875 = distinct !DICompileUnit(language: DW_LANG_C11, file: !876, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !877, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "lib/randperm.c", directory: "/src", checksumkind: CSK_MD5, checksum: "40d9ef006b04474ffd3ed51e1e91ea2b")
!877 = !{!255, !150, !146}
!878 = distinct !DICompileUnit(language: DW_LANG_C11, file: !672, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !879, globals: !880, splitDebugInlining: false, nameTableKind: None)
!879 = !{!148}
!880 = !{!670, !673, !675, !677, !680, !682}
!881 = distinct !DICompileUnit(language: DW_LANG_C11, file: !882, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !883, retainedTypes: !937, splitDebugInlining: false, nameTableKind: None)
!882 = !DIFile(filename: "lib/rand-isaac.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d44161d8d093b6cf59f0cc9f71c527c2")
!883 = !{!884}
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !885, file: !882, line: 100, baseType: !87, size: 32, elements: !935)
!885 = distinct !DISubprogram(name: "isaac_refill", scope: !882, file: !882, line: 90, type: !886, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !881, retainedNodes: !902)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !888, !901}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !890, line: 56, size: 16576, elements: !891)
!890 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4c70774edc5c86c3b7f59097e965130e")
!891 = !{!892, !898, !899, !900}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !889, file: !890, line: 58, baseType: !893, size: 16384)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 16384, elements: !624)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !890, line: 44, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !867, line: 52, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !157, line: 59, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !157, line: 45, baseType: !150)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !889, file: !890, line: 59, baseType: !894, size: 64, offset: 16384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !889, file: !890, line: 59, baseType: !894, size: 64, offset: 16448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !889, file: !890, line: 59, baseType: !894, size: 64, offset: 16512)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !912, !913, !915, !916, !918, !919, !921, !922, !925, !926, !928, !929, !931, !932, !934}
!903 = !DILocalVariable(name: "s", arg: 1, scope: !885, file: !882, line: 90, type: !888)
!904 = !DILocalVariable(name: "result", arg: 2, scope: !885, file: !882, line: 90, type: !901)
!905 = !DILocalVariable(name: "a", scope: !885, file: !882, line: 93, type: !894)
!906 = !DILocalVariable(name: "b", scope: !885, file: !882, line: 94, type: !894)
!907 = !DILocalVariable(name: "m", scope: !885, file: !882, line: 97, type: !901)
!908 = !DILocalVariable(name: "r", scope: !885, file: !882, line: 98, type: !901)
!909 = !DILocalVariable(name: "x", scope: !910, file: !882, line: 118, type: !894)
!910 = distinct !DILexicalBlock(scope: !911, file: !882, line: 118, column: 7)
!911 = distinct !DILexicalBlock(scope: !885, file: !882, line: 117, column: 5)
!912 = !DILocalVariable(name: "y", scope: !910, file: !882, line: 118, type: !894)
!913 = !DILocalVariable(name: "x", scope: !914, file: !882, line: 119, type: !894)
!914 = distinct !DILexicalBlock(scope: !911, file: !882, line: 119, column: 7)
!915 = !DILocalVariable(name: "y", scope: !914, file: !882, line: 119, type: !894)
!916 = !DILocalVariable(name: "x", scope: !917, file: !882, line: 120, type: !894)
!917 = distinct !DILexicalBlock(scope: !911, file: !882, line: 120, column: 7)
!918 = !DILocalVariable(name: "y", scope: !917, file: !882, line: 120, type: !894)
!919 = !DILocalVariable(name: "x", scope: !920, file: !882, line: 121, type: !894)
!920 = distinct !DILexicalBlock(scope: !911, file: !882, line: 121, column: 7)
!921 = !DILocalVariable(name: "y", scope: !920, file: !882, line: 121, type: !894)
!922 = !DILocalVariable(name: "x", scope: !923, file: !882, line: 128, type: !894)
!923 = distinct !DILexicalBlock(scope: !924, file: !882, line: 128, column: 7)
!924 = distinct !DILexicalBlock(scope: !885, file: !882, line: 127, column: 5)
!925 = !DILocalVariable(name: "y", scope: !923, file: !882, line: 128, type: !894)
!926 = !DILocalVariable(name: "x", scope: !927, file: !882, line: 129, type: !894)
!927 = distinct !DILexicalBlock(scope: !924, file: !882, line: 129, column: 7)
!928 = !DILocalVariable(name: "y", scope: !927, file: !882, line: 129, type: !894)
!929 = !DILocalVariable(name: "x", scope: !930, file: !882, line: 130, type: !894)
!930 = distinct !DILexicalBlock(scope: !924, file: !882, line: 130, column: 7)
!931 = !DILocalVariable(name: "y", scope: !930, file: !882, line: 130, type: !894)
!932 = !DILocalVariable(name: "x", scope: !933, file: !882, line: 131, type: !894)
!933 = distinct !DILexicalBlock(scope: !924, file: !882, line: 131, column: 7)
!934 = !DILocalVariable(name: "y", scope: !933, file: !882, line: 131, type: !894)
!935 = !{!936}
!936 = !DIEnumerator(name: "HALF", value: 128)
!937 = !{!894}
!938 = distinct !DICompileUnit(language: DW_LANG_C11, file: !686, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !939, globals: !940, splitDebugInlining: false, nameTableKind: None)
!939 = !{!146, !150}
!940 = !{!684, !687}
!941 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !942, retainedTypes: !854, globals: !946, splitDebugInlining: false, nameTableKind: None)
!942 = !{!943}
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !691, line: 40, baseType: !87, size: 32, elements: !944)
!944 = !{!945}
!945 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!946 = !{!689, !692, !694, !696, !698, !700, !705, !707, !709, !711, !716, !718, !723, !725, !730, !735, !740, !745, !747, !749, !751, !753, !755, !757}
!947 = distinct !DICompileUnit(language: DW_LANG_C11, file: !948, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !949, retainedTypes: !980, splitDebugInlining: false, nameTableKind: None)
!948 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!949 = !{!950, !962}
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !951, file: !948, line: 188, baseType: !87, size: 32, elements: !960)
!951 = distinct !DISubprogram(name: "x2nrealloc", scope: !948, file: !948, line: 176, type: !952, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !947, retainedNodes: !955)
!952 = !DISubroutineType(types: !953)
!953 = !{!146, !146, !954, !148}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!955 = !{!956, !957, !958, !959}
!956 = !DILocalVariable(name: "p", arg: 1, scope: !951, file: !948, line: 176, type: !146)
!957 = !DILocalVariable(name: "pn", arg: 2, scope: !951, file: !948, line: 176, type: !954)
!958 = !DILocalVariable(name: "s", arg: 3, scope: !951, file: !948, line: 176, type: !148)
!959 = !DILocalVariable(name: "n", scope: !951, file: !948, line: 178, type: !148)
!960 = !{!961}
!961 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !963, file: !948, line: 228, baseType: !87, size: 32, elements: !960)
!963 = distinct !DISubprogram(name: "xpalloc", scope: !948, file: !948, line: 223, type: !964, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !947, retainedNodes: !970)
!964 = !DISubroutineType(types: !965)
!965 = !{!146, !146, !966, !967, !969, !967}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !968, line: 130, baseType: !969)
!968 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !149, line: 35, baseType: !158)
!970 = !{!971, !972, !973, !974, !975, !976, !977, !978, !979}
!971 = !DILocalVariable(name: "pa", arg: 1, scope: !963, file: !948, line: 223, type: !146)
!972 = !DILocalVariable(name: "pn", arg: 2, scope: !963, file: !948, line: 223, type: !966)
!973 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !963, file: !948, line: 223, type: !967)
!974 = !DILocalVariable(name: "n_max", arg: 4, scope: !963, file: !948, line: 223, type: !969)
!975 = !DILocalVariable(name: "s", arg: 5, scope: !963, file: !948, line: 223, type: !967)
!976 = !DILocalVariable(name: "n0", scope: !963, file: !948, line: 230, type: !967)
!977 = !DILocalVariable(name: "n", scope: !963, file: !948, line: 237, type: !967)
!978 = !DILocalVariable(name: "nbytes", scope: !963, file: !948, line: 248, type: !967)
!979 = !DILocalVariable(name: "adjusted_nbytes", scope: !963, file: !948, line: 252, type: !967)
!980 = !{!145, !146, !255, !158, !150}
!981 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !982, splitDebugInlining: false, nameTableKind: None)
!982 = !{!776, !779, !781}
!983 = distinct !DICompileUnit(language: DW_LANG_C11, file: !984, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !985, retainedTypes: !986, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!985 = !{!85, !129}
!986 = !{!99, !147, !145, !255, !150, !866}
!987 = distinct !DICompileUnit(language: DW_LANG_C11, file: !988, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !854, splitDebugInlining: false, nameTableKind: None)
!988 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!989 = distinct !DICompileUnit(language: DW_LANG_C11, file: !990, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!990 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!991 = distinct !DICompileUnit(language: DW_LANG_C11, file: !992, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!992 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!993 = distinct !DICompileUnit(language: DW_LANG_C11, file: !994, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "lib/memset_explicit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5aa0e831d3f4d1a5017c23894634ef8c")
!995 = distinct !DICompileUnit(language: DW_LANG_C11, file: !996, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!996 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!997 = distinct !DICompileUnit(language: DW_LANG_C11, file: !998, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !877, splitDebugInlining: false, nameTableKind: None)
!998 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!999 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1000, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1001 = distinct !DICompileUnit(language: DW_LANG_C11, file: !846, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1002, splitDebugInlining: false, nameTableKind: None)
!1002 = !{!1003, !844}
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !846, line: 35, type: !212, isLocal: true, isDefinition: true)
!1005 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1006, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1008, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !854, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1009 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1010 = !{i32 7, !"Dwarf Version", i32 5}
!1011 = !{i32 2, !"Debug Info Version", i32 3}
!1012 = !{i32 1, !"wchar_size", i32 4}
!1013 = !{i32 8, !"PIC Level", i32 2}
!1014 = !{i32 7, !"PIE Level", i32 2}
!1015 = !{i32 7, !"uwtable", i32 2}
!1016 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 50, type: !1017, scopeLine: 51, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1019)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !99}
!1019 = !{!1020}
!1020 = !DILocalVariable(name: "status", arg: 1, scope: !1016, file: !2, line: 50, type: !99)
!1021 = !DILocation(line: 0, scope: !1016)
!1022 = !DILocation(line: 52, column: 14, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1016, file: !2, line: 52, column: 7)
!1024 = !DILocation(line: 52, column: 7, scope: !1016)
!1025 = !DILocation(line: 53, column: 5, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !2, line: 53, column: 5)
!1027 = !{!1028, !1028, i64 0}
!1028 = !{!"any pointer", !1029, i64 0}
!1029 = !{!"omnipotent char", !1030, i64 0}
!1030 = !{!"Simple C/C++ TBAA"}
!1031 = !DILocation(line: 56, column: 7, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1023, file: !2, line: 55, column: 5)
!1033 = !DILocation(line: 62, column: 7, scope: !1032)
!1034 = !DILocation(line: 729, column: 3, scope: !1035, inlinedAt: !1037)
!1035 = distinct !DISubprogram(name: "emit_stdin_note", scope: !98, file: !98, line: 727, type: !524, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1036)
!1036 = !{}
!1037 = distinct !DILocation(line: 66, column: 7, scope: !1032)
!1038 = !DILocation(line: 736, column: 3, scope: !1039, inlinedAt: !1040)
!1039 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !98, file: !98, line: 734, type: !524, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1036)
!1040 = distinct !DILocation(line: 67, column: 7, scope: !1032)
!1041 = !DILocation(line: 69, column: 7, scope: !1032)
!1042 = !DILocation(line: 72, column: 7, scope: !1032)
!1043 = !DILocation(line: 75, column: 7, scope: !1032)
!1044 = !DILocation(line: 78, column: 7, scope: !1032)
!1045 = !DILocation(line: 81, column: 7, scope: !1032)
!1046 = !DILocation(line: 84, column: 7, scope: !1032)
!1047 = !DILocation(line: 87, column: 7, scope: !1032)
!1048 = !DILocation(line: 90, column: 7, scope: !1032)
!1049 = !DILocation(line: 91, column: 7, scope: !1032)
!1050 = !DILocalVariable(name: "program", arg: 1, scope: !1051, file: !98, line: 836, type: !151)
!1051 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !98, file: !98, line: 836, type: !1052, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1054)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !151}
!1054 = !{!1050, !1055, !1062, !1063, !1065, !1066}
!1055 = !DILocalVariable(name: "infomap", scope: !1051, file: !98, line: 838, type: !1056)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 896, elements: !168)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1051, file: !98, line: 838, size: 128, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1058, file: !98, line: 838, baseType: !151, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1058, file: !98, line: 838, baseType: !151, size: 64, offset: 64)
!1062 = !DILocalVariable(name: "node", scope: !1051, file: !98, line: 848, type: !151)
!1063 = !DILocalVariable(name: "map_prog", scope: !1051, file: !98, line: 849, type: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1065 = !DILocalVariable(name: "lc_messages", scope: !1051, file: !98, line: 861, type: !151)
!1066 = !DILocalVariable(name: "url_program", scope: !1051, file: !98, line: 874, type: !151)
!1067 = !DILocation(line: 0, scope: !1051, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 92, column: 7, scope: !1032)
!1069 = !DILocation(line: 857, column: 3, scope: !1051, inlinedAt: !1068)
!1070 = !DILocation(line: 861, column: 29, scope: !1051, inlinedAt: !1068)
!1071 = !DILocation(line: 862, column: 7, scope: !1072, inlinedAt: !1068)
!1072 = distinct !DILexicalBlock(scope: !1051, file: !98, line: 862, column: 7)
!1073 = !DILocation(line: 862, column: 19, scope: !1072, inlinedAt: !1068)
!1074 = !DILocation(line: 862, column: 22, scope: !1072, inlinedAt: !1068)
!1075 = !DILocation(line: 862, column: 7, scope: !1051, inlinedAt: !1068)
!1076 = !DILocation(line: 868, column: 7, scope: !1077, inlinedAt: !1068)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !98, line: 863, column: 5)
!1078 = !DILocation(line: 870, column: 5, scope: !1077, inlinedAt: !1068)
!1079 = !DILocation(line: 875, column: 3, scope: !1051, inlinedAt: !1068)
!1080 = !DILocation(line: 877, column: 3, scope: !1051, inlinedAt: !1068)
!1081 = !DILocation(line: 95, column: 3, scope: !1016)
!1082 = !DISubprogram(name: "dcgettext", scope: !1083, file: !1083, line: 51, type: !1084, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1083 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!145, !151, !151, !99}
!1086 = !DISubprogram(name: "__fprintf_chk", scope: !1087, file: !1087, line: 93, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1087 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!99, !1090, !99, !1091, null}
!1090 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !268)
!1091 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!1092 = !DISubprogram(name: "__printf_chk", scope: !1087, file: !1087, line: 95, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!99, !99, !1091, null}
!1095 = !DISubprogram(name: "fputs_unlocked", scope: !1096, file: !1096, line: 691, type: !1097, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1096 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!99, !1091, !1090}
!1099 = !DILocation(line: 0, scope: !245)
!1100 = !DILocation(line: 581, column: 7, scope: !253)
!1101 = !{!1102, !1102, i64 0}
!1102 = !{!"int", !1029, i64 0}
!1103 = !DILocation(line: 581, column: 19, scope: !253)
!1104 = !DILocation(line: 581, column: 7, scope: !245)
!1105 = !DILocation(line: 585, column: 26, scope: !252)
!1106 = !DILocation(line: 0, scope: !252)
!1107 = !DILocation(line: 586, column: 23, scope: !252)
!1108 = !DILocation(line: 586, column: 28, scope: !252)
!1109 = !DILocation(line: 586, column: 32, scope: !252)
!1110 = !{!1029, !1029, i64 0}
!1111 = !DILocation(line: 586, column: 38, scope: !252)
!1112 = !DILocalVariable(name: "__s1", arg: 1, scope: !1113, file: !1114, line: 1359, type: !151)
!1113 = distinct !DISubprogram(name: "streq", scope: !1114, file: !1114, line: 1359, type: !1115, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1117)
!1114 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!255, !151, !151}
!1117 = !{!1112, !1118}
!1118 = !DILocalVariable(name: "__s2", arg: 2, scope: !1113, file: !1114, line: 1359, type: !151)
!1119 = !DILocation(line: 0, scope: !1113, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 586, column: 41, scope: !252)
!1121 = !DILocation(line: 1361, column: 11, scope: !1113, inlinedAt: !1120)
!1122 = !DILocation(line: 1361, column: 10, scope: !1113, inlinedAt: !1120)
!1123 = !DILocation(line: 586, column: 19, scope: !252)
!1124 = !DILocation(line: 587, column: 5, scope: !252)
!1125 = !DILocation(line: 588, column: 7, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !245, file: !98, line: 588, column: 7)
!1127 = !DILocation(line: 588, column: 7, scope: !245)
!1128 = !DILocation(line: 590, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1126, file: !98, line: 589, column: 5)
!1130 = !DILocation(line: 591, column: 7, scope: !1129)
!1131 = !DILocation(line: 595, column: 37, scope: !245)
!1132 = !DILocation(line: 595, column: 35, scope: !245)
!1133 = !DILocation(line: 596, column: 29, scope: !245)
!1134 = !DILocation(line: 597, column: 8, scope: !261)
!1135 = !DILocation(line: 597, column: 7, scope: !245)
!1136 = !DILocation(line: 604, column: 24, scope: !260)
!1137 = !DILocation(line: 604, column: 12, scope: !261)
!1138 = !DILocation(line: 0, scope: !259)
!1139 = !DILocation(line: 610, column: 16, scope: !259)
!1140 = !DILocation(line: 610, column: 7, scope: !259)
!1141 = !DILocation(line: 611, column: 21, scope: !259)
!1142 = !{!1143, !1143, i64 0}
!1143 = !{!"short", !1029, i64 0}
!1144 = !DILocation(line: 611, column: 19, scope: !259)
!1145 = !DILocation(line: 611, column: 16, scope: !259)
!1146 = !DILocation(line: 610, column: 30, scope: !259)
!1147 = distinct !{!1147, !1140, !1141, !1148}
!1148 = !{!"llvm.loop.mustprogress"}
!1149 = !DILocation(line: 612, column: 18, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !259, file: !98, line: 612, column: 11)
!1151 = !DILocation(line: 612, column: 11, scope: !259)
!1152 = !DILocation(line: 618, column: 5, scope: !259)
!1153 = !DILocation(line: 620, column: 23, scope: !245)
!1154 = !DILocation(line: 625, column: 39, scope: !245)
!1155 = !DILocation(line: 626, column: 3, scope: !245)
!1156 = !DILocation(line: 626, column: 10, scope: !245)
!1157 = !DILocation(line: 626, column: 21, scope: !245)
!1158 = !DILocation(line: 628, column: 44, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !98, line: 628, column: 11)
!1160 = distinct !DILexicalBlock(scope: !245, file: !98, line: 627, column: 5)
!1161 = !DILocation(line: 628, column: 32, scope: !1159)
!1162 = !DILocation(line: 628, column: 49, scope: !1159)
!1163 = !DILocation(line: 628, column: 11, scope: !1160)
!1164 = !DILocation(line: 630, column: 11, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1160, file: !98, line: 630, column: 11)
!1166 = !DILocation(line: 630, column: 11, scope: !1160)
!1167 = !DILocation(line: 632, column: 26, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !98, line: 632, column: 15)
!1169 = distinct !DILexicalBlock(scope: !1165, file: !98, line: 631, column: 9)
!1170 = !DILocation(line: 632, column: 34, scope: !1168)
!1171 = !DILocation(line: 632, column: 37, scope: !1168)
!1172 = !DILocation(line: 632, column: 15, scope: !1169)
!1173 = !DILocation(line: 636, column: 16, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1169, file: !98, line: 636, column: 15)
!1175 = !DILocation(line: 636, column: 29, scope: !1174)
!1176 = !DILocation(line: 640, column: 16, scope: !1160)
!1177 = distinct !{!1177, !1155, !1178, !1148}
!1178 = !DILocation(line: 641, column: 5, scope: !245)
!1179 = !DILocation(line: 644, column: 3, scope: !245)
!1180 = !DILocation(line: 0, scope: !1113, inlinedAt: !1181)
!1181 = distinct !DILocation(line: 648, column: 31, scope: !245)
!1182 = !DILocation(line: 0, scope: !1113, inlinedAt: !1183)
!1183 = distinct !DILocation(line: 649, column: 31, scope: !245)
!1184 = !DILocation(line: 0, scope: !1113, inlinedAt: !1185)
!1185 = distinct !DILocation(line: 650, column: 31, scope: !245)
!1186 = !DILocation(line: 0, scope: !1113, inlinedAt: !1187)
!1187 = distinct !DILocation(line: 651, column: 31, scope: !245)
!1188 = !DILocation(line: 0, scope: !1113, inlinedAt: !1189)
!1189 = distinct !DILocation(line: 652, column: 31, scope: !245)
!1190 = !DILocation(line: 0, scope: !1113, inlinedAt: !1191)
!1191 = distinct !DILocation(line: 653, column: 31, scope: !245)
!1192 = !DILocation(line: 0, scope: !1113, inlinedAt: !1193)
!1193 = distinct !DILocation(line: 654, column: 31, scope: !245)
!1194 = !DILocation(line: 0, scope: !1113, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 655, column: 31, scope: !245)
!1196 = !DILocation(line: 0, scope: !1113, inlinedAt: !1197)
!1197 = distinct !DILocation(line: 656, column: 31, scope: !245)
!1198 = !DILocation(line: 0, scope: !1113, inlinedAt: !1199)
!1199 = distinct !DILocation(line: 657, column: 31, scope: !245)
!1200 = !DILocation(line: 663, column: 7, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !245, file: !98, line: 663, column: 7)
!1202 = !DILocation(line: 664, column: 7, scope: !1201)
!1203 = !DILocation(line: 664, column: 10, scope: !1201)
!1204 = !DILocation(line: 663, column: 7, scope: !245)
!1205 = !DILocation(line: 669, column: 7, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1201, file: !98, line: 665, column: 5)
!1207 = !DILocation(line: 671, column: 5, scope: !1206)
!1208 = !DILocation(line: 676, column: 7, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1201, file: !98, line: 673, column: 5)
!1210 = !DILocation(line: 679, column: 3, scope: !245)
!1211 = !DILocation(line: 683, column: 3, scope: !245)
!1212 = !DILocation(line: 686, column: 3, scope: !245)
!1213 = !DILocation(line: 688, column: 3, scope: !245)
!1214 = !DILocation(line: 691, column: 3, scope: !245)
!1215 = !DILocation(line: 695, column: 3, scope: !245)
!1216 = !DILocation(line: 696, column: 1, scope: !245)
!1217 = !DISubprogram(name: "setlocale", scope: !1218, file: !1218, line: 122, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1218 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!145, !99, !151}
!1221 = !DISubprogram(name: "strncmp", scope: !1222, file: !1222, line: 159, type: !1223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1222 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!99, !151, !151, !148}
!1225 = !DISubprogram(name: "exit", scope: !1226, file: !1226, line: 624, type: !1017, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1226 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1227 = !DISubprogram(name: "getenv", scope: !1226, file: !1226, line: 641, type: !1228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!145, !151}
!1230 = !DISubprogram(name: "strcmp", scope: !1222, file: !1222, line: 156, type: !1231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!99, !151, !151}
!1233 = !DISubprogram(name: "strspn", scope: !1222, file: !1222, line: 297, type: !1234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!150, !151, !151}
!1236 = !DISubprogram(name: "strchr", scope: !1222, file: !1222, line: 246, type: !1237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!145, !151, !99}
!1239 = !DISubprogram(name: "__ctype_b_loc", scope: !130, file: !130, line: 79, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!1242}
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!1245 = !DISubprogram(name: "strcspn", scope: !1222, file: !1222, line: 293, type: !1234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1246 = !DISubprogram(name: "fwrite_unlocked", scope: !1096, file: !1096, line: 704, type: !1247, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1036)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!148, !1249, !148, !148, !1090}
!1249 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1252 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 377, type: !1253, scopeLine: 378, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1256)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!99, !99, !1255}
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!1256 = !{!1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1283, !1287, !1288, !1289, !1292, !1293, !1295, !1297, !1298}
!1257 = !DILocalVariable(name: "argc", arg: 1, scope: !1252, file: !2, line: 377, type: !99)
!1258 = !DILocalVariable(name: "argv", arg: 2, scope: !1252, file: !2, line: 377, type: !1255)
!1259 = !DILocalVariable(name: "echo", scope: !1252, file: !2, line: 379, type: !255)
!1260 = !DILocalVariable(name: "input_range", scope: !1252, file: !2, line: 380, type: !255)
!1261 = !DILocalVariable(name: "lo_input", scope: !1252, file: !2, line: 381, type: !148)
!1262 = !DILocalVariable(name: "hi_input", scope: !1252, file: !2, line: 382, type: !148)
!1263 = !DILocalVariable(name: "head_lines", scope: !1252, file: !2, line: 383, type: !967)
!1264 = !DILocalVariable(name: "outfile", scope: !1252, file: !2, line: 384, type: !151)
!1265 = !DILocalVariable(name: "random_source", scope: !1252, file: !2, line: 385, type: !145)
!1266 = !DILocalVariable(name: "eolbyte", scope: !1252, file: !2, line: 386, type: !4)
