; ModuleID = 'src/sleep.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [249 x i8] c"Usage: %s NUMBER[SUFFIX]...\0A  or:  %s OPTION\0APause for NUMBER seconds, where NUMBER is an integer or floating-point.\0ASUFFIX may be 's','m','h', or 'd', for seconds, minutes, hours, days.\0AWith multiple arguments, pause for the sum of their values.\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"sleep\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !22

!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 40)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !75, line: 676, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 15)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !75, line: 676, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 61)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !75, line: 679, type: !132, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !75, line: 683, type: !109, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !75, line: 688, type: !109, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !75, line: 691, type: !148, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !75, line: 839, type: !59, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !75, line: 840, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 22)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !75, line: 841, type: !175, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !75, line: 862, type: !116, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !75, line: 868, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 71)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !75, line: 875, type: !69, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !75, line: 877, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 51)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !75, line: 877, type: !54, isLocal: true, isDefinition: true)
!216 = !{!217, !218, !219, !222, !224, !225, !226, !230, !231, !232, !233, !235, !289, !290, !291, !293, !294}
!217 = !DILocalVariable(name: "program", arg: 1, scope: !74, file: !75, line: 573, type: !78)
!218 = !DILocalVariable(name: "option", arg: 2, scope: !74, file: !75, line: 573, type: !78)
!219 = !DILocalVariable(name: "term", scope: !220, file: !75, line: 585, type: !78)
!220 = distinct !DILexicalBlock(scope: !221, file: !75, line: 582, column: 5)
!221 = distinct !DILexicalBlock(scope: !74, file: !75, line: 581, column: 7)
!222 = !DILocalVariable(name: "double_space", scope: !74, file: !75, line: 594, type: !223)
!223 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!224 = !DILocalVariable(name: "first_word", scope: !74, file: !75, line: 595, type: !78)
!225 = !DILocalVariable(name: "option_text", scope: !74, file: !75, line: 596, type: !78)
!226 = !DILocalVariable(name: "s", scope: !227, file: !75, line: 608, type: !78)
!227 = distinct !DILexicalBlock(scope: !228, file: !75, line: 605, column: 5)
!228 = distinct !DILexicalBlock(scope: !229, file: !75, line: 604, column: 12)
!229 = distinct !DILexicalBlock(scope: !74, file: !75, line: 597, column: 7)
!230 = !DILocalVariable(name: "spaces", scope: !227, file: !75, line: 609, type: !102)
!231 = !DILocalVariable(name: "anchor_len", scope: !74, file: !75, line: 620, type: !102)
!232 = !DILocalVariable(name: "desc_text", scope: !74, file: !75, line: 625, type: !78)
!233 = !DILocalVariable(name: "__ptr", scope: !234, file: !75, line: 644, type: !78)
!234 = distinct !DILexicalBlock(scope: !74, file: !75, line: 644, column: 3)
!235 = !DILocalVariable(name: "__stream", scope: !234, file: !75, line: 644, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !238, line: 7, baseType: !239)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !240, line: 49, size: 1728, elements: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!241 = !{!242, !243, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !258, !260, !261, !262, !266, !267, !269, !270, !273, !275, !278, !281, !282, !283, !284, !285}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !240, line: 51, baseType: !100, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !239, file: !240, line: 54, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !239, file: !240, line: 55, baseType: !244, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !239, file: !240, line: 56, baseType: !244, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !239, file: !240, line: 57, baseType: !244, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !239, file: !240, line: 58, baseType: !244, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !239, file: !240, line: 59, baseType: !244, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !239, file: !240, line: 60, baseType: !244, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !239, file: !240, line: 61, baseType: !244, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !239, file: !240, line: 64, baseType: !244, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !239, file: !240, line: 65, baseType: !244, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !239, file: !240, line: 66, baseType: !244, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !239, file: !240, line: 68, baseType: !256, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !240, line: 36, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !239, file: !240, line: 70, baseType: !259, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !239, file: !240, line: 72, baseType: !100, size: 32, offset: 896)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !240, line: 73, baseType: !100, size: 32, offset: 928)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !239, file: !240, line: 74, baseType: !263, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !264, line: 152, baseType: !265)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!265 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !239, file: !240, line: 77, baseType: !101, size: 16, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !239, file: !240, line: 78, baseType: !268, size: 8, offset: 1040)
!268 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !239, file: !240, line: 79, baseType: !29, size: 8, offset: 1048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !240, line: 81, baseType: !271, size: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !240, line: 43, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !240, line: 89, baseType: !274, size: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !264, line: 153, baseType: !265)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !239, file: !240, line: 91, baseType: !276, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !240, line: 37, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !239, file: !240, line: 92, baseType: !279, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !240, line: 38, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !239, file: !240, line: 93, baseType: !259, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !239, file: !240, line: 94, baseType: !99, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !239, file: !240, line: 95, baseType: !102, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !239, file: !240, line: 96, baseType: !100, size: 32, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !239, file: !240, line: 98, baseType: !286, size: 160, offset: 1568)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 20)
!289 = !DILocalVariable(name: "__cnt", scope: !234, file: !75, line: 644, type: !102)
!290 = !DILocalVariable(name: "url_program", scope: !74, file: !75, line: 648, type: !78)
!291 = !DILocalVariable(name: "__ptr", scope: !292, file: !75, line: 686, type: !78)
!292 = distinct !DILexicalBlock(scope: !74, file: !75, line: 686, column: 3)
!293 = !DILocalVariable(name: "__stream", scope: !292, file: !75, line: 686, type: !236)
!294 = !DILocalVariable(name: "__cnt", scope: !292, file: !75, line: 686, type: !102)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !297, line: 3, type: !175, isLocal: true, isDefinition: true)
!297 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "Version", scope: !300, file: !297, line: 3, type: !78, isLocal: false, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C11, file: !297, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !301, splitDebugInlining: false, nameTableKind: None)
!301 = !{!295, !298}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "file_name", scope: !304, file: !305, line: 45, type: !78, isLocal: true, isDefinition: true)
!304 = distinct !DICompileUnit(language: DW_LANG_C11, file: !305, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !306, splitDebugInlining: false, nameTableKind: None)
!305 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!306 = !{!307, !309, !311, !313, !302, !315}
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !305, line: 121, type: !143, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !305, line: 121, type: !54, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !305, line: 123, type: !143, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !305, line: 126, type: !132, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !304, file: !305, line: 55, type: !223, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !319, file: !320, line: 66, type: !366, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C11, file: !320, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !321, globals: !322, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!321 = !{!99, !105}
!322 = !{!323, !325, !345, !347, !349, !351, !317, !353, !355, !357, !359, !364}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !320, line: 272, type: !109, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "old_file_name", scope: !327, file: !320, line: 304, type: !78, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "verror_at_line", scope: !320, file: !320, line: 298, type: !328, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !338)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !100, !100, !78, !84, !78, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !332)
!332 = !{!333, !335, !336, !337}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !331, file: !334, baseType: !84, size: 32)
!334 = !DIFile(filename: "lib/error.c", directory: "/src")
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !331, file: !334, baseType: !84, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !331, file: !334, baseType: !99, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !331, file: !334, baseType: !99, size: 64, offset: 128)
!338 = !{!339, !340, !341, !342, !343, !344}
!339 = !DILocalVariable(name: "status", arg: 1, scope: !327, file: !320, line: 298, type: !100)
!340 = !DILocalVariable(name: "errnum", arg: 2, scope: !327, file: !320, line: 298, type: !100)
!341 = !DILocalVariable(name: "file_name", arg: 3, scope: !327, file: !320, line: 298, type: !78)
!342 = !DILocalVariable(name: "line_number", arg: 4, scope: !327, file: !320, line: 298, type: !84)
!343 = !DILocalVariable(name: "message", arg: 5, scope: !327, file: !320, line: 298, type: !78)
!344 = !DILocalVariable(name: "args", arg: 6, scope: !327, file: !320, line: 298, type: !330)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "old_line_number", scope: !327, file: !320, line: 305, type: !84, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !320, line: 338, type: !116, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !320, line: 346, type: !148, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !320, line: 346, type: !123, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "error_message_count", scope: !319, file: !320, line: 69, type: !84, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !319, file: !320, line: 295, type: !100, isLocal: false, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !320, line: 208, type: !143, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !320, line: 208, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 21)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !320, line: 214, type: !109, isLocal: true, isDefinition: true)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !371, line: 60, type: !123, isLocal: true, isDefinition: true)
!371 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "long_options", scope: !374, file: !371, line: 34, type: !382, isLocal: true, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C11, file: !371, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !375, splitDebugInlining: false, nameTableKind: None)
!375 = !{!369, !376, !378, !380, !372}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !371, line: 112, type: !29, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !371, line: 36, type: !109, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !371, line: 37, type: !148, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 768, elements: !133)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !385, line: 50, size: 256, elements: !386)
!385 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!386 = !{!387, !388, !389, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !384, file: !385, line: 52, baseType: !78, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !384, file: !385, line: 55, baseType: !100, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !385, line: 56, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !384, file: !385, line: 57, baseType: !100, size: 32, offset: 192)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "program_name", scope: !394, file: !395, line: 31, type: !78, isLocal: false, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C11, file: !395, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !396, globals: !397, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!396 = !{!244}
!397 = !{!392, !398, !400}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !395, line: 46, type: !148, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !395, line: 49, type: !116, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "utf07FF", scope: !404, file: !405, line: 46, type: !432, isLocal: true, isDefinition: true)
!404 = distinct !DISubprogram(name: "proper_name_lite", scope: !405, file: !405, line: 38, type: !406, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !410)
!405 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!406 = !DISubroutineType(types: !407)
!407 = !{!78, !78, !78}
!408 = distinct !DICompileUnit(language: DW_LANG_C11, file: !405, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !409, splitDebugInlining: false, nameTableKind: None)
!409 = !{!402}
!410 = !{!411, !412, !413, !414, !419}
!411 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !404, file: !405, line: 38, type: !78)
!412 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !404, file: !405, line: 38, type: !78)
!413 = !DILocalVariable(name: "translation", scope: !404, file: !405, line: 40, type: !78)
!414 = !DILocalVariable(name: "w", scope: !404, file: !405, line: 47, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !416, line: 37, baseType: !417)
!416 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !264, line: 57, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !264, line: 42, baseType: !84)
!419 = !DILocalVariable(name: "mbs", scope: !404, file: !405, line: 48, type: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !421, line: 6, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !423, line: 21, baseType: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 13, size: 64, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !424, file: !423, line: 15, baseType: !100, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !424, file: !423, line: 20, baseType: !428, size: 32, offset: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !423, line: 16, size: 32, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !428, file: !423, line: 18, baseType: !84, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !428, file: !423, line: 19, baseType: !116, size: 32)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 16, elements: !124)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !435, line: 78, type: !148, isLocal: true, isDefinition: true)
!435 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !435, line: 79, type: !14, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !435, line: 80, type: !49, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !435, line: 81, type: !49, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !435, line: 82, type: !286, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !435, line: 83, type: !123, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !435, line: 84, type: !148, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !435, line: 85, type: !143, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !435, line: 86, type: !143, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !435, line: 87, type: !148, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !456, file: !435, line: 76, type: !542, isLocal: false, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C11, file: !435, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !457, retainedTypes: !477, globals: !478, splitDebugInlining: false, nameTableKind: None)
!457 = !{!458, !472, !82}
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !459, line: 42, baseType: !84, size: 32, elements: !460)
!459 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!461 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!462 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!463 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!464 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!465 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!466 = !DIEnumerator(name: "c_quoting_style", value: 5)
!467 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!468 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!469 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!470 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!471 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !459, line: 254, baseType: !84, size: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!475 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!476 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!477 = !{!100, !101, !102}
!478 = !{!433, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !479, !483, !493, !495, !500, !502, !504, !506, !508, !531, !538, !540}
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !456, file: !435, line: 92, type: !481, isLocal: false, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 320, elements: !35)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !456, file: !435, line: 1040, type: !485, isLocal: false, isDefinition: true)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !435, line: 56, size: 448, elements: !486)
!486 = !{!487, !488, !489, !491, !492}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !485, file: !435, line: 59, baseType: !458, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !435, line: 62, baseType: !100, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !485, file: !435, line: 66, baseType: !490, size: 256, offset: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !149)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !485, file: !435, line: 69, baseType: !78, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !485, file: !435, line: 72, baseType: !78, size: 64, offset: 384)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !456, file: !435, line: 107, type: !485, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "slot0", scope: !456, file: !435, line: 831, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 256)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !435, line: 321, type: !123, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !435, line: 357, type: !123, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !435, line: 358, type: !123, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !435, line: 199, type: !143, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "quote", scope: !510, file: !435, line: 228, type: !529, isLocal: true, isDefinition: true)
!510 = distinct !DISubprogram(name: "gettext_quote", scope: !435, file: !435, line: 197, type: !511, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !456, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!78, !78, !458}
!513 = !{!514, !515, !516, !517, !518}
!514 = !DILocalVariable(name: "msgid", arg: 1, scope: !510, file: !435, line: 197, type: !78)
!515 = !DILocalVariable(name: "s", arg: 2, scope: !510, file: !435, line: 197, type: !458)
!516 = !DILocalVariable(name: "translation", scope: !510, file: !435, line: 199, type: !78)
!517 = !DILocalVariable(name: "w", scope: !510, file: !435, line: 229, type: !415)
!518 = !DILocalVariable(name: "mbs", scope: !510, file: !435, line: 230, type: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !421, line: 6, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !423, line: 21, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 13, size: 64, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !521, file: !423, line: 15, baseType: !100, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !521, file: !423, line: 20, baseType: !525, size: 32, offset: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !521, file: !423, line: 16, size: 32, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !525, file: !423, line: 18, baseType: !84, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !525, file: !423, line: 19, baseType: !116, size: 32)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 64, elements: !530)
!530 = !{!125, !118}
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "slotvec", scope: !456, file: !435, line: 834, type: !533, isLocal: true, isDefinition: true)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !435, line: 823, size: 128, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !534, file: !435, line: 825, baseType: !102, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !534, file: !435, line: 826, baseType: !244, size: 64, offset: 64)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "nslots", scope: !456, file: !435, line: 832, type: !100, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "slotvec0", scope: !456, file: !435, line: 833, type: !534, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 704, elements: !544)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!544 = !{!545}
!545 = !DISubrange(count: 11)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !548, line: 67, type: !54, isLocal: true, isDefinition: true)
!548 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !548, line: 69, type: !143, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !548, line: 83, type: !143, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !548, line: 83, type: !116, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !548, line: 85, type: !123, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !548, line: 88, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 171)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !548, line: 88, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 34)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !548, line: 105, type: !59, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !548, line: 109, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 23)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !548, line: 113, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 28)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !548, line: 120, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !548, line: 127, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 36)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !548, line: 134, type: !170, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !548, line: 142, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 44)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !548, line: 150, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 48)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !548, line: 159, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 52)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !548, line: 170, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 60)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !548, line: 248, type: !286, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !548, line: 248, type: !195, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !548, line: 254, type: !286, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !548, line: 254, type: !44, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !548, line: 254, type: !170, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !548, line: 259, type: !3, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !548, line: 259, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 29)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !630, file: !631, line: 26, type: !633, isLocal: false, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C11, file: !631, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !632, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!632 = !{!628}
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 376, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 47)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "exit_failure", scope: !638, file: !639, line: 24, type: !641, isLocal: false, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !640, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!640 = !{!636}
!641 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !100)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 34, type: !132, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !644, line: 34, type: !143, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !644, line: 34, type: !165, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !651, file: !652, line: 58, type: !677, isLocal: true, isDefinition: true)
!651 = distinct !DICompileUnit(language: DW_LANG_C11, file: !652, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !653, globals: !674, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!653 = !{!244, !654}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !655, line: 24, baseType: !656)
!655 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !657, line: 41, baseType: !658)
!657 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !657, line: 27, size: 1856, elements: !660)
!660 = !{!661, !665, !668, !671, !672}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !659, file: !657, line: 30, baseType: !662, size: 832)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 832, elements: !50)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !657, line: 30, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !659, file: !657, line: 33, baseType: !666, size: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !659, file: !657, line: 34, baseType: !669, size: 64, offset: 896)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !659, file: !657, line: 35, baseType: !669, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !659, file: !657, line: 38, baseType: !673, size: 832, offset: 1024)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 832, elements: !50)
!674 = !{!675, !649}
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !652, line: 66, type: !123, isLocal: true, isDefinition: true)
!677 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !654)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !680, line: 108, type: !29, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "internal_state", scope: !683, file: !680, line: 97, type: !686, isLocal: true, isDefinition: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !684, globals: !685, splitDebugInlining: false, nameTableKind: None)
!684 = !{!99, !102, !105}
!685 = !{!678, !681}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !421, line: 6, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !423, line: 21, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 13, size: 64, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !688, file: !423, line: 15, baseType: !100, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !688, file: !423, line: 20, baseType: !692, size: 32, offset: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !688, file: !423, line: 16, size: 32, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !692, file: !423, line: 18, baseType: !84, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !692, file: !423, line: 19, baseType: !116, size: 32)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !698, line: 35, type: !14, isLocal: true, isDefinition: true)
!698 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/cl-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a67239aa557b1854772fcd1589240f00")
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !548, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !704, retainedTypes: !708, globals: !709, splitDebugInlining: false, nameTableKind: None)
!704 = !{!705}
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !548, line: 40, baseType: !84, size: 32, elements: !706)
!706 = !{!707}
!707 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!708 = !{!99}
!709 = !{!546, !549, !551, !553, !555, !557, !562, !567, !569, !574, !579, !584, !589, !591, !596, !601, !606, !611, !613, !615, !617, !619, !621, !623}
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !712, retainedTypes: !743, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!712 = !{!713, !725}
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !714, file: !711, line: 188, baseType: !84, size: 32, elements: !723)
!714 = distinct !DISubprogram(name: "x2nrealloc", scope: !711, file: !711, line: 176, type: !715, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !710, retainedNodes: !718)
!715 = !DISubroutineType(types: !716)
!716 = !{!99, !99, !717, !102}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!718 = !{!719, !720, !721, !722}
!719 = !DILocalVariable(name: "p", arg: 1, scope: !714, file: !711, line: 176, type: !99)
!720 = !DILocalVariable(name: "pn", arg: 2, scope: !714, file: !711, line: 176, type: !717)
!721 = !DILocalVariable(name: "s", arg: 3, scope: !714, file: !711, line: 176, type: !102)
!722 = !DILocalVariable(name: "n", scope: !714, file: !711, line: 178, type: !102)
!723 = !{!724}
!724 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !726, file: !711, line: 228, baseType: !84, size: 32, elements: !723)
!726 = distinct !DISubprogram(name: "xpalloc", scope: !711, file: !711, line: 223, type: !727, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !710, retainedNodes: !733)
!727 = !DISubroutineType(types: !728)
!728 = !{!99, !99, !729, !730, !732, !730}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !731, line: 130, baseType: !732)
!731 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !103, line: 35, baseType: !265)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742}
!734 = !DILocalVariable(name: "pa", arg: 1, scope: !726, file: !711, line: 223, type: !99)
!735 = !DILocalVariable(name: "pn", arg: 2, scope: !726, file: !711, line: 223, type: !729)
!736 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !726, file: !711, line: 223, type: !730)
!737 = !DILocalVariable(name: "n_max", arg: 4, scope: !726, file: !711, line: 223, type: !732)
!738 = !DILocalVariable(name: "s", arg: 5, scope: !726, file: !711, line: 223, type: !730)
!739 = !DILocalVariable(name: "n0", scope: !726, file: !711, line: 230, type: !730)
!740 = !DILocalVariable(name: "n", scope: !726, file: !711, line: 237, type: !730)
!741 = !DILocalVariable(name: "nbytes", scope: !726, file: !711, line: 248, type: !730)
!742 = !DILocalVariable(name: "adjusted_nbytes", scope: !726, file: !711, line: 252, type: !730)
!743 = !{!244, !99, !223, !265, !104}
!744 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !745, splitDebugInlining: false, nameTableKind: None)
!745 = !{!642, !645, !647}
!746 = distinct !DICompileUnit(language: DW_LANG_C11, file: !747, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!747 = !DIFile(filename: "lib/xnanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b6a69034949aee1e9f05553e779b94d2")
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !750, line: 10, baseType: !751)
!750 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !264, line: 160, baseType: !265)
!752 = distinct !DICompileUnit(language: DW_LANG_C11, file: !753, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!753 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!754 = distinct !DICompileUnit(language: DW_LANG_C11, file: !755, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !756, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/dtotimespec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "863541a7a9cbed8b745823733251add6")
!756 = !{!757}
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !758, line: 44, baseType: !84, size: 32, elements: !759)
!758 = !DIFile(filename: "./lib/timespec.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2321879fdee55a014e00353b7423449")
!759 = !{!760}
!760 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000)
!761 = distinct !DICompileUnit(language: DW_LANG_C11, file: !762, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !708, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!765 = distinct !DICompileUnit(language: DW_LANG_C11, file: !766, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !708, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!767 = distinct !DICompileUnit(language: DW_LANG_C11, file: !768, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "lib/nanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ea6d8d4443a961090653c9a262702e98")
!769 = !{!770}
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !768, line: 37, baseType: !84, size: 32, elements: !771)
!771 = !{!772}
!772 = !DIEnumerator(name: "BILLION", value: 1000000000)
!773 = distinct !DICompileUnit(language: DW_LANG_C11, file: !774, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !775, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!775 = !{!223, !104, !99}
!776 = distinct !DICompileUnit(language: DW_LANG_C11, file: !698, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !777, splitDebugInlining: false, nameTableKind: None)
!777 = !{!778, !696}
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !698, line: 35, type: !123, isLocal: true, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !781, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!782 = distinct !DICompileUnit(language: DW_LANG_C11, file: !783, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !708, splitDebugInlining: false, nameTableKind: None)
!783 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!784 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!785 = !{i32 7, !"Dwarf Version", i32 5}
!786 = !{i32 2, !"Debug Info Version", i32 3}
!787 = !{i32 1, !"wchar_size", i32 4}
!788 = !{i32 8, !"PIC Level", i32 2}
!789 = !{i32 7, !"PIE Level", i32 2}
!790 = !{i32 7, !"uwtable", i32 2}
!791 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !792, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !100}
!794 = !{!795}
!795 = !DILocalVariable(name: "status", arg: 1, scope: !791, file: !2, line: 36, type: !100)
!796 = !DILocation(line: 0, scope: !791)
!797 = !DILocation(line: 38, column: 14, scope: !798)
!798 = distinct !DILexicalBlock(scope: !791, file: !2, line: 38, column: 7)
!799 = !DILocation(line: 38, column: 7, scope: !791)
!800 = !DILocation(line: 39, column: 5, scope: !801)
!801 = distinct !DILexicalBlock(scope: !798, file: !2, line: 39, column: 5)
!802 = !{!803, !803, i64 0}
!803 = !{!"any pointer", !804, i64 0}
!804 = !{!"omnipotent char", !805, i64 0}
!805 = !{!"Simple C/C++ TBAA"}
!806 = !DILocation(line: 42, column: 7, scope: !807)
!807 = distinct !DILexicalBlock(scope: !798, file: !2, line: 41, column: 5)
!808 = !DILocation(line: 51, column: 7, scope: !807)
!809 = !DILocation(line: 52, column: 7, scope: !807)
!810 = !DILocalVariable(name: "program", arg: 1, scope: !811, file: !75, line: 836, type: !78)
!811 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !75, file: !75, line: 836, type: !812, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !78}
!814 = !{!810, !815, !822, !823, !825, !826}
!815 = !DILocalVariable(name: "infomap", scope: !811, file: !75, line: 838, type: !816)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 896, elements: !144)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !811, file: !75, line: 838, size: 128, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !818, file: !75, line: 838, baseType: !78, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !818, file: !75, line: 838, baseType: !78, size: 64, offset: 64)
!822 = !DILocalVariable(name: "node", scope: !811, file: !75, line: 848, type: !78)
!823 = !DILocalVariable(name: "map_prog", scope: !811, file: !75, line: 849, type: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!825 = !DILocalVariable(name: "lc_messages", scope: !811, file: !75, line: 861, type: !78)
!826 = !DILocalVariable(name: "url_program", scope: !811, file: !75, line: 874, type: !78)
!827 = !DILocation(line: 0, scope: !811, inlinedAt: !828)
!828 = distinct !DILocation(line: 53, column: 7, scope: !807)
!829 = !DILocation(line: 857, column: 3, scope: !811, inlinedAt: !828)
!830 = !DILocation(line: 861, column: 29, scope: !811, inlinedAt: !828)
!831 = !DILocation(line: 862, column: 7, scope: !832, inlinedAt: !828)
!832 = distinct !DILexicalBlock(scope: !811, file: !75, line: 862, column: 7)
!833 = !DILocation(line: 862, column: 19, scope: !832, inlinedAt: !828)
!834 = !DILocation(line: 862, column: 22, scope: !832, inlinedAt: !828)
!835 = !DILocation(line: 862, column: 7, scope: !811, inlinedAt: !828)
!836 = !DILocation(line: 868, column: 7, scope: !837, inlinedAt: !828)
!837 = distinct !DILexicalBlock(scope: !832, file: !75, line: 863, column: 5)
!838 = !DILocation(line: 870, column: 5, scope: !837, inlinedAt: !828)
!839 = !DILocation(line: 875, column: 3, scope: !811, inlinedAt: !828)
!840 = !DILocation(line: 877, column: 3, scope: !811, inlinedAt: !828)
!841 = !DILocation(line: 55, column: 3, scope: !791)
!842 = !DISubprogram(name: "dcgettext", scope: !843, file: !843, line: 51, type: !844, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!843 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!844 = !DISubroutineType(types: !845)
!845 = !{!244, !78, !78, !100}
!846 = !{}
!847 = !DISubprogram(name: "__fprintf_chk", scope: !848, file: !848, line: 93, type: !849, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!848 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!849 = !DISubroutineType(types: !850)
!850 = !{!100, !851, !100, !852, null}
!851 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !236)
!852 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !78)
!853 = !DISubprogram(name: "__printf_chk", scope: !848, file: !848, line: 95, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!854 = !DISubroutineType(types: !855)
!855 = !{!100, !100, !852, null}
!856 = !DILocation(line: 0, scope: !74)
!857 = !DILocation(line: 581, column: 7, scope: !221)
!858 = !{!859, !859, i64 0}
!859 = !{!"int", !804, i64 0}
!860 = !DILocation(line: 581, column: 19, scope: !221)
!861 = !DILocation(line: 581, column: 7, scope: !74)
!862 = !DILocation(line: 585, column: 26, scope: !220)
!863 = !DILocation(line: 0, scope: !220)
!864 = !DILocation(line: 586, column: 23, scope: !220)
!865 = !DILocation(line: 586, column: 28, scope: !220)
!866 = !DILocation(line: 586, column: 32, scope: !220)
!867 = !{!804, !804, i64 0}
!868 = !DILocation(line: 586, column: 38, scope: !220)
!869 = !DILocalVariable(name: "__s1", arg: 1, scope: !870, file: !871, line: 1359, type: !78)
!870 = distinct !DISubprogram(name: "streq", scope: !871, file: !871, line: 1359, type: !872, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !874)
!871 = !DIFile(filename: "./lib/string.h", directory: "/src")
!872 = !DISubroutineType(types: !873)
!873 = !{!223, !78, !78}
!874 = !{!869, !875}
!875 = !DILocalVariable(name: "__s2", arg: 2, scope: !870, file: !871, line: 1359, type: !78)
!876 = !DILocation(line: 0, scope: !870, inlinedAt: !877)
!877 = distinct !DILocation(line: 586, column: 41, scope: !220)
!878 = !DILocation(line: 1361, column: 11, scope: !870, inlinedAt: !877)
!879 = !DILocation(line: 1361, column: 10, scope: !870, inlinedAt: !877)
!880 = !DILocation(line: 586, column: 19, scope: !220)
!881 = !DILocation(line: 587, column: 5, scope: !220)
!882 = !DILocation(line: 588, column: 7, scope: !883)
!883 = distinct !DILexicalBlock(scope: !74, file: !75, line: 588, column: 7)
!884 = !DILocation(line: 588, column: 7, scope: !74)
!885 = !DILocation(line: 590, column: 7, scope: !886)
!886 = distinct !DILexicalBlock(scope: !883, file: !75, line: 589, column: 5)
!887 = !DILocation(line: 591, column: 7, scope: !886)
!888 = !DILocation(line: 595, column: 37, scope: !74)
!889 = !DILocation(line: 595, column: 35, scope: !74)
!890 = !DILocation(line: 596, column: 29, scope: !74)
!891 = !DILocation(line: 597, column: 8, scope: !229)
!892 = !DILocation(line: 597, column: 7, scope: !74)
!893 = !DILocation(line: 604, column: 24, scope: !228)
!894 = !DILocation(line: 604, column: 12, scope: !229)
!895 = !DILocation(line: 0, scope: !227)
!896 = !DILocation(line: 610, column: 16, scope: !227)
!897 = !DILocation(line: 610, column: 7, scope: !227)
!898 = !DILocation(line: 611, column: 21, scope: !227)
!899 = !{!900, !900, i64 0}
!900 = !{!"short", !804, i64 0}
!901 = !DILocation(line: 611, column: 19, scope: !227)
!902 = !DILocation(line: 611, column: 16, scope: !227)
!903 = !DILocation(line: 610, column: 30, scope: !227)
!904 = distinct !{!904, !897, !898, !905}
!905 = !{!"llvm.loop.mustprogress"}
!906 = !DILocation(line: 612, column: 18, scope: !907)
!907 = distinct !DILexicalBlock(scope: !227, file: !75, line: 612, column: 11)
!908 = !DILocation(line: 612, column: 11, scope: !227)
!909 = !DILocation(line: 618, column: 5, scope: !227)
!910 = !DILocation(line: 620, column: 23, scope: !74)
!911 = !DILocation(line: 625, column: 39, scope: !74)
!912 = !DILocation(line: 626, column: 3, scope: !74)
!913 = !DILocation(line: 626, column: 10, scope: !74)
!914 = !DILocation(line: 626, column: 21, scope: !74)
!915 = !DILocation(line: 628, column: 44, scope: !916)
!916 = distinct !DILexicalBlock(scope: !917, file: !75, line: 628, column: 11)
!917 = distinct !DILexicalBlock(scope: !74, file: !75, line: 627, column: 5)
!918 = !DILocation(line: 628, column: 32, scope: !916)
!919 = !DILocation(line: 628, column: 49, scope: !916)
!920 = !DILocation(line: 628, column: 11, scope: !917)
!921 = !DILocation(line: 630, column: 11, scope: !922)
!922 = distinct !DILexicalBlock(scope: !917, file: !75, line: 630, column: 11)
!923 = !DILocation(line: 630, column: 11, scope: !917)
!924 = !DILocation(line: 632, column: 26, scope: !925)
!925 = distinct !DILexicalBlock(scope: !926, file: !75, line: 632, column: 15)
!926 = distinct !DILexicalBlock(scope: !922, file: !75, line: 631, column: 9)
!927 = !DILocation(line: 632, column: 34, scope: !925)
!928 = !DILocation(line: 632, column: 37, scope: !925)
!929 = !DILocation(line: 632, column: 15, scope: !926)
!930 = !DILocation(line: 636, column: 16, scope: !931)
!931 = distinct !DILexicalBlock(scope: !926, file: !75, line: 636, column: 15)
!932 = !DILocation(line: 636, column: 29, scope: !931)
!933 = !DILocation(line: 640, column: 16, scope: !917)
!934 = distinct !{!934, !912, !935, !905}
!935 = !DILocation(line: 641, column: 5, scope: !74)
!936 = !DILocation(line: 644, column: 3, scope: !74)
!937 = !DILocation(line: 0, scope: !870, inlinedAt: !938)
!938 = distinct !DILocation(line: 648, column: 31, scope: !74)
!939 = !DILocation(line: 0, scope: !870, inlinedAt: !940)
!940 = distinct !DILocation(line: 649, column: 31, scope: !74)
!941 = !DILocation(line: 0, scope: !870, inlinedAt: !942)
!942 = distinct !DILocation(line: 650, column: 31, scope: !74)
!943 = !DILocation(line: 0, scope: !870, inlinedAt: !944)
!944 = distinct !DILocation(line: 651, column: 31, scope: !74)
!945 = !DILocation(line: 0, scope: !870, inlinedAt: !946)
!946 = distinct !DILocation(line: 652, column: 31, scope: !74)
!947 = !DILocation(line: 0, scope: !870, inlinedAt: !948)
!948 = distinct !DILocation(line: 653, column: 31, scope: !74)
!949 = !DILocation(line: 0, scope: !870, inlinedAt: !950)
!950 = distinct !DILocation(line: 654, column: 31, scope: !74)
!951 = !DILocation(line: 0, scope: !870, inlinedAt: !952)
!952 = distinct !DILocation(line: 655, column: 31, scope: !74)
!953 = !DILocation(line: 0, scope: !870, inlinedAt: !954)
!954 = distinct !DILocation(line: 656, column: 31, scope: !74)
!955 = !DILocation(line: 0, scope: !870, inlinedAt: !956)
!956 = distinct !DILocation(line: 657, column: 31, scope: !74)
!957 = !DILocation(line: 663, column: 7, scope: !958)
!958 = distinct !DILexicalBlock(scope: !74, file: !75, line: 663, column: 7)
!959 = !DILocation(line: 664, column: 7, scope: !958)
!960 = !DILocation(line: 664, column: 10, scope: !958)
!961 = !DILocation(line: 663, column: 7, scope: !74)
!962 = !DILocation(line: 669, column: 7, scope: !963)
!963 = distinct !DILexicalBlock(scope: !958, file: !75, line: 665, column: 5)
!964 = !DILocation(line: 671, column: 5, scope: !963)
!965 = !DILocation(line: 676, column: 7, scope: !966)
!966 = distinct !DILexicalBlock(scope: !958, file: !75, line: 673, column: 5)
!967 = !DILocation(line: 679, column: 3, scope: !74)
!968 = !DILocation(line: 683, column: 3, scope: !74)
!969 = !DILocation(line: 686, column: 3, scope: !74)
!970 = !DILocation(line: 688, column: 3, scope: !74)
!971 = !DILocation(line: 691, column: 3, scope: !74)
!972 = !DILocation(line: 695, column: 3, scope: !74)
!973 = !DILocation(line: 696, column: 1, scope: !74)
!974 = !DISubprogram(name: "setlocale", scope: !975, file: !975, line: 122, type: !976, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!975 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!976 = !DISubroutineType(types: !977)
!977 = !{!244, !100, !78}
!978 = !DISubprogram(name: "strncmp", scope: !979, file: !979, line: 159, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!979 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!980 = !DISubroutineType(types: !981)
!981 = !{!100, !78, !78, !102}
!982 = !DISubprogram(name: "fputs_unlocked", scope: !983, file: !983, line: 691, type: !984, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!983 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!984 = !DISubroutineType(types: !985)
!985 = !{!100, !852, !851}
!986 = !DISubprogram(name: "exit", scope: !987, file: !987, line: 624, type: !792, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !846)
!987 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!988 = !DISubprogram(name: "getenv", scope: !987, file: !987, line: 641, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!989 = !DISubroutineType(types: !990)
!990 = !{!244, !78}
!991 = !DISubprogram(name: "strcmp", scope: !979, file: !979, line: 156, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!992 = !DISubroutineType(types: !993)
!993 = !{!100, !78, !78}
!994 = !DISubprogram(name: "strspn", scope: !979, file: !979, line: 297, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!995 = !DISubroutineType(types: !996)
!996 = !{!104, !78, !78}
!997 = !DISubprogram(name: "strchr", scope: !979, file: !979, line: 246, type: !998, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!998 = !DISubroutineType(types: !999)
!999 = !{!244, !78, !100}
!1000 = !DISubprogram(name: "__ctype_b_loc", scope: !83, file: !83, line: 79, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!1004 = !DISubprogram(name: "strcspn", scope: !979, file: !979, line: 293, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1005 = !DISubprogram(name: "fwrite_unlocked", scope: !983, file: !983, line: 704, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!102, !1008, !102, !102, !851}
!1008 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1011 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 94, type: !1012, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !1015)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!100, !100, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!1015 = !{!1016, !1017, !1018, !1020, !1021, !1023, !1026, !1027}
!1016 = !DILocalVariable(name: "argc", arg: 1, scope: !1011, file: !2, line: 94, type: !100)
!1017 = !DILocalVariable(name: "argv", arg: 2, scope: !1011, file: !2, line: 94, type: !1014)
!1018 = !DILocalVariable(name: "seconds", scope: !1011, file: !2, line: 96, type: !1019)
!1019 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1020 = !DILocalVariable(name: "ok", scope: !1011, file: !2, line: 97, type: !223)
!1021 = !DILocalVariable(name: "i", scope: !1022, file: !2, line: 117, type: !100)
!1022 = distinct !DILexicalBlock(scope: !1011, file: !2, line: 117, column: 3)
!1023 = !DILocalVariable(name: "p", scope: !1024, file: !2, line: 119, type: !244)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !2, line: 118, column: 5)
!1025 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 117, column: 3)
!1026 = !DILocalVariable(name: "duration", scope: !1024, file: !2, line: 121, type: !1019)
!1027 = !DILocalVariable(name: "s", scope: !1024, file: !2, line: 122, type: !1019)
!1028 = !DILocation(line: 0, scope: !1011)
!1029 = !DILocation(line: 100, column: 21, scope: !1011)
!1030 = !DILocation(line: 100, column: 3, scope: !1011)
!1031 = !DILocation(line: 101, column: 3, scope: !1011)
!1032 = !DILocation(line: 102, column: 3, scope: !1011)
!1033 = !DILocation(line: 103, column: 3, scope: !1011)
!1034 = !DILocation(line: 105, column: 3, scope: !1011)
!1035 = !DILocation(line: 108, column: 36, scope: !1011)
!1036 = !DILocation(line: 108, column: 58, scope: !1011)
!1037 = !DILocation(line: 107, column: 3, scope: !1011)
!1038 = !DILocation(line: 111, column: 12, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1011, file: !2, line: 111, column: 7)
!1040 = !DILocation(line: 111, column: 7, scope: !1011)
!1041 = !DILocation(line: 113, column: 7, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1039, file: !2, line: 112, column: 5)
!1043 = !DILocation(line: 114, column: 7, scope: !1042)
!1044 = !DILocation(line: 117, column: 16, scope: !1022)
!1045 = !DILocation(line: 0, scope: !1022)
!1046 = !DILocation(line: 117, column: 26, scope: !1025)
!1047 = !DILocation(line: 117, column: 3, scope: !1022)
!1048 = !DILocation(line: 138, column: 8, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1011, file: !2, line: 138, column: 7)
!1050 = !DILocation(line: 138, column: 7, scope: !1011)
!1051 = !DILocation(line: 119, column: 7, scope: !1024)
!1052 = !DILocation(line: 120, column: 13, scope: !1024)
!1053 = !DILocation(line: 121, column: 36, scope: !1024)
!1054 = !DILocation(line: 0, scope: !1024)
!1055 = !DILocation(line: 121, column: 25, scope: !1024)
!1056 = !DILocation(line: 122, column: 45, scope: !1024)
!1057 = !DILocalVariable(name: "c", arg: 1, scope: !1058, file: !1059, line: 54, type: !1019)
!1058 = distinct !DISubprogram(name: "dtimespec_bound", scope: !1059, file: !1059, line: 54, type: !1060, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !1062)
!1059 = !DIFile(filename: "./lib/dtimespec-bound.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1c1d0447ed5234421679b9baaf454c86")
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!1019, !1019, !100}
!1062 = !{!1057, !1063, !1064}
!1063 = !DILocalVariable(name: "err", arg: 2, scope: !1058, file: !1059, line: 54, type: !100)
!1064 = !DILocalVariable(name: "phi", scope: !1058, file: !1059, line: 70, type: !1019)
!1065 = !DILocation(line: 0, scope: !1058, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 122, column: 18, scope: !1024)
!1067 = !DILocation(line: 60, column: 11, scope: !1068, inlinedAt: !1066)
!1068 = distinct !DILexicalBlock(scope: !1058, file: !1059, line: 60, column: 7)
!1069 = !DILocation(line: 60, column: 21, scope: !1068, inlinedAt: !1066)
!1070 = !DILocation(line: 123, column: 11, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 123, column: 11)
!1072 = !DILocation(line: 123, column: 22, scope: !1071)
!1073 = !DILocation(line: 123, column: 19, scope: !1071)
!1074 = !DILocation(line: 125, column: 11, scope: !1071)
!1075 = !DILocation(line: 127, column: 15, scope: !1071)
!1076 = !DILocation(line: 127, column: 18, scope: !1071)
!1077 = !DILocation(line: 127, column: 25, scope: !1071)
!1078 = !DILocation(line: 127, column: 21, scope: !1071)
!1079 = !DILocation(line: 129, column: 11, scope: !1071)
!1080 = !DILocalVariable(name: "x", arg: 1, scope: !1081, file: !2, line: 65, type: !1084)
!1081 = distinct !DISubprogram(name: "apply_suffix", scope: !2, file: !2, line: 65, type: !1082, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !1085)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!223, !1084, !4}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1085 = !{!1080, !1086, !1087}
!1086 = !DILocalVariable(name: "suffix_char", arg: 2, scope: !1081, file: !2, line: 65, type: !4)
!1087 = !DILocalVariable(name: "multiplier", scope: !1081, file: !2, line: 67, type: !100)
!1088 = !DILocation(line: 0, scope: !1081, inlinedAt: !1089)
!1089 = distinct !DILocation(line: 129, column: 16, scope: !1071)
!1090 = !DILocation(line: 69, column: 11, scope: !1081, inlinedAt: !1089)
!1091 = !DILocation(line: 69, column: 3, scope: !1081, inlinedAt: !1089)
!1092 = !DILocation(line: 77, column: 7, scope: !1093, inlinedAt: !1089)
!1093 = distinct !DILexicalBlock(scope: !1081, file: !2, line: 70, column: 5)
!1094 = !DILocation(line: 80, column: 7, scope: !1093, inlinedAt: !1089)
!1095 = !DILocation(line: 83, column: 7, scope: !1093, inlinedAt: !1089)
!1096 = !DILocation(line: 88, column: 28, scope: !1081, inlinedAt: !1089)
!1097 = !DILocation(line: 0, scope: !1058, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 88, column: 8, scope: !1081, inlinedAt: !1089)
!1099 = !DILocation(line: 60, column: 21, scope: !1068, inlinedAt: !1098)
!1100 = !DILocation(line: 123, column: 11, scope: !1024)
!1101 = !DILocation(line: 131, column: 11, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1071, file: !2, line: 130, column: 9)
!1103 = !DILocation(line: 133, column: 9, scope: !1102)
!1104 = !DILocation(line: 122, column: 14, scope: !1024)
!1105 = !DILocation(line: 135, column: 42, scope: !1024)
!1106 = !DILocation(line: 0, scope: !1058, inlinedAt: !1107)
!1107 = distinct !DILocation(line: 135, column: 17, scope: !1024)
!1108 = !DILocation(line: 60, column: 21, scope: !1068, inlinedAt: !1107)
!1109 = !DILocation(line: 136, column: 5, scope: !1025)
!1110 = !DILocation(line: 117, column: 35, scope: !1025)
!1111 = distinct !{!1111, !1047, !1112, !905}
!1112 = !DILocation(line: 136, column: 5, scope: !1022)
!1113 = !DILocation(line: 139, column: 5, scope: !1049)
!1114 = !DILocation(line: 141, column: 7, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1011, file: !2, line: 141, column: 7)
!1116 = !DILocation(line: 141, column: 7, scope: !1011)
!1117 = !DILocation(line: 142, column: 5, scope: !1115)
!1118 = !DILocation(line: 144, column: 3, scope: !1011)
!1119 = !DISubprogram(name: "bindtextdomain", scope: !843, file: !843, line: 86, type: !1120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!244, !78, !78}
!1122 = !DISubprogram(name: "textdomain", scope: !843, file: !843, line: 82, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1123 = !DISubprogram(name: "atexit", scope: !987, file: !987, line: 602, type: !1124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!100, !366}
!1126 = !DISubprogram(name: "__errno_location", scope: !1127, file: !1127, line: 37, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1127 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!390}
!1130 = distinct !DISubprogram(name: "cl_strtod", scope: !700, file: !700, line: 59, type: !1131, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !699, retainedNodes: !1134)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1019, !78, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1014)
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1142, !1143}
!1135 = !DILocalVariable(name: "nptr", arg: 1, scope: !1130, file: !700, line: 59, type: !78)
!1136 = !DILocalVariable(name: "endptr", arg: 2, scope: !1130, file: !700, line: 59, type: !1133)
!1137 = !DILocalVariable(name: "end", scope: !1130, file: !700, line: 61, type: !244)
!1138 = !DILocalVariable(name: "d", scope: !1130, file: !700, line: 62, type: !1019)
!1139 = !DILocalVariable(name: "strtod_errno", scope: !1140, file: !700, line: 65, type: !100)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !700, line: 64, column: 5)
!1141 = distinct !DILexicalBlock(scope: !1130, file: !700, line: 63, column: 7)
!1142 = !DILocalVariable(name: "c_end", scope: !1140, file: !700, line: 66, type: !244)
!1143 = !DILocalVariable(name: "c", scope: !1140, file: !700, line: 67, type: !1019)
!1144 = !DILocation(line: 0, scope: !1130)
!1145 = !DILocation(line: 61, column: 3, scope: !1130)
!1146 = !DILocation(line: 62, column: 14, scope: !1130)
!1147 = !DILocation(line: 63, column: 8, scope: !1141)
!1148 = !DILocation(line: 63, column: 7, scope: !1141)
!1149 = !DILocation(line: 63, column: 7, scope: !1130)
!1150 = !DILocation(line: 65, column: 26, scope: !1140)
!1151 = !DILocation(line: 0, scope: !1140)
!1152 = !DILocation(line: 66, column: 7, scope: !1140)
!1153 = !DILocation(line: 67, column: 18, scope: !1140)
!1154 = !DILocation(line: 68, column: 17, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1140, file: !700, line: 68, column: 11)
!1156 = !DILocation(line: 68, column: 15, scope: !1155)
!1157 = !DILocation(line: 68, column: 11, scope: !1140)
!1158 = !DILocation(line: 71, column: 15, scope: !1155)
!1159 = !DILocation(line: 72, column: 5, scope: !1141)
!1160 = !DILocation(line: 72, column: 5, scope: !1140)
!1161 = !DILocation(line: 73, column: 7, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1130, file: !700, line: 73, column: 7)
!1163 = !DILocation(line: 73, column: 7, scope: !1130)
!1164 = !DILocation(line: 74, column: 13, scope: !1162)
!1165 = !DILocation(line: 74, column: 5, scope: !1162)
!1166 = !DILocation(line: 76, column: 1, scope: !1130)
!1167 = !DILocation(line: 75, column: 3, scope: !1130)
!1168 = !DISubprogram(name: "strtod", scope: !987, file: !987, line: 118, type: !1169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!1019, !852, !1133}
!1171 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !305, file: !305, line: 50, type: !812, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !304, retainedNodes: !1172)
!1172 = !{!1173}
!1173 = !DILocalVariable(name: "file", arg: 1, scope: !1171, file: !305, line: 50, type: !78)
!1174 = !DILocation(line: 0, scope: !1171)
!1175 = !DILocation(line: 52, column: 13, scope: !1171)
!1176 = !DILocation(line: 53, column: 1, scope: !1171)
!1177 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !305, file: !305, line: 87, type: !1178, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !304, retainedNodes: !1180)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{null, !223}
!1180 = !{!1181}
!1181 = !DILocalVariable(name: "ignore", arg: 1, scope: !1177, file: !305, line: 87, type: !223)
!1182 = !DILocation(line: 0, scope: !1177)
!1183 = !DILocation(line: 89, column: 16, scope: !1177)
!1184 = !{!1185, !1185, i64 0}
!1185 = !{!"_Bool", !804, i64 0}
!1186 = !DILocation(line: 90, column: 1, scope: !1177)
!1187 = distinct !DISubprogram(name: "close_stdout", scope: !305, file: !305, line: 116, type: !367, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !304, retainedNodes: !1188)
!1188 = !{!1189}
!1189 = !DILocalVariable(name: "write_error", scope: !1190, file: !305, line: 121, type: !78)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !305, line: 120, column: 5)
!1191 = distinct !DILexicalBlock(scope: !1187, file: !305, line: 118, column: 7)
!1192 = !DILocation(line: 118, column: 21, scope: !1191)
!1193 = !DILocation(line: 118, column: 7, scope: !1191)
!1194 = !DILocation(line: 118, column: 29, scope: !1191)
!1195 = !DILocation(line: 119, column: 7, scope: !1191)
!1196 = !DILocation(line: 119, column: 12, scope: !1191)
!1197 = !{i8 0, i8 2}
!1198 = !DILocation(line: 119, column: 25, scope: !1191)
!1199 = !DILocation(line: 119, column: 28, scope: !1191)
!1200 = !DILocation(line: 119, column: 34, scope: !1191)
!1201 = !DILocation(line: 118, column: 7, scope: !1187)
!1202 = !DILocation(line: 121, column: 33, scope: !1190)
!1203 = !DILocation(line: 0, scope: !1190)
!1204 = !DILocation(line: 122, column: 11, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1190, file: !305, line: 122, column: 11)
!1206 = !DILocation(line: 0, scope: !1205)
!1207 = !DILocation(line: 122, column: 11, scope: !1190)
!1208 = !DILocation(line: 123, column: 9, scope: !1205)
!1209 = !DILocation(line: 126, column: 9, scope: !1205)
!1210 = !DILocation(line: 128, column: 14, scope: !1190)
!1211 = !DILocation(line: 128, column: 7, scope: !1190)
!1212 = !DILocation(line: 133, column: 42, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1187, file: !305, line: 133, column: 7)
!1214 = !DILocation(line: 133, column: 28, scope: !1213)
!1215 = !DILocation(line: 133, column: 50, scope: !1213)
!1216 = !DILocation(line: 133, column: 7, scope: !1187)
!1217 = !DILocation(line: 134, column: 12, scope: !1213)
!1218 = !DILocation(line: 134, column: 5, scope: !1213)
!1219 = !DILocation(line: 135, column: 1, scope: !1187)
!1220 = !DISubprogram(name: "_exit", scope: !1221, file: !1221, line: 624, type: !792, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !846)
!1221 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1222 = distinct !DISubprogram(name: "verror", scope: !320, file: !320, line: 251, type: !1223, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1225)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{null, !100, !100, !78, !330}
!1225 = !{!1226, !1227, !1228, !1229}
!1226 = !DILocalVariable(name: "status", arg: 1, scope: !1222, file: !320, line: 251, type: !100)
!1227 = !DILocalVariable(name: "errnum", arg: 2, scope: !1222, file: !320, line: 251, type: !100)
!1228 = !DILocalVariable(name: "message", arg: 3, scope: !1222, file: !320, line: 251, type: !78)
!1229 = !DILocalVariable(name: "args", arg: 4, scope: !1222, file: !320, line: 251, type: !330)
!1230 = !DILocation(line: 0, scope: !1222)
!1231 = !DILocation(line: 261, column: 3, scope: !1222)
!1232 = !DILocation(line: 265, column: 7, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1222, file: !320, line: 265, column: 7)
!1234 = !DILocation(line: 265, column: 7, scope: !1222)
!1235 = !DILocation(line: 266, column: 5, scope: !1233)
!1236 = !DILocation(line: 272, column: 7, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1233, file: !320, line: 268, column: 5)
!1238 = !DILocation(line: 276, column: 3, scope: !1222)
!1239 = !DILocation(line: 282, column: 1, scope: !1222)
!1240 = distinct !DISubprogram(name: "flush_stdout", scope: !320, file: !320, line: 163, type: !367, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1241)
!1241 = !{!1242}
!1242 = !DILocalVariable(name: "stdout_fd", scope: !1240, file: !320, line: 166, type: !100)
!1243 = !DILocation(line: 0, scope: !1240)
!1244 = !DILocalVariable(name: "fd", arg: 1, scope: !1245, file: !320, line: 145, type: !100)
!1245 = distinct !DISubprogram(name: "is_open", scope: !320, file: !320, line: 145, type: !1246, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1248)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!100, !100}
!1248 = !{!1244}
!1249 = !DILocation(line: 0, scope: !1245, inlinedAt: !1250)
!1250 = distinct !DILocation(line: 182, column: 25, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1240, file: !320, line: 182, column: 7)
!1252 = !DILocation(line: 157, column: 15, scope: !1245, inlinedAt: !1250)
!1253 = !DILocation(line: 157, column: 12, scope: !1245, inlinedAt: !1250)
!1254 = !DILocation(line: 182, column: 7, scope: !1240)
!1255 = !DILocation(line: 184, column: 5, scope: !1251)
!1256 = !DILocation(line: 185, column: 1, scope: !1240)
!1257 = distinct !DISubprogram(name: "error_tail", scope: !320, file: !320, line: 219, type: !1223, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1258)
!1258 = !{!1259, !1260, !1261, !1262}
!1259 = !DILocalVariable(name: "status", arg: 1, scope: !1257, file: !320, line: 219, type: !100)
!1260 = !DILocalVariable(name: "errnum", arg: 2, scope: !1257, file: !320, line: 219, type: !100)
!1261 = !DILocalVariable(name: "message", arg: 3, scope: !1257, file: !320, line: 219, type: !78)
!1262 = !DILocalVariable(name: "args", arg: 4, scope: !1257, file: !320, line: 219, type: !330)
!1263 = !DILocation(line: 0, scope: !1257)
!1264 = !DILocation(line: 229, column: 13, scope: !1257)
!1265 = !DILocalVariable(name: "__stream", arg: 1, scope: !1266, file: !848, line: 132, type: !1269)
!1266 = distinct !DISubprogram(name: "vfprintf", scope: !848, file: !848, line: 132, type: !1267, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1304)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!100, !1269, !852, !330}
!1269 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1270)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !238, line: 7, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !240, line: 49, size: 1728, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1272, file: !240, line: 51, baseType: !100, size: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1272, file: !240, line: 54, baseType: !244, size: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1272, file: !240, line: 55, baseType: !244, size: 64, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1272, file: !240, line: 56, baseType: !244, size: 64, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1272, file: !240, line: 57, baseType: !244, size: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1272, file: !240, line: 58, baseType: !244, size: 64, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1272, file: !240, line: 59, baseType: !244, size: 64, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1272, file: !240, line: 60, baseType: !244, size: 64, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1272, file: !240, line: 61, baseType: !244, size: 64, offset: 512)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1272, file: !240, line: 64, baseType: !244, size: 64, offset: 576)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1272, file: !240, line: 65, baseType: !244, size: 64, offset: 640)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1272, file: !240, line: 66, baseType: !244, size: 64, offset: 704)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1272, file: !240, line: 68, baseType: !256, size: 64, offset: 768)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1272, file: !240, line: 70, baseType: !1288, size: 64, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1272, file: !240, line: 72, baseType: !100, size: 32, offset: 896)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1272, file: !240, line: 73, baseType: !100, size: 32, offset: 928)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1272, file: !240, line: 74, baseType: !263, size: 64, offset: 960)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1272, file: !240, line: 77, baseType: !101, size: 16, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1272, file: !240, line: 78, baseType: !268, size: 8, offset: 1040)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1272, file: !240, line: 79, baseType: !29, size: 8, offset: 1048)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1272, file: !240, line: 81, baseType: !271, size: 64, offset: 1088)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1272, file: !240, line: 89, baseType: !274, size: 64, offset: 1152)
