; ModuleID = 'src/split.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.numname = type { i32, [8 x i8] }
%struct.__mbstate_t = type { i32, %struct.sched_param }
%struct.sched_param = type { i32 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.posix_spawnattr_t = type { i16, i32, %struct.__sigset_t, %struct.__sigset_t, %struct.sched_param, i32, [16 x i32] }
%struct.__sigset_t = type { [16 x i64] }
%struct.posix_spawn_file_actions_t = type { i32, i32, ptr, [16 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon }
%union.anon = type { x86_fp80 }


!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 20)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1623, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 63)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1637, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 28)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1637, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1656, type: !293, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1664, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 64)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1670, type: !340, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1672, type: !240, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1684, type: !264, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1701, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 31)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1750, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1750, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 184, elements: !272)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "filter_command", scope: !110, file: !2, line: 56, type: !216, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "filter_pid", scope: !110, file: !2, line: 59, type: !373, isLocal: true, isDefinition: true)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !374, line: 97, baseType: !375)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !203, line: 154, baseType: !107)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "default_SIGPIPE", scope: !110, file: !2, line: 67, type: !206, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "outfile", scope: !110, file: !2, line: 73, type: !109, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "suffix_length", scope: !110, file: !2, line: 83, type: !382, isLocal: true, isDefinition: true)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !383, line: 130, baseType: !384)
!383 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !215, line: 35, baseType: !204)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !110, file: !2, line: 89, type: !216, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !110, file: !2, line: 92, type: !216, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !110, file: !2, line: 98, type: !391, isLocal: true, isDefinition: true)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !392, line: 26, size: 1152, elements: !393)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!393 = !{!394, !396, !398, !400, !402, !404, !406, !407, !408, !409, !411, !413, !421, !422, !423}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !391, file: !392, line: 31, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !203, line: 145, baseType: !207)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !391, file: !392, line: 36, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !203, line: 148, baseType: !207)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !391, file: !392, line: 44, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !203, line: 151, baseType: !207)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !391, file: !392, line: 45, baseType: !401, size: 32, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !203, line: 150, baseType: !113)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !391, file: !392, line: 47, baseType: !403, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !203, line: 146, baseType: !113)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !391, file: !392, line: 48, baseType: !405, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !203, line: 147, baseType: !113)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !391, file: !392, line: 50, baseType: !107, size: 32, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !391, file: !392, line: 52, baseType: !395, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !391, file: !392, line: 57, baseType: !202, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !391, file: !392, line: 61, baseType: !410, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !203, line: 175, baseType: !204)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !391, file: !392, line: 63, baseType: !412, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !203, line: 180, baseType: !204)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !391, file: !392, line: 74, baseType: !414, size: 128, offset: 576)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !415, line: 11, size: 128, elements: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!416 = !{!417, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !414, file: !415, line: 16, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !203, line: 160, baseType: !204)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !414, file: !415, line: 21, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !203, line: 197, baseType: !204)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !391, file: !392, line: 75, baseType: !414, size: 128, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !391, file: !392, line: 76, baseType: !414, size: 128, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !391, file: !392, line: 89, baseType: !424, size: 192, offset: 960)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 192, elements: !265)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "verbose", scope: !110, file: !2, line: 105, type: !206, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !110, file: !2, line: 108, type: !206, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "unbuffered", scope: !110, file: !2, line: 112, type: !206, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !156, line: 729, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 56)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !156, line: 736, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 75)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !443, file: !156, line: 575, type: !107, isLocal: true, isDefinition: true)
!443 = distinct !DISubprogram(name: "oputs_", scope: !156, file: !156, line: 573, type: !444, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !446)
!444 = !DISubroutineType(cc: DW_CC_nocall, types: !445)
!445 = !{null, !216, !216}
!446 = !{!447, !448, !449, !452, !453, !454, !455, !459, !460, !461, !462, !464, !510, !511, !512, !514, !515}
!447 = !DILocalVariable(name: "program", arg: 1, scope: !443, file: !156, line: 573, type: !216)
!448 = !DILocalVariable(name: "option", arg: 2, scope: !443, file: !156, line: 573, type: !216)
!449 = !DILocalVariable(name: "term", scope: !450, file: !156, line: 585, type: !216)
!450 = distinct !DILexicalBlock(scope: !451, file: !156, line: 582, column: 5)
!451 = distinct !DILexicalBlock(scope: !443, file: !156, line: 581, column: 7)
!452 = !DILocalVariable(name: "double_space", scope: !443, file: !156, line: 594, type: !206)
!453 = !DILocalVariable(name: "first_word", scope: !443, file: !156, line: 595, type: !216)
!454 = !DILocalVariable(name: "option_text", scope: !443, file: !156, line: 596, type: !216)
!455 = !DILocalVariable(name: "s", scope: !456, file: !156, line: 608, type: !216)
!456 = distinct !DILexicalBlock(scope: !457, file: !156, line: 605, column: 5)
!457 = distinct !DILexicalBlock(scope: !458, file: !156, line: 604, column: 12)
!458 = distinct !DILexicalBlock(scope: !443, file: !156, line: 597, column: 7)
!459 = !DILocalVariable(name: "spaces", scope: !456, file: !156, line: 609, type: !214)
!460 = !DILocalVariable(name: "anchor_len", scope: !443, file: !156, line: 620, type: !214)
!461 = !DILocalVariable(name: "desc_text", scope: !443, file: !156, line: 625, type: !216)
!462 = !DILocalVariable(name: "__ptr", scope: !463, file: !156, line: 644, type: !216)
!463 = distinct !DILexicalBlock(scope: !443, file: !156, line: 644, column: 3)
!464 = !DILocalVariable(name: "__stream", scope: !463, file: !156, line: 644, type: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !467, line: 7, baseType: !468)
!467 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !469, line: 49, size: 1728, elements: !470)
!469 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !486, !488, !489, !490, !491, !492, !493, !494, !497, !499, !502, !505, !506, !507, !508, !509}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !468, file: !469, line: 51, baseType: !107, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !468, file: !469, line: 54, baseType: !109, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !468, file: !469, line: 55, baseType: !109, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !468, file: !469, line: 56, baseType: !109, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !468, file: !469, line: 57, baseType: !109, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !468, file: !469, line: 58, baseType: !109, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !468, file: !469, line: 59, baseType: !109, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !468, file: !469, line: 60, baseType: !109, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !468, file: !469, line: 61, baseType: !109, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !468, file: !469, line: 64, baseType: !109, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !468, file: !469, line: 65, baseType: !109, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !468, file: !469, line: 66, baseType: !109, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !468, file: !469, line: 68, baseType: !484, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !469, line: 36, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !468, file: !469, line: 70, baseType: !487, size: 64, offset: 832)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !468, file: !469, line: 72, baseType: !107, size: 32, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !468, file: !469, line: 73, baseType: !107, size: 32, offset: 928)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !468, file: !469, line: 74, baseType: !202, size: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !468, file: !469, line: 77, baseType: !205, size: 16, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !468, file: !469, line: 78, baseType: !221, size: 8, offset: 1040)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !468, file: !469, line: 79, baseType: !225, size: 8, offset: 1048)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !468, file: !469, line: 81, baseType: !495, size: 64, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !469, line: 43, baseType: null)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !468, file: !469, line: 89, baseType: !498, size: 64, offset: 1152)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !203, line: 153, baseType: !204)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !468, file: !469, line: 91, baseType: !500, size: 64, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !469, line: 37, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !468, file: !469, line: 92, baseType: !503, size: 64, offset: 1280)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !469, line: 38, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !468, file: !469, line: 93, baseType: !487, size: 64, offset: 1344)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !468, file: !469, line: 94, baseType: !208, size: 64, offset: 1408)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !468, file: !469, line: 95, baseType: !214, size: 64, offset: 1472)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !468, file: !469, line: 96, baseType: !107, size: 32, offset: 1536)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !468, file: !469, line: 98, baseType: !325, size: 160, offset: 1568)
!510 = !DILocalVariable(name: "__cnt", scope: !463, file: !156, line: 644, type: !214)
!511 = !DILocalVariable(name: "url_program", scope: !443, file: !156, line: 648, type: !216)
!512 = !DILocalVariable(name: "__ptr", scope: !513, file: !156, line: 686, type: !216)
!513 = distinct !DILexicalBlock(scope: !443, file: !156, line: 686, column: 3)
!514 = !DILocalVariable(name: "__stream", scope: !513, file: !156, line: 686, type: !465)
!515 = !DILocalVariable(name: "__cnt", scope: !513, file: !156, line: 686, type: !214)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !156, line: 585, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 5)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !156, line: 586, type: !518, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !156, line: 595, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 4)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !156, line: 620, type: !16, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !156, line: 648, type: !340, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !156, line: 648, type: !518, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !156, line: 649, type: !525, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !156, line: 649, type: !264, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !156, line: 650, type: !518, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !156, line: 651, type: !16, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !156, line: 651, type: !16, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !156, line: 652, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 7)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !156, line: 653, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 8)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !156, line: 654, type: !230, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !156, line: 655, type: !230, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !156, line: 656, type: !230, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !156, line: 657, type: !230, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !156, line: 663, type: !546, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !156, line: 664, type: !230, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !156, line: 669, type: !293, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !156, line: 669, type: !283, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !156, line: 676, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 15)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !156, line: 676, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 61)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !156, line: 679, type: !264, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !156, line: 683, type: !518, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !156, line: 688, type: !518, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !156, line: 691, type: !551, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !156, line: 744, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 216)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !156, line: 839, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 16)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !156, line: 840, type: !245, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !156, line: 841, type: !572, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !156, line: 862, type: !525, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !156, line: 868, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 71)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !156, line: 875, type: !240, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !156, line: 877, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 51)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !156, line: 877, type: !363, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !16, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 137, type: !16, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 138, type: !288, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 139, type: !546, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !315, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !2, line: 141, type: !288, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !2, line: 142, type: !310, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !315, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !293, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !2, line: 146, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 13)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !546, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !551, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !230, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !363, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !518, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !551, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "longopts", scope: !110, file: !2, line: 134, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 4352, elements: !294)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !658, line: 50, size: 256, elements: !659)
!658 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!659 = !{!660, !661, !662, !664}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !658, line: 52, baseType: !216, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !657, file: !658, line: 55, baseType: !107, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !658, line: 56, baseType: !663, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !657, file: !658, line: 57, baseType: !107, size: 32, offset: 192)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1363, type: !546, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1396, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 25)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1398, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 21)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "eolchar", scope: !110, file: !2, line: 115, type: !107, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !240, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !110, file: !2, line: 86, type: !216, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !2, line: 209, type: !685, isLocal: true, isDefinition: true)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 42)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !110, file: !2, line: 80, type: !206, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "infile", scope: !110, file: !2, line: 95, type: !216, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !340, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "outbase", scope: !110, file: !2, line: 70, type: !216, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "sufindex", scope: !698, file: !2, line: 409, type: !711, isLocal: true, isDefinition: true)
!698 = distinct !DISubprogram(name: "next_file_name", scope: !2, file: !2, line: 406, type: !699, scopeLine: 407, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{null}
!701 = !{!702, !705, !706, !707, !710, !712, !714}
!702 = !DILocalVariable(name: "overflow", scope: !703, file: !2, line: 416, type: !206)
!703 = distinct !DILexicalBlock(scope: !704, file: !2, line: 415, column: 5)
!704 = distinct !DILexicalBlock(scope: !698, file: !2, line: 414, column: 7)
!705 = !DILocalVariable(name: "widen", scope: !703, file: !2, line: 416, type: !206)
!706 = !DILocalVariable(name: "outfile_size", scope: !703, file: !2, line: 441, type: !382)
!707 = !DILocalVariable(name: "i", scope: !708, file: !2, line: 470, type: !382)
!708 = distinct !DILexicalBlock(scope: !709, file: !2, line: 466, column: 9)
!709 = distinct !DILexicalBlock(scope: !703, file: !2, line: 465, column: 11)
!710 = !DILocalVariable(name: "sufindex_end", scope: !708, file: !2, line: 474, type: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!712 = !DILocalVariable(name: "i", scope: !713, file: !2, line: 497, type: !382)
!713 = distinct !DILexicalBlock(scope: !704, file: !2, line: 494, column: 5)
!714 = !DILabel(scope: !703, name: "new_name", file: !2, line: 418)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "outbase_length", scope: !698, file: !2, line: 410, type: !382, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "outfile_length", scope: !698, file: !2, line: 411, type: !382, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !698, file: !2, line: 412, type: !382, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !551, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 208, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 26)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !358, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !110, file: !2, line: 77, type: !109, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !2, line: 521, type: !315, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 532, type: !315, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !2, line: 534, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 35)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !2, line: 538, type: !674, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 544, type: !518, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !283, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !2, line: 548, type: !235, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !2, line: 569, type: !255, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !245, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !2, line: 592, type: !669, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !2, line: 595, type: !16, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !551, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 598, type: !264, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !255, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !2, line: 611, type: !240, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !110, file: !2, line: 64, type: !107, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "open_pipes", scope: !110, file: !2, line: 62, type: !663, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !110, file: !2, line: 63, type: !382, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1074, type: !595, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1074, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 608, elements: !64)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !2, line: 945, type: !363, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !2, line: 945, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 592, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 74)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !156, line: 952, type: !363, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1197, type: !340, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 646, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !726)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !2, line: 654, type: !264, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !794, isLocal: true, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 41)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !2, line: 664, type: !3, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !2, line: 670, type: !738, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "output_desc", scope: !110, file: !2, line: 101, type: !107, isLocal: true, isDefinition: true)
!803 = !{!804, !805, !806, !807, !808, !809, !813, !814, !815, !816, !817, !819, !822, !824, !825, !828}
!804 = !DILocalVariable(name: "argc", arg: 1, scope: !104, file: !2, line: 1407, type: !107)
!805 = !DILocalVariable(name: "argv", arg: 2, scope: !104, file: !2, line: 1407, type: !108)
!806 = !DILocalVariable(name: "split_type", scope: !104, file: !2, line: 1409, type: !112)
!807 = !DILocalVariable(name: "in_blk_size", scope: !104, file: !2, line: 1410, type: !382)
!808 = !DILocalVariable(name: "page_size", scope: !104, file: !2, line: 1411, type: !382)
!809 = !DILocalVariable(name: "k_units", scope: !104, file: !2, line: 1412, type: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !811, line: 101, baseType: !812)
!811 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !203, line: 72, baseType: !204)
!813 = !DILocalVariable(name: "n_units", scope: !104, file: !2, line: 1413, type: !810)
!814 = !DILocalVariable(name: "c", scope: !104, file: !2, line: 1416, type: !107)
!815 = !DILocalVariable(name: "digits_optind", scope: !104, file: !2, line: 1417, type: !107)
!816 = !DILocalVariable(name: "file_size", scope: !104, file: !2, line: 1418, type: !200)
!817 = !DILocalVariable(name: "this_optind", scope: !818, file: !2, line: 1433, type: !107)
!818 = distinct !DILexicalBlock(scope: !104, file: !2, line: 1431, column: 5)
!819 = !DILocalVariable(name: "suffix_len", scope: !820, file: !2, line: 1449, type: !107)
!820 = distinct !DILexicalBlock(scope: !821, file: !2, line: 1448, column: 11)
!821 = distinct !DILexicalBlock(scope: !818, file: !2, line: 1441, column: 9)
!822 = !DILocalVariable(name: "neweol", scope: !823, file: !2, line: 1512, type: !4)
!823 = distinct !DILexicalBlock(scope: !821, file: !2, line: 1511, column: 11)
!824 = !DILocalVariable(name: "buf", scope: !104, file: !2, line: 1693, type: !109)
!825 = !DILocalVariable(name: "initial_read", scope: !104, file: !2, line: 1694, type: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !201, line: 77, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !203, line: 194, baseType: !204)
!828 = !DILocalVariable(name: "files", scope: !829, file: !2, line: 1744, type: !831)
!829 = distinct !DILexicalBlock(scope: !830, file: !2, line: 1743, column: 7)
!830 = distinct !DILexicalBlock(scope: !104, file: !2, line: 1712, column: 5)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "of_t", file: !2, line: 1122, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "of_info", file: !2, line: 1116, size: 256, elements: !834)
!834 = !{!835, !836, !837, !838}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "of_name", scope: !833, file: !2, line: 1118, baseType: !109, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ofd", scope: !833, file: !2, line: 1119, baseType: !107, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ofile", scope: !833, file: !2, line: 1120, baseType: !465, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "opid", scope: !833, file: !2, line: 1121, baseType: !373, size: 32, offset: 192)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 120, elements: !573)
!840 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!841 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!842 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!843 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "tempfile", scope: !846, file: !847, line: 86, type: !109, isLocal: true, isDefinition: true)
!846 = distinct !DISubprogram(name: "temp_stream", scope: !847, file: !847, line: 84, type: !848, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !885, retainedNodes: !906)
!847 = !DIFile(filename: "src/temp-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8878e64e34a1409e8108ead719db2042")
!848 = !DISubroutineType(types: !849)
!849 = !{!206, !850, !108}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !467, line: 7, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !469, line: 49, size: 1728, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !853, file: !469, line: 51, baseType: !107, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !853, file: !469, line: 54, baseType: !109, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !853, file: !469, line: 55, baseType: !109, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !853, file: !469, line: 56, baseType: !109, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !853, file: !469, line: 57, baseType: !109, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !853, file: !469, line: 58, baseType: !109, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !853, file: !469, line: 59, baseType: !109, size: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !853, file: !469, line: 60, baseType: !109, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !853, file: !469, line: 61, baseType: !109, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !853, file: !469, line: 64, baseType: !109, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !853, file: !469, line: 65, baseType: !109, size: 64, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !853, file: !469, line: 66, baseType: !109, size: 64, offset: 704)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !853, file: !469, line: 68, baseType: !484, size: 64, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !853, file: !469, line: 70, baseType: !869, size: 64, offset: 832)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !853, file: !469, line: 72, baseType: !107, size: 32, offset: 896)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !853, file: !469, line: 73, baseType: !107, size: 32, offset: 928)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !853, file: !469, line: 74, baseType: !202, size: 64, offset: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !853, file: !469, line: 77, baseType: !205, size: 16, offset: 1024)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !853, file: !469, line: 78, baseType: !221, size: 8, offset: 1040)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !853, file: !469, line: 79, baseType: !225, size: 8, offset: 1048)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !853, file: !469, line: 81, baseType: !495, size: 64, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !853, file: !469, line: 89, baseType: !498, size: 64, offset: 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !853, file: !469, line: 91, baseType: !500, size: 64, offset: 1216)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !853, file: !469, line: 92, baseType: !503, size: 64, offset: 1280)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !853, file: !469, line: 93, baseType: !869, size: 64, offset: 1344)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !853, file: !469, line: 94, baseType: !208, size: 64, offset: 1408)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !853, file: !469, line: 95, baseType: !214, size: 64, offset: 1472)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !853, file: !469, line: 96, baseType: !107, size: 32, offset: 1536)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !853, file: !469, line: 98, baseType: !325, size: 160, offset: 1568)
!885 = distinct !DICompileUnit(language: DW_LANG_C11, file: !847, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !886, retainedTypes: !887, globals: !888, splitDebugInlining: false, nameTableKind: None)
!886 = !{!160}
!887 = !{!208}
!888 = !{!844, !889, !891, !893, !895, !897, !899, !904}
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !846, file: !847, line: 87, type: !851, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !847, line: 97, type: !738, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !847, line: 101, type: !16, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !847, line: 128, type: !738, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !847, line: 133, type: !264, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !847, line: 136, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 30)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !847, line: 154, type: !358, isLocal: true, isDefinition: true)
!906 = !{!907, !908, !909, !912, !913, !914}
!907 = !DILocalVariable(name: "fp", arg: 1, scope: !846, file: !847, line: 84, type: !850)
!908 = !DILocalVariable(name: "file_name", arg: 2, scope: !846, file: !847, line: 84, type: !108)
!909 = !DILocalVariable(name: "tempbuf", scope: !910, file: !847, line: 90, type: !109)
!910 = distinct !DILexicalBlock(scope: !911, file: !847, line: 89, column: 5)
!911 = distinct !DILexicalBlock(scope: !846, file: !847, line: 88, column: 7)
!912 = !DILocalVariable(name: "tempbuf_len", scope: !910, file: !847, line: 91, type: !214)
!913 = !DILocalVariable(name: "fd", scope: !910, file: !847, line: 125, type: !107)
!914 = !DILabel(scope: !915, name: "Reset", file: !847, line: 140)
!915 = distinct !DILexicalBlock(scope: !916, file: !847, line: 135, column: 9)
!916 = distinct !DILexicalBlock(scope: !910, file: !847, line: 134, column: 11)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !919, line: 3, type: !572, isLocal: true, isDefinition: true)
!919 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "Version", scope: !922, file: !919, line: 3, type: !216, isLocal: false, isDefinition: true)
!922 = distinct !DICompileUnit(language: DW_LANG_C11, file: !919, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !923, splitDebugInlining: false, nameTableKind: None)
!923 = !{!917, !920}
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "file_name", scope: !926, file: !927, line: 45, type: !216, isLocal: true, isDefinition: true)
!926 = distinct !DICompileUnit(language: DW_LANG_C11, file: !927, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !928, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!928 = !{!929, !931, !933, !935, !924, !937}
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !927, line: 121, type: !546, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !927, line: 121, type: !363, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !927, line: 123, type: !546, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !927, line: 126, type: !264, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !926, file: !927, line: 55, type: !206, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !941, file: !942, line: 66, type: !985, isLocal: false, isDefinition: true)
!941 = distinct !DICompileUnit(language: DW_LANG_C11, file: !942, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !943, globals: !944, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!943 = !{!208, !218}
!944 = !{!945, !947, !967, !969, !971, !973, !939, !975, !977, !979, !981, !983}
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !942, line: 272, type: !518, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "old_file_name", scope: !949, file: !942, line: 304, type: !216, isLocal: true, isDefinition: true)
!949 = distinct !DISubprogram(name: "verror_at_line", scope: !942, file: !942, line: 298, type: !950, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !941, retainedNodes: !960)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !107, !107, !216, !113, !216, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !954)
!954 = !{!955, !957, !958, !959}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !953, file: !956, baseType: !113, size: 32)
!956 = !DIFile(filename: "lib/error.c", directory: "/src")
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !953, file: !956, baseType: !113, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !953, file: !956, baseType: !208, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !953, file: !956, baseType: !208, size: 64, offset: 128)
!960 = !{!961, !962, !963, !964, !965, !966}
!961 = !DILocalVariable(name: "status", arg: 1, scope: !949, file: !942, line: 298, type: !107)
!962 = !DILocalVariable(name: "errnum", arg: 2, scope: !949, file: !942, line: 298, type: !107)
!963 = !DILocalVariable(name: "file_name", arg: 3, scope: !949, file: !942, line: 298, type: !216)
!964 = !DILocalVariable(name: "line_number", arg: 4, scope: !949, file: !942, line: 298, type: !113)
!965 = !DILocalVariable(name: "message", arg: 5, scope: !949, file: !942, line: 298, type: !216)
!966 = !DILocalVariable(name: "args", arg: 6, scope: !949, file: !942, line: 298, type: !952)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "old_line_number", scope: !949, file: !942, line: 305, type: !113, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !942, line: 338, type: !525, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !942, line: 346, type: !551, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !942, line: 346, type: !340, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "error_message_count", scope: !941, file: !942, line: 69, type: !113, isLocal: false, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !941, file: !942, line: 295, type: !107, isLocal: false, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !942, line: 208, type: !546, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !942, line: 208, type: !674, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !942, line: 214, type: !518, isLocal: true, isDefinition: true)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "program_name", scope: !988, file: !989, line: 31, type: !216, isLocal: false, isDefinition: true)
!988 = distinct !DICompileUnit(language: DW_LANG_C11, file: !989, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !990, globals: !991, splitDebugInlining: false, nameTableKind: None)
!989 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!990 = !{!109}
!991 = !{!986, !992, !994}
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !989, line: 46, type: !551, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !989, line: 49, type: !525, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "utf07FF", scope: !998, file: !999, line: 46, type: !1026, isLocal: true, isDefinition: true)
!998 = distinct !DISubprogram(name: "proper_name_lite", scope: !999, file: !999, line: 38, type: !1000, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1002, retainedNodes: !1004)
!999 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!216, !216, !216}
!1002 = distinct !DICompileUnit(language: DW_LANG_C11, file: !999, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1003, splitDebugInlining: false, nameTableKind: None)
!1003 = !{!996}
!1004 = !{!1005, !1006, !1007, !1008, !1013}
!1005 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !998, file: !999, line: 38, type: !216)
!1006 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !998, file: !999, line: 38, type: !216)
!1007 = !DILocalVariable(name: "translation", scope: !998, file: !999, line: 40, type: !216)
!1008 = !DILocalVariable(name: "w", scope: !998, file: !999, line: 47, type: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1010, line: 37, baseType: !1011)
!1010 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !203, line: 57, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !203, line: 42, baseType: !113)
!1013 = !DILocalVariable(name: "mbs", scope: !998, file: !999, line: 48, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1015, line: 6, baseType: !1016)
!1015 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1017, line: 21, baseType: !1018)
!1017 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 13, size: 64, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1018, file: !1017, line: 15, baseType: !107, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1018, file: !1017, line: 20, baseType: !1022, size: 32, offset: 32)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1018, file: !1017, line: 16, size: 32, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1022, file: !1017, line: 18, baseType: !113, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1022, file: !1017, line: 19, baseType: !525, size: 32)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 16, elements: !341)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 78, type: !551, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 79, type: !16, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 80, type: !638, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 81, type: !638, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 82, type: !325, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 83, type: !340, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 84, type: !551, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 85, type: !546, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 86, type: !546, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 87, type: !551, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1050, file: !1029, line: 76, type: !1122, isLocal: false, isDefinition: true)
!1050 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1051, retainedTypes: !1057, globals: !1058, splitDebugInlining: false, nameTableKind: None)
!1051 = !{!160, !1052, !129}
!1052 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !161, line: 254, baseType: !113, size: 32, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1055 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1056 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1057 = !{!107, !205, !214}
!1058 = !{!1027, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1059, !1063, !1073, !1075, !1080, !1082, !1084, !1086, !1088, !1111, !1118, !1120}
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1050, file: !1029, line: 92, type: !1061, isLocal: false, isDefinition: true)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 320, elements: !231)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1050, file: !1029, line: 1040, type: !1065, isLocal: false, isDefinition: true)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1029, line: 56, size: 448, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1071, !1072}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1065, file: !1029, line: 59, baseType: !160, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1065, file: !1029, line: 62, baseType: !107, size: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1065, file: !1029, line: 66, baseType: !1070, size: 256, offset: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, elements: !552)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1065, file: !1029, line: 69, baseType: !216, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1065, file: !1029, line: 72, baseType: !216, size: 64, offset: 384)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1050, file: !1029, line: 107, type: !1065, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "slot0", scope: !1050, file: !1029, line: 831, type: !1077, isLocal: true, isDefinition: true)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 256)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 321, type: !340, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 357, type: !340, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 358, type: !340, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 199, type: !546, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(name: "quote", scope: !1090, file: !1029, line: 228, type: !1109, isLocal: true, isDefinition: true)
!1090 = distinct !DISubprogram(name: "gettext_quote", scope: !1029, file: !1029, line: 197, type: !1091, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1050, retainedNodes: !1093)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!216, !216, !160}
!1093 = !{!1094, !1095, !1096, !1097, !1098}
!1094 = !DILocalVariable(name: "msgid", arg: 1, scope: !1090, file: !1029, line: 197, type: !216)
!1095 = !DILocalVariable(name: "s", arg: 2, scope: !1090, file: !1029, line: 197, type: !160)
!1096 = !DILocalVariable(name: "translation", scope: !1090, file: !1029, line: 199, type: !216)
!1097 = !DILocalVariable(name: "w", scope: !1090, file: !1029, line: 229, type: !1009)
!1098 = !DILocalVariable(name: "mbs", scope: !1090, file: !1029, line: 230, type: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1015, line: 6, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1017, line: 21, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 13, size: 64, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1101, file: !1017, line: 15, baseType: !107, size: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1101, file: !1017, line: 20, baseType: !1105, size: 32, offset: 32)
!1105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1101, file: !1017, line: 16, size: 32, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1105, file: !1017, line: 18, baseType: !113, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1105, file: !1017, line: 19, baseType: !525, size: 32)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !1110)
!1110 = !{!342, !527}
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(name: "slotvec", scope: !1050, file: !1029, line: 834, type: !1113, isLocal: true, isDefinition: true)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1029, line: 823, size: 128, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1029, line: 825, baseType: !214, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1114, file: !1029, line: 826, baseType: !109, size: 64, offset: 64)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(name: "nslots", scope: !1050, file: !1029, line: 832, type: !107, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1050, file: !1029, line: 833, type: !1114, isLocal: true, isDefinition: true)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 704, elements: !289)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "numname_table", scope: !1126, file: !1127, line: 43, type: !1136, isLocal: true, isDefinition: true)
!1126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1127, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1128, globals: !1129, splitDebugInlining: false, nameTableKind: None)
!1127 = !DIFile(filename: "lib/sig2str.c", directory: "/src", checksumkind: CSK_MD5, checksum: "828136ef7ede39101f7053cda7cea598")
!1128 = !{!113}
!1129 = !{!1130, !1132, !1134, !1124}
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 351, type: !16, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 356, type: !16, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 362, type: !525, isLocal: true, isDefinition: true)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 3360, elements: !739)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !1127, line: 43, size: 96, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1137, file: !1127, line: 43, baseType: !107, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1137, file: !1127, line: 43, baseType: !1141, size: 64, offset: 32)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !552)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(scope: null, file: !1144, line: 98, type: !518, isLocal: true, isDefinition: true)
!1144 = !DIFile(filename: "lib/tmpdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6bb1205c798131b3318a3c96a85b8877")
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1144, line: 110, type: !546, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1144, line: 132, type: !518, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !1144, line: 160, type: !363, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 67, type: !363, isLocal: true, isDefinition: true)
!1153 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 69, type: !546, isLocal: true, isDefinition: true)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 83, type: !546, isLocal: true, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 83, type: !525, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 85, type: !340, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 88, type: !1164, isLocal: true, isDefinition: true)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 171)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 88, type: !255, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 105, type: !595, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 109, type: !271, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 113, type: !335, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 120, type: !1177, isLocal: true, isDefinition: true)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1178)
!1178 = !{!1179}
!1179 = !DISubrange(count: 32)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 127, type: !1182, isLocal: true, isDefinition: true)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1183)
!1183 = !{!1184}
!1184 = !DISubrange(count: 36)
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 134, type: !283, isLocal: true, isDefinition: true)
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 142, type: !1189, isLocal: true, isDefinition: true)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1190)
!1190 = !{!1191}
!1191 = !DISubrange(count: 44)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 150, type: !250, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 159, type: !1196, isLocal: true, isDefinition: true)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1197)
!1197 = !{!1198}
!1198 = !DISubrange(count: 52)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 170, type: !31, isLocal: true, isDefinition: true)
!1201 = !DIGlobalVariableExpression(var: !1202, expr: !DIExpression())
!1202 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 248, type: !325, isLocal: true, isDefinition: true)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 248, type: !245, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 254, type: !325, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 254, type: !310, isLocal: true, isDefinition: true)
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 254, type: !283, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 259, type: !3, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1153, line: 259, type: !278, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1217, file: !1218, line: 26, type: !1220, isLocal: false, isDefinition: true)
!1217 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1218, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1219, splitDebugInlining: false, nameTableKind: None)
!1218 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1219 = !{!1215}
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 376, elements: !304)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1223, file: !1224, line: 24, type: !1226, isLocal: false, isDefinition: true)
!1223 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1224, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1225, splitDebugInlining: false, nameTableKind: None)
!1224 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1225 = !{!1221}
!1226 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!1227 = !DIGlobalVariableExpression(var: !1228, expr: !DIExpression())
!1228 = distinct !DIGlobalVariable(scope: null, file: !1229, line: 34, type: !264, isLocal: true, isDefinition: true)
!1229 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(scope: null, file: !1229, line: 34, type: !546, isLocal: true, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !1229, line: 34, type: !293, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !1236, line: 80, type: !546, isLocal: true, isDefinition: true)
!1236 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !1236, line: 80, type: !546, isLocal: true, isDefinition: true)
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(scope: null, file: !1241, line: 108, type: !225, isLocal: true, isDefinition: true)
!1241 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(name: "internal_state", scope: !1244, file: !1241, line: 97, type: !1247, isLocal: true, isDefinition: true)
!1244 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1241, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1245, globals: !1246, splitDebugInlining: false, nameTableKind: None)
!1245 = !{!208, !214, !218}
!1246 = !{!1239, !1242}
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1015, line: 6, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1017, line: 21, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 13, size: 64, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1249, file: !1017, line: 15, baseType: !107, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1249, file: !1017, line: 20, baseType: !1253, size: 32, offset: 32)
!1253 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1249, file: !1017, line: 16, size: 32, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1253, file: !1017, line: 18, baseType: !113, size: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1253, file: !1017, line: 19, baseType: !525, size: 32)
!1257 = !DIGlobalVariableExpression(var: !1258, expr: !DIExpression())
!1258 = distinct !DIGlobalVariable(scope: null, file: !1259, line: 4617, type: !525, isLocal: true, isDefinition: true)
!1259 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1259, line: 5292, type: !16, isLocal: true, isDefinition: true)
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(name: "decimal_format", scope: !1264, file: !1259, line: 5889, type: !1726, isLocal: true, isDefinition: true)
!1264 = distinct !DISubprogram(name: "vasnprintf", scope: !1259, file: !1259, line: 2459, type: !1265, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1276, retainedNodes: !1811)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!109, !109, !1267, !216, !1268}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1270)
!1270 = !{!1271, !1273, !1274, !1275}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1269, file: !1272, baseType: !113, size: 32)
!1272 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src")
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1269, file: !1272, baseType: !113, size: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1269, file: !1272, baseType: !208, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1269, file: !1272, baseType: !208, size: 64, offset: 128)
!1276 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1259, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1277, retainedTypes: !1714, globals: !1723, splitDebugInlining: false, nameTableKind: None)
!1277 = !{!1278, !1328}
!1278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1279, line: 47, baseType: !113, size: 32, elements: !1280)
!1279 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1280 = !{!1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!1281 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1282 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1283 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1284 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1285 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1286 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1287 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1288 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1289 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1290 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1291 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1292 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1293 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1294 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1295 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1296 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1297 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1298 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1299 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1300 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1301 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1302 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1303 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1304 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1305 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1306 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1307 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1308 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1309 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1310 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1311 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1312 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1313 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1314 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1315 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1316 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1317 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1318 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1319 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1320 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1321 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1322 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1323 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1324 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1325 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1326 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1327 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1329, line: 41, baseType: !113, size: 32, elements: !1330)
!1329 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713}
!1331 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!1332 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!1333 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!1334 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!1335 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!1336 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!1337 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!1338 = !DIEnumerator(name: "DAY_1", value: 131079)
!1339 = !DIEnumerator(name: "DAY_2", value: 131080)
!1340 = !DIEnumerator(name: "DAY_3", value: 131081)
!1341 = !DIEnumerator(name: "DAY_4", value: 131082)
!1342 = !DIEnumerator(name: "DAY_5", value: 131083)
