; ModuleID = 'src/stty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.mode_info = type { ptr, i32, i8, i64, i64 }
%struct.control_info = type { ptr, i8, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.winsize = type { i16, i16, i16, i16 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.9 }
%union.anon.9 = type { x86_fp80 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 953, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 41)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 971, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1624, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 203)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !2, line: 978, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1672, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 209)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !2, line: 978, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 31)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 256)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !446, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !290, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 61)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1083, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2216, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 277)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "mode", scope: !495, file: !2, line: 1291, type: !527, isLocal: true, isDefinition: true)
!495 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1287, type: !496, scopeLine: 1288, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !499)
!496 = !DISubroutineType(types: !497)
!497 = !{!134, !134, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !515, !523, !526}
!500 = !DILocalVariable(name: "argc", arg: 1, scope: !495, file: !2, line: 1287, type: !134)
!501 = !DILocalVariable(name: "argv", arg: 2, scope: !495, file: !2, line: 1287, type: !498)
!502 = !DILocalVariable(name: "output_type", scope: !495, file: !2, line: 1293, type: !123)
!503 = !DILocalVariable(name: "optc", scope: !495, file: !2, line: 1294, type: !134)
!504 = !DILocalVariable(name: "argi", scope: !495, file: !2, line: 1295, type: !134)
!505 = !DILocalVariable(name: "opti", scope: !495, file: !2, line: 1296, type: !134)
!506 = !DILocalVariable(name: "require_set_attr", scope: !495, file: !2, line: 1297, type: !200)
!507 = !DILocalVariable(name: "verbose_output", scope: !495, file: !2, line: 1298, type: !200)
!508 = !DILocalVariable(name: "recoverable_output", scope: !495, file: !2, line: 1299, type: !200)
!509 = !DILocalVariable(name: "noargs", scope: !495, file: !2, line: 1300, type: !200)
!510 = !DILocalVariable(name: "file_name", scope: !495, file: !2, line: 1301, type: !188)
!511 = !DILocalVariable(name: "device_name", scope: !495, file: !2, line: 1302, type: !196)
!512 = !DILocalVariable(name: "fdflags", scope: !513, file: !2, line: 1401, type: !134)
!513 = distinct !DILexicalBlock(scope: !514, file: !2, line: 1400, column: 5)
!514 = distinct !DILexicalBlock(scope: !495, file: !2, line: 1399, column: 7)
!515 = !DILocalVariable(name: "i", scope: !516, file: !2, line: 1449, type: !124)
!516 = distinct !DILexicalBlock(scope: !517, file: !2, line: 1449, column: 15)
!517 = distinct !DILexicalBlock(scope: !518, file: !2, line: 1447, column: 13)
!518 = distinct !DILexicalBlock(scope: !519, file: !2, line: 1446, column: 15)
!519 = distinct !DILexicalBlock(scope: !520, file: !2, line: 1445, column: 9)
!520 = distinct !DILexicalBlock(scope: !521, file: !2, line: 1444, column: 11)
!521 = distinct !DILexicalBlock(scope: !522, file: !2, line: 1426, column: 5)
!522 = distinct !DILexicalBlock(scope: !495, file: !2, line: 1425, column: 7)
!523 = !DILocalVariable(name: "newc", scope: !524, file: !2, line: 1451, type: !124)
!524 = distinct !DILexicalBlock(scope: !525, file: !2, line: 1450, column: 17)
!525 = distinct !DILexicalBlock(scope: !516, file: !2, line: 1449, column: 15)
!526 = !DILocalVariable(name: "oldc", scope: !524, file: !2, line: 1452, type: !124)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !528, line: 24, size: 480, elements: !529)
!528 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios-struct.h", directory: "", checksumkind: CSK_MD5, checksum: "a512dc8866a1d12d70982670557f907e")
!529 = !{!530, !531, !532, !533, !534, !535, !539, !540}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !527, file: !528, line: 26, baseType: !202, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !527, file: !528, line: 27, baseType: !202, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !527, file: !528, line: 28, baseType: !202, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !527, file: !528, line: 29, baseType: !202, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !527, file: !528, line: 30, baseType: !201, size: 8, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !527, file: !528, line: 31, baseType: !536, size: 256, offset: 136)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 256, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !527, file: !528, line: 32, baseType: !198, size: 32, offset: 416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !527, file: !528, line: 33, baseType: !198, size: 32, offset: 448)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1306, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 1)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1307, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 10)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1307, type: !392, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1326, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 6)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1344, type: !369, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1354, type: !451, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1354, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 16)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1359, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 7)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1360, type: !555, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1381, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 632, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 79)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1387, type: !101, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1390, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 15)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "check_mode", scope: !495, file: !2, line: 1394, type: !527, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1403, type: !206, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1406, type: !322, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "new_mode", scope: !495, file: !2, line: 1429, type: !527, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1448, type: !392, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1453, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 25)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1453, type: !206, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1458, type: !84, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "max_col", scope: !121, file: !2, line: 464, type: !134, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "current_col", scope: !121, file: !2, line: 467, type: !134, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "dev_debug", scope: !121, file: !2, line: 473, type: !200, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !133, line: 736, type: !259, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !615, file: !133, line: 575, type: !134, isLocal: true, isDefinition: true)
!615 = distinct !DISubprogram(name: "oputs_", scope: !133, file: !133, line: 573, type: !616, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !618)
!616 = !DISubroutineType(cc: DW_CC_nocall, types: !617)
!617 = !{null, !196, !196}
!618 = !{!619, !620, !621, !624, !625, !626, !627, !631, !632, !633, !634, !636, !689, !690, !691, !693, !694}
!619 = !DILocalVariable(name: "program", arg: 1, scope: !615, file: !133, line: 573, type: !196)
!620 = !DILocalVariable(name: "option", arg: 2, scope: !615, file: !133, line: 573, type: !196)
!621 = !DILocalVariable(name: "term", scope: !622, file: !133, line: 585, type: !196)
!622 = distinct !DILexicalBlock(scope: !623, file: !133, line: 582, column: 5)
!623 = distinct !DILexicalBlock(scope: !615, file: !133, line: 581, column: 7)
!624 = !DILocalVariable(name: "double_space", scope: !615, file: !133, line: 594, type: !200)
!625 = !DILocalVariable(name: "first_word", scope: !615, file: !133, line: 595, type: !196)
!626 = !DILocalVariable(name: "option_text", scope: !615, file: !133, line: 596, type: !196)
!627 = !DILocalVariable(name: "s", scope: !628, file: !133, line: 608, type: !196)
!628 = distinct !DILexicalBlock(scope: !629, file: !133, line: 605, column: 5)
!629 = distinct !DILexicalBlock(scope: !630, file: !133, line: 604, column: 12)
!630 = distinct !DILexicalBlock(scope: !615, file: !133, line: 597, column: 7)
!631 = !DILocalVariable(name: "spaces", scope: !628, file: !133, line: 609, type: !193)
!632 = !DILocalVariable(name: "anchor_len", scope: !615, file: !133, line: 620, type: !193)
!633 = !DILocalVariable(name: "desc_text", scope: !615, file: !133, line: 625, type: !196)
!634 = !DILocalVariable(name: "__ptr", scope: !635, file: !133, line: 644, type: !196)
!635 = distinct !DILexicalBlock(scope: !615, file: !133, line: 644, column: 3)
!636 = !DILocalVariable(name: "__stream", scope: !635, file: !133, line: 644, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !639, line: 7, baseType: !640)
!639 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !641, line: 49, size: 1728, elements: !642)
!641 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !658, !660, !661, !662, !666, !667, !669, !670, !673, !675, !678, !681, !682, !683, !684, !685}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !640, file: !641, line: 51, baseType: !134, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !640, file: !641, line: 54, baseType: !188, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !640, file: !641, line: 55, baseType: !188, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !640, file: !641, line: 56, baseType: !188, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !640, file: !641, line: 57, baseType: !188, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !640, file: !641, line: 58, baseType: !188, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !640, file: !641, line: 59, baseType: !188, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !640, file: !641, line: 60, baseType: !188, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !640, file: !641, line: 61, baseType: !188, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !640, file: !641, line: 64, baseType: !188, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !640, file: !641, line: 65, baseType: !188, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !640, file: !641, line: 66, baseType: !188, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !640, file: !641, line: 68, baseType: !656, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !641, line: 36, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !640, file: !641, line: 70, baseType: !659, size: 64, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !640, file: !641, line: 72, baseType: !134, size: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !640, file: !641, line: 73, baseType: !134, size: 32, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !640, file: !641, line: 74, baseType: !663, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !664, line: 152, baseType: !665)
!664 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!665 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !640, file: !641, line: 77, baseType: !192, size: 16, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !640, file: !641, line: 78, baseType: !668, size: 8, offset: 1040)
!668 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !640, file: !641, line: 79, baseType: !543, size: 8, offset: 1048)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !640, file: !641, line: 81, baseType: !671, size: 64, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !641, line: 43, baseType: null)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !640, file: !641, line: 89, baseType: !674, size: 64, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !664, line: 153, baseType: !665)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !640, file: !641, line: 91, baseType: !676, size: 64, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !641, line: 37, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !640, file: !641, line: 92, baseType: !679, size: 64, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !641, line: 38, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !640, file: !641, line: 93, baseType: !659, size: 64, offset: 1344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !640, file: !641, line: 94, baseType: !189, size: 64, offset: 1408)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !640, file: !641, line: 95, baseType: !193, size: 64, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !640, file: !641, line: 96, baseType: !134, size: 32, offset: 1536)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !640, file: !641, line: 98, baseType: !686, size: 160, offset: 1568)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 20)
!689 = !DILocalVariable(name: "__cnt", scope: !635, file: !133, line: 644, type: !193)
!690 = !DILocalVariable(name: "url_program", scope: !615, file: !133, line: 648, type: !196)
!691 = !DILocalVariable(name: "__ptr", scope: !692, file: !133, line: 686, type: !196)
!692 = distinct !DILexicalBlock(scope: !615, file: !133, line: 686, column: 3)
!693 = !DILocalVariable(name: "__stream", scope: !692, file: !133, line: 686, type: !637)
!694 = !DILocalVariable(name: "__cnt", scope: !692, file: !133, line: 686, type: !193)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !133, line: 585, type: !19, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !133, line: 586, type: !19, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !133, line: 595, type: !211, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !133, line: 620, type: !555, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !133, line: 648, type: !705, isLocal: true, isDefinition: true)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 2)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !133, line: 648, type: !19, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !133, line: 649, type: !211, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !133, line: 649, type: !206, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !133, line: 650, type: !19, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !133, line: 651, type: !555, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !133, line: 651, type: !555, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !133, line: 652, type: !569, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !133, line: 653, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 8)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !133, line: 654, type: !548, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !133, line: 655, type: !548, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !133, line: 656, type: !548, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !133, line: 657, type: !548, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !133, line: 663, type: !569, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !133, line: 664, type: !548, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !133, line: 669, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 17)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !133, line: 669, type: !218, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !133, line: 676, type: !583, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !133, line: 676, type: !485, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !133, line: 679, type: !206, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !133, line: 683, type: !19, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !133, line: 688, type: !19, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !133, line: 691, type: !724, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !133, line: 839, type: !564, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !133, line: 840, type: !54, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !133, line: 841, type: !583, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !133, line: 862, type: !211, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !133, line: 868, type: !362, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !133, line: 875, type: !379, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !133, line: 877, type: !297, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !133, line: 877, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 12)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 488, type: !211, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 489, type: !19, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !2, line: 490, type: !19, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !569, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !19, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 493, type: !724, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "longopts", scope: !121, file: !2, line: 486, type: !791, isLocal: true, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 1792, elements: !570)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !794, line: 50, size: 256, elements: !795)
!794 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!795 = !{!796, !797, !798, !800}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !793, file: !794, line: 52, baseType: !196, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !793, file: !794, line: 55, baseType: !134, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !793, file: !794, line: 56, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !793, file: !794, line: 57, baseType: !134, size: 32, offset: 192)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1152, type: !686, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1161, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 23)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1172, type: !569, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1178, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 18)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1186, type: !569, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1192, type: !812, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1216, type: !19, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1225, type: !19, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1226, type: !724, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1235, type: !19, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1245, type: !19, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1251, type: !379, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1256, type: !555, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !569, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !2, line: 206, type: !569, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !569, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !2, line: 210, type: !211, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !211, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !211, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !211, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !2, line: 214, type: !555, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !211, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !569, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !555, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 218, type: !569, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !2, line: 220, type: !724, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !569, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !569, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !569, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !569, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !555, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !569, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !555, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !2, line: 233, type: !555, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !555, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !19, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !555, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !569, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !2, line: 239, type: !555, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !2, line: 242, type: !555, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !724, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !555, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !555, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !555, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !555, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !555, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !555, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !569, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !555, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !555, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !211, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !2, line: 275, type: !211, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !211, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !2, line: 279, type: !211, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !2, line: 280, type: !211, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !2, line: 281, type: !211, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !2, line: 285, type: !19, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !2, line: 288, type: !19, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !2, line: 291, type: !19, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !19, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !211, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !211, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !2, line: 306, type: !211, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !2, line: 307, type: !211, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !211, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !211, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !2, line: 314, type: !19, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !569, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !2, line: 317, type: !569, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !19, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !555, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 9)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !555, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !2, line: 323, type: !569, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !569, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !555, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !2, line: 329, type: !569, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !724, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !2, line: 333, type: !951, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 336, type: !724, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !724, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !569, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !724, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !2, line: 344, type: !569, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !724, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !555, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !2, line: 353, type: !569, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !2, line: 354, type: !19, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !2, line: 355, type: !206, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !206, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 357, type: !19, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !2, line: 358, type: !569, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !211, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 360, type: !555, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !569, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 362, type: !569, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !724, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 367, type: !19, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !2, line: 370, type: !555, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !555, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !2, line: 373, type: !211, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !2, line: 374, type: !211, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "mode_info", scope: !121, file: !2, line: 203, type: !1016, isLocal: true, isDefinition: true)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 23040, elements: !1025)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_info", file: !2, line: 194, size: 256, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !2, line: 196, baseType: !196, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1018, file: !2, line: 197, baseType: !172, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !2, line: 198, baseType: !4, size: 8, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1018, file: !2, line: 199, baseType: !195, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1018, file: !2, line: 200, baseType: !195, size: 64, offset: 192)
!1025 = !{!1026}
!1026 = !DISubrange(count: 90)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !19, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !2, line: 392, type: !19, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !555, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !19, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !2, line: 395, type: !211, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !2, line: 396, type: !211, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !2, line: 398, type: !19, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !2, line: 401, type: !555, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !555, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !2, line: 404, type: !19, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !19, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !2, line: 410, type: !555, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !2, line: 417, type: !569, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !555, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !555, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !2, line: 424, type: !724, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !2, line: 431, type: !211, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !2, line: 432, type: !19, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "control_info", scope: !121, file: !2, line: 389, type: !1065, isLocal: true, isDefinition: true)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 3648, elements: !284)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_info", file: !2, line: 380, size: 192, elements: !1068)
!1068 = !{!1069, !1070, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1067, file: !2, line: 382, baseType: !196, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "saneval", scope: !1067, file: !2, line: 383, baseType: !201, size: 8, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1067, file: !2, line: 384, baseType: !193, size: 64, offset: 128)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1703, type: !206, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1703, type: !555, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2223, type: !19, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2225, type: !19, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1725, type: !417, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1725, type: !1084, isLocal: true, isDefinition: true)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !1085)
!1085 = !{!1086}
!1086 = !DISubrange(count: 11)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1725, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 536, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 67)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1731, type: !54, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1737, type: !54, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(name: "last_ibaud", scope: !121, file: !2, line: 476, type: !198, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "last_obaud", scope: !121, file: !2, line: 477, type: !198, isLocal: true, isDefinition: true)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2326, type: !206, isLocal: true, isDefinition: true)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2326, type: !598, isLocal: true, isDefinition: true)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1822, type: !218, isLocal: true, isDefinition: true)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1828, type: !417, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1828, type: !569, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2092, type: !564, isLocal: true, isDefinition: true)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2092, type: !19, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2095, type: !1116, isLocal: true, isDefinition: true)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 34)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2095, type: !951, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2082, type: !1123, isLocal: true, isDefinition: true)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !1124)
!1124 = !{!1125}
!1125 = !DISubrange(count: 58)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1853, type: !724, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1920, type: !1084, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !951, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1955, type: !392, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1991, type: !211, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(name: "buf", scope: !1138, file: !2, line: 2274, type: !548, isLocal: true, isDefinition: true)
!1138 = distinct !DISubprogram(name: "visible", scope: !2, file: !2, line: 2272, type: !1139, scopeLine: 2273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !1141)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!196, !201}
!1141 = !{!1142, !1143}
!1142 = !DILocalVariable(name: "ch", arg: 1, scope: !1138, file: !2, line: 2272, type: !201)
!1143 = !DILocalVariable(name: "bpout", scope: !1138, file: !2, line: 2275, type: !188)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2278, type: !724, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2042, type: !805, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2105, type: !564, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2111, type: !19, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 3, type: !583, isLocal: true, isDefinition: true)
!1155 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(name: "Version", scope: !1158, file: !1155, line: 3, type: !196, isLocal: false, isDefinition: true)
!1158 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1155, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1159, splitDebugInlining: false, nameTableKind: None)
!1159 = !{!1153, !1156}
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(name: "file_name", scope: !1162, file: !1163, line: 45, type: !196, isLocal: true, isDefinition: true)
!1162 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1163, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1164, splitDebugInlining: false, nameTableKind: None)
!1163 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1164 = !{!1165, !1167, !1169, !1171, !1160, !1173}
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 121, type: !569, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 121, type: !774, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 123, type: !569, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 126, type: !206, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1162, file: !1163, line: 55, type: !200, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1177, file: !1178, line: 66, type: !1221, isLocal: false, isDefinition: true)
!1177 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1178, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1179, globals: !1180, splitDebugInlining: false, nameTableKind: None)
!1178 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1179 = !{!189, !191}
!1180 = !{!1181, !1183, !1203, !1205, !1207, !1209, !1175, !1211, !1213, !1215, !1217, !1219}
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 272, type: !19, isLocal: true, isDefinition: true)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1185, file: !1178, line: 304, type: !196, isLocal: true, isDefinition: true)
!1185 = distinct !DISubprogram(name: "verror_at_line", scope: !1178, file: !1178, line: 298, type: !1186, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1177, retainedNodes: !1196)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{null, !134, !134, !196, !124, !196, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1190)
!1190 = !{!1191, !1193, !1194, !1195}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1189, file: !1192, baseType: !124, size: 32)
!1192 = !DIFile(filename: "lib/error.c", directory: "/src")
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1189, file: !1192, baseType: !124, size: 32, offset: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1189, file: !1192, baseType: !189, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1189, file: !1192, baseType: !189, size: 64, offset: 128)
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1202}
!1197 = !DILocalVariable(name: "status", arg: 1, scope: !1185, file: !1178, line: 298, type: !134)
!1198 = !DILocalVariable(name: "errnum", arg: 2, scope: !1185, file: !1178, line: 298, type: !134)
!1199 = !DILocalVariable(name: "file_name", arg: 3, scope: !1185, file: !1178, line: 298, type: !196)
!1200 = !DILocalVariable(name: "line_number", arg: 4, scope: !1185, file: !1178, line: 298, type: !124)
!1201 = !DILocalVariable(name: "message", arg: 5, scope: !1185, file: !1178, line: 298, type: !196)
!1202 = !DILocalVariable(name: "args", arg: 6, scope: !1185, file: !1178, line: 298, type: !1188)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1185, file: !1178, line: 305, type: !124, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 338, type: !211, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 346, type: !724, isLocal: true, isDefinition: true)
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 346, type: !705, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1177, file: !1178, line: 69, type: !124, isLocal: false, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1177, file: !1178, line: 295, type: !134, isLocal: false, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 208, type: !569, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 208, type: !417, isLocal: true, isDefinition: true)
!1219 = !DIGlobalVariableExpression(var: !1220, expr: !DIExpression())
!1220 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 214, type: !19, isLocal: true, isDefinition: true)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{null}
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1226, file: !1227, line: 506, type: !134, isLocal: true, isDefinition: true)
!1226 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1227, file: !1227, line: 485, type: !1228, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1230, retainedNodes: !1232)
!1227 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!134, !134, !134}
!1230 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1227, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1231, splitDebugInlining: false, nameTableKind: None)
!1231 = !{!1224}
!1232 = !{!1233, !1234, !1235, !1236, !1239}
!1233 = !DILocalVariable(name: "fd", arg: 1, scope: !1226, file: !1227, line: 485, type: !134)
!1234 = !DILocalVariable(name: "target", arg: 2, scope: !1226, file: !1227, line: 485, type: !134)
!1235 = !DILocalVariable(name: "result", scope: !1226, file: !1227, line: 487, type: !134)
!1236 = !DILocalVariable(name: "flags", scope: !1237, file: !1227, line: 530, type: !134)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !1227, line: 529, column: 5)
!1238 = distinct !DILexicalBlock(scope: !1226, file: !1227, line: 528, column: 7)
!1239 = !DILocalVariable(name: "saved_errno", scope: !1240, file: !1227, line: 533, type: !134)
!1240 = distinct !DILexicalBlock(scope: !1241, file: !1227, line: 532, column: 9)
!1241 = distinct !DILexicalBlock(scope: !1237, file: !1227, line: 531, column: 11)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(name: "program_name", scope: !1244, file: !1245, line: 31, type: !196, isLocal: false, isDefinition: true)
!1244 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1245, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1246, globals: !1247, splitDebugInlining: false, nameTableKind: None)
!1245 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1246 = !{!188}
!1247 = !{!1242, !1248, !1250}
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1245, line: 46, type: !724, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1245, line: 49, type: !211, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1254, file: !1255, line: 46, type: !1282, isLocal: true, isDefinition: true)
!1254 = distinct !DISubprogram(name: "proper_name_lite", scope: !1255, file: !1255, line: 38, type: !1256, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1258, retainedNodes: !1260)
!1255 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!196, !196, !196}
!1258 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1255, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1259, splitDebugInlining: false, nameTableKind: None)
!1259 = !{!1252}
!1260 = !{!1261, !1262, !1263, !1264, !1269}
!1261 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1254, file: !1255, line: 38, type: !196)
!1262 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1254, file: !1255, line: 38, type: !196)
!1263 = !DILocalVariable(name: "translation", scope: !1254, file: !1255, line: 40, type: !196)
!1264 = !DILocalVariable(name: "w", scope: !1254, file: !1255, line: 47, type: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1266, line: 37, baseType: !1267)
!1266 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !664, line: 57, baseType: !1268)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !664, line: 42, baseType: !124)
!1269 = !DILocalVariable(name: "mbs", scope: !1254, file: !1255, line: 48, type: !1270)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1271, line: 6, baseType: !1272)
!1271 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1273, line: 21, baseType: !1274)
!1273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1273, line: 13, size: 64, elements: !1275)
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1274, file: !1273, line: 15, baseType: !134, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1274, file: !1273, line: 20, baseType: !1278, size: 32, offset: 32)
!1278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1274, file: !1273, line: 16, size: 32, elements: !1279)
!1279 = !{!1280, !1281}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1278, file: !1273, line: 18, baseType: !124, size: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1278, file: !1273, line: 19, baseType: !211, size: 32)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 16, elements: !706)
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 78, type: !724, isLocal: true, isDefinition: true)
!1285 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 79, type: !555, isLocal: true, isDefinition: true)
!1288 = !DIGlobalVariableExpression(var: !1289, expr: !DIExpression())
!1289 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 80, type: !1290, isLocal: true, isDefinition: true)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1291)
!1291 = !{!1292}
!1292 = !DISubrange(count: 13)
!1293 = !DIGlobalVariableExpression(var: !1294, expr: !DIExpression())
!1294 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 81, type: !1290, isLocal: true, isDefinition: true)
!1295 = !DIGlobalVariableExpression(var: !1296, expr: !DIExpression())
!1296 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 82, type: !686, isLocal: true, isDefinition: true)
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 83, type: !705, isLocal: true, isDefinition: true)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 84, type: !724, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 85, type: !569, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
!1304 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 86, type: !569, isLocal: true, isDefinition: true)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 87, type: !724, isLocal: true, isDefinition: true)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1309, file: !1285, line: 76, type: !1378, isLocal: false, isDefinition: true)
!1309 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1285, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1310, retainedTypes: !1316, globals: !1317, splitDebugInlining: false, nameTableKind: None)
!1310 = !{!138, !1311, !152}
!1311 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !139, line: 254, baseType: !124, size: 32, elements: !1312)
!1312 = !{!1313, !1314, !1315}
!1313 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1314 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1315 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1316 = !{!134, !192, !193}
!1317 = !{!1283, !1286, !1288, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1318, !1322, !1332, !1334, !1336, !1338, !1340, !1342, !1344, !1367, !1374, !1376}
!1318 = !DIGlobalVariableExpression(var: !1319, expr: !DIExpression())
!1319 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1309, file: !1285, line: 92, type: !1320, isLocal: false, isDefinition: true)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 320, elements: !549)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!1322 = !DIGlobalVariableExpression(var: !1323, expr: !DIExpression())
!1323 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1309, file: !1285, line: 1040, type: !1324, isLocal: false, isDefinition: true)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1285, line: 56, size: 448, elements: !1325)
!1325 = !{!1326, !1327, !1328, !1330, !1331}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1324, file: !1285, line: 59, baseType: !138, size: 32)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1324, file: !1285, line: 62, baseType: !134, size: 32, offset: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1324, file: !1285, line: 66, baseType: !1329, size: 256, offset: 64)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 256, elements: !725)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1324, file: !1285, line: 69, baseType: !196, size: 64, offset: 320)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1324, file: !1285, line: 72, baseType: !196, size: 64, offset: 384)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1309, file: !1285, line: 107, type: !1324, isLocal: true, isDefinition: true)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(name: "slot0", scope: !1309, file: !1285, line: 831, type: !476, isLocal: true, isDefinition: true)
!1336 = !DIGlobalVariableExpression(var: !1337, expr: !DIExpression())
!1337 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 321, type: !705, isLocal: true, isDefinition: true)
!1338 = !DIGlobalVariableExpression(var: !1339, expr: !DIExpression())
!1339 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 357, type: !705, isLocal: true, isDefinition: true)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 358, type: !705, isLocal: true, isDefinition: true)
!1342 = !DIGlobalVariableExpression(var: !1343, expr: !DIExpression())
!1343 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 199, type: !569, isLocal: true, isDefinition: true)
!1344 = !DIGlobalVariableExpression(var: !1345, expr: !DIExpression())
!1345 = distinct !DIGlobalVariable(name: "quote", scope: !1346, file: !1285, line: 228, type: !1365, isLocal: true, isDefinition: true)
!1346 = distinct !DISubprogram(name: "gettext_quote", scope: !1285, file: !1285, line: 197, type: !1347, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1309, retainedNodes: !1349)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!196, !196, !138}
!1349 = !{!1350, !1351, !1352, !1353, !1354}
!1350 = !DILocalVariable(name: "msgid", arg: 1, scope: !1346, file: !1285, line: 197, type: !196)
!1351 = !DILocalVariable(name: "s", arg: 2, scope: !1346, file: !1285, line: 197, type: !138)
!1352 = !DILocalVariable(name: "translation", scope: !1346, file: !1285, line: 199, type: !196)
!1353 = !DILocalVariable(name: "w", scope: !1346, file: !1285, line: 229, type: !1265)
!1354 = !DILocalVariable(name: "mbs", scope: !1346, file: !1285, line: 230, type: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1271, line: 6, baseType: !1356)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1273, line: 21, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1273, line: 13, size: 64, elements: !1358)
!1358 = !{!1359, !1360}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1357, file: !1273, line: 15, baseType: !134, size: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1357, file: !1273, line: 20, baseType: !1361, size: 32, offset: 32)
!1361 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1357, file: !1273, line: 16, size: 32, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1361, file: !1273, line: 18, baseType: !124, size: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1361, file: !1273, line: 19, baseType: !211, size: 32)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !1366)
!1366 = !{!707, !213}
!1367 = !DIGlobalVariableExpression(var: !1368, expr: !DIExpression())
!1368 = distinct !DIGlobalVariable(name: "slotvec", scope: !1309, file: !1285, line: 834, type: !1369, isLocal: true, isDefinition: true)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1285, line: 823, size: 128, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1370, file: !1285, line: 825, baseType: !193, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1370, file: !1285, line: 826, baseType: !188, size: 64, offset: 64)
!1374 = !DIGlobalVariableExpression(var: !1375, expr: !DIExpression())
!1375 = distinct !DIGlobalVariable(name: "nslots", scope: !1309, file: !1285, line: 832, type: !134, isLocal: true, isDefinition: true)
!1376 = !DIGlobalVariableExpression(var: !1377, expr: !DIExpression())
!1377 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1309, file: !1285, line: 833, type: !1370, isLocal: true, isDefinition: true)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 704, elements: !1085)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!1380 = !DIGlobalVariableExpression(var: !1381, expr: !DIExpression())
!1381 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 67, type: !774, isLocal: true, isDefinition: true)
!1382 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 69, type: !569, isLocal: true, isDefinition: true)
!1385 = !DIGlobalVariableExpression(var: !1386, expr: !DIExpression())
!1386 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 83, type: !569, isLocal: true, isDefinition: true)
!1387 = !DIGlobalVariableExpression(var: !1388, expr: !DIExpression())
!1388 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 83, type: !211, isLocal: true, isDefinition: true)
!1389 = !DIGlobalVariableExpression(var: !1390, expr: !DIExpression())
!1390 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 85, type: !705, isLocal: true, isDefinition: true)
!1391 = !DIGlobalVariableExpression(var: !1392, expr: !DIExpression())
!1392 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 88, type: !1393, isLocal: true, isDefinition: true)
!1393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1394)
!1394 = !{!1395}
!1395 = !DISubrange(count: 171)
!1396 = !DIGlobalVariableExpression(var: !1397, expr: !DIExpression())
!1397 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 88, type: !1116, isLocal: true, isDefinition: true)
!1398 = !DIGlobalVariableExpression(var: !1399, expr: !DIExpression())
!1399 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 105, type: !564, isLocal: true, isDefinition: true)
!1400 = !DIGlobalVariableExpression(var: !1401, expr: !DIExpression())
!1401 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 109, type: !805, isLocal: true, isDefinition: true)
!1402 = !DIGlobalVariableExpression(var: !1403, expr: !DIExpression())
!1403 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 113, type: !424, isLocal: true, isDefinition: true)
!1404 = !DIGlobalVariableExpression(var: !1405, expr: !DIExpression())
!1405 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 120, type: !1406, isLocal: true, isDefinition: true)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !537)
!1407 = !DIGlobalVariableExpression(var: !1408, expr: !DIExpression())
!1408 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 127, type: !1409, isLocal: true, isDefinition: true)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1410)
!1410 = !{!1411}
!1411 = !DISubrange(count: 36)
!1412 = !DIGlobalVariableExpression(var: !1413, expr: !DIExpression())
!1413 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 134, type: !218, isLocal: true, isDefinition: true)
!1414 = !DIGlobalVariableExpression(var: !1415, expr: !DIExpression())
!1415 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 142, type: !436, isLocal: true, isDefinition: true)
!1416 = !DIGlobalVariableExpression(var: !1417, expr: !DIExpression())
!1417 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 150, type: !1418, isLocal: true, isDefinition: true)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1419)
!1419 = !{!1420}
!1420 = !DISubrange(count: 48)
!1421 = !DIGlobalVariableExpression(var: !1422, expr: !DIExpression())
!1422 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 159, type: !89, isLocal: true, isDefinition: true)
!1423 = !DIGlobalVariableExpression(var: !1424, expr: !DIExpression())
!1424 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 170, type: !79, isLocal: true, isDefinition: true)
!1425 = !DIGlobalVariableExpression(var: !1426, expr: !DIExpression())
!1426 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 248, type: !686, isLocal: true, isDefinition: true)
!1427 = !DIGlobalVariableExpression(var: !1428, expr: !DIExpression())
!1428 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 248, type: !54, isLocal: true, isDefinition: true)
!1429 = !DIGlobalVariableExpression(var: !1430, expr: !DIExpression())
!1430 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 254, type: !686, isLocal: true, isDefinition: true)
!1431 = !DIGlobalVariableExpression(var: !1432, expr: !DIExpression())
!1432 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 254, type: !451, isLocal: true, isDefinition: true)
!1433 = !DIGlobalVariableExpression(var: !1434, expr: !DIExpression())
!1434 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 254, type: !218, isLocal: true, isDefinition: true)
!1435 = !DIGlobalVariableExpression(var: !1436, expr: !DIExpression())
!1436 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 259, type: !3, isLocal: true, isDefinition: true)
!1437 = !DIGlobalVariableExpression(var: !1438, expr: !DIExpression())
!1438 = distinct !DIGlobalVariable(scope: null, file: !1382, line: 259, type: !412, isLocal: true, isDefinition: true)
!1439 = !DIGlobalVariableExpression(var: !1440, expr: !DIExpression())
!1440 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1441, file: !1442, line: 26, type: !1444, isLocal: false, isDefinition: true)
!1441 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1442, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1443, splitDebugInlining: false, nameTableKind: None)
!1442 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1443 = !{!1439}
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 376, elements: !85)
!1445 = !DIGlobalVariableExpression(var: !1446, expr: !DIExpression())
!1446 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1447, file: !1448, line: 24, type: !1450, isLocal: false, isDefinition: true)
!1447 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1448, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1449, splitDebugInlining: false, nameTableKind: None)
!1448 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1449 = !{!1445}
!1450 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !134)
!1451 = !DIGlobalVariableExpression(var: !1452, expr: !DIExpression())
!1452 = distinct !DIGlobalVariable(scope: null, file: !1453, line: 34, type: !206, isLocal: true, isDefinition: true)
!1453 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1454 = !DIGlobalVariableExpression(var: !1455, expr: !DIExpression())
!1455 = distinct !DIGlobalVariable(scope: null, file: !1453, line: 34, type: !569, isLocal: true, isDefinition: true)
!1456 = !DIGlobalVariableExpression(var: !1457, expr: !DIExpression())
!1457 = distinct !DIGlobalVariable(scope: null, file: !1453, line: 34, type: !741, isLocal: true, isDefinition: true)
!1458 = !DIGlobalVariableExpression(var: !1459, expr: !DIExpression())
!1459 = distinct !DIGlobalVariable(scope: null, file: !1460, line: 80, type: !569, isLocal: true, isDefinition: true)
!1460 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!1461 = !DIGlobalVariableExpression(var: !1462, expr: !DIExpression())
!1462 = distinct !DIGlobalVariable(scope: null, file: !1463, line: 108, type: !543, isLocal: true, isDefinition: true)
!1463 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1464 = !DIGlobalVariableExpression(var: !1465, expr: !DIExpression())
!1465 = distinct !DIGlobalVariable(name: "internal_state", scope: !1466, file: !1463, line: 97, type: !1469, isLocal: true, isDefinition: true)
!1466 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1463, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1467, globals: !1468, splitDebugInlining: false, nameTableKind: None)
!1467 = !{!189, !193, !191}
!1468 = !{!1461, !1464}
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1271, line: 6, baseType: !1470)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1273, line: 21, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1273, line: 13, size: 64, elements: !1472)
!1472 = !{!1473, !1474}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1471, file: !1273, line: 15, baseType: !134, size: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1471, file: !1273, line: 20, baseType: !1475, size: 32, offset: 32)
!1475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1471, file: !1273, line: 16, size: 32, elements: !1476)
!1476 = !{!1477, !1478}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1475, file: !1273, line: 18, baseType: !124, size: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1475, file: !1273, line: 19, baseType: !211, size: 32)
!1479 = !DIGlobalVariableExpression(var: !1480, expr: !DIExpression())
!1480 = distinct !DIGlobalVariable(scope: null, file: !1481, line: 4617, type: !211, isLocal: true, isDefinition: true)
!1481 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1482 = !DIGlobalVariableExpression(var: !1483, expr: !DIExpression())
!1483 = distinct !DIGlobalVariable(scope: null, file: !1481, line: 5292, type: !555, isLocal: true, isDefinition: true)
!1484 = !DIGlobalVariableExpression(var: !1485, expr: !DIExpression())
!1485 = distinct !DIGlobalVariable(name: "decimal_format", scope: !1486, file: !1481, line: 5889, type: !1948, isLocal: true, isDefinition: true)
!1486 = distinct !DISubprogram(name: "vasnprintf", scope: !1481, file: !1481, line: 2459, type: !1487, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1498, retainedNodes: !2033)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!188, !188, !1489, !196, !1490}
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1492)
!1492 = !{!1493, !1495, !1496, !1497}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1491, file: !1494, baseType: !124, size: 32)
!1494 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src")
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1491, file: !1494, baseType: !124, size: 32, offset: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1491, file: !1494, baseType: !189, size: 64, offset: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1491, file: !1494, baseType: !189, size: 64, offset: 128)
!1498 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1481, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1499, retainedTypes: !1936, globals: !1945, splitDebugInlining: false, nameTableKind: None)
!1499 = !{!1500, !1550}
!1500 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1501, line: 47, baseType: !124, size: 32, elements: !1502)
!1501 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1502 = !{!1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549}
!1503 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1504 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1505 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
