; ModuleID = 'src/sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@.str = private unnamed_addr constant [9 x i8] c"%05d %5s\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c" %s\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"%d %s\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !17
@.str.1.4 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !23
@.str.2.5 = private unnamed_addr constant [39 x i8] c"Print or check %s (%d-bit) checksums.\0A\00", align 1, !dbg !28
@.str.3.6 = private unnamed_addr constant [4 x i8] c"BSD\00", align 1, !dbg !30

!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1852, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 35)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1866, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1868, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 54)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1893, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 15)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !61, file: !19, line: 194, type: !224, isLocal: true, isDefinition: true)
!224 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !61, file: !19, line: 197, type: !227, isLocal: true, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !228, line: 130, baseType: !229)
!228 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !130, line: 35, baseType: !230)
!230 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !61, file: !19, line: 200, type: !227, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "sum_algorithm", scope: !61, file: !19, line: 253, type: !63, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !69, line: 729, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 56)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !242, file: !69, line: 575, type: !70, isLocal: true, isDefinition: true)
!242 = distinct !DISubprogram(name: "oputs_", scope: !69, file: !69, line: 573, type: !243, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !61, retainedNodes: !245)
!243 = !DISubroutineType(cc: DW_CC_nocall, types: !244)
!244 = !{null, !131, !131}
!245 = !{!246, !247, !248, !251, !252, !253, !254, !258, !259, !260, !261, !263, !314, !315, !316, !318, !319}
!246 = !DILocalVariable(name: "program", arg: 1, scope: !242, file: !69, line: 573, type: !131)
!247 = !DILocalVariable(name: "option", arg: 2, scope: !242, file: !69, line: 573, type: !131)
!248 = !DILocalVariable(name: "term", scope: !249, file: !69, line: 585, type: !131)
!249 = distinct !DILexicalBlock(scope: !250, file: !69, line: 582, column: 5)
!250 = distinct !DILexicalBlock(scope: !242, file: !69, line: 581, column: 7)
!251 = !DILocalVariable(name: "double_space", scope: !242, file: !69, line: 594, type: !224)
!252 = !DILocalVariable(name: "first_word", scope: !242, file: !69, line: 595, type: !131)
!253 = !DILocalVariable(name: "option_text", scope: !242, file: !69, line: 596, type: !131)
!254 = !DILocalVariable(name: "s", scope: !255, file: !69, line: 608, type: !131)
!255 = distinct !DILexicalBlock(scope: !256, file: !69, line: 605, column: 5)
!256 = distinct !DILexicalBlock(scope: !257, file: !69, line: 604, column: 12)
!257 = distinct !DILexicalBlock(scope: !242, file: !69, line: 597, column: 7)
!258 = !DILocalVariable(name: "spaces", scope: !255, file: !69, line: 609, type: !129)
!259 = !DILocalVariable(name: "anchor_len", scope: !242, file: !69, line: 620, type: !129)
!260 = !DILocalVariable(name: "desc_text", scope: !242, file: !69, line: 625, type: !131)
!261 = !DILocalVariable(name: "__ptr", scope: !262, file: !69, line: 644, type: !131)
!262 = distinct !DILexicalBlock(scope: !242, file: !69, line: 644, column: 3)
!263 = !DILocalVariable(name: "__stream", scope: !262, file: !69, line: 644, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !266, line: 7, baseType: !267)
!266 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !268, line: 49, size: 1728, elements: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !285, !287, !288, !289, !291, !292, !294, !295, !298, !300, !303, !306, !307, !308, !309, !310}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !267, file: !268, line: 51, baseType: !70, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !267, file: !268, line: 54, baseType: !126, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !267, file: !268, line: 55, baseType: !126, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !267, file: !268, line: 56, baseType: !126, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !267, file: !268, line: 57, baseType: !126, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !267, file: !268, line: 58, baseType: !126, size: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !267, file: !268, line: 59, baseType: !126, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !267, file: !268, line: 60, baseType: !126, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !267, file: !268, line: 61, baseType: !126, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !267, file: !268, line: 64, baseType: !126, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !267, file: !268, line: 65, baseType: !126, size: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !267, file: !268, line: 66, baseType: !126, size: 64, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !267, file: !268, line: 68, baseType: !283, size: 64, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !268, line: 36, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !267, file: !268, line: 70, baseType: !286, size: 64, offset: 832)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !267, file: !268, line: 72, baseType: !70, size: 32, offset: 896)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !267, file: !268, line: 73, baseType: !70, size: 32, offset: 928)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !267, file: !268, line: 74, baseType: !290, size: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !230)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !267, file: !268, line: 77, baseType: !128, size: 16, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !267, file: !268, line: 78, baseType: !293, size: 8, offset: 1040)
!293 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !267, file: !268, line: 79, baseType: !138, size: 8, offset: 1048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !267, file: !268, line: 81, baseType: !296, size: 64, offset: 1088)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !268, line: 43, baseType: null)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !267, file: !268, line: 89, baseType: !299, size: 64, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !230)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !267, file: !268, line: 91, baseType: !301, size: 64, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !268, line: 37, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !267, file: !268, line: 92, baseType: !304, size: 64, offset: 1280)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !268, line: 38, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !267, file: !268, line: 93, baseType: !286, size: 64, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !267, file: !268, line: 94, baseType: !127, size: 64, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !267, file: !268, line: 95, baseType: !129, size: 64, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !267, file: !268, line: 96, baseType: !70, size: 32, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !267, file: !268, line: 98, baseType: !311, size: 160, offset: 1568)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 20)
!314 = !DILocalVariable(name: "__cnt", scope: !262, file: !69, line: 644, type: !129)
!315 = !DILocalVariable(name: "url_program", scope: !242, file: !69, line: 648, type: !131)
!316 = !DILocalVariable(name: "__ptr", scope: !317, file: !69, line: 686, type: !131)
!317 = distinct !DILexicalBlock(scope: !242, file: !69, line: 686, column: 3)
!318 = !DILocalVariable(name: "__stream", scope: !317, file: !69, line: 686, type: !264)
!319 = !DILocalVariable(name: "__cnt", scope: !317, file: !69, line: 686, type: !129)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !69, line: 585, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 5)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !69, line: 586, type: !322, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !69, line: 595, type: !9, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !69, line: 620, type: !14, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !209, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !322, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !9, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !153, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !69, line: 650, type: !322, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !14, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !14, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !69, line: 652, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 7)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !69, line: 653, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !69, line: 654, type: !143, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !69, line: 655, type: !143, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !69, line: 656, type: !143, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !69, line: 657, type: !143, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !69, line: 663, type: !347, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !69, line: 664, type: !143, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 17)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !34, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !219, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 61)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !153, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !322, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !322, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !352, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !168, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 22)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !219, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !9, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 71)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 27)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 51)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 12)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !19, line: 480, type: !322, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !19, line: 483, type: !322, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !19, line: 484, type: !352, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "digest_delim", scope: !61, file: !19, line: 224, type: !133, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !61, file: !19, line: 211, type: !224, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "status_only", scope: !61, file: !19, line: 204, type: !224, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "warn", scope: !61, file: !19, line: 208, type: !224, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "quiet", scope: !61, file: !19, line: 214, type: !224, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "strict", scope: !61, file: !19, line: 218, type: !224, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "raw_digest", scope: !61, file: !19, line: 232, type: !224, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1390, type: !209, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1393, type: !153, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1410, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 28)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1440, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 47)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1461, type: !352, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1461, type: !311, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1490, type: !14, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1490, type: !347, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1492, type: !153, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1512, type: !219, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1520, type: !451, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1528, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 42)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1528, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 44)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1536, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 43)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1536, type: !475, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1544, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 45)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1544, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 46)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1552, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 25)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !61, file: !19, line: 221, type: !70, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "bin2hex", scope: !504, file: !19, line: 1345, type: !514, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "hex_equal", scope: !19, file: !19, line: 1343, type: !505, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !61, retainedNodes: !509)
!505 = !DISubroutineType(types: !506)
!506 = !{!224, !507, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!509 = !{!510, !511, !512, !513}
!510 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !504, file: !19, line: 1343, type: !507)
!511 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !504, file: !19, line: 1343, type: !507)
!512 = !DILocalVariable(name: "digest_bin_bytes", scope: !504, file: !19, line: 1349, type: !227)
!513 = !DILocalVariable(name: "cnt", scope: !504, file: !19, line: 1353, type: !227)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 128, elements: !169)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !69, line: 952, type: !417, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "sumfns", scope: !61, file: !19, line: 254, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 128, elements: !210)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !521, line: 7, baseType: !522)
!521 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!70, !264, !127, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !109, line: 101, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !111, line: 72, baseType: !230)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "sum_output_fns", scope: !61, file: !19, line: 259, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 128, elements: !210)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !19, line: 244, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !131, !70, !535, !224, !224, !133, !224, !526}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 1024, elements: !10)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !540, line: 50, size: 256, elements: !541)
!540 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!541 = !{!542, !543, !544, !546}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !539, file: !540, line: 52, baseType: !131, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !539, file: !540, line: 55, baseType: !70, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !539, file: !540, line: 56, baseType: !545, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !539, file: !540, line: 57, baseType: !70, size: 32, offset: 192)
!547 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!548 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !551, line: 3, type: !219, isLocal: true, isDefinition: true)
!551 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "Version", scope: !554, file: !551, line: 3, type: !131, isLocal: false, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C11, file: !551, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !555, splitDebugInlining: false, nameTableKind: None)
!555 = !{!549, !552}
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "file_name", scope: !558, file: !559, line: 45, type: !131, isLocal: true, isDefinition: true)
!558 = distinct !DICompileUnit(language: DW_LANG_C11, file: !559, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !560, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!560 = !{!561, !563, !565, !567, !556, !569}
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !559, line: 121, type: !347, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !559, line: 121, type: !417, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !559, line: 123, type: !347, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !559, line: 126, type: !153, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !558, file: !559, line: 55, type: !224, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !573, file: !574, line: 66, type: !620, isLocal: false, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C11, file: !574, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !575, globals: !576, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!575 = !{!127, !133}
!576 = !{!577, !579, !599, !601, !603, !605, !571, !607, !609, !611, !613, !618}
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !574, line: 272, type: !322, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "old_file_name", scope: !581, file: !574, line: 304, type: !131, isLocal: true, isDefinition: true)
!581 = distinct !DISubprogram(name: "verror_at_line", scope: !574, file: !574, line: 298, type: !582, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !573, retainedNodes: !592)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !70, !70, !131, !64, !131, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !586)
!586 = !{!587, !589, !590, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !585, file: !588, baseType: !64, size: 32)
!588 = !DIFile(filename: "lib/error.c", directory: "/src")
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !585, file: !588, baseType: !64, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !585, file: !588, baseType: !127, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !585, file: !588, baseType: !127, size: 64, offset: 128)
!592 = !{!593, !594, !595, !596, !597, !598}
!593 = !DILocalVariable(name: "status", arg: 1, scope: !581, file: !574, line: 298, type: !70)
!594 = !DILocalVariable(name: "errnum", arg: 2, scope: !581, file: !574, line: 298, type: !70)
!595 = !DILocalVariable(name: "file_name", arg: 3, scope: !581, file: !574, line: 298, type: !131)
!596 = !DILocalVariable(name: "line_number", arg: 4, scope: !581, file: !574, line: 298, type: !64)
!597 = !DILocalVariable(name: "message", arg: 5, scope: !581, file: !574, line: 298, type: !131)
!598 = !DILocalVariable(name: "args", arg: 6, scope: !581, file: !574, line: 298, type: !584)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "old_line_number", scope: !581, file: !574, line: 305, type: !64, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !574, line: 338, type: !9, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !574, line: 346, type: !352, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !574, line: 346, type: !209, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "error_message_count", scope: !573, file: !574, line: 69, type: !64, isLocal: false, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !573, file: !574, line: 295, type: !70, isLocal: false, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !574, line: 208, type: !347, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !574, line: 208, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 21)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !574, line: 214, type: !322, isLocal: true, isDefinition: true)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null}
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !625, line: 161, type: !209, isLocal: true, isDefinition: true)
!625 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !625, line: 163, type: !138, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !625, line: 233, type: !14, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !625, line: 251, type: !14, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "power_letter", scope: !634, file: !625, line: 36, type: !682, isLocal: true, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C11, file: !625, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!635 = !{!636, !649}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !637, line: 47, baseType: !64, size: 32, elements: !638)
!637 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!639 = !DIEnumerator(name: "human_ceiling", value: 0)
!640 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!641 = !DIEnumerator(name: "human_floor", value: 2)
!642 = !DIEnumerator(name: "human_group_digits", value: 4)
!643 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!644 = !DIEnumerator(name: "human_autoscale", value: 16)
!645 = !DIEnumerator(name: "human_base_1024", value: 32)
!646 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!647 = !DIEnumerator(name: "human_SI", value: 128)
!648 = !DIEnumerator(name: "human_B", value: 256)
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !650, line: 30, baseType: !64, size: 32, elements: !651)
!650 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!651 = !{!652, !653, !654, !655, !656}
!652 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!653 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!654 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!655 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!656 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!657 = !{!535}
!658 = !{!623, !626, !628, !630, !632, !659, !664, !666, !668, !670, !672, !676, !680}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !625, line: 417, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 11)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !625, line: 418, type: !143, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !625, line: 438, type: !163, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !625, line: 398, type: !219, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !625, line: 398, type: !153, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "block_size_args", scope: !634, file: !625, line: 398, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 192, elements: !154)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !634, file: !625, line: 399, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 64, elements: !210)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !625, line: 408, type: !168, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 88, elements: !662)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "program_name", scope: !685, file: !686, line: 31, type: !131, isLocal: false, isDefinition: true)
!685 = distinct !DICompileUnit(language: DW_LANG_C11, file: !686, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !687, globals: !688, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!687 = !{!126}
!688 = !{!683, !689, !691}
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !686, line: 46, type: !352, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !686, line: 49, type: !9, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "utf07FF", scope: !695, file: !696, line: 46, type: !723, isLocal: true, isDefinition: true)
!695 = distinct !DISubprogram(name: "proper_name_lite", scope: !696, file: !696, line: 38, type: !697, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !699, retainedNodes: !701)
!696 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!697 = !DISubroutineType(types: !698)
!698 = !{!131, !131, !131}
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !696, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !700, splitDebugInlining: false, nameTableKind: None)
!700 = !{!693}
!701 = !{!702, !703, !704, !705, !710}
!702 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !695, file: !696, line: 38, type: !131)
!703 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !695, file: !696, line: 38, type: !131)
!704 = !DILocalVariable(name: "translation", scope: !695, file: !696, line: 40, type: !131)
!705 = !DILocalVariable(name: "w", scope: !695, file: !696, line: 47, type: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !707, line: 37, baseType: !708)
!707 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !111, line: 57, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !111, line: 42, baseType: !64)
!710 = !DILocalVariable(name: "mbs", scope: !695, file: !696, line: 48, type: !711)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !712, line: 6, baseType: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !714, line: 21, baseType: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 13, size: 64, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !715, file: !714, line: 15, baseType: !70, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !715, file: !714, line: 20, baseType: !719, size: 32, offset: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !714, line: 16, size: 32, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !719, file: !714, line: 18, baseType: !64, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !719, file: !714, line: 19, baseType: !9, size: 32)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 16, elements: !210)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !726, line: 78, type: !352, isLocal: true, isDefinition: true)
!726 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !726, line: 79, type: !14, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !726, line: 80, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 13)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !726, line: 81, type: !731, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !726, line: 82, type: !311, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !726, line: 83, type: !209, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !726, line: 84, type: !352, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !726, line: 85, type: !347, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !726, line: 86, type: !347, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !726, line: 87, type: !352, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !750, file: !726, line: 76, type: !822, isLocal: false, isDefinition: true)
!750 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !751, retainedTypes: !757, globals: !758, splitDebugInlining: false, nameTableKind: None)
!751 = !{!89, !752, !74}
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !90, line: 254, baseType: !64, size: 32, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!755 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!756 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!757 = !{!70, !128, !129}
!758 = !{!724, !727, !729, !734, !736, !738, !740, !742, !744, !746, !748, !759, !763, !773, !775, !780, !782, !784, !786, !788, !811, !818, !820}
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !750, file: !726, line: 92, type: !761, isLocal: false, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 320, elements: !144)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !750, file: !726, line: 1040, type: !765, isLocal: false, isDefinition: true)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !726, line: 56, size: 448, elements: !766)
!766 = !{!767, !768, !769, !771, !772}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !765, file: !726, line: 59, baseType: !89, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !765, file: !726, line: 62, baseType: !70, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !765, file: !726, line: 66, baseType: !770, size: 256, offset: 64)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !353)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !765, file: !726, line: 69, baseType: !131, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !765, file: !726, line: 72, baseType: !131, size: 64, offset: 384)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !750, file: !726, line: 107, type: !765, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "slot0", scope: !750, file: !726, line: 831, type: !777, isLocal: true, isDefinition: true)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 256)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !726, line: 321, type: !209, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !726, line: 357, type: !209, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !726, line: 358, type: !209, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !726, line: 199, type: !347, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "quote", scope: !790, file: !726, line: 228, type: !809, isLocal: true, isDefinition: true)
!790 = distinct !DISubprogram(name: "gettext_quote", scope: !726, file: !726, line: 197, type: !791, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !750, retainedNodes: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!131, !131, !89}
!793 = !{!794, !795, !796, !797, !798}
!794 = !DILocalVariable(name: "msgid", arg: 1, scope: !790, file: !726, line: 197, type: !131)
!795 = !DILocalVariable(name: "s", arg: 2, scope: !790, file: !726, line: 197, type: !89)
!796 = !DILocalVariable(name: "translation", scope: !790, file: !726, line: 199, type: !131)
!797 = !DILocalVariable(name: "w", scope: !790, file: !726, line: 229, type: !706)
!798 = !DILocalVariable(name: "mbs", scope: !790, file: !726, line: 230, type: !799)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !712, line: 6, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !714, line: 21, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 13, size: 64, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !801, file: !714, line: 15, baseType: !70, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !801, file: !714, line: 20, baseType: !805, size: 32, offset: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !801, file: !714, line: 16, size: 32, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !805, file: !714, line: 18, baseType: !64, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !805, file: !714, line: 19, baseType: !9, size: 32)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !810)
!810 = !{!211, !11}
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "slotvec", scope: !750, file: !726, line: 834, type: !813, isLocal: true, isDefinition: true)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !726, line: 823, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !814, file: !726, line: 825, baseType: !129, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !814, file: !726, line: 826, baseType: !126, size: 64, offset: 64)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "nslots", scope: !750, file: !726, line: 832, type: !70, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "slotvec0", scope: !750, file: !726, line: 833, type: !814, isLocal: true, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 704, elements: !662)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !825, line: 67, type: !417, isLocal: true, isDefinition: true)
!825 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !825, line: 69, type: !347, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !825, line: 83, type: !347, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !825, line: 83, type: !9, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !825, line: 85, type: !209, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !825, line: 88, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 171)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !825, line: 88, type: !841, isLocal: true, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 34)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !825, line: 105, type: !168, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !825, line: 109, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 23)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !825, line: 113, type: !446, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !825, line: 120, type: !855, isLocal: true, isDefinition: true)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 32)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !825, line: 127, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 36)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !825, line: 134, type: !34, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !825, line: 142, type: !475, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !825, line: 150, type: !869, isLocal: true, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 48)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !825, line: 159, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 52)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !825, line: 170, type: !173, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !825, line: 248, type: !311, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !825, line: 248, type: !393, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !825, line: 254, type: !311, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !825, line: 254, type: !158, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !825, line: 254, type: !34, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !825, line: 259, type: !20, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !825, line: 259, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 29)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !898, file: !899, line: 26, type: !901, isLocal: false, isDefinition: true)
!898 = distinct !DICompileUnit(language: DW_LANG_C11, file: !899, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !900, splitDebugInlining: false, nameTableKind: None)
!899 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!900 = !{!896}
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 376, elements: !452)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "exit_failure", scope: !904, file: !905, line: 24, type: !907, isLocal: false, isDefinition: true)
!904 = distinct !DICompileUnit(language: DW_LANG_C11, file: !905, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !906, splitDebugInlining: false, nameTableKind: None)
!905 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!906 = !{!902}
!907 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !910, line: 34, type: !153, isLocal: true, isDefinition: true)
!910 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !910, line: 34, type: !347, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !910, line: 34, type: !369, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !917, file: !918, line: 65, type: !934, isLocal: false, isDefinition: true)
!917 = distinct !DICompileUnit(language: DW_LANG_C11, file: !918, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !919, retainedTypes: !920, globals: !921, splitDebugInlining: false, nameTableKind: None)
!918 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!919 = !{!89}
!920 = !{!127, !131, !133}
!921 = !{!915, !922, !924, !926, !928, !930, !932}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !918, line: 141, type: !347, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !918, line: 141, type: !407, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !918, line: 142, type: !893, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !918, line: 160, type: !615, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !918, line: 165, type: !352, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !918, line: 170, type: !322, isLocal: true, isDefinition: true)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !935, line: 69, baseType: !620)
!935 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !938, file: !939, line: 506, type: !70, isLocal: true, isDefinition: true)
!938 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !939, file: !939, line: 485, type: !940, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !942, retainedNodes: !944)
!939 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!940 = !DISubroutineType(types: !941)
!941 = !{!70, !70, !70}
!942 = distinct !DICompileUnit(language: DW_LANG_C11, file: !939, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !943, splitDebugInlining: false, nameTableKind: None)
!943 = !{!936}
!944 = !{!945, !946, !947, !948, !951}
!945 = !DILocalVariable(name: "fd", arg: 1, scope: !938, file: !939, line: 485, type: !70)
!946 = !DILocalVariable(name: "target", arg: 2, scope: !938, file: !939, line: 485, type: !70)
!947 = !DILocalVariable(name: "result", scope: !938, file: !939, line: 487, type: !70)
!948 = !DILocalVariable(name: "flags", scope: !949, file: !939, line: 530, type: !70)
!949 = distinct !DILexicalBlock(scope: !950, file: !939, line: 529, column: 5)
!950 = distinct !DILexicalBlock(scope: !938, file: !939, line: 528, column: 7)
!951 = !DILocalVariable(name: "saved_errno", scope: !952, file: !939, line: 533, type: !70)
!952 = distinct !DILexicalBlock(scope: !953, file: !939, line: 532, column: 9)
!953 = distinct !DILexicalBlock(scope: !949, file: !939, line: 531, column: 11)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !956, line: 108, type: !138, isLocal: true, isDefinition: true)
!956 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "internal_state", scope: !959, file: !956, line: 97, type: !962, isLocal: true, isDefinition: true)
!959 = distinct !DICompileUnit(language: DW_LANG_C11, file: !956, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !960, globals: !961, splitDebugInlining: false, nameTableKind: None)
!960 = !{!127, !129, !133}
!961 = !{!954, !957}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !712, line: 6, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !714, line: 21, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 13, size: 64, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !964, file: !714, line: 15, baseType: !70, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !964, file: !714, line: 20, baseType: !968, size: 32, offset: 32)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !964, file: !714, line: 16, size: 32, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !968, file: !714, line: 18, baseType: !64, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !968, file: !714, line: 19, baseType: !9, size: 32)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !974, line: 35, type: !14, isLocal: true, isDefinition: true)
!974 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!975 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !976, retainedTypes: !1061, globals: !1063, splitDebugInlining: false, nameTableKind: None)
!976 = !{!977, !1039, !636}
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !978, file: !2, line: 40, baseType: !64, size: 32, elements: !1037)
!978 = distinct !DISubprogram(name: "bsd_sum_stream", scope: !2, file: !2, line: 34, type: !979, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !975, retainedNodes: !1015)
!979 = !DISubroutineType(types: !980)
!980 = !{!70, !981, !127, !525}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !266, line: 7, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !268, line: 49, size: 1728, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !983, file: !268, line: 51, baseType: !70, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !983, file: !268, line: 54, baseType: !126, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !983, file: !268, line: 55, baseType: !126, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !983, file: !268, line: 56, baseType: !126, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !983, file: !268, line: 57, baseType: !126, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !983, file: !268, line: 58, baseType: !126, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !983, file: !268, line: 59, baseType: !126, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !983, file: !268, line: 60, baseType: !126, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !983, file: !268, line: 61, baseType: !126, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !983, file: !268, line: 64, baseType: !126, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !983, file: !268, line: 65, baseType: !126, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !983, file: !268, line: 66, baseType: !126, size: 64, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !983, file: !268, line: 68, baseType: !283, size: 64, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !983, file: !268, line: 70, baseType: !999, size: 64, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !983, file: !268, line: 72, baseType: !70, size: 32, offset: 896)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !983, file: !268, line: 73, baseType: !70, size: 32, offset: 928)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !983, file: !268, line: 74, baseType: !290, size: 64, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !983, file: !268, line: 77, baseType: !128, size: 16, offset: 1024)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !983, file: !268, line: 78, baseType: !293, size: 8, offset: 1040)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !983, file: !268, line: 79, baseType: !138, size: 8, offset: 1048)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !983, file: !268, line: 81, baseType: !296, size: 64, offset: 1088)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !983, file: !268, line: 89, baseType: !299, size: 64, offset: 1152)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !983, file: !268, line: 91, baseType: !301, size: 64, offset: 1216)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !983, file: !268, line: 92, baseType: !304, size: 64, offset: 1280)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !983, file: !268, line: 93, baseType: !999, size: 64, offset: 1344)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !983, file: !268, line: 94, baseType: !127, size: 64, offset: 1408)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !983, file: !268, line: 95, baseType: !129, size: 64, offset: 1472)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !983, file: !268, line: 96, baseType: !70, size: 32, offset: 1536)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !983, file: !268, line: 98, baseType: !311, size: 160, offset: 1568)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1028, !1031, !1033, !1035, !1036}
!1016 = !DILocalVariable(name: "stream", arg: 1, scope: !978, file: !2, line: 34, type: !981)
!1017 = !DILocalVariable(name: "resstream", arg: 2, scope: !978, file: !2, line: 34, type: !127)
!1018 = !DILocalVariable(name: "length", arg: 3, scope: !978, file: !2, line: 34, type: !525)
!1019 = !DILocalVariable(name: "ret", scope: !978, file: !2, line: 36, type: !70)
!1020 = !DILocalVariable(name: "sum", scope: !978, file: !2, line: 37, type: !227)
!1021 = !DILocalVariable(name: "checksum", scope: !978, file: !2, line: 38, type: !70)
!1022 = !DILocalVariable(name: "total_bytes", scope: !978, file: !2, line: 39, type: !526)
!1023 = !DILocalVariable(name: "buffer", scope: !978, file: !2, line: 41, type: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1026, line: 24, baseType: !1027)
!1026 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !111, line: 38, baseType: !133)
!1028 = !DILocalVariable(name: "n", scope: !1029, file: !2, line: 54, type: !129)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 53, column: 5)
!1030 = distinct !DILexicalBlock(scope: !978, file: !2, line: 48, column: 3)
!1031 = !DILocalVariable(name: "i", scope: !1032, file: !2, line: 71, type: !129)
!1032 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 71, column: 5)
!1033 = !DILocalVariable(name: "i", scope: !1034, file: !2, line: 86, type: !227)
!1034 = distinct !DILexicalBlock(scope: !978, file: !2, line: 86, column: 3)
!1035 = !DILabel(scope: !978, name: "final_process", file: !2, line: 84)
!1036 = !DILabel(scope: !978, name: "cleanup_buffer", file: !2, line: 101)
!1037 = !{!1038}
!1038 = !DIEnumerator(name: "buffer_length", value: 32768)
!1039 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1040, file: !2, line: 115, baseType: !64, size: 32, elements: !1037)
!1040 = distinct !DISubprogram(name: "sysv_sum_stream", scope: !2, file: !2, line: 110, type: !979, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !975, retainedNodes: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1053, !1055, !1057, !1058, !1059, !1060}
!1042 = !DILocalVariable(name: "stream", arg: 1, scope: !1040, file: !2, line: 110, type: !981)
!1043 = !DILocalVariable(name: "resstream", arg: 2, scope: !1040, file: !2, line: 110, type: !127)
!1044 = !DILocalVariable(name: "length", arg: 3, scope: !1040, file: !2, line: 110, type: !525)
!1045 = !DILocalVariable(name: "ret", scope: !1040, file: !2, line: 112, type: !70)
!1046 = !DILocalVariable(name: "sum", scope: !1040, file: !2, line: 113, type: !227)
!1047 = !DILocalVariable(name: "total_bytes", scope: !1040, file: !2, line: 114, type: !526)
!1048 = !DILocalVariable(name: "buffer", scope: !1040, file: !2, line: 116, type: !1024)
!1049 = !DILocalVariable(name: "s", scope: !1040, file: !2, line: 122, type: !64)
!1050 = !DILocalVariable(name: "n", scope: !1051, file: !2, line: 132, type: !129)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 131, column: 5)
!1052 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 126, column: 3)
!1053 = !DILocalVariable(name: "i", scope: !1054, file: !2, line: 149, type: !129)
!1054 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 149, column: 5)
!1055 = !DILocalVariable(name: "i", scope: !1056, file: !2, line: 161, type: !129)
!1056 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 161, column: 3)
!1057 = !DILocalVariable(name: "r", scope: !1040, file: !2, line: 170, type: !70)
!1058 = !DILocalVariable(name: "checksum", scope: !1040, file: !2, line: 171, type: !70)
!1059 = !DILabel(scope: !1040, name: "final_process", file: !2, line: 159)
!1060 = !DILabel(scope: !1040, name: "cleanup_buffer", file: !2, line: 176)
!1061 = !{!224, !545, !131, !129, !1062, !133}
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !111, line: 40, baseType: !128)
!1063 = !{!0, !7, !12}
!1064 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1065, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1066, splitDebugInlining: false, nameTableKind: None)
!1065 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1066 = !{!116}
!1067 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1068, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1068 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1069 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1070, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1071, splitDebugInlining: false, nameTableKind: None)
!1070 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1071 = !{!127}
!1072 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1073, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1073 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1074 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1075, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1071, splitDebugInlining: false, nameTableKind: None)
!1075 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1076 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1077, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1077 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1078 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1079, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1079 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1080 = distinct !DICompileUnit(language: DW_LANG_C11, file: !825, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1081, retainedTypes: !1071, globals: !1085, splitDebugInlining: false, nameTableKind: None)
!1081 = !{!1082}
!1082 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 40, baseType: !64, size: 32, elements: !1083)
!1083 = !{!1084}
!1084 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1085 = !{!823, !826, !828, !830, !832, !834, !839, !844, !846, !851, !853, !858, !863, !865, !867, !872, !877, !879, !881, !883, !885, !887, !889, !891}
!1086 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1087, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1088, retainedTypes: !1116, splitDebugInlining: false, nameTableKind: None)
!1087 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1088 = !{!1089, !1101}
!1089 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1090, file: !1087, line: 188, baseType: !64, size: 32, elements: !1099)
!1090 = distinct !DISubprogram(name: "x2nrealloc", scope: !1087, file: !1087, line: 176, type: !1091, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1086, retainedNodes: !1094)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!127, !127, !1093, !129}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!1094 = !{!1095, !1096, !1097, !1098}
!1095 = !DILocalVariable(name: "p", arg: 1, scope: !1090, file: !1087, line: 176, type: !127)
!1096 = !DILocalVariable(name: "pn", arg: 2, scope: !1090, file: !1087, line: 176, type: !1093)
!1097 = !DILocalVariable(name: "s", arg: 3, scope: !1090, file: !1087, line: 176, type: !129)
!1098 = !DILocalVariable(name: "n", scope: !1090, file: !1087, line: 178, type: !129)
!1099 = !{!1100}
!1100 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1101 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1102, file: !1087, line: 228, baseType: !64, size: 32, elements: !1099)
!1102 = distinct !DISubprogram(name: "xpalloc", scope: !1087, file: !1087, line: 223, type: !1103, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1086, retainedNodes: !1106)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!127, !127, !1105, !227, !229, !227}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115}
!1107 = !DILocalVariable(name: "pa", arg: 1, scope: !1102, file: !1087, line: 223, type: !127)
!1108 = !DILocalVariable(name: "pn", arg: 2, scope: !1102, file: !1087, line: 223, type: !1105)
!1109 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1102, file: !1087, line: 223, type: !227)
!1110 = !DILocalVariable(name: "n_max", arg: 4, scope: !1102, file: !1087, line: 223, type: !229)
!1111 = !DILocalVariable(name: "s", arg: 5, scope: !1102, file: !1087, line: 223, type: !227)
!1112 = !DILocalVariable(name: "n0", scope: !1102, file: !1087, line: 230, type: !227)
!1113 = !DILocalVariable(name: "n", scope: !1102, file: !1087, line: 237, type: !227)
!1114 = !DILocalVariable(name: "nbytes", scope: !1102, file: !1087, line: 248, type: !227)
!1115 = !DILocalVariable(name: "adjusted_nbytes", scope: !1102, file: !1087, line: 252, type: !227)
!1116 = !{!126, !127, !224, !230, !107}
!1117 = distinct !DICompileUnit(language: DW_LANG_C11, file: !910, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1118, splitDebugInlining: false, nameTableKind: None)
!1118 = !{!908, !911, !913}
!1119 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1120, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1121, retainedTypes: !1122, splitDebugInlining: false, nameTableKind: None)
!1120 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!1121 = !{!649, !74}
!1122 = !{!70, !128, !126, !224, !107, !108}
!1123 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1124, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1071, splitDebugInlining: false, nameTableKind: None)
!1124 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1125 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1126, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1126 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1127 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1128, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1129, splitDebugInlining: false, nameTableKind: None)
!1128 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1129 = !{!224, !107, !127}
!1130 = distinct !DICompileUnit(language: DW_LANG_C11, file: !974, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1131, splitDebugInlining: false, nameTableKind: None)
!1131 = !{!1132, !972}
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !974, line: 35, type: !209, isLocal: true, isDefinition: true)
!1134 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1135, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1135 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1136 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1137, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1071, splitDebugInlining: false, nameTableKind: None)
!1137 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1138 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1139 = !{i32 7, !"Dwarf Version", i32 5}
!1140 = !{i32 2, !"Debug Info Version", i32 3}
!1141 = !{i32 1, !"wchar_size", i32 4}
!1142 = !{i32 8, !"PIC Level", i32 2}
!1143 = !{i32 7, !"PIE Level", i32 2}
!1144 = !{i32 7, !"uwtable", i32 2}
!1145 = !DILocation(line: 0, scope: !978)
!1146 = !DILocation(line: 41, column: 21, scope: !978)
!1147 = !DILocation(line: 43, column: 9, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !978, file: !2, line: 43, column: 7)
!1149 = !DILocation(line: 43, column: 7, scope: !978)
!1150 = !DILocation(line: 52, column: 5, scope: !1030)
!1151 = !DILocation(line: 49, column: 9, scope: !1030)
!1152 = !DILocation(line: 54, column: 18, scope: !1029)
!1153 = !DILocation(line: 0, scope: !1029)
!1154 = !DILocation(line: 55, column: 13, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 55, column: 11)
!1156 = !DILocation(line: 55, column: 11, scope: !1029)
!1157 = !DILocalVariable(name: "__stream", arg: 1, scope: !1158, file: !1159, line: 135, type: !981)
!1158 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1159, file: !1159, line: 135, type: !1160, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !975, retainedNodes: !1162)
!1159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!70, !981}
!1162 = !{!1157}
!1163 = !DILocation(line: 0, scope: !1158, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 57, column: 15, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1166, file: !2, line: 57, column: 15)
!1166 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 56, column: 9)
!1167 = !DILocation(line: 137, column: 10, scope: !1158, inlinedAt: !1164)
!1168 = !{!1169, !1170, i64 0}
!1169 = !{!"_IO_FILE", !1170, i64 0, !1173, i64 8, !1173, i64 16, !1173, i64 24, !1173, i64 32, !1173, i64 40, !1173, i64 48, !1173, i64 56, !1173, i64 64, !1173, i64 72, !1173, i64 80, !1173, i64 88, !1173, i64 96, !1173, i64 104, !1170, i64 112, !1170, i64 116, !1174, i64 120, !1175, i64 128, !1171, i64 130, !1171, i64 131, !1173, i64 136, !1174, i64 144, !1173, i64 152, !1173, i64 160, !1173, i64 168, !1173, i64 176, !1174, i64 184, !1170, i64 192, !1171, i64 196}
!1170 = !{!"int", !1171, i64 0}
!1171 = !{!"omnipotent char", !1172, i64 0}
!1172 = !{!"Simple C/C++ TBAA"}
!1173 = !{!"any pointer", !1171, i64 0}
!1174 = !{!"long", !1171, i64 0}
!1175 = !{!"short", !1171, i64 0}
!1176 = !DILocation(line: 57, column: 15, scope: !1165)
!1177 = !DILocation(line: 0, scope: !1166)
!1178 = !DILocation(line: 62, column: 11, scope: !1029)
!1179 = !DILocation(line: 64, column: 25, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 64, column: 11)
!1181 = !DILocation(line: 64, column: 11, scope: !1029)
!1182 = !DILocalVariable(name: "__stream", arg: 1, scope: !1183, file: !1159, line: 128, type: !981)
!1183 = distinct !DISubprogram(name: "feof_unlocked", scope: !1159, file: !1159, line: 128, type: !1160, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !975, retainedNodes: !1184)
!1184 = !{!1182}
!1185 = !DILocation(line: 0, scope: !1183, inlinedAt: !1186)
!1186 = distinct !DILocation(line: 67, column: 11, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 67, column: 11)
!1188 = !DILocation(line: 130, column: 10, scope: !1183, inlinedAt: !1186)
!1189 = !DILocation(line: 67, column: 11, scope: !1187)
!1190 = !DILocation(line: 0, scope: !1030)
!1191 = !DILocation(line: 0, scope: !1034)
!1192 = !DILocation(line: 86, column: 23, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1034, file: !2, line: 86, column: 3)
!1194 = !DILocation(line: 86, column: 3, scope: !1034)
!1195 = !DILocation(line: 77, column: 9, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 77, column: 9)
!1197 = !DILocation(line: 77, column: 9, scope: !1030)
!1198 = distinct !{!1198, !1199, !1200}
!1199 = !DILocation(line: 47, column: 3, scope: !978)
!1200 = !DILocation(line: 82, column: 3, scope: !978)
!1201 = !DILocation(line: 0, scope: !1032)
!1202 = !DILocation(line: 73, column: 30, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !2, line: 72, column: 7)
!1204 = distinct !DILexicalBlock(scope: !1032, file: !2, line: 71, column: 5)
!1205 = !DILocation(line: 73, column: 54, scope: !1203)
!1206 = !DILocation(line: 73, column: 36, scope: !1203)
!1207 = !DILocation(line: 74, column: 21, scope: !1203)
!1208 = !{!1171, !1171, i64 0}
!1209 = !DILocation(line: 74, column: 18, scope: !1203)
!1210 = !DILocation(line: 75, column: 18, scope: !1203)
!1211 = !DILocation(line: 71, column: 34, scope: !1204)
!1212 = !DILocation(line: 71, column: 26, scope: !1204)
!1213 = !DILocation(line: 71, column: 5, scope: !1032)
!1214 = distinct !{!1214, !1213, !1215, !1216}
!1215 = !DILocation(line: 76, column: 7, scope: !1032)
!1216 = !{!"llvm.loop.mustprogress"}
!1217 = !DILocation(line: 79, column: 9, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1196, file: !2, line: 78, column: 7)
!1219 = !DILocation(line: 79, column: 15, scope: !1218)
!1220 = !{!1170, !1170, i64 0}
!1221 = !DILocation(line: 80, column: 9, scope: !1218)
!1222 = !DILocation(line: 88, column: 28, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1193, file: !2, line: 87, column: 5)
!1224 = !DILocation(line: 88, column: 52, scope: !1223)
!1225 = !DILocation(line: 88, column: 34, scope: !1223)
!1226 = !DILocation(line: 89, column: 19, scope: !1223)
!1227 = !DILocation(line: 89, column: 16, scope: !1223)
!1228 = !DILocation(line: 90, column: 16, scope: !1223)
!1229 = !DILocation(line: 0, scope: !1223)
!1230 = !DILocation(line: 92, column: 7, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !978, file: !2, line: 92, column: 7)
!1232 = !DILocation(line: 92, column: 7, scope: !978)
!1233 = !DILocation(line: 86, column: 31, scope: !1193)
!1234 = distinct !{!1234, !1194, !1235, !1216}
!1235 = !DILocation(line: 91, column: 5, scope: !1034)
!1236 = !DILocation(line: 94, column: 7, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1231, file: !2, line: 93, column: 5)
!1238 = !DILocation(line: 94, column: 13, scope: !1237)
!1239 = !DILocation(line: 95, column: 7, scope: !1237)
!1240 = !DILocalVariable(name: "__dest", arg: 1, scope: !1241, file: !1242, line: 26, type: !1245)
!1241 = distinct !DISubprogram(name: "memcpy", scope: !1242, file: !1242, line: 26, type: !1243, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !975, retainedNodes: !1247)
!1242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!127, !1245, !1246, !129}
!1245 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !127)
!1246 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !535)
!1247 = !{!1240, !1248, !1249}
!1248 = !DILocalVariable(name: "__src", arg: 2, scope: !1241, file: !1242, line: 26, type: !1246)
!1249 = !DILocalVariable(name: "__len", arg: 3, scope: !1241, file: !1242, line: 26, type: !129)
!1250 = !DILocation(line: 0, scope: !1241, inlinedAt: !1251)
!1251 = distinct !DILocation(line: 98, column: 3, scope: !978)
!1252 = !DILocation(line: 29, column: 10, scope: !1241, inlinedAt: !1251)
!1253 = !DILocation(line: 99, column: 11, scope: !978)
!1254 = !{!1174, !1174, i64 0}
!1255 = !DILocation(line: 100, column: 3, scope: !978)
!1256 = !DILocation(line: 101, column: 1, scope: !978)
!1257 = !DILocation(line: 102, column: 3, scope: !978)
!1258 = !DILocation(line: 103, column: 3, scope: !978)
!1259 = !DILocation(line: 104, column: 1, scope: !978)
!1260 = !DISubprogram(name: "malloc", scope: !1261, file: !1261, line: 540, type: !1262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1264)
!1261 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1262 = !DISubroutineType(types: !1263)
