; ModuleID = 'src/tail.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.pollfd = type { i32, i16, i16 }
%struct.File_spec = type { ptr, ptr, %struct.timespec, i64, i64, i32, i64, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct.inotify_event = type { i32, i32, i32, i32, [0 x i8] }
%struct.charbuffer = type { [8192 x i8], i64, ptr }
%struct.linebuffer = type { [8192 x i8], i64, i64, ptr }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

!176 = !{!177, !178}
!177 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!178 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 81, baseType: !175, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIEnumerator(name: "COPY_TO_EOF", value: -1)
!182 = !DIEnumerator(name: "COPY_A_BUFFER", value: -2)
!183 = !{!175, !184, !185, !188, !190, !191, !192, !187, !193, !194, !196, !200, !201}
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 46, baseType: !187)
!186 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!187 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!190 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!191 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!192 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !197, line: 97, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !199, line: 154, baseType: !175)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !202, line: 63, baseType: !203)
!202 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !199, line: 152, baseType: !192)
!204 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !61, !66, !71, !76, !81, !86, !91, !96, !101, !106, !205, !210, !321, !326, !328, !333, !338, !340, !342, !344, !346, !111, !348, !350, !352, !357, !362, !441, !443, !445, !450, !455, !457, !459, !461, !464, !466, !468, !470, !475, !480, !482, !484, !486, !488, !490, !492, !497, !502, !504, !509, !511, !513, !515, !517, !519, !524, !526, !528, !530, !535, !540, !545, !547, !549, !551, !553, !555, !557, !562, !564, !566, !571, !576, !581, !583, !585, !590, !595, !600, !605, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !653, !655, !659, !661, !663, !667, !669, !671, !673, !676, !678, !680, !682, !684, !686, !688, !690, !692, !694, !701, !703, !705, !707, !712, !714, !719, !721, !723, !725, !738, !743, !748, !750, !752, !757, !762, !764, !766, !768, !770, !772, !777, !779, !784, !786, !789, !791, !793, !798, !803, !805, !807, !809, !814, !816, !844, !846, !848, !853, !855, !858}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2396, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 2)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !212, file: !2, line: 2396, type: !200, isLocal: true, isDefinition: true)
!212 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 2347, type: !213, scopeLine: 2348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !216)
!213 = !DISubroutineType(types: !214)
!214 = !{!175, !175, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!216 = !{!217, !218, !219, !220, !221, !226, !227, !228, !265, !266, !268, !270, !272, !274, !303, !304, !306, !308, !311, !314}
!217 = !DILocalVariable(name: "argc", arg: 1, scope: !212, file: !2, line: 2347, type: !175)
!218 = !DILocalVariable(name: "argv", arg: 2, scope: !212, file: !2, line: 2347, type: !215)
!219 = !DILocalVariable(name: "header_mode", scope: !212, file: !2, line: 2349, type: !119)
!220 = !DILocalVariable(name: "ok", scope: !212, file: !2, line: 2350, type: !191)
!221 = !DILocalVariable(name: "n_units", scope: !212, file: !2, line: 2353, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "count_t", file: !2, line: 85, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !224, line: 101, baseType: !225)
!224 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !199, line: 72, baseType: !192)
!226 = !DILocalVariable(name: "n_files", scope: !212, file: !2, line: 2354, type: !175)
!227 = !DILocalVariable(name: "file", scope: !212, file: !2, line: 2355, type: !215)
!228 = !DILocalVariable(name: "F", scope: !212, file: !2, line: 2356, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !2, line: 118, size: 832, elements: !231)
!231 = !{!232, !233, !234, !242, !245, !248, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !264}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !2, line: 121, baseType: !200, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prettyname", scope: !230, file: !2, line: 124, baseType: !188, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !230, file: !2, line: 127, baseType: !235, size: 128, offset: 128)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !236, line: 11, size: 128, elements: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!237 = !{!238, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !235, file: !236, line: 16, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !199, line: 160, baseType: !192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !235, file: !236, line: 21, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !199, line: 197, baseType: !192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !230, file: !2, line: 128, baseType: !243, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !197, line: 59, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !199, line: 145, baseType: !187)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !230, file: !2, line: 129, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !197, line: 47, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !199, line: 148, baseType: !187)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !230, file: !2, line: 130, baseType: !249, size: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !197, line: 69, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !199, line: 150, baseType: !116)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !230, file: !2, line: 134, baseType: !201, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !230, file: !2, line: 139, baseType: !191, size: 8, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !230, file: !2, line: 142, baseType: !191, size: 8, offset: 520)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !230, file: !2, line: 146, baseType: !191, size: 8, offset: 528)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !230, file: !2, line: 149, baseType: !175, size: 32, offset: 544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !230, file: !2, line: 153, baseType: !175, size: 32, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !230, file: !2, line: 156, baseType: !175, size: 32, offset: 608)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !230, file: !2, line: 160, baseType: !175, size: 32, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !230, file: !2, line: 164, baseType: !175, size: 32, offset: 672)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !230, file: !2, line: 167, baseType: !261, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !262, line: 130, baseType: !263)
!262 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !186, line: 35, baseType: !192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !230, file: !2, line: 171, baseType: !222, size: 64, offset: 768)
!265 = !DILocalVariable(name: "obsolete_option", scope: !212, file: !2, line: 2357, type: !191)
!266 = !DILocalVariable(name: "sleep_interval", scope: !212, file: !2, line: 2362, type: !267)
!267 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!268 = !DILocalVariable(name: "p", scope: !269, file: !2, line: 2373, type: !175)
!269 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2372, column: 3)
!270 = !DILocalVariable(name: "found_hyphen", scope: !271, file: !2, line: 2402, type: !191)
!271 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2401, column: 3)
!272 = !DILocalVariable(name: "i", scope: !273, file: !2, line: 2404, type: !175)
!273 = distinct !DILexicalBlock(scope: !271, file: !2, line: 2404, column: 5)
!274 = !DILocalVariable(name: "in_stat", scope: !275, file: !2, line: 2418, type: !277)
!275 = distinct !DILexicalBlock(scope: !276, file: !2, line: 2417, column: 7)
!276 = distinct !DILexicalBlock(scope: !271, file: !2, line: 2416, column: 9)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !278, line: 26, size: 1152, elements: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!279 = !{!280, !281, !282, !284, !285, !287, !289, !290, !291, !292, !294, !296, !297, !298, !299}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !277, file: !278, line: 31, baseType: !244, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !277, file: !278, line: 36, baseType: !247, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !277, file: !278, line: 44, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !199, line: 151, baseType: !187)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !277, file: !278, line: 45, baseType: !250, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !277, file: !278, line: 47, baseType: !286, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !199, line: 146, baseType: !116)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !277, file: !278, line: 48, baseType: !288, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !199, line: 147, baseType: !116)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !277, file: !278, line: 50, baseType: !175, size: 32, offset: 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !277, file: !278, line: 52, baseType: !244, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !277, file: !278, line: 57, baseType: !203, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !277, file: !278, line: 61, baseType: !293, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !199, line: 175, baseType: !192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !277, file: !278, line: 63, baseType: !295, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !199, line: 180, baseType: !192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !277, file: !278, line: 74, baseType: !235, size: 128, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !277, file: !278, line: 75, baseType: !235, size: 128, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !277, file: !278, line: 76, baseType: !235, size: 128, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !277, file: !278, line: 89, baseType: !300, size: 192, offset: 960)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 192, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 3)
!303 = !DILocalVariable(name: "blocking_stdin", scope: !275, file: !2, line: 2419, type: !191)
!304 = !DILocalVariable(name: "i", scope: !305, file: !2, line: 2437, type: !175)
!305 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2437, column: 3)
!306 = !DILocalVariable(name: "i", scope: !307, file: !2, line: 2449, type: !175)
!307 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2449, column: 3)
!308 = !DILocalVariable(name: "out_stat", scope: !309, file: !2, line: 2456, type: !277)
!309 = distinct !DILexicalBlock(scope: !310, file: !2, line: 2453, column: 5)
!310 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2452, column: 7)
!311 = !DILocalVariable(name: "wd", scope: !312, file: !2, line: 2510, type: !175)
!312 = distinct !DILexicalBlock(scope: !313, file: !2, line: 2509, column: 9)
!313 = distinct !DILexicalBlock(scope: !309, file: !2, line: 2508, column: 11)
!314 = !DILocalVariable(name: "ht", scope: !315, file: !2, line: 2519, type: !317)
!315 = distinct !DILexicalBlock(scope: !316, file: !2, line: 2512, column: 13)
!316 = distinct !DILexicalBlock(scope: !312, file: !2, line: 2511, column: 15)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !319, line: 56, baseType: !320)
!319 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !319, line: 54, flags: DIFlagFwdDecl)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2410, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 25)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2425, type: !83, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2440, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 15)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2458, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 16)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2525, type: !39, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "forever", scope: !113, file: !2, line: 187, type: !191, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "monitor_output", scope: !113, file: !2, line: 190, type: !191, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "from_start", scope: !113, file: !2, line: 193, type: !191, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "print_headers", scope: !113, file: !2, line: 196, type: !191, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !113, file: !2, line: 226, type: !191, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !113, file: !2, line: 234, type: !191, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !174, line: 729, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 56)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !174, line: 736, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 75)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !364, file: !174, line: 575, type: !175, isLocal: true, isDefinition: true)
!364 = distinct !DISubprogram(name: "oputs_", scope: !174, file: !174, line: 573, type: !365, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !367)
!365 = !DISubroutineType(cc: DW_CC_nocall, types: !366)
!366 = !{null, !188, !188}
!367 = !{!368, !369, !370, !373, !374, !375, !376, !380, !381, !382, !383, !385, !435, !436, !437, !439, !440}
!368 = !DILocalVariable(name: "program", arg: 1, scope: !364, file: !174, line: 573, type: !188)
!369 = !DILocalVariable(name: "option", arg: 2, scope: !364, file: !174, line: 573, type: !188)
!370 = !DILocalVariable(name: "term", scope: !371, file: !174, line: 585, type: !188)
!371 = distinct !DILexicalBlock(scope: !372, file: !174, line: 582, column: 5)
!372 = distinct !DILexicalBlock(scope: !364, file: !174, line: 581, column: 7)
!373 = !DILocalVariable(name: "double_space", scope: !364, file: !174, line: 594, type: !191)
!374 = !DILocalVariable(name: "first_word", scope: !364, file: !174, line: 595, type: !188)
!375 = !DILocalVariable(name: "option_text", scope: !364, file: !174, line: 596, type: !188)
!376 = !DILocalVariable(name: "s", scope: !377, file: !174, line: 608, type: !188)
!377 = distinct !DILexicalBlock(scope: !378, file: !174, line: 605, column: 5)
!378 = distinct !DILexicalBlock(scope: !379, file: !174, line: 604, column: 12)
!379 = distinct !DILexicalBlock(scope: !364, file: !174, line: 597, column: 7)
!380 = !DILocalVariable(name: "spaces", scope: !377, file: !174, line: 609, type: !185)
!381 = !DILocalVariable(name: "anchor_len", scope: !364, file: !174, line: 620, type: !185)
!382 = !DILocalVariable(name: "desc_text", scope: !364, file: !174, line: 625, type: !188)
!383 = !DILocalVariable(name: "__ptr", scope: !384, file: !174, line: 644, type: !188)
!384 = distinct !DILexicalBlock(scope: !364, file: !174, line: 644, column: 3)
!385 = !DILocalVariable(name: "__stream", scope: !384, file: !174, line: 644, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !388, line: 7, baseType: !389)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !390, line: 49, size: 1728, elements: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407, !409, !410, !411, !412, !413, !415, !416, !419, !421, !424, !427, !428, !429, !430, !431}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !389, file: !390, line: 51, baseType: !175, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !389, file: !390, line: 54, baseType: !200, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !389, file: !390, line: 55, baseType: !200, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !389, file: !390, line: 56, baseType: !200, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !389, file: !390, line: 57, baseType: !200, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !389, file: !390, line: 58, baseType: !200, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !389, file: !390, line: 59, baseType: !200, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !389, file: !390, line: 60, baseType: !200, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !389, file: !390, line: 61, baseType: !200, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !389, file: !390, line: 64, baseType: !200, size: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !389, file: !390, line: 65, baseType: !200, size: 64, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !389, file: !390, line: 66, baseType: !200, size: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !389, file: !390, line: 68, baseType: !405, size: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !390, line: 36, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !389, file: !390, line: 70, baseType: !408, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !389, file: !390, line: 72, baseType: !175, size: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !389, file: !390, line: 73, baseType: !175, size: 32, offset: 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !389, file: !390, line: 74, baseType: !203, size: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !389, file: !390, line: 77, baseType: !184, size: 16, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !389, file: !390, line: 78, baseType: !414, size: 8, offset: 1040)
!414 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !389, file: !390, line: 79, baseType: !98, size: 8, offset: 1048)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !389, file: !390, line: 81, baseType: !417, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !390, line: 43, baseType: null)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !389, file: !390, line: 89, baseType: !420, size: 64, offset: 1152)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !199, line: 153, baseType: !192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !389, file: !390, line: 91, baseType: !422, size: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !390, line: 37, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !389, file: !390, line: 92, baseType: !425, size: 64, offset: 1280)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !390, line: 38, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !389, file: !390, line: 93, baseType: !408, size: 64, offset: 1344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !389, file: !390, line: 94, baseType: !193, size: 64, offset: 1408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !389, file: !390, line: 95, baseType: !185, size: 64, offset: 1472)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !389, file: !390, line: 96, baseType: !175, size: 32, offset: 1536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !389, file: !390, line: 98, baseType: !432, size: 160, offset: 1568)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 20)
!435 = !DILocalVariable(name: "__cnt", scope: !384, file: !174, line: 644, type: !185)
!436 = !DILocalVariable(name: "url_program", scope: !364, file: !174, line: 648, type: !188)
!437 = !DILocalVariable(name: "__ptr", scope: !438, file: !174, line: 686, type: !188)
!438 = distinct !DILexicalBlock(scope: !364, file: !174, line: 686, column: 3)
!439 = !DILocalVariable(name: "__stream", scope: !438, file: !174, line: 686, type: !386)
!440 = !DILocalVariable(name: "__cnt", scope: !438, file: !174, line: 686, type: !185)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !174, line: 585, type: !19, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !174, line: 586, type: !19, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !174, line: 595, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 4)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !174, line: 620, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 6)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !174, line: 648, type: !207, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !174, line: 648, type: !19, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !174, line: 649, type: !447, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !174, line: 649, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !301)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !174, line: 650, type: !19, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !174, line: 651, type: !452, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !174, line: 651, type: !452, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !174, line: 652, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 7)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !174, line: 653, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 8)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !174, line: 654, type: !103, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !174, line: 655, type: !103, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !174, line: 656, type: !103, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !174, line: 657, type: !103, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !174, line: 663, type: !472, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !174, line: 664, type: !103, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !174, line: 669, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 17)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !174, line: 669, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 40)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !174, line: 676, type: !330, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !174, line: 676, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 61)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !174, line: 679, type: !463, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !174, line: 683, type: !19, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !174, line: 688, type: !19, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !174, line: 691, type: !477, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !174, line: 839, type: !335, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !174, line: 840, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 22)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !174, line: 841, type: !330, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !174, line: 862, type: !447, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !174, line: 868, type: !29, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !174, line: 875, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 27)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !174, line: 877, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 51)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !174, line: 877, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 12)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2110, type: !463, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "count_lines", scope: !113, file: !2, line: 180, type: !191, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2183, type: !521, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2203, type: !330, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2205, type: !108, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2206, type: !108, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2216, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 9)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2228, type: !354, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2246, type: !542, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2263, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 30)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 14)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 11)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !335, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !494, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 13)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2283, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 37)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2295, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 64)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2299, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 53)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2304, type: !537, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2304, type: !83, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 254, type: !452, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 255, type: !452, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !472, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 257, type: !452, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !432, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 260, type: !494, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !447, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !432, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !452, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !452, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 267, type: !472, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !330, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !477, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !335, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !19, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !477, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "long_options", scope: !113, file: !2, line: 252, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 4352, elements: !495)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !646, line: 50, size: 256, elements: !647)
!646 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!647 = !{!648, !649, !650, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !645, file: !646, line: 52, baseType: !188, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !645, file: !646, line: 55, baseType: !175, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !645, file: !646, line: 56, baseType: !651, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !645, file: !646, line: 57, baseType: !175, size: 32, offset: 192)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !113, file: !2, line: 176, type: !191, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !113, file: !2, line: 113, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 64, elements: !208)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !578, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !19, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !113, file: !2, line: 108, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 192, elements: !301)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !113, file: !2, line: 213, type: !222, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "debug", scope: !113, file: !2, line: 237, type: !191, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "pids_alloc", scope: !113, file: !2, line: 220, type: !261, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "pids", scope: !113, file: !2, line: 219, type: !675, isLocal: true, isDefinition: true)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !113, file: !2, line: 231, type: !191, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "line_end", scope: !113, file: !2, line: 199, type: !4, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "follow_mode", scope: !113, file: !2, line: 184, type: !124, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "nbpids", scope: !113, file: !2, line: 218, type: !175, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2026, type: !532, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2041, type: !335, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2055, type: !39, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2055, type: !323, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2080, type: !494, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "first_file", scope: !696, file: !2, line: 462, type: !191, isLocal: true, isDefinition: true)
!696 = distinct !DISubprogram(name: "write_header", scope: !2, file: !2, line: 460, type: !697, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !188}
!699 = !{!700}
!700 = !DILocalVariable(name: "prettyname", arg: 1, scope: !696, file: !2, line: 460, type: !188)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !573, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !207, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !494, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 43)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !578, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 640, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 80)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !2, line: 418, type: !568, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !3, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !709, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "whence_msgid", scope: !727, file: !2, line: 417, type: !737, isLocal: true, isDefinition: true)
!727 = distinct !DISubprogram(name: "xlseek", scope: !2, file: !2, line: 410, type: !728, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !730)
!728 = !DISubroutineType(types: !729)
!729 = !{!201, !175, !201, !175, !188}
!730 = !{!731, !732, !733, !734, !735, !736}
!731 = !DILocalVariable(name: "fd", arg: 1, scope: !727, file: !2, line: 410, type: !175)
!732 = !DILocalVariable(name: "offset", arg: 2, scope: !727, file: !2, line: 410, type: !201)
!733 = !DILocalVariable(name: "whence", arg: 3, scope: !727, file: !2, line: 410, type: !175)
!734 = !DILocalVariable(name: "prettyname", arg: 4, scope: !727, file: !2, line: 410, type: !188)
!735 = !DILocalVariable(name: "new_offset", scope: !727, file: !2, line: 412, type: !201)
!736 = !DILocalVariable(name: "joffset", scope: !727, file: !2, line: 422, type: !223)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 192, elements: !301)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 19)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 970, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 54)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !174, line: 952, type: !542, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1539, type: !207, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1549, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 36)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1552, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 28)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1573, type: !335, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1617, type: !335, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1629, type: !463, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1629, type: !108, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1650, type: !740, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1690, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 44)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1710, type: !759, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1727, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 46)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !432, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !788, isLocal: true, isDefinition: true)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 320, elements: !500)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1009, type: !745, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1023, type: !532, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1039, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 47)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1046, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 52)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1068, type: !103, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1069, type: !323, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1080, type: !592, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1090, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 42)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1457, type: !740, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "debugged", scope: !818, file: !2, line: 1178, type: !191, isLocal: true, isDefinition: true)
!818 = distinct !DISubprogram(name: "tail_forever", scope: !2, file: !2, line: 1174, type: !819, scopeLine: 1175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !229, !175, !267}
!821 = !{!822, !823, !824, !825, !826, !828, !829, !831, !834, !835, !836, !837, !840, !841, !842, !843}
!822 = !DILocalVariable(name: "f", arg: 1, scope: !818, file: !2, line: 1174, type: !229)
!823 = !DILocalVariable(name: "n_files", arg: 2, scope: !818, file: !2, line: 1174, type: !175)
!824 = !DILocalVariable(name: "sleep_interval", arg: 3, scope: !818, file: !2, line: 1174, type: !267)
!825 = !DILocalVariable(name: "last", scope: !818, file: !2, line: 1176, type: !175)
!826 = !DILocalVariable(name: "blocking", scope: !827, file: !2, line: 1183, type: !191)
!827 = distinct !DILexicalBlock(scope: !818, file: !2, line: 1181, column: 5)
!828 = !DILocalVariable(name: "any_input", scope: !827, file: !2, line: 1194, type: !191)
!829 = !DILocalVariable(name: "i", scope: !830, file: !2, line: 1196, type: !175)
!830 = distinct !DILexicalBlock(scope: !827, file: !2, line: 1196, column: 7)
!831 = !DILocalVariable(name: "stats", scope: !832, file: !2, line: 1198, type: !277)
!832 = distinct !DILexicalBlock(scope: !833, file: !2, line: 1197, column: 9)
!833 = distinct !DILexicalBlock(scope: !830, file: !2, line: 1196, column: 7)
!834 = !DILocalVariable(name: "fd", scope: !832, file: !2, line: 1203, type: !175)
!835 = !DILocalVariable(name: "prettyname", scope: !832, file: !2, line: 1210, type: !188)
!836 = !DILocalVariable(name: "mode", scope: !832, file: !2, line: 1211, type: !249)
!837 = !DILocalVariable(name: "old_flags", scope: !838, file: !2, line: 1215, type: !175)
!838 = distinct !DILexicalBlock(scope: !839, file: !2, line: 1214, column: 13)
!839 = distinct !DILexicalBlock(scope: !832, file: !2, line: 1213, column: 15)
!840 = !DILocalVariable(name: "new_flags", scope: !838, file: !2, line: 1216, type: !175)
!841 = !DILocalVariable(name: "read_unchanged", scope: !832, file: !2, line: 1236, type: !191)
!842 = !DILocalVariable(name: "bytes_to_read", scope: !832, file: !2, line: 1301, type: !222)
!843 = !DILocalVariable(name: "nr", scope: !832, file: !2, line: 1309, type: !222)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1189, type: !432, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1189, type: !740, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1228, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 35)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1266, type: !573, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1266, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 408, elements: !538)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1345, type: !532, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!861 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!862 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!863 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!864 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!865 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!866 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!867 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!868 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !871, line: 64, type: !872, isLocal: true, isDefinition: true)
!871 = !DIFile(filename: "src/iopoll.c", directory: "/src", checksumkind: CSK_MD5, checksum: "994e71aa1d7ebbae5028422474ffd3c4")
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 26)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !871, line: 64, type: !587, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !871, line: 64, type: !879, isLocal: true, isDefinition: true)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 352, elements: !775)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !871, line: 88, type: !477, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !884, line: 3, type: !330, isLocal: true, isDefinition: true)
!884 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "Version", scope: !887, file: !884, line: 3, type: !188, isLocal: false, isDefinition: true)
!887 = distinct !DICompileUnit(language: DW_LANG_C11, file: !884, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !888, splitDebugInlining: false, nameTableKind: None)
!888 = !{!882, !885}
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !891, file: !892, line: 65, type: !914, isLocal: false, isDefinition: true)
!891 = distinct !DICompileUnit(language: DW_LANG_C11, file: !892, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !893, retainedTypes: !894, globals: !895, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!893 = !{!128}
!894 = !{!193, !188, !190}
!895 = !{!889, !896, !898, !900, !905, !910, !912}
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !892, line: 141, type: !472, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !892, line: 141, type: !532, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !892, line: 142, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 29)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !892, line: 160, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 21)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !892, line: 165, type: !477, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !892, line: 170, type: !19, isLocal: true, isDefinition: true)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !915, line: 69, baseType: !916)
!915 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null}
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "file_name", scope: !921, file: !922, line: 45, type: !188, isLocal: true, isDefinition: true)
!921 = distinct !DICompileUnit(language: DW_LANG_C11, file: !922, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !923, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!923 = !{!924, !926, !928, !930, !919, !932}
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !922, line: 121, type: !472, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !922, line: 121, type: !542, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !922, line: 123, type: !472, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !922, line: 126, type: !463, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !921, file: !922, line: 55, type: !191, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !936, file: !937, line: 66, type: !916, isLocal: false, isDefinition: true)
!936 = distinct !DICompileUnit(language: DW_LANG_C11, file: !937, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !938, globals: !939, splitDebugInlining: false, nameTableKind: None)
!937 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!938 = !{!193, !190}
!939 = !{!940, !942, !962, !964, !966, !968, !934, !970, !972, !974, !976, !978}
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !937, line: 272, type: !19, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "old_file_name", scope: !944, file: !937, line: 304, type: !188, isLocal: true, isDefinition: true)
!944 = distinct !DISubprogram(name: "verror_at_line", scope: !937, file: !937, line: 298, type: !945, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !936, retainedNodes: !955)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !175, !175, !188, !116, !188, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !949)
!949 = !{!950, !952, !953, !954}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !948, file: !951, baseType: !116, size: 32)
!951 = !DIFile(filename: "lib/error.c", directory: "/src")
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !948, file: !951, baseType: !116, size: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !948, file: !951, baseType: !193, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !948, file: !951, baseType: !193, size: 64, offset: 128)
!955 = !{!956, !957, !958, !959, !960, !961}
!956 = !DILocalVariable(name: "status", arg: 1, scope: !944, file: !937, line: 298, type: !175)
!957 = !DILocalVariable(name: "errnum", arg: 2, scope: !944, file: !937, line: 298, type: !175)
!958 = !DILocalVariable(name: "file_name", arg: 3, scope: !944, file: !937, line: 298, type: !188)
!959 = !DILocalVariable(name: "line_number", arg: 4, scope: !944, file: !937, line: 298, type: !116)
!960 = !DILocalVariable(name: "message", arg: 5, scope: !944, file: !937, line: 298, type: !188)
!961 = !DILocalVariable(name: "args", arg: 6, scope: !944, file: !937, line: 298, type: !947)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "old_line_number", scope: !944, file: !937, line: 305, type: !116, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !937, line: 338, type: !447, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !937, line: 346, type: !477, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !937, line: 346, type: !207, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "error_message_count", scope: !936, file: !937, line: 69, type: !116, isLocal: false, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !936, file: !937, line: 295, type: !175, isLocal: false, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !937, line: 208, type: !472, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !937, line: 208, type: !907, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !937, line: 214, type: !19, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !982, file: !983, line: 506, type: !175, isLocal: true, isDefinition: true)
!982 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !983, file: !983, line: 485, type: !984, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !986, retainedNodes: !988)
!983 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!984 = !DISubroutineType(types: !985)
!985 = !{!175, !175, !175}
!986 = distinct !DICompileUnit(language: DW_LANG_C11, file: !983, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !987, splitDebugInlining: false, nameTableKind: None)
!987 = !{!980}
!988 = !{!989, !990, !991, !992, !995}
!989 = !DILocalVariable(name: "fd", arg: 1, scope: !982, file: !983, line: 485, type: !175)
!990 = !DILocalVariable(name: "target", arg: 2, scope: !982, file: !983, line: 485, type: !175)
!991 = !DILocalVariable(name: "result", scope: !982, file: !983, line: 487, type: !175)
!992 = !DILocalVariable(name: "flags", scope: !993, file: !983, line: 530, type: !175)
!993 = distinct !DILexicalBlock(scope: !994, file: !983, line: 529, column: 5)
!994 = distinct !DILexicalBlock(scope: !982, file: !983, line: 528, column: 7)
!995 = !DILocalVariable(name: "saved_errno", scope: !996, file: !983, line: 533, type: !175)
!996 = distinct !DILexicalBlock(scope: !997, file: !983, line: 532, column: 9)
!997 = distinct !DILexicalBlock(scope: !993, file: !983, line: 531, column: 11)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 226, type: !108, isLocal: true, isDefinition: true)
!1000 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 227, type: !108, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 228, type: !9, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 231, type: !108, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1009, file: !1000, line: 134, type: !1013, isLocal: true, isDefinition: true)
!1009 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1000, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1010, globals: !1012, splitDebugInlining: false, nameTableKind: None)
!1010 = !{!187, !193, !1011, !185}
!1011 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1012 = !{!998, !1001, !1003, !1005, !1007}
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !319, line: 52, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !319, line: 40, size: 160, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1015, file: !319, line: 45, baseType: !1011, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1015, file: !319, line: 46, baseType: !1011, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1015, file: !319, line: 47, baseType: !1011, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1015, file: !319, line: 48, baseType: !1011, size: 32, offset: 96)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1015, file: !319, line: 49, baseType: !191, size: 8, offset: 128)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !1024, line: 43, type: !335, isLocal: true, isDefinition: true)
!1024 = !DIFile(filename: "lib/posixver.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b586c85144b881c520e7e1ef1553b215")
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "program_name", scope: !1027, file: !1028, line: 31, type: !188, isLocal: false, isDefinition: true)
!1027 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1028, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1029, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!1028 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1029 = !{!200}
!1030 = !{!1025, !1031, !1033}
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 46, type: !477, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 49, type: !447, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1037, file: !1038, line: 46, type: !1065, isLocal: true, isDefinition: true)
!1037 = distinct !DISubprogram(name: "proper_name_lite", scope: !1038, file: !1038, line: 38, type: !1039, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1041, retainedNodes: !1043)
!1038 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!188, !188, !188}
!1041 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1038, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1042, splitDebugInlining: false, nameTableKind: None)
!1042 = !{!1035}
!1043 = !{!1044, !1045, !1046, !1047, !1052}
!1044 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1037, file: !1038, line: 38, type: !188)
!1045 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1037, file: !1038, line: 38, type: !188)
!1046 = !DILocalVariable(name: "translation", scope: !1037, file: !1038, line: 40, type: !188)
!1047 = !DILocalVariable(name: "w", scope: !1037, file: !1038, line: 47, type: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1049, line: 37, baseType: !1050)
!1049 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !199, line: 57, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !199, line: 42, baseType: !116)
!1052 = !DILocalVariable(name: "mbs", scope: !1037, file: !1038, line: 48, type: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1054, line: 6, baseType: !1055)
!1054 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1056, line: 21, baseType: !1057)
!1056 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1056, line: 13, size: 64, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1057, file: !1056, line: 15, baseType: !175, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1057, file: !1056, line: 20, baseType: !1061, size: 32, offset: 32)
!1061 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1057, file: !1056, line: 16, size: 32, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1061, file: !1056, line: 18, baseType: !116, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1061, file: !1056, line: 19, baseType: !447, size: 32)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 16, elements: !208)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 78, type: !477, isLocal: true, isDefinition: true)
!1068 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 79, type: !452, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 80, type: !587, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 81, type: !587, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 82, type: !432, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 83, type: !207, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 84, type: !477, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 85, type: !472, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 86, type: !472, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 87, type: !477, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1089, file: !1068, line: 76, type: !1161, isLocal: false, isDefinition: true)
!1089 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1068, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1090, retainedTypes: !1096, globals: !1097, splitDebugInlining: false, nameTableKind: None)
!1090 = !{!128, !1091, !142}
!1091 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !129, line: 254, baseType: !116, size: 32, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1094 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1095 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1096 = !{!175, !184, !185}
!1097 = !{!1066, !1069, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1098, !1102, !1112, !1114, !1119, !1121, !1123, !1125, !1127, !1150, !1157, !1159}
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1089, file: !1068, line: 92, type: !1100, isLocal: false, isDefinition: true)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 320, elements: !104)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1089, file: !1068, line: 1040, type: !1104, isLocal: false, isDefinition: true)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1068, line: 56, size: 448, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1110, !1111}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1104, file: !1068, line: 59, baseType: !128, size: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !1068, line: 62, baseType: !175, size: 32, offset: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1104, file: !1068, line: 66, baseType: !1109, size: 256, offset: 64)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, elements: !478)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1104, file: !1068, line: 69, baseType: !188, size: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1104, file: !1068, line: 72, baseType: !188, size: 64, offset: 384)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1089, file: !1068, line: 107, type: !1104, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(name: "slot0", scope: !1089, file: !1068, line: 831, type: !1116, isLocal: true, isDefinition: true)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 256)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 321, type: !207, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 357, type: !207, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 358, type: !207, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !1068, line: 199, type: !472, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "quote", scope: !1129, file: !1068, line: 228, type: !1148, isLocal: true, isDefinition: true)
!1129 = distinct !DISubprogram(name: "gettext_quote", scope: !1068, file: !1068, line: 197, type: !1130, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1089, retainedNodes: !1132)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!188, !188, !128}
!1132 = !{!1133, !1134, !1135, !1136, !1137}
!1133 = !DILocalVariable(name: "msgid", arg: 1, scope: !1129, file: !1068, line: 197, type: !188)
!1134 = !DILocalVariable(name: "s", arg: 2, scope: !1129, file: !1068, line: 197, type: !128)
!1135 = !DILocalVariable(name: "translation", scope: !1129, file: !1068, line: 199, type: !188)
!1136 = !DILocalVariable(name: "w", scope: !1129, file: !1068, line: 229, type: !1048)
!1137 = !DILocalVariable(name: "mbs", scope: !1129, file: !1068, line: 230, type: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1054, line: 6, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1056, line: 21, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1056, line: 13, size: 64, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1140, file: !1056, line: 15, baseType: !175, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1140, file: !1056, line: 20, baseType: !1144, size: 32, offset: 32)
!1144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1140, file: !1056, line: 16, size: 32, elements: !1145)
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1144, file: !1056, line: 18, baseType: !116, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1144, file: !1056, line: 19, baseType: !447, size: 32)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !1149)
!1149 = !{!209, !449}
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "slotvec", scope: !1089, file: !1068, line: 834, type: !1152, isLocal: true, isDefinition: true)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1068, line: 823, size: 128, elements: !1154)
!1154 = !{!1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !1068, line: 825, baseType: !185, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1153, file: !1068, line: 826, baseType: !200, size: 64, offset: 64)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(name: "nslots", scope: !1089, file: !1068, line: 832, type: !175, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1089, file: !1068, line: 833, type: !1153, isLocal: true, isDefinition: true)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 704, elements: !579)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 67, type: !542, isLocal: true, isDefinition: true)
!1164 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 69, type: !472, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 83, type: !472, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 83, type: !447, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 85, type: !207, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 88, type: !1175, isLocal: true, isDefinition: true)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1176)
!1176 = !{!1177}
!1177 = !DISubrange(count: 171)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 88, type: !1180, isLocal: true, isDefinition: true)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 34)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 105, type: !335, isLocal: true, isDefinition: true)
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 109, type: !1187, isLocal: true, isDefinition: true)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1188)
!1188 = !{!1189}
!1189 = !DISubrange(count: 23)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 113, type: !759, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 120, type: !1194, isLocal: true, isDefinition: true)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 32)
!1197 = !DIGlobalVariableExpression(var: !1198, expr: !DIExpression())
!1198 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 127, type: !754, isLocal: true, isDefinition: true)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 134, type: !499, isLocal: true, isDefinition: true)
!1201 = !DIGlobalVariableExpression(var: !1202, expr: !DIExpression())
!1202 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 142, type: !774, isLocal: true, isDefinition: true)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 150, type: !1205, isLocal: true, isDefinition: true)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1206)
!1206 = !{!1207}
!1207 = !DISubrange(count: 48)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 159, type: !800, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 170, type: !1212, isLocal: true, isDefinition: true)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1213)
!1213 = !{!1214}
!1214 = !DISubrange(count: 60)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 248, type: !432, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 248, type: !521, isLocal: true, isDefinition: true)
!1219 = !DIGlobalVariableExpression(var: !1220, expr: !DIExpression())
!1220 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 254, type: !432, isLocal: true, isDefinition: true)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 254, type: !573, isLocal: true, isDefinition: true)
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 254, type: !499, isLocal: true, isDefinition: true)
!1225 = !DIGlobalVariableExpression(var: !1226, expr: !DIExpression())
!1226 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 259, type: !3, isLocal: true, isDefinition: true)
!1227 = !DIGlobalVariableExpression(var: !1228, expr: !DIExpression())
!1228 = distinct !DIGlobalVariable(scope: null, file: !1164, line: 259, type: !902, isLocal: true, isDefinition: true)
!1229 = !DIGlobalVariableExpression(var: !1230, expr: !DIExpression())
!1230 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1231, file: !1232, line: 26, type: !1234, isLocal: false, isDefinition: true)
