; ModuleID = 'src/timeout.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.numname = type { i32, [8 x i8] }
%struct.__mbstate_t = type { i32, %union.anon.0 }
%union.anon.0 = type { i32 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, ptr }
%union.anon = type { ptr }
%struct.__sigset_t = type { [16 x i64] }
%struct.itimerspec = type { %struct.timespec, %struct.timespec }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s [OPTION]... DURATION COMMAND [ARG]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [61 x i8] c"Start COMMAND, and kill it if still running after DURATION.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"timeout\00", align 1, !dbg !17

!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !2, line: 664, type: !157, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !2, line: 682, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 33)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "timed_out", scope: !94, file: !2, line: 88, type: !105, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "monitored_pid", scope: !94, file: !2, line: 90, type: !181, isLocal: true, isDefinition: true)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !182, line: 97, baseType: !183)
!182 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !184, line: 154, baseType: !105)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "kill_after", scope: !94, file: !2, line: 91, type: !187, isLocal: true, isDefinition: true)
!187 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "foreground", scope: !94, file: !2, line: 92, type: !190, isLocal: true, isDefinition: true)
!190 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "preserve_status", scope: !94, file: !2, line: 93, type: !190, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "verbose", scope: !94, file: !2, line: 94, type: !190, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "command", scope: !94, file: !2, line: 95, type: !137, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !97, line: 736, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 75)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !204, file: !97, line: 575, type: !105, isLocal: true, isDefinition: true)
!204 = distinct !DISubprogram(name: "oputs_", scope: !97, file: !97, line: 573, type: !205, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !207)
!205 = !DISubroutineType(cc: DW_CC_nocall, types: !206)
!206 = !{null, !137, !137}
!207 = !{!208, !209, !210, !213, !214, !215, !216, !220, !221, !222, !223, !225, !276, !277, !278, !280, !281}
!208 = !DILocalVariable(name: "program", arg: 1, scope: !204, file: !97, line: 573, type: !137)
!209 = !DILocalVariable(name: "option", arg: 2, scope: !204, file: !97, line: 573, type: !137)
!210 = !DILocalVariable(name: "term", scope: !211, file: !97, line: 585, type: !137)
!211 = distinct !DILexicalBlock(scope: !212, file: !97, line: 582, column: 5)
!212 = distinct !DILexicalBlock(scope: !204, file: !97, line: 581, column: 7)
!213 = !DILocalVariable(name: "double_space", scope: !204, file: !97, line: 594, type: !190)
!214 = !DILocalVariable(name: "first_word", scope: !204, file: !97, line: 595, type: !137)
!215 = !DILocalVariable(name: "option_text", scope: !204, file: !97, line: 596, type: !137)
!216 = !DILocalVariable(name: "s", scope: !217, file: !97, line: 608, type: !137)
!217 = distinct !DILexicalBlock(scope: !218, file: !97, line: 605, column: 5)
!218 = distinct !DILexicalBlock(scope: !219, file: !97, line: 604, column: 12)
!219 = distinct !DILexicalBlock(scope: !204, file: !97, line: 597, column: 7)
!220 = !DILocalVariable(name: "spaces", scope: !217, file: !97, line: 609, type: !134)
!221 = !DILocalVariable(name: "anchor_len", scope: !204, file: !97, line: 620, type: !134)
!222 = !DILocalVariable(name: "desc_text", scope: !204, file: !97, line: 625, type: !137)
!223 = !DILocalVariable(name: "__ptr", scope: !224, file: !97, line: 644, type: !137)
!224 = distinct !DILexicalBlock(scope: !204, file: !97, line: 644, column: 3)
!225 = !DILocalVariable(name: "__stream", scope: !224, file: !97, line: 644, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !228, line: 7, baseType: !229)
!228 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !230, line: 49, size: 1728, elements: !231)
!230 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !249, !250, !251, !254, !255, !256, !257, !260, !262, !265, !268, !269, !270, !271, !272}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !229, file: !230, line: 51, baseType: !105, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !229, file: !230, line: 54, baseType: !125, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !229, file: !230, line: 55, baseType: !125, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !229, file: !230, line: 56, baseType: !125, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !229, file: !230, line: 57, baseType: !125, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !229, file: !230, line: 58, baseType: !125, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !229, file: !230, line: 59, baseType: !125, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !229, file: !230, line: 60, baseType: !125, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !229, file: !230, line: 61, baseType: !125, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !229, file: !230, line: 64, baseType: !125, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !229, file: !230, line: 65, baseType: !125, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !229, file: !230, line: 66, baseType: !125, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !229, file: !230, line: 68, baseType: !245, size: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !230, line: 36, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !229, file: !230, line: 70, baseType: !248, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !229, file: !230, line: 72, baseType: !105, size: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !229, file: !230, line: 73, baseType: !105, size: 32, offset: 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !229, file: !230, line: 74, baseType: !252, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !184, line: 152, baseType: !253)
!253 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !229, file: !230, line: 77, baseType: !133, size: 16, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !229, file: !230, line: 78, baseType: !132, size: 8, offset: 1040)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !229, file: !230, line: 79, baseType: !74, size: 8, offset: 1048)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !229, file: !230, line: 81, baseType: !258, size: 64, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !230, line: 43, baseType: null)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !229, file: !230, line: 89, baseType: !261, size: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !184, line: 153, baseType: !253)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !229, file: !230, line: 91, baseType: !263, size: 64, offset: 1216)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !230, line: 37, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !229, file: !230, line: 92, baseType: !266, size: 64, offset: 1280)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !230, line: 38, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !229, file: !230, line: 93, baseType: !248, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !229, file: !230, line: 94, baseType: !126, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !229, file: !230, line: 95, baseType: !134, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !229, file: !230, line: 96, baseType: !105, size: 32, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !229, file: !230, line: 98, baseType: !273, size: 160, offset: 1568)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 20)
!276 = !DILocalVariable(name: "__cnt", scope: !224, file: !97, line: 644, type: !134)
!277 = !DILocalVariable(name: "url_program", scope: !204, file: !97, line: 648, type: !137)
!278 = !DILocalVariable(name: "__ptr", scope: !279, file: !97, line: 686, type: !137)
!279 = distinct !DILexicalBlock(scope: !204, file: !97, line: 686, column: 3)
!280 = !DILocalVariable(name: "__stream", scope: !279, file: !97, line: 686, type: !226)
!281 = !DILocalVariable(name: "__cnt", scope: !279, file: !97, line: 686, type: !134)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !97, line: 585, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 5)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !97, line: 586, type: !284, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !97, line: 595, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 4)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !97, line: 620, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 6)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !97, line: 648, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 2)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !97, line: 648, type: !284, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !97, line: 649, type: !291, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !97, line: 649, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 3)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !97, line: 650, type: !284, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !97, line: 651, type: !296, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !97, line: 651, type: !296, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !97, line: 652, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 7)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !97, line: 653, type: !19, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !97, line: 654, type: !79, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !97, line: 655, type: !79, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !97, line: 656, type: !79, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !97, line: 657, type: !79, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !97, line: 663, type: !321, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !97, line: 664, type: !79, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !97, line: 669, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 17)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !97, line: 669, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 40)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !97, line: 676, type: !150, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !97, line: 676, type: !14, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !97, line: 679, type: !310, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !97, line: 683, type: !284, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !97, line: 688, type: !284, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !97, line: 691, type: !19, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !97, line: 839, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 16)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !97, line: 840, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 22)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !97, line: 841, type: !150, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !97, line: 862, type: !291, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !97, line: 868, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 71)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !97, line: 875, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 27)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !97, line: 877, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 51)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !97, line: 877, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 12)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 11)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !2, line: 100, type: !396, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !362, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !321, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !19, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !284, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !19, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !162, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "term_signal", scope: !94, file: !2, line: 89, type: !105, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !310, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 32)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "term_sig", scope: !94, file: !424, line: 6, type: !425, isLocal: true, isDefinition: true)
!424 = !DIFile(filename: "src/term-sig.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d5de988e1d621d74adbec0ff67a5bdb7")
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 704, elements: !368)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 21)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 23)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !367, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 503, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 37)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 2048, elements: !20)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !447, line: 50, size: 256, elements: !448)
!447 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!448 = !{!449, !450, !451, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !446, file: !447, line: 52, baseType: !137, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !446, file: !447, line: 55, baseType: !105, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !446, file: !447, line: 56, baseType: !452, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !446, file: !447, line: 57, baseType: !105, size: 32, offset: 192)
!454 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!455 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!456 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!457 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !460, line: 72, type: !381, isLocal: true, isDefinition: true)
!460 = !DIFile(filename: "src/operand2sig.c", directory: "/src", checksumkind: CSK_MD5, checksum: "46beb430284fcb3f5c7434dd479a51b3")
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !460, line: 87, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 19)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !468, line: 3, type: !150, isLocal: true, isDefinition: true)
!468 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "Version", scope: !471, file: !468, line: 3, type: !137, isLocal: false, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C11, file: !468, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !472, splitDebugInlining: false, nameTableKind: None)
!472 = !{!466, !469}
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "file_name", scope: !475, file: !476, line: 45, type: !137, isLocal: true, isDefinition: true)
!475 = distinct !DICompileUnit(language: DW_LANG_C11, file: !476, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !477, splitDebugInlining: false, nameTableKind: None)
!476 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!477 = !{!478, !480, !482, !484, !473, !486}
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !476, line: 121, type: !321, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !476, line: 121, type: !391, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !476, line: 123, type: !321, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !476, line: 126, type: !310, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !475, file: !476, line: 55, type: !190, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !490, file: !491, line: 66, type: !534, isLocal: false, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C11, file: !491, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !492, globals: !493, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!492 = !{!126, !139}
!493 = !{!494, !496, !516, !518, !520, !522, !488, !524, !526, !528, !530, !532}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !491, line: 272, type: !284, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "old_file_name", scope: !498, file: !491, line: 304, type: !137, isLocal: true, isDefinition: true)
!498 = distinct !DISubprogram(name: "verror_at_line", scope: !491, file: !491, line: 298, type: !499, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !490, retainedNodes: !509)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !105, !105, !137, !98, !137, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !503)
!503 = !{!504, !506, !507, !508}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !502, file: !505, baseType: !98, size: 32)
!505 = !DIFile(filename: "lib/error.c", directory: "/src")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !502, file: !505, baseType: !98, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !502, file: !505, baseType: !126, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !502, file: !505, baseType: !126, size: 64, offset: 128)
!509 = !{!510, !511, !512, !513, !514, !515}
!510 = !DILocalVariable(name: "status", arg: 1, scope: !498, file: !491, line: 298, type: !105)
!511 = !DILocalVariable(name: "errnum", arg: 2, scope: !498, file: !491, line: 298, type: !105)
!512 = !DILocalVariable(name: "file_name", arg: 3, scope: !498, file: !491, line: 298, type: !137)
!513 = !DILocalVariable(name: "line_number", arg: 4, scope: !498, file: !491, line: 298, type: !98)
!514 = !DILocalVariable(name: "message", arg: 5, scope: !498, file: !491, line: 298, type: !137)
!515 = !DILocalVariable(name: "args", arg: 6, scope: !498, file: !491, line: 298, type: !501)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "old_line_number", scope: !498, file: !491, line: 305, type: !98, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !491, line: 338, type: !291, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !491, line: 346, type: !19, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !491, line: 346, type: !301, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "error_message_count", scope: !490, file: !491, line: 69, type: !98, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !490, file: !491, line: 295, type: !105, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !491, line: 208, type: !321, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !491, line: 208, type: !429, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !491, line: 214, type: !284, isLocal: true, isDefinition: true)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null}
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "program_name", scope: !539, file: !540, line: 31, type: !137, isLocal: false, isDefinition: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C11, file: !540, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !541, globals: !542, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!541 = !{!125}
!542 = !{!537, !543, !545}
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !540, line: 46, type: !19, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !540, line: 49, type: !291, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "utf07FF", scope: !549, file: !550, line: 46, type: !577, isLocal: true, isDefinition: true)
!549 = distinct !DISubprogram(name: "proper_name_lite", scope: !550, file: !550, line: 38, type: !551, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !553, retainedNodes: !555)
!550 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!551 = !DISubroutineType(types: !552)
!552 = !{!137, !137, !137}
!553 = distinct !DICompileUnit(language: DW_LANG_C11, file: !550, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !554, splitDebugInlining: false, nameTableKind: None)
!554 = !{!547}
!555 = !{!556, !557, !558, !559, !564}
!556 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !549, file: !550, line: 38, type: !137)
!557 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !549, file: !550, line: 38, type: !137)
!558 = !DILocalVariable(name: "translation", scope: !549, file: !550, line: 40, type: !137)
!559 = !DILocalVariable(name: "w", scope: !549, file: !550, line: 47, type: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !561, line: 37, baseType: !562)
!561 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !184, line: 57, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !184, line: 42, baseType: !98)
!564 = !DILocalVariable(name: "mbs", scope: !549, file: !550, line: 48, type: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !566, line: 6, baseType: !567)
!566 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !568, line: 21, baseType: !569)
!568 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 13, size: 64, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !569, file: !568, line: 15, baseType: !105, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !569, file: !568, line: 20, baseType: !573, size: 32, offset: 32)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !569, file: !568, line: 16, size: 32, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !573, file: !568, line: 18, baseType: !98, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !573, file: !568, line: 19, baseType: !291, size: 32)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 16, elements: !302)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !580, line: 78, type: !19, isLocal: true, isDefinition: true)
!580 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !580, line: 79, type: !296, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !580, line: 80, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 13)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !580, line: 81, type: !585, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !580, line: 82, type: !273, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !580, line: 83, type: !301, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !580, line: 84, type: !19, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !580, line: 85, type: !321, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !580, line: 86, type: !321, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !580, line: 87, type: !19, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !604, file: !580, line: 76, type: !690, isLocal: false, isDefinition: true)
!604 = distinct !DICompileUnit(language: DW_LANG_C11, file: !580, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !605, retainedTypes: !625, globals: !626, splitDebugInlining: false, nameTableKind: None)
!605 = !{!606, !620, !109}
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !607, line: 42, baseType: !98, size: 32, elements: !608)
!607 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!609 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!610 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!611 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!612 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!613 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!614 = !DIEnumerator(name: "c_quoting_style", value: 5)
!615 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!616 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!617 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!618 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!619 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !607, line: 254, baseType: !98, size: 32, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!623 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!624 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!625 = !{!105, !133, !134}
!626 = !{!578, !581, !583, !588, !590, !592, !594, !596, !598, !600, !602, !627, !631, !641, !643, !648, !650, !652, !654, !656, !679, !686, !688}
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !604, file: !580, line: 92, type: !629, isLocal: false, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 320, elements: !80)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !604, file: !580, line: 1040, type: !633, isLocal: false, isDefinition: true)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !580, line: 56, size: 448, elements: !634)
!634 = !{!635, !636, !637, !639, !640}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !633, file: !580, line: 59, baseType: !606, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !580, line: 62, baseType: !105, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !633, file: !580, line: 66, baseType: !638, size: 256, offset: 64)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !20)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !633, file: !580, line: 69, baseType: !137, size: 64, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !633, file: !580, line: 72, baseType: !137, size: 64, offset: 384)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !604, file: !580, line: 107, type: !633, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "slot0", scope: !604, file: !580, line: 831, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 256)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !580, line: 321, type: !301, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !580, line: 357, type: !301, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !580, line: 358, type: !301, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !580, line: 199, type: !321, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "quote", scope: !658, file: !580, line: 228, type: !677, isLocal: true, isDefinition: true)
!658 = distinct !DISubprogram(name: "gettext_quote", scope: !580, file: !580, line: 197, type: !659, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !604, retainedNodes: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{!137, !137, !606}
!661 = !{!662, !663, !664, !665, !666}
!662 = !DILocalVariable(name: "msgid", arg: 1, scope: !658, file: !580, line: 197, type: !137)
!663 = !DILocalVariable(name: "s", arg: 2, scope: !658, file: !580, line: 197, type: !606)
!664 = !DILocalVariable(name: "translation", scope: !658, file: !580, line: 199, type: !137)
!665 = !DILocalVariable(name: "w", scope: !658, file: !580, line: 229, type: !560)
!666 = !DILocalVariable(name: "mbs", scope: !658, file: !580, line: 230, type: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !566, line: 6, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !568, line: 21, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 13, size: 64, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !669, file: !568, line: 15, baseType: !105, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !669, file: !568, line: 20, baseType: !673, size: 32, offset: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !568, line: 16, size: 32, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !673, file: !568, line: 18, baseType: !98, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !673, file: !568, line: 19, baseType: !291, size: 32)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !678)
!678 = !{!303, !293}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "slotvec", scope: !604, file: !580, line: 834, type: !681, isLocal: true, isDefinition: true)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !580, line: 823, size: 128, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !682, file: !580, line: 825, baseType: !134, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !682, file: !580, line: 826, baseType: !125, size: 64, offset: 64)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "nslots", scope: !604, file: !580, line: 832, type: !105, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "slotvec0", scope: !604, file: !580, line: 833, type: !682, isLocal: true, isDefinition: true)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 704, elements: !397)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "numname_table", scope: !694, file: !695, line: 43, type: !704, isLocal: true, isDefinition: true)
!694 = distinct !DICompileUnit(language: DW_LANG_C11, file: !695, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !696, globals: !697, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "lib/sig2str.c", directory: "/src", checksumkind: CSK_MD5, checksum: "828136ef7ede39101f7053cda7cea598")
!696 = !{!98}
!697 = !{!698, !700, !702, !692}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !695, line: 351, type: !296, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !695, line: 356, type: !296, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !695, line: 362, type: !291, isLocal: true, isDefinition: true)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 3360, elements: !710)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !695, line: 43, size: 96, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !705, file: !695, line: 43, baseType: !105, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !695, line: 43, baseType: !709, size: 64, offset: 32)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !20)
!710 = !{!711}
!711 = !DISubrange(count: 35)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !714, line: 67, type: !391, isLocal: true, isDefinition: true)
!714 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !714, line: 69, type: !321, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !714, line: 83, type: !321, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !714, line: 83, type: !291, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !714, line: 85, type: !301, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !714, line: 88, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 171)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !714, line: 88, type: !157, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !714, line: 105, type: !362, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !714, line: 109, type: !434, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !714, line: 113, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 28)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !714, line: 120, type: !419, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !714, line: 127, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 36)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !714, line: 134, type: !345, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !714, line: 142, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 44)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !714, line: 150, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 48)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !714, line: 159, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 52)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !714, line: 170, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 60)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !714, line: 248, type: !273, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !714, line: 248, type: !367, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !714, line: 254, type: !273, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !714, line: 254, type: !143, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !714, line: 254, type: !345, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !714, line: 259, type: !3, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !714, line: 259, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 29)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !787, file: !788, line: 26, type: !790, isLocal: false, isDefinition: true)
!787 = distinct !DICompileUnit(language: DW_LANG_C11, file: !788, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !789, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!789 = !{!785}
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 376, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 47)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "exit_failure", scope: !795, file: !796, line: 24, type: !798, isLocal: false, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C11, file: !796, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !797, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!797 = !{!793}
!798 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !105)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !801, line: 34, type: !310, isLocal: true, isDefinition: true)
!801 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !801, line: 34, type: !321, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !801, line: 34, type: !340, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !808, file: !809, line: 58, type: !833, isLocal: true, isDefinition: true)
!808 = distinct !DICompileUnit(language: DW_LANG_C11, file: !809, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !810, globals: !830, splitDebugInlining: false, nameTableKind: None)
!809 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!810 = !{!125, !811}
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !812, line: 24, baseType: !813)
!812 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !814, line: 41, baseType: !815)
!814 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !814, line: 27, size: 1856, elements: !817)
!817 = !{!818, !822, !825, !827, !828}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !816, file: !814, line: 30, baseType: !819, size: 832)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 832, elements: !586)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !814, line: 30, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !816, file: !814, line: 33, baseType: !823, size: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !816, file: !814, line: 34, baseType: !826, size: 64, offset: 896)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !816, file: !814, line: 35, baseType: !826, size: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !816, file: !814, line: 38, baseType: !829, size: 832, offset: 1024)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 832, elements: !586)
!830 = !{!831, !806}
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !809, line: 66, type: !301, isLocal: true, isDefinition: true)
!833 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !811)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !836, line: 108, type: !74, isLocal: true, isDefinition: true)
!836 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "internal_state", scope: !839, file: !836, line: 97, type: !842, isLocal: true, isDefinition: true)
!839 = distinct !DICompileUnit(language: DW_LANG_C11, file: !836, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !840, globals: !841, splitDebugInlining: false, nameTableKind: None)
!840 = !{!126, !134, !139}
!841 = !{!834, !837}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !566, line: 6, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !568, line: 21, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 13, size: 64, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !844, file: !568, line: 15, baseType: !105, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !844, file: !568, line: 20, baseType: !848, size: 32, offset: 32)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !844, file: !568, line: 16, size: 32, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !848, file: !568, line: 18, baseType: !98, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !848, file: !568, line: 19, baseType: !291, size: 32)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !854, line: 35, type: !296, isLocal: true, isDefinition: true)
!854 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !460, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !856, splitDebugInlining: false, nameTableKind: None)
!856 = !{!458, !461}
!857 = distinct !DICompileUnit(language: DW_LANG_C11, file: !858, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/cl-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a67239aa557b1854772fcd1589240f00")
!859 = distinct !DICompileUnit(language: DW_LANG_C11, file: !860, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !861, retainedTypes: !866, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/dtotimespec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "863541a7a9cbed8b745823733251add6")
!861 = !{!862}
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !863, line: 44, baseType: !98, size: 32, elements: !864)
!863 = !DIFile(filename: "./lib/timespec.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2321879fdee55a014e00353b7423449")
!864 = !{!865}
!865 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000)
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !868, line: 10, baseType: !869)
!868 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !184, line: 160, baseType: !253)
!870 = distinct !DICompileUnit(language: DW_LANG_C11, file: !871, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!872 = distinct !DICompileUnit(language: DW_LANG_C11, file: !714, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !873, retainedTypes: !877, globals: !878, splitDebugInlining: false, nameTableKind: None)
!873 = !{!874}
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 40, baseType: !98, size: 32, elements: !875)
!875 = !{!876}
!876 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!877 = !{!126}
!878 = !{!712, !715, !717, !719, !721, !723, !728, !730, !732, !734, !739, !741, !746, !748, !753, !758, !763, !768, !770, !772, !774, !776, !778, !780}
!879 = distinct !DICompileUnit(language: DW_LANG_C11, file: !880, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !881, retainedTypes: !912, splitDebugInlining: false, nameTableKind: None)
!880 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!881 = !{!882, !894}
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !883, file: !880, line: 188, baseType: !98, size: 32, elements: !892)
!883 = distinct !DISubprogram(name: "x2nrealloc", scope: !880, file: !880, line: 176, type: !884, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !879, retainedNodes: !887)
!884 = !DISubroutineType(types: !885)
!885 = !{!126, !126, !886, !134}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!887 = !{!888, !889, !890, !891}
!888 = !DILocalVariable(name: "p", arg: 1, scope: !883, file: !880, line: 176, type: !126)
!889 = !DILocalVariable(name: "pn", arg: 2, scope: !883, file: !880, line: 176, type: !886)
!890 = !DILocalVariable(name: "s", arg: 3, scope: !883, file: !880, line: 176, type: !134)
!891 = !DILocalVariable(name: "n", scope: !883, file: !880, line: 178, type: !134)
!892 = !{!893}
!893 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !895, file: !880, line: 228, baseType: !98, size: 32, elements: !892)
!895 = distinct !DISubprogram(name: "xpalloc", scope: !880, file: !880, line: 223, type: !896, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !879, retainedNodes: !902)
!896 = !DISubroutineType(types: !897)
!897 = !{!126, !126, !898, !899, !901, !899}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !900, line: 130, baseType: !901)
!900 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !135, line: 35, baseType: !253)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911}
!903 = !DILocalVariable(name: "pa", arg: 1, scope: !895, file: !880, line: 223, type: !126)
!904 = !DILocalVariable(name: "pn", arg: 2, scope: !895, file: !880, line: 223, type: !898)
!905 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !895, file: !880, line: 223, type: !899)
!906 = !DILocalVariable(name: "n_max", arg: 4, scope: !895, file: !880, line: 223, type: !901)
!907 = !DILocalVariable(name: "s", arg: 5, scope: !895, file: !880, line: 223, type: !899)
!908 = !DILocalVariable(name: "n0", scope: !895, file: !880, line: 230, type: !899)
!909 = !DILocalVariable(name: "n", scope: !895, file: !880, line: 237, type: !899)
!910 = !DILocalVariable(name: "nbytes", scope: !895, file: !880, line: 248, type: !899)
!911 = !DILocalVariable(name: "adjusted_nbytes", scope: !895, file: !880, line: 252, type: !899)
!912 = !{!125, !126, !190, !253, !136}
!913 = distinct !DICompileUnit(language: DW_LANG_C11, file: !801, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !914, splitDebugInlining: false, nameTableKind: None)
!914 = !{!799, !802, !804}
!915 = distinct !DICompileUnit(language: DW_LANG_C11, file: !916, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!917 = distinct !DICompileUnit(language: DW_LANG_C11, file: !918, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!918 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!919 = distinct !DICompileUnit(language: DW_LANG_C11, file: !920, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !877, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!921 = distinct !DICompileUnit(language: DW_LANG_C11, file: !922, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !877, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!923 = distinct !DICompileUnit(language: DW_LANG_C11, file: !924, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !925, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!925 = !{!190, !136, !126}
!926 = distinct !DICompileUnit(language: DW_LANG_C11, file: !854, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !927, splitDebugInlining: false, nameTableKind: None)
!927 = !{!928, !852}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !854, line: 35, type: !301, isLocal: true, isDefinition: true)
!930 = distinct !DICompileUnit(language: DW_LANG_C11, file: !931, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!932 = distinct !DICompileUnit(language: DW_LANG_C11, file: !933, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !877, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!934 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!935 = !{i32 7, !"Dwarf Version", i32 5}
!936 = !{i32 2, !"Debug Info Version", i32 3}
!937 = !{i32 1, !"wchar_size", i32 4}
!938 = !{i32 8, !"PIC Level", i32 2}
!939 = !{i32 7, !"PIE Level", i32 2}
!940 = !{i32 7, !"uwtable", i32 2}
!941 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 264, type: !130, scopeLine: 265, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !942)
!942 = !{!943}
!943 = !DILocalVariable(name: "status", arg: 1, scope: !941, file: !2, line: 264, type: !105)
!944 = !DILocation(line: 0, scope: !941)
!945 = !DILocation(line: 266, column: 14, scope: !946)
!946 = distinct !DILexicalBlock(scope: !941, file: !2, line: 266, column: 7)
!947 = !DILocation(line: 266, column: 7, scope: !941)
!948 = !DILocation(line: 267, column: 5, scope: !949)
!949 = distinct !DILexicalBlock(scope: !946, file: !2, line: 267, column: 5)
!950 = !{!951, !951, i64 0}
!951 = !{!"any pointer", !952, i64 0}
!952 = !{!"omnipotent char", !953, i64 0}
!953 = !{!"Simple C/C++ TBAA"}
!954 = !DILocation(line: 270, column: 7, scope: !955)
!955 = distinct !DILexicalBlock(scope: !946, file: !2, line: 269, column: 5)
!956 = !DILocation(line: 273, column: 7, scope: !955)
!957 = !DILocation(line: 736, column: 3, scope: !958, inlinedAt: !960)
!958 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !97, file: !97, line: 734, type: !535, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !959)
!959 = !{}
!960 = distinct !DILocation(line: 277, column: 7, scope: !955)
!961 = !DILocation(line: 279, column: 7, scope: !955)
!962 = !DILocation(line: 285, column: 7, scope: !955)
!963 = !DILocation(line: 290, column: 7, scope: !955)
!964 = !DILocation(line: 295, column: 7, scope: !955)
!965 = !DILocation(line: 301, column: 7, scope: !955)
!966 = !DILocation(line: 306, column: 7, scope: !955)
!967 = !DILocation(line: 307, column: 7, scope: !955)
!968 = !DILocation(line: 309, column: 7, scope: !955)
!969 = !DILocation(line: 314, column: 7, scope: !955)
!970 = !DILocation(line: 320, column: 7, scope: !955)
!971 = !DILocalVariable(name: "program", arg: 1, scope: !972, file: !97, line: 836, type: !137)
!972 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !97, file: !97, line: 836, type: !973, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !137}
!975 = !{!971, !976, !983, !984, !986, !987}
!976 = !DILocalVariable(name: "infomap", scope: !972, file: !97, line: 838, type: !977)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 896, elements: !322)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !972, file: !97, line: 838, size: 128, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !979, file: !97, line: 838, baseType: !137, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !979, file: !97, line: 838, baseType: !137, size: 64, offset: 64)
!983 = !DILocalVariable(name: "node", scope: !972, file: !97, line: 848, type: !137)
!984 = !DILocalVariable(name: "map_prog", scope: !972, file: !97, line: 849, type: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!986 = !DILocalVariable(name: "lc_messages", scope: !972, file: !97, line: 861, type: !137)
!987 = !DILocalVariable(name: "url_program", scope: !972, file: !97, line: 874, type: !137)
!988 = !DILocation(line: 0, scope: !972, inlinedAt: !989)
!989 = distinct !DILocation(line: 330, column: 7, scope: !955)
!990 = !DILocation(line: 857, column: 3, scope: !972, inlinedAt: !989)
!991 = !DILocation(line: 861, column: 29, scope: !972, inlinedAt: !989)
!992 = !DILocation(line: 862, column: 7, scope: !993, inlinedAt: !989)
!993 = distinct !DILexicalBlock(scope: !972, file: !97, line: 862, column: 7)
!994 = !DILocation(line: 862, column: 19, scope: !993, inlinedAt: !989)
!995 = !DILocation(line: 862, column: 22, scope: !993, inlinedAt: !989)
!996 = !DILocation(line: 862, column: 7, scope: !972, inlinedAt: !989)
!997 = !DILocation(line: 868, column: 7, scope: !998, inlinedAt: !989)
!998 = distinct !DILexicalBlock(scope: !993, file: !97, line: 863, column: 5)
!999 = !DILocation(line: 870, column: 5, scope: !998, inlinedAt: !989)
!1000 = !DILocation(line: 875, column: 3, scope: !972, inlinedAt: !989)
!1001 = !DILocation(line: 877, column: 3, scope: !972, inlinedAt: !989)
!1002 = !DILocation(line: 332, column: 3, scope: !941)
!1003 = !DISubprogram(name: "dcgettext", scope: !1004, file: !1004, line: 51, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1004 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!125, !137, !137, !105}
!1007 = !DISubprogram(name: "__fprintf_chk", scope: !1008, file: !1008, line: 93, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1008 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!105, !1011, !105, !1012, null}
!1011 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !226)
!1012 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !137)
!1013 = !DISubprogram(name: "__printf_chk", scope: !1008, file: !1008, line: 95, type: !1014, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!105, !105, !1012, null}
!1016 = !DISubprogram(name: "fputs_unlocked", scope: !1017, file: !1017, line: 691, type: !1018, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1017 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!105, !1012, !1011}
!1020 = !DILocation(line: 0, scope: !204)
!1021 = !DILocation(line: 581, column: 7, scope: !212)
!1022 = !{!1023, !1023, i64 0}
!1023 = !{!"int", !952, i64 0}
!1024 = !DILocation(line: 581, column: 19, scope: !212)
!1025 = !DILocation(line: 581, column: 7, scope: !204)
!1026 = !DILocation(line: 585, column: 26, scope: !211)
!1027 = !DILocation(line: 0, scope: !211)
!1028 = !DILocation(line: 586, column: 23, scope: !211)
!1029 = !DILocation(line: 586, column: 28, scope: !211)
!1030 = !DILocation(line: 586, column: 32, scope: !211)
!1031 = !{!952, !952, i64 0}
!1032 = !DILocation(line: 586, column: 38, scope: !211)
!1033 = !DILocalVariable(name: "__s1", arg: 1, scope: !1034, file: !1035, line: 1359, type: !137)
!1034 = distinct !DISubprogram(name: "streq", scope: !1035, file: !1035, line: 1359, type: !1036, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1038)
!1035 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!190, !137, !137}
!1038 = !{!1033, !1039}
!1039 = !DILocalVariable(name: "__s2", arg: 2, scope: !1034, file: !1035, line: 1359, type: !137)
!1040 = !DILocation(line: 0, scope: !1034, inlinedAt: !1041)
!1041 = distinct !DILocation(line: 586, column: 41, scope: !211)
!1042 = !DILocation(line: 1361, column: 11, scope: !1034, inlinedAt: !1041)
!1043 = !DILocation(line: 1361, column: 10, scope: !1034, inlinedAt: !1041)
!1044 = !DILocation(line: 586, column: 19, scope: !211)
!1045 = !DILocation(line: 587, column: 5, scope: !211)
!1046 = !DILocation(line: 588, column: 7, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !204, file: !97, line: 588, column: 7)
!1048 = !DILocation(line: 588, column: 7, scope: !204)
!1049 = !DILocation(line: 590, column: 7, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !97, line: 589, column: 5)
!1051 = !DILocation(line: 591, column: 7, scope: !1050)
!1052 = !DILocation(line: 595, column: 37, scope: !204)
!1053 = !DILocation(line: 595, column: 35, scope: !204)
!1054 = !DILocation(line: 596, column: 29, scope: !204)
!1055 = !DILocation(line: 597, column: 8, scope: !219)
!1056 = !DILocation(line: 597, column: 7, scope: !204)
!1057 = !DILocation(line: 604, column: 24, scope: !218)
!1058 = !DILocation(line: 604, column: 12, scope: !219)
!1059 = !DILocation(line: 0, scope: !217)
!1060 = !DILocation(line: 610, column: 16, scope: !217)
!1061 = !DILocation(line: 610, column: 7, scope: !217)
!1062 = !DILocation(line: 611, column: 21, scope: !217)
!1063 = !{!1064, !1064, i64 0}
!1064 = !{!"short", !952, i64 0}
!1065 = !DILocation(line: 611, column: 19, scope: !217)
!1066 = !DILocation(line: 611, column: 16, scope: !217)
!1067 = !DILocation(line: 610, column: 30, scope: !217)
!1068 = distinct !{!1068, !1061, !1062, !1069}
!1069 = !{!"llvm.loop.mustprogress"}
!1070 = !DILocation(line: 612, column: 18, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !217, file: !97, line: 612, column: 11)
!1072 = !DILocation(line: 612, column: 11, scope: !217)
!1073 = !DILocation(line: 618, column: 5, scope: !217)
!1074 = !DILocation(line: 620, column: 23, scope: !204)
!1075 = !DILocation(line: 625, column: 39, scope: !204)
!1076 = !DILocation(line: 626, column: 3, scope: !204)
!1077 = !DILocation(line: 626, column: 10, scope: !204)
!1078 = !DILocation(line: 626, column: 21, scope: !204)
!1079 = !DILocation(line: 628, column: 44, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !97, line: 628, column: 11)
!1081 = distinct !DILexicalBlock(scope: !204, file: !97, line: 627, column: 5)
!1082 = !DILocation(line: 628, column: 32, scope: !1080)
!1083 = !DILocation(line: 628, column: 49, scope: !1080)
!1084 = !DILocation(line: 628, column: 11, scope: !1081)
!1085 = !DILocation(line: 630, column: 11, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1081, file: !97, line: 630, column: 11)
!1087 = !DILocation(line: 630, column: 11, scope: !1081)
!1088 = !DILocation(line: 632, column: 26, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !97, line: 632, column: 15)
!1090 = distinct !DILexicalBlock(scope: !1086, file: !97, line: 631, column: 9)
!1091 = !DILocation(line: 632, column: 34, scope: !1089)
!1092 = !DILocation(line: 632, column: 37, scope: !1089)
!1093 = !DILocation(line: 632, column: 15, scope: !1090)
!1094 = !DILocation(line: 636, column: 16, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1090, file: !97, line: 636, column: 15)
!1096 = !DILocation(line: 636, column: 29, scope: !1095)
!1097 = !DILocation(line: 640, column: 16, scope: !1081)
!1098 = distinct !{!1098, !1076, !1099, !1069}
!1099 = !DILocation(line: 641, column: 5, scope: !204)
!1100 = !DILocation(line: 644, column: 3, scope: !204)
!1101 = !DILocation(line: 0, scope: !1034, inlinedAt: !1102)
!1102 = distinct !DILocation(line: 648, column: 31, scope: !204)
!1103 = !DILocation(line: 0, scope: !1034, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 649, column: 31, scope: !204)
!1105 = !DILocation(line: 0, scope: !1034, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 650, column: 31, scope: !204)
!1107 = !DILocation(line: 0, scope: !1034, inlinedAt: !1108)
!1108 = distinct !DILocation(line: 651, column: 31, scope: !204)
!1109 = !DILocation(line: 0, scope: !1034, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 652, column: 31, scope: !204)
!1111 = !DILocation(line: 0, scope: !1034, inlinedAt: !1112)
!1112 = distinct !DILocation(line: 653, column: 31, scope: !204)
!1113 = !DILocation(line: 0, scope: !1034, inlinedAt: !1114)
!1114 = distinct !DILocation(line: 654, column: 31, scope: !204)
!1115 = !DILocation(line: 0, scope: !1034, inlinedAt: !1116)
!1116 = distinct !DILocation(line: 655, column: 31, scope: !204)
!1117 = !DILocation(line: 0, scope: !1034, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 656, column: 31, scope: !204)
!1119 = !DILocation(line: 0, scope: !1034, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 657, column: 31, scope: !204)
!1121 = !DILocation(line: 663, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !204, file: !97, line: 663, column: 7)
!1123 = !DILocation(line: 664, column: 7, scope: !1122)
!1124 = !DILocation(line: 664, column: 10, scope: !1122)
!1125 = !DILocation(line: 663, column: 7, scope: !204)
!1126 = !DILocation(line: 669, column: 7, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1122, file: !97, line: 665, column: 5)
!1128 = !DILocation(line: 671, column: 5, scope: !1127)
!1129 = !DILocation(line: 676, column: 7, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1122, file: !97, line: 673, column: 5)
!1131 = !DILocation(line: 679, column: 3, scope: !204)
!1132 = !DILocation(line: 683, column: 3, scope: !204)
!1133 = !DILocation(line: 686, column: 3, scope: !204)
!1134 = !DILocation(line: 688, column: 3, scope: !204)
!1135 = !DILocation(line: 691, column: 3, scope: !204)
!1136 = !DILocation(line: 695, column: 3, scope: !204)
!1137 = !DILocation(line: 696, column: 1, scope: !204)
!1138 = !DISubprogram(name: "setlocale", scope: !1139, file: !1139, line: 122, type: !1140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1139 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!125, !105, !137}
!1142 = !DISubprogram(name: "strncmp", scope: !1143, file: !1143, line: 159, type: !1144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1143 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!105, !137, !137, !134}
!1146 = !DISubprogram(name: "exit", scope: !1147, file: !1147, line: 624, type: !130, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1147 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1148 = !DISubprogram(name: "getenv", scope: !1147, file: !1147, line: 641, type: !1149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!125, !137}
!1151 = !DISubprogram(name: "strcmp", scope: !1143, file: !1143, line: 156, type: !1152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!105, !137, !137}
!1154 = !DISubprogram(name: "strspn", scope: !1143, file: !1143, line: 297, type: !1155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!136, !137, !137}
!1157 = !DISubprogram(name: "strchr", scope: !1143, file: !1143, line: 246, type: !1158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!125, !137, !105}
!1160 = !DISubprogram(name: "__ctype_b_loc", scope: !110, file: !110, line: 79, type: !1161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!1164 = !DISubprogram(name: "strcspn", scope: !1143, file: !1143, line: 293, type: !1155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1165 = !DISubprogram(name: "fwrite_unlocked", scope: !1017, file: !1017, line: 704, type: !1166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !959)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!134, !1168, !134, !134, !1011}
!1168 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1171 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 508, type: !1172, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1175)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!105, !105, !1174}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1189, !1190, !1194, !1196, !1197}
!1176 = !DILocalVariable(name: "argc", arg: 1, scope: !1171, file: !2, line: 508, type: !105)
!1177 = !DILocalVariable(name: "argv", arg: 2, scope: !1171, file: !2, line: 508, type: !1174)
!1178 = !DILocalVariable(name: "timeout", scope: !1171, file: !2, line: 510, type: !187)
!1179 = !DILocalVariable(name: "c", scope: !1171, file: !2, line: 511, type: !105)
!1180 = !DILocalVariable(name: "orig_set", scope: !1171, file: !2, line: 586, type: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !1182, line: 7, baseType: !1183)
!1182 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !1184, line: 8, baseType: !1185)
!1184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1184, line: 5, size: 1024, elements: !1186)
!1186 = !{!1187}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !1185, file: !1184, line: 7, baseType: !1188, size: 1024)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1024, elements: !363)
!1189 = !DILocalVariable(name: "timeout_pid", scope: !1171, file: !2, line: 593, type: !181)
!1190 = !DILocalVariable(name: "exit_status", scope: !1191, file: !2, line: 632, type: !105)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 607, column: 5)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !2, line: 606, column: 12)
!1193 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 601, column: 7)
!1194 = !DILocalVariable(name: "wait_result", scope: !1195, file: !2, line: 638, type: !181)
!1195 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 637, column: 5)
!1196 = !DILocalVariable(name: "status", scope: !1195, file: !2, line: 639, type: !105)
!1197 = !DILocalVariable(name: "sig", scope: !1198, file: !2, line: 662, type: !105)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !2, line: 661, column: 13)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !2, line: 660, column: 20)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !2, line: 658, column: 15)
!1201 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 657, column: 9)
!1202 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 650, column: 11)
!1203 = !DILocation(line: 0, scope: !1171)
!1204 = !DILocation(line: 514, column: 21, scope: !1171)
!1205 = !DILocation(line: 514, column: 3, scope: !1171)
!1206 = !DILocation(line: 515, column: 3, scope: !1171)
!1207 = !DILocation(line: 516, column: 3, scope: !1171)
!1208 = !DILocation(line: 517, column: 3, scope: !1171)
!1209 = !DILocalVariable(name: "status", arg: 1, scope: !1210, file: !97, line: 102, type: !105)
!1210 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !97, file: !97, line: 102, type: !130, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1211)
!1211 = !{!1209}
!1212 = !DILocation(line: 0, scope: !1210, inlinedAt: !1213)
!1213 = distinct !DILocation(line: 519, column: 3, scope: !1171)
!1214 = !DILocation(line: 105, column: 18, scope: !1215, inlinedAt: !1213)
!1215 = distinct !DILexicalBlock(scope: !1210, file: !97, line: 104, column: 7)
!1216 = !DILocation(line: 520, column: 3, scope: !1171)
!1217 = !DILocation(line: 522, column: 3, scope: !1171)
!1218 = !DILocation(line: 522, column: 15, scope: !1171)
!1219 = !DILocation(line: 528, column: 22, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 526, column: 9)
!1221 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 524, column: 5)
!1222 = !DILocation(line: 529, column: 11, scope: !1220)
!1223 = !DILocation(line: 532, column: 40, scope: !1220)
!1224 = !DILocation(line: 532, column: 24, scope: !1220)
!1225 = !DILocation(line: 532, column: 22, scope: !1220)
!1226 = !{!1227, !1227, i64 0}
!1227 = !{!"double", !952, i64 0}
!1228 = !DILocation(line: 533, column: 11, scope: !1220)
!1229 = !DILocation(line: 536, column: 27, scope: !1220)
!1230 = !DILocation(line: 537, column: 11, scope: !1220)
!1231 = !DILocation(line: 540, column: 38, scope: !1220)
!1232 = !DILocation(line: 540, column: 25, scope: !1220)
!1233 = !DILocation(line: 540, column: 23, scope: !1220)
!1234 = !DILocation(line: 541, column: 27, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1220, file: !2, line: 541, column: 15)
!1236 = !DILocation(line: 541, column: 15, scope: !1220)
!1237 = distinct !{!1237, !1217, !1238, !1069}
!1238 = !DILocation(line: 557, column: 5, scope: !1171)
!1239 = !DILocation(line: 542, column: 13, scope: !1235)
!1240 = !DILocation(line: 546, column: 19, scope: !1220)
!1241 = !DILocation(line: 547, column: 11, scope: !1220)
!1242 = !DILocation(line: 549, column: 9, scope: !1220)
!1243 = !DILocation(line: 551, column: 9, scope: !1220)
!1244 = !DILocation(line: 554, column: 11, scope: !1220)
!1245 = !DILocation(line: 559, column: 14, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 559, column: 7)
!1247 = !DILocation(line: 559, column: 12, scope: !1246)
!1248 = !DILocation(line: 559, column: 21, scope: !1246)
!1249 = !DILocation(line: 559, column: 7, scope: !1171)
!1250 = !DILocation(line: 560, column: 5, scope: !1246)
!1251 = !DILocation(line: 562, column: 40, scope: !1171)
!1252 = !DILocation(line: 562, column: 29, scope: !1171)
!1253 = !DILocation(line: 562, column: 13, scope: !1171)
!1254 = !DILocation(line: 564, column: 11, scope: !1171)
!1255 = !DILocation(line: 564, column: 8, scope: !1171)
!1256 = !DILocation(line: 565, column: 13, scope: !1171)
!1257 = !DILocation(line: 565, column: 11, scope: !1171)
!1258 = !DILocation(line: 571, column: 8, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 571, column: 7)
!1260 = !DILocation(line: 571, column: 7, scope: !1171)
!1261 = !DILocation(line: 572, column: 5, scope: !1259)
!1262 = !DILocation(line: 576, column: 20, scope: !1171)
!1263 = !DILocalVariable(name: "sigterm", arg: 1, scope: !1264, file: !2, line: 437, type: !105)
!1264 = distinct !DISubprogram(name: "install_cleanup", scope: !2, file: !2, line: 437, type: !130, scopeLine: 438, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1265)
!1265 = !{!1263, !1266, !1354, !1356}
!1266 = !DILocalVariable(name: "sa", scope: !1264, file: !2, line: 439, type: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1268, line: 27, size: 1216, elements: !1269)
!1268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!1269 = !{!1270, !1351, !1352, !1353}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1267, file: !1268, line: 38, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1267, file: !1268, line: 31, size: 64, elements: !1272)
!1272 = !{!1273, !1274}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1271, file: !1268, line: 34, baseType: !127, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1271, file: !1268, line: 36, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{null, !105, !1278, !126}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1280, line: 124, baseType: !1281)
!1280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1280, line: 36, size: 1024, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286, !1287}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1281, file: !1280, line: 38, baseType: !105, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1281, file: !1280, line: 40, baseType: !105, size: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1281, file: !1280, line: 42, baseType: !105, size: 32, offset: 64)
