; ModuleID = 'src/true.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating success.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"true\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !24

!162 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 15)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !3, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !127, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !9, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !9, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !140, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 22)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !163, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !108, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 71)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 27)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 51)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 12)
!210 = !{!211, !212, !213, !216, !218, !219, !220, !224, !225, !226, !227, !229, !282, !283, !284, !286, !287}
!211 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!212 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!213 = !DILocalVariable(name: "term", scope: !214, file: !69, line: 585, type: !72)
!214 = distinct !DILexicalBlock(scope: !215, file: !69, line: 582, column: 5)
!215 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!216 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !217)
!217 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!218 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!219 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!220 = !DILocalVariable(name: "s", scope: !221, file: !69, line: 608, type: !72)
!221 = distinct !DILexicalBlock(scope: !222, file: !69, line: 605, column: 5)
!222 = distinct !DILexicalBlock(scope: !223, file: !69, line: 604, column: 12)
!223 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!224 = !DILocalVariable(name: "spaces", scope: !221, file: !69, line: 609, type: !97)
!225 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !97)
!226 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!227 = !DILocalVariable(name: "__ptr", scope: !228, file: !69, line: 644, type: !72)
!228 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!229 = !DILocalVariable(name: "__stream", scope: !228, file: !69, line: 644, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !251, !253, !254, !255, !259, !260, !262, !263, !266, !268, !271, !274, !275, !276, !277, !278}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !233, file: !234, line: 51, baseType: !95, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !233, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !233, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !233, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !233, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !233, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !233, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !233, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !233, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !233, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !233, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !233, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !233, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !234, line: 36, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !233, file: !234, line: 70, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !233, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !233, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !233, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 152, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!258 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !233, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !233, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!261 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !233, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !233, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !234, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !233, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 153, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !233, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !234, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !233, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !234, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !233, file: !234, line: 93, baseType: !252, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !233, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !233, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !233, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !233, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocalVariable(name: "__cnt", scope: !228, file: !69, line: 644, type: !97)
!283 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !69, line: 686, type: !72)
!285 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !69, line: 686, type: !230)
!287 = !DILocalVariable(name: "__cnt", scope: !285, file: !69, line: 686, type: !97)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !290, line: 3, type: !163, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !290, line: 3, type: !72, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !290, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !294, splitDebugInlining: false, nameTableKind: None)
!294 = !{!288, !291}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 45, type: !72, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!299 = !{!300, !302, !304, !306, !295, !308}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !51, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !207, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !298, line: 123, type: !51, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !298, line: 126, type: !127, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 55, type: !217, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !312, file: !313, line: 66, type: !359, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !315, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!314 = !{!94, !100}
!315 = !{!316, !318, !338, !340, !342, !344, !310, !346, !348, !350, !352, !357}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !313, line: 272, type: !9, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "old_file_name", scope: !320, file: !313, line: 304, type: !72, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "verror_at_line", scope: !313, file: !313, line: 298, type: !321, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !331)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !95, !95, !72, !78, !72, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !325)
!325 = !{!326, !328, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !324, file: !327, baseType: !78, size: 32)
!327 = !DIFile(filename: "lib/error.c", directory: "/src")
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !324, file: !327, baseType: !78, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !324, file: !327, baseType: !94, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !324, file: !327, baseType: !94, size: 64, offset: 128)
!331 = !{!332, !333, !334, !335, !336, !337}
!332 = !DILocalVariable(name: "status", arg: 1, scope: !320, file: !313, line: 298, type: !95)
!333 = !DILocalVariable(name: "errnum", arg: 2, scope: !320, file: !313, line: 298, type: !95)
!334 = !DILocalVariable(name: "file_name", arg: 3, scope: !320, file: !313, line: 298, type: !72)
!335 = !DILocalVariable(name: "line_number", arg: 4, scope: !320, file: !313, line: 298, type: !78)
!336 = !DILocalVariable(name: "message", arg: 5, scope: !320, file: !313, line: 298, type: !72)
!337 = !DILocalVariable(name: "args", arg: 6, scope: !320, file: !313, line: 298, type: !323)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "old_line_number", scope: !320, file: !313, line: 305, type: !78, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !313, line: 338, type: !108, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !140, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !118, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "error_message_count", scope: !312, file: !313, line: 69, type: !78, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !312, file: !313, line: 295, type: !95, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !51, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 21)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !313, line: 214, type: !9, isLocal: true, isDefinition: true)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "program_name", scope: !364, file: !365, line: 31, type: !72, isLocal: false, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C11, file: !365, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, globals: !367, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!366 = !{!93}
!367 = !{!362, !368, !370}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !365, line: 46, type: !140, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !365, line: 49, type: !108, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "utf07FF", scope: !374, file: !375, line: 46, type: !402, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "proper_name_lite", scope: !375, file: !375, line: 38, type: !376, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !380)
!375 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!376 = !DISubroutineType(types: !377)
!377 = !{!72, !72, !72}
!378 = distinct !DICompileUnit(language: DW_LANG_C11, file: !375, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !379, splitDebugInlining: false, nameTableKind: None)
!379 = !{!372}
!380 = !{!381, !382, !383, !384, !389}
!381 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !374, file: !375, line: 38, type: !72)
!382 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !374, file: !375, line: 38, type: !72)
!383 = !DILocalVariable(name: "translation", scope: !374, file: !375, line: 40, type: !72)
!384 = !DILocalVariable(name: "w", scope: !374, file: !375, line: 47, type: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !386, line: 37, baseType: !387)
!386 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !257, line: 57, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !257, line: 42, baseType: !78)
!389 = !DILocalVariable(name: "mbs", scope: !374, file: !375, line: 48, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !391, line: 6, baseType: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !393, line: 21, baseType: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 13, size: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !394, file: !393, line: 15, baseType: !95, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !394, file: !393, line: 20, baseType: !398, size: 32, offset: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !393, line: 16, size: 32, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !398, file: !393, line: 18, baseType: !78, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !398, file: !393, line: 19, baseType: !108, size: 32)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !119)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !405, line: 78, type: !140, isLocal: true, isDefinition: true)
!405 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !405, line: 79, type: !113, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !405, line: 80, type: !63, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !405, line: 81, type: !63, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !405, line: 82, type: !279, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !405, line: 83, type: !118, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !405, line: 84, type: !140, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !405, line: 85, type: !51, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !405, line: 86, type: !51, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !405, line: 87, type: !140, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !426, file: !405, line: 76, type: !512, isLocal: false, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C11, file: !405, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !447, globals: !448, splitDebugInlining: false, nameTableKind: None)
!427 = !{!428, !442, !76}
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !429, line: 42, baseType: !78, size: 32, elements: !430)
!429 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!431 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!432 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!433 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!434 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!435 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!436 = !DIEnumerator(name: "c_quoting_style", value: 5)
!437 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!438 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!439 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!440 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!441 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !429, line: 254, baseType: !78, size: 32, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!445 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!446 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!447 = !{!95, !96, !97}
!448 = !{!403, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !449, !453, !463, !465, !470, !472, !474, !476, !478, !501, !508, !510}
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !426, file: !405, line: 92, type: !451, isLocal: false, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 320, elements: !42)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !426, file: !405, line: 1040, type: !455, isLocal: false, isDefinition: true)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !405, line: 56, size: 448, elements: !456)
!456 = !{!457, !458, !459, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !455, file: !405, line: 59, baseType: !428, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !405, line: 62, baseType: !95, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !455, file: !405, line: 66, baseType: !460, size: 256, offset: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !141)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !455, file: !405, line: 69, baseType: !72, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !455, file: !405, line: 72, baseType: !72, size: 64, offset: 384)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !426, file: !405, line: 107, type: !455, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "slot0", scope: !426, file: !405, line: 831, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 256)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !405, line: 321, type: !118, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !405, line: 357, type: !118, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !405, line: 358, type: !118, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !405, line: 199, type: !51, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "quote", scope: !480, file: !405, line: 228, type: !499, isLocal: true, isDefinition: true)
!480 = distinct !DISubprogram(name: "gettext_quote", scope: !405, file: !405, line: 197, type: !481, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !426, retainedNodes: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!72, !72, !428}
!483 = !{!484, !485, !486, !487, !488}
!484 = !DILocalVariable(name: "msgid", arg: 1, scope: !480, file: !405, line: 197, type: !72)
!485 = !DILocalVariable(name: "s", arg: 2, scope: !480, file: !405, line: 197, type: !428)
!486 = !DILocalVariable(name: "translation", scope: !480, file: !405, line: 199, type: !72)
!487 = !DILocalVariable(name: "w", scope: !480, file: !405, line: 229, type: !385)
!488 = !DILocalVariable(name: "mbs", scope: !480, file: !405, line: 230, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !391, line: 6, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !393, line: 21, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 13, size: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !491, file: !393, line: 15, baseType: !95, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !491, file: !393, line: 20, baseType: !495, size: 32, offset: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !491, file: !393, line: 16, size: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !495, file: !393, line: 18, baseType: !78, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !495, file: !393, line: 19, baseType: !108, size: 32)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !500)
!500 = !{!120, !110}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "slotvec", scope: !426, file: !405, line: 834, type: !503, isLocal: true, isDefinition: true)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !405, line: 823, size: 128, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !504, file: !405, line: 825, baseType: !97, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !504, file: !405, line: 826, baseType: !93, size: 64, offset: 64)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "nslots", scope: !426, file: !405, line: 832, type: !95, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "slotvec0", scope: !426, file: !405, line: 833, type: !504, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 704, elements: !514)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!514 = !{!515}
!515 = !DISubrange(count: 11)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !518, line: 67, type: !207, isLocal: true, isDefinition: true)
!518 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !518, line: 69, type: !51, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !518, line: 83, type: !51, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !518, line: 83, type: !108, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !518, line: 85, type: !118, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !518, line: 88, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 171)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !518, line: 88, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 34)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !518, line: 105, type: !178, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !518, line: 109, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 23)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !518, line: 113, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 28)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !518, line: 120, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 32)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !518, line: 127, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 36)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !518, line: 134, type: !158, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !518, line: 142, type: !14, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !518, line: 150, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 48)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !518, line: 159, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 52)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !518, line: 170, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 60)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !518, line: 248, type: !279, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !518, line: 248, type: !183, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !518, line: 254, type: !279, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !518, line: 254, type: !58, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !518, line: 254, type: !158, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !518, line: 259, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 39)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !518, line: 259, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 29)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !600, file: !601, line: 26, type: !603, isLocal: false, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C11, file: !601, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !602, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!602 = !{!598}
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 47)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "exit_failure", scope: !608, file: !609, line: 24, type: !611, isLocal: false, isDefinition: true)
!608 = distinct !DICompileUnit(language: DW_LANG_C11, file: !609, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !610, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!610 = !{!606}
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !614, line: 34, type: !127, isLocal: true, isDefinition: true)
!614 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !614, line: 34, type: !51, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !614, line: 34, type: !153, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !621, line: 108, type: !36, isLocal: true, isDefinition: true)
!621 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "internal_state", scope: !624, file: !621, line: 97, type: !627, isLocal: true, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C11, file: !621, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !625, globals: !626, splitDebugInlining: false, nameTableKind: None)
!625 = !{!94, !97, !100}
!626 = !{!619, !622}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !391, line: 6, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !393, line: 21, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 13, size: 64, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !629, file: !393, line: 15, baseType: !95, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !629, file: !393, line: 20, baseType: !633, size: 32, offset: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !629, file: !393, line: 16, size: 32, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !633, file: !393, line: 18, baseType: !78, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !633, file: !393, line: 19, baseType: !108, size: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !639, line: 35, type: !113, isLocal: true, isDefinition: true)
!639 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!640 = distinct !DICompileUnit(language: DW_LANG_C11, file: !641, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!642 = distinct !DICompileUnit(language: DW_LANG_C11, file: !518, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !643, retainedTypes: !647, globals: !648, splitDebugInlining: false, nameTableKind: None)
!643 = !{!644}
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !518, line: 40, baseType: !78, size: 32, elements: !645)
!645 = !{!646}
!646 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!647 = !{!94}
!648 = !{!516, !519, !521, !523, !525, !527, !532, !537, !539, !544, !549, !554, !559, !561, !563, !568, !573, !578, !580, !582, !584, !586, !588, !593}
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !650, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !651, retainedTypes: !682, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!651 = !{!652, !664}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !653, file: !650, line: 188, baseType: !78, size: 32, elements: !662)
!653 = distinct !DISubprogram(name: "x2nrealloc", scope: !650, file: !650, line: 176, type: !654, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !657)
!654 = !DISubroutineType(types: !655)
!655 = !{!94, !94, !656, !97}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!657 = !{!658, !659, !660, !661}
!658 = !DILocalVariable(name: "p", arg: 1, scope: !653, file: !650, line: 176, type: !94)
!659 = !DILocalVariable(name: "pn", arg: 2, scope: !653, file: !650, line: 176, type: !656)
!660 = !DILocalVariable(name: "s", arg: 3, scope: !653, file: !650, line: 176, type: !97)
!661 = !DILocalVariable(name: "n", scope: !653, file: !650, line: 178, type: !97)
!662 = !{!663}
!663 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !665, file: !650, line: 228, baseType: !78, size: 32, elements: !662)
!665 = distinct !DISubprogram(name: "xpalloc", scope: !650, file: !650, line: 223, type: !666, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !672)
!666 = !DISubroutineType(types: !667)
!667 = !{!94, !94, !668, !669, !671, !669}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !670, line: 130, baseType: !671)
!670 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !98, line: 35, baseType: !258)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681}
!673 = !DILocalVariable(name: "pa", arg: 1, scope: !665, file: !650, line: 223, type: !94)
!674 = !DILocalVariable(name: "pn", arg: 2, scope: !665, file: !650, line: 223, type: !668)
!675 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !665, file: !650, line: 223, type: !669)
!676 = !DILocalVariable(name: "n_max", arg: 4, scope: !665, file: !650, line: 223, type: !671)
!677 = !DILocalVariable(name: "s", arg: 5, scope: !665, file: !650, line: 223, type: !669)
!678 = !DILocalVariable(name: "n0", scope: !665, file: !650, line: 230, type: !669)
!679 = !DILocalVariable(name: "n", scope: !665, file: !650, line: 237, type: !669)
!680 = !DILocalVariable(name: "nbytes", scope: !665, file: !650, line: 248, type: !669)
!681 = !DILocalVariable(name: "adjusted_nbytes", scope: !665, file: !650, line: 252, type: !669)
!682 = !{!93, !94, !217, !258, !99}
!683 = distinct !DICompileUnit(language: DW_LANG_C11, file: !614, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !684, splitDebugInlining: false, nameTableKind: None)
!684 = !{!612, !615, !617}
!685 = distinct !DICompileUnit(language: DW_LANG_C11, file: !686, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!691 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !694, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !695, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!695 = !{!217, !99, !94}
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !697, splitDebugInlining: false, nameTableKind: None)
!697 = !{!698, !637}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !639, line: 35, type: !118, isLocal: true, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !703, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!704 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!705 = !{i32 7, !"Dwarf Version", i32 5}
!706 = !{i32 2, !"Debug Info Version", i32 3}
!707 = !{i32 1, !"wchar_size", i32 4}
!708 = !{i32 8, !"PIC Level", i32 2}
!709 = !{i32 7, !"PIE Level", i32 2}
!710 = !{i32 7, !"uwtable", i32 2}
!711 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !712, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !95}
!714 = !{!715}
!715 = !DILocalVariable(name: "status", arg: 1, scope: !711, file: !2, line: 36, type: !95)
!716 = !DILocation(line: 0, scope: !711)
!717 = !DILocation(line: 38, column: 3, scope: !711)
!718 = !{!719, !719, i64 0}
!719 = !{!"any pointer", !720, i64 0}
!720 = !{!"omnipotent char", !721, i64 0}
!721 = !{!"Simple C/C++ TBAA"}
!722 = !DILocation(line: 43, column: 3, scope: !711)
!723 = !DILocation(line: 47, column: 3, scope: !711)
!724 = !DILocation(line: 48, column: 3, scope: !711)
!725 = !DILocation(line: 49, column: 3, scope: !711)
!726 = !DILocation(line: 50, column: 3, scope: !711)
!727 = !DILocation(line: 51, column: 3, scope: !711)
!728 = !DISubprogram(name: "dcgettext", scope: !729, file: !729, line: 51, type: !730, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!729 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!730 = !DISubroutineType(types: !731)
!731 = !{!93, !72, !72, !95}
!732 = !{}
!733 = !DISubprogram(name: "__printf_chk", scope: !734, file: !734, line: 95, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!734 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!735 = !DISubroutineType(types: !736)
!736 = !{!95, !95, !737, null}
!737 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!738 = !DILocation(line: 0, scope: !68)
!739 = !DILocation(line: 581, column: 7, scope: !215)
!740 = !{!741, !741, i64 0}
!741 = !{!"int", !720, i64 0}
!742 = !DILocation(line: 581, column: 19, scope: !215)
!743 = !DILocation(line: 581, column: 7, scope: !68)
!744 = !DILocation(line: 585, column: 26, scope: !214)
!745 = !DILocation(line: 0, scope: !214)
!746 = !DILocation(line: 586, column: 23, scope: !214)
!747 = !DILocation(line: 586, column: 28, scope: !214)
!748 = !DILocation(line: 586, column: 32, scope: !214)
!749 = !{!720, !720, i64 0}
!750 = !DILocation(line: 586, column: 38, scope: !214)
!751 = !DILocalVariable(name: "__s1", arg: 1, scope: !752, file: !753, line: 1359, type: !72)
!752 = distinct !DISubprogram(name: "streq", scope: !753, file: !753, line: 1359, type: !754, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !756)
!753 = !DIFile(filename: "./lib/string.h", directory: "/src")
!754 = !DISubroutineType(types: !755)
!755 = !{!217, !72, !72}
!756 = !{!751, !757}
!757 = !DILocalVariable(name: "__s2", arg: 2, scope: !752, file: !753, line: 1359, type: !72)
!758 = !DILocation(line: 0, scope: !752, inlinedAt: !759)
!759 = distinct !DILocation(line: 586, column: 41, scope: !214)
!760 = !DILocation(line: 1361, column: 11, scope: !752, inlinedAt: !759)
!761 = !DILocation(line: 1361, column: 10, scope: !752, inlinedAt: !759)
!762 = !DILocation(line: 586, column: 19, scope: !214)
!763 = !DILocation(line: 587, column: 5, scope: !214)
!764 = !DILocation(line: 588, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!766 = !DILocation(line: 588, column: 7, scope: !68)
!767 = !DILocation(line: 590, column: 7, scope: !768)
!768 = distinct !DILexicalBlock(scope: !765, file: !69, line: 589, column: 5)
!769 = !DILocation(line: 591, column: 7, scope: !768)
!770 = !DILocation(line: 595, column: 37, scope: !68)
!771 = !DILocation(line: 595, column: 35, scope: !68)
!772 = !DILocation(line: 596, column: 29, scope: !68)
!773 = !DILocation(line: 597, column: 8, scope: !223)
!774 = !DILocation(line: 597, column: 7, scope: !68)
!775 = !DILocation(line: 604, column: 24, scope: !222)
!776 = !DILocation(line: 604, column: 12, scope: !223)
!777 = !DILocation(line: 0, scope: !221)
!778 = !DILocation(line: 610, column: 16, scope: !221)
!779 = !DILocation(line: 610, column: 7, scope: !221)
!780 = !DILocation(line: 611, column: 21, scope: !221)
!781 = !{!782, !782, i64 0}
!782 = !{!"short", !720, i64 0}
!783 = !DILocation(line: 611, column: 19, scope: !221)
!784 = !DILocation(line: 611, column: 16, scope: !221)
!785 = !DILocation(line: 610, column: 30, scope: !221)
!786 = distinct !{!786, !779, !780, !787}
!787 = !{!"llvm.loop.mustprogress"}
!788 = !DILocation(line: 612, column: 18, scope: !789)
!789 = distinct !DILexicalBlock(scope: !221, file: !69, line: 612, column: 11)
!790 = !DILocation(line: 612, column: 11, scope: !221)
!791 = !DILocation(line: 618, column: 5, scope: !221)
!792 = !DILocation(line: 620, column: 23, scope: !68)
!793 = !DILocation(line: 625, column: 39, scope: !68)
!794 = !DILocation(line: 626, column: 3, scope: !68)
!795 = !DILocation(line: 626, column: 10, scope: !68)
!796 = !DILocation(line: 626, column: 21, scope: !68)
!797 = !DILocation(line: 628, column: 44, scope: !798)
!798 = distinct !DILexicalBlock(scope: !799, file: !69, line: 628, column: 11)
!799 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!800 = !DILocation(line: 628, column: 32, scope: !798)
!801 = !DILocation(line: 628, column: 49, scope: !798)
!802 = !DILocation(line: 628, column: 11, scope: !799)
!803 = !DILocation(line: 630, column: 11, scope: !804)
!804 = distinct !DILexicalBlock(scope: !799, file: !69, line: 630, column: 11)
!805 = !DILocation(line: 630, column: 11, scope: !799)
!806 = !DILocation(line: 632, column: 26, scope: !807)
!807 = distinct !DILexicalBlock(scope: !808, file: !69, line: 632, column: 15)
!808 = distinct !DILexicalBlock(scope: !804, file: !69, line: 631, column: 9)
!809 = !DILocation(line: 632, column: 34, scope: !807)
!810 = !DILocation(line: 632, column: 37, scope: !807)
!811 = !DILocation(line: 632, column: 15, scope: !808)
!812 = !DILocation(line: 636, column: 16, scope: !813)
!813 = distinct !DILexicalBlock(scope: !808, file: !69, line: 636, column: 15)
!814 = !DILocation(line: 636, column: 29, scope: !813)
!815 = !DILocation(line: 640, column: 16, scope: !799)
!816 = distinct !{!816, !794, !817, !787}
!817 = !DILocation(line: 641, column: 5, scope: !68)
!818 = !DILocation(line: 644, column: 3, scope: !68)
!819 = !DILocation(line: 0, scope: !752, inlinedAt: !820)
!820 = distinct !DILocation(line: 648, column: 31, scope: !68)
!821 = !DILocation(line: 0, scope: !752, inlinedAt: !822)
!822 = distinct !DILocation(line: 649, column: 31, scope: !68)
!823 = !DILocation(line: 0, scope: !752, inlinedAt: !824)
!824 = distinct !DILocation(line: 650, column: 31, scope: !68)
!825 = !DILocation(line: 0, scope: !752, inlinedAt: !826)
!826 = distinct !DILocation(line: 651, column: 31, scope: !68)
!827 = !DILocation(line: 0, scope: !752, inlinedAt: !828)
!828 = distinct !DILocation(line: 652, column: 31, scope: !68)
!829 = !DILocation(line: 0, scope: !752, inlinedAt: !830)
!830 = distinct !DILocation(line: 653, column: 31, scope: !68)
!831 = !DILocation(line: 0, scope: !752, inlinedAt: !832)
!832 = distinct !DILocation(line: 654, column: 31, scope: !68)
!833 = !DILocation(line: 0, scope: !752, inlinedAt: !834)
!834 = distinct !DILocation(line: 655, column: 31, scope: !68)
!835 = !DILocation(line: 0, scope: !752, inlinedAt: !836)
!836 = distinct !DILocation(line: 656, column: 31, scope: !68)
!837 = !DILocation(line: 0, scope: !752, inlinedAt: !838)
!838 = distinct !DILocation(line: 657, column: 31, scope: !68)
!839 = !DILocation(line: 663, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!841 = !DILocation(line: 664, column: 7, scope: !840)
!842 = !DILocation(line: 664, column: 10, scope: !840)
!843 = !DILocation(line: 663, column: 7, scope: !68)
!844 = !DILocation(line: 669, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !840, file: !69, line: 665, column: 5)
!846 = !DILocation(line: 671, column: 5, scope: !845)
!847 = !DILocation(line: 676, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !840, file: !69, line: 673, column: 5)
!849 = !DILocation(line: 679, column: 3, scope: !68)
!850 = !DILocation(line: 683, column: 3, scope: !68)
!851 = !DILocation(line: 686, column: 3, scope: !68)
!852 = !DILocation(line: 688, column: 3, scope: !68)
!853 = !DILocation(line: 691, column: 3, scope: !68)
!854 = !DILocation(line: 695, column: 3, scope: !68)
!855 = !DILocation(line: 696, column: 1, scope: !68)
!856 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !857, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !859)
!857 = !DISubroutineType(cc: DW_CC_nocall, types: !858)
!858 = !{null, !72}
!859 = !{!860, !861, !868, !869, !871, !872}
!860 = !DILocalVariable(name: "program", arg: 1, scope: !856, file: !69, line: 836, type: !72)
!861 = !DILocalVariable(name: "infomap", scope: !856, file: !69, line: 838, type: !862)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 896, elements: !52)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !856, file: !69, line: 838, size: 128, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !864, file: !69, line: 838, baseType: !72, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !864, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!868 = !DILocalVariable(name: "node", scope: !856, file: !69, line: 848, type: !72)
!869 = !DILocalVariable(name: "map_prog", scope: !856, file: !69, line: 849, type: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!871 = !DILocalVariable(name: "lc_messages", scope: !856, file: !69, line: 861, type: !72)
!872 = !DILocalVariable(name: "url_program", scope: !856, file: !69, line: 874, type: !72)
!873 = !DILocation(line: 0, scope: !856)
!874 = !DILocation(line: 857, column: 3, scope: !856)
!875 = !DILocation(line: 861, column: 29, scope: !856)
!876 = !DILocation(line: 862, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !856, file: !69, line: 862, column: 7)
!878 = !DILocation(line: 862, column: 19, scope: !877)
!879 = !DILocation(line: 862, column: 22, scope: !877)
!880 = !DILocation(line: 862, column: 7, scope: !856)
!881 = !DILocation(line: 868, column: 7, scope: !882)
!882 = distinct !DILexicalBlock(scope: !877, file: !69, line: 863, column: 5)
!883 = !DILocation(line: 870, column: 5, scope: !882)
!884 = !DILocation(line: 875, column: 3, scope: !856)
!885 = !DILocation(line: 877, column: 3, scope: !856)
!886 = !DILocation(line: 879, column: 1, scope: !856)
!887 = !DISubprogram(name: "exit", scope: !888, file: !888, line: 624, type: !712, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !732)
!888 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!889 = !DISubprogram(name: "setlocale", scope: !890, file: !890, line: 122, type: !891, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!890 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!891 = !DISubroutineType(types: !892)
!892 = !{!93, !95, !72}
!893 = !DISubprogram(name: "strncmp", scope: !894, file: !894, line: 159, type: !895, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!894 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!895 = !DISubroutineType(types: !896)
!896 = !{!95, !72, !72, !97}
!897 = !DISubprogram(name: "fputs_unlocked", scope: !898, file: !898, line: 691, type: !899, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!898 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!899 = !DISubroutineType(types: !900)
!900 = !{!95, !737, !901}
!901 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !230)
!902 = !DISubprogram(name: "getenv", scope: !888, file: !888, line: 641, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!903 = !DISubroutineType(types: !904)
!904 = !{!93, !72}
!905 = !DISubprogram(name: "strcmp", scope: !894, file: !894, line: 156, type: !906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!906 = !DISubroutineType(types: !907)
!907 = !{!95, !72, !72}
!908 = !DISubprogram(name: "strspn", scope: !894, file: !894, line: 297, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!909 = !DISubroutineType(types: !910)
!910 = !{!99, !72, !72}
!911 = !DISubprogram(name: "strchr", scope: !894, file: !894, line: 246, type: !912, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!912 = !DISubroutineType(types: !913)
!913 = !{!93, !72, !95}
!914 = !DISubprogram(name: "__ctype_b_loc", scope: !77, file: !77, line: 79, type: !915, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!915 = !DISubroutineType(types: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!920 = !DISubprogram(name: "strcspn", scope: !894, file: !894, line: 293, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!921 = !DISubprogram(name: "fwrite_unlocked", scope: !898, file: !898, line: 704, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!922 = !DISubroutineType(types: !923)
!923 = !{!97, !924, !97, !97, !901}
!924 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!927 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !928, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !931)
!928 = !DISubroutineType(types: !929)
!929 = !{!95, !95, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!931 = !{!932, !933}
!932 = !DILocalVariable(name: "argc", arg: 1, scope: !927, file: !2, line: 55, type: !95)
!933 = !DILocalVariable(name: "argv", arg: 2, scope: !927, file: !2, line: 55, type: !930)
!934 = !DILocation(line: 0, scope: !927)
!935 = !DILocation(line: 59, column: 12, scope: !936)
!936 = distinct !DILexicalBlock(scope: !927, file: !2, line: 59, column: 7)
!937 = !DILocation(line: 59, column: 7, scope: !927)
!938 = !DILocation(line: 62, column: 25, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !2, line: 60, column: 5)
!940 = !DILocation(line: 62, column: 7, scope: !939)
!941 = !DILocation(line: 63, column: 7, scope: !939)
!942 = !DILocation(line: 64, column: 7, scope: !939)
!943 = !DILocation(line: 65, column: 7, scope: !939)
!944 = !DILocation(line: 69, column: 7, scope: !939)
!945 = !DILocation(line: 71, column: 18, scope: !946)
!946 = distinct !DILexicalBlock(scope: !939, file: !2, line: 71, column: 11)
!947 = !DILocation(line: 0, scope: !752, inlinedAt: !948)
!948 = distinct !DILocation(line: 71, column: 11, scope: !946)
!949 = !DILocation(line: 1361, column: 11, scope: !752, inlinedAt: !948)
!950 = !DILocation(line: 1361, column: 10, scope: !752, inlinedAt: !948)
!951 = !DILocation(line: 71, column: 11, scope: !939)
!952 = !DILocation(line: 72, column: 9, scope: !946)
!953 = !DILocation(line: 0, scope: !752, inlinedAt: !954)
!954 = distinct !DILocation(line: 74, column: 11, scope: !955)
!955 = distinct !DILexicalBlock(scope: !939, file: !2, line: 74, column: 11)
!956 = !DILocation(line: 1361, column: 11, scope: !752, inlinedAt: !954)
!957 = !DILocation(line: 1361, column: 10, scope: !752, inlinedAt: !954)
!958 = !DILocation(line: 74, column: 11, scope: !939)
!959 = !DILocation(line: 75, column: 22, scope: !955)
!960 = !DILocation(line: 75, column: 58, scope: !955)
!961 = !DILocation(line: 75, column: 67, scope: !955)
!962 = !DILocation(line: 75, column: 9, scope: !955)
!963 = !DILocation(line: 79, column: 3, scope: !927)
!964 = !DISubprogram(name: "bindtextdomain", scope: !729, file: !729, line: 86, type: !965, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!965 = !DISubroutineType(types: !966)
!966 = !{!93, !72, !72}
!967 = !DISubprogram(name: "textdomain", scope: !729, file: !729, line: 82, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!968 = !DISubprogram(name: "atexit", scope: !888, file: !888, line: 602, type: !969, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!969 = !DISubroutineType(types: !970)
!970 = !{!95, !359}
!971 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !298, file: !298, line: 50, type: !972, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !973)
!972 = !DISubroutineType(types: !858)
!973 = !{!974}
!974 = !DILocalVariable(name: "file", arg: 1, scope: !971, file: !298, line: 50, type: !72)
!975 = !DILocation(line: 0, scope: !971)
!976 = !DILocation(line: 52, column: 13, scope: !971)
!977 = !DILocation(line: 53, column: 1, scope: !971)
!978 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !298, file: !298, line: 87, type: !979, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !981)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !217}
!981 = !{!982}
!982 = !DILocalVariable(name: "ignore", arg: 1, scope: !978, file: !298, line: 87, type: !217)
!983 = !DILocation(line: 0, scope: !978)
!984 = !DILocation(line: 89, column: 16, scope: !978)
!985 = !{!986, !986, i64 0}
!986 = !{!"_Bool", !720, i64 0}
!987 = !DILocation(line: 90, column: 1, scope: !978)
!988 = distinct !DISubprogram(name: "close_stdout", scope: !298, file: !298, line: 116, type: !360, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !989)
!989 = !{!990}
!990 = !DILocalVariable(name: "write_error", scope: !991, file: !298, line: 121, type: !72)
!991 = distinct !DILexicalBlock(scope: !992, file: !298, line: 120, column: 5)
!992 = distinct !DILexicalBlock(scope: !988, file: !298, line: 118, column: 7)
!993 = !DILocation(line: 118, column: 21, scope: !992)
!994 = !DILocation(line: 118, column: 7, scope: !992)
!995 = !DILocation(line: 118, column: 29, scope: !992)
!996 = !DILocation(line: 119, column: 7, scope: !992)
!997 = !DILocation(line: 119, column: 12, scope: !992)
!998 = !{i8 0, i8 2}
!999 = !DILocation(line: 119, column: 25, scope: !992)
!1000 = !DILocation(line: 119, column: 28, scope: !992)
!1001 = !DILocation(line: 119, column: 34, scope: !992)
!1002 = !DILocation(line: 118, column: 7, scope: !988)
!1003 = !DILocation(line: 121, column: 33, scope: !991)
!1004 = !DILocation(line: 0, scope: !991)
!1005 = !DILocation(line: 122, column: 11, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !991, file: !298, line: 122, column: 11)
!1007 = !DILocation(line: 0, scope: !1006)
!1008 = !DILocation(line: 122, column: 11, scope: !991)
!1009 = !DILocation(line: 123, column: 9, scope: !1006)
!1010 = !DILocation(line: 126, column: 9, scope: !1006)
!1011 = !DILocation(line: 128, column: 14, scope: !991)
!1012 = !DILocation(line: 128, column: 7, scope: !991)
!1013 = !DILocation(line: 133, column: 42, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !988, file: !298, line: 133, column: 7)
!1015 = !DILocation(line: 133, column: 28, scope: !1014)
!1016 = !DILocation(line: 133, column: 50, scope: !1014)
!1017 = !DILocation(line: 133, column: 7, scope: !988)
!1018 = !DILocation(line: 134, column: 12, scope: !1014)
!1019 = !DILocation(line: 134, column: 5, scope: !1014)
!1020 = !DILocation(line: 135, column: 1, scope: !988)
!1021 = !DISubprogram(name: "__errno_location", scope: !1022, file: !1022, line: 37, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1022 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!1026 = !DISubprogram(name: "_exit", scope: !1027, file: !1027, line: 624, type: !712, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1027 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1028 = distinct !DISubprogram(name: "verror", scope: !313, file: !313, line: 251, type: !1029, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !95, !95, !72, !323}
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DILocalVariable(name: "status", arg: 1, scope: !1028, file: !313, line: 251, type: !95)
!1033 = !DILocalVariable(name: "errnum", arg: 2, scope: !1028, file: !313, line: 251, type: !95)
!1034 = !DILocalVariable(name: "message", arg: 3, scope: !1028, file: !313, line: 251, type: !72)
!1035 = !DILocalVariable(name: "args", arg: 4, scope: !1028, file: !313, line: 251, type: !323)
!1036 = !DILocation(line: 0, scope: !1028)
!1037 = !DILocation(line: 261, column: 3, scope: !1028)
!1038 = !DILocation(line: 265, column: 7, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1028, file: !313, line: 265, column: 7)
!1040 = !DILocation(line: 265, column: 7, scope: !1028)
!1041 = !DILocation(line: 266, column: 5, scope: !1039)
!1042 = !DILocation(line: 272, column: 7, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !313, line: 268, column: 5)
!1044 = !DILocation(line: 276, column: 3, scope: !1028)
!1045 = !DILocation(line: 282, column: 1, scope: !1028)
!1046 = distinct !DISubprogram(name: "flush_stdout", scope: !313, file: !313, line: 163, type: !360, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1047)
!1047 = !{!1048}
!1048 = !DILocalVariable(name: "stdout_fd", scope: !1046, file: !313, line: 166, type: !95)
!1049 = !DILocation(line: 0, scope: !1046)
!1050 = !DILocalVariable(name: "fd", arg: 1, scope: !1051, file: !313, line: 145, type: !95)
!1051 = distinct !DISubprogram(name: "is_open", scope: !313, file: !313, line: 145, type: !1052, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1054)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!95, !95}
!1054 = !{!1050}
!1055 = !DILocation(line: 0, scope: !1051, inlinedAt: !1056)
!1056 = distinct !DILocation(line: 182, column: 25, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1046, file: !313, line: 182, column: 7)
!1058 = !DILocation(line: 157, column: 15, scope: !1051, inlinedAt: !1056)
!1059 = !DILocation(line: 157, column: 12, scope: !1051, inlinedAt: !1056)
!1060 = !DILocation(line: 182, column: 7, scope: !1046)
!1061 = !DILocation(line: 184, column: 5, scope: !1057)
!1062 = !DILocation(line: 185, column: 1, scope: !1046)
!1063 = !DISubprogram(name: "__fprintf_chk", scope: !734, file: !734, line: 93, type: !1064, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!95, !1066, !95, !737, null}
!1066 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1069, file: !234, line: 51, baseType: !95, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1069, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1069, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1069, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1069, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1069, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1069, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1069, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1069, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1069, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1069, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1069, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1069, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1069, file: !234, line: 70, baseType: !1085, size: 64, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1069, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1069, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1069, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1069, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1069, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1069, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1069, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1069, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1069, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1069, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1069, file: !234, line: 93, baseType: !1085, size: 64, offset: 1344)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1069, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1069, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1069, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1069, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!1101 = distinct !DISubprogram(name: "error_tail", scope: !313, file: !313, line: 219, type: !1029, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1102)
!1102 = !{!1103, !1104, !1105, !1106}
!1103 = !DILocalVariable(name: "status", arg: 1, scope: !1101, file: !313, line: 219, type: !95)
!1104 = !DILocalVariable(name: "errnum", arg: 2, scope: !1101, file: !313, line: 219, type: !95)
!1105 = !DILocalVariable(name: "message", arg: 3, scope: !1101, file: !313, line: 219, type: !72)
!1106 = !DILocalVariable(name: "args", arg: 4, scope: !1101, file: !313, line: 219, type: !323)
!1107 = !DILocation(line: 0, scope: !1101)
!1108 = !DILocation(line: 229, column: 13, scope: !1101)
!1109 = !DILocalVariable(name: "__stream", arg: 1, scope: !1110, file: !734, line: 132, type: !1066)
!1110 = distinct !DISubprogram(name: "vfprintf", scope: !734, file: !734, line: 132, type: !1111, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1113)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!95, !1066, !737, !323}
!1113 = !{!1109, !1114, !1115}
!1114 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1110, file: !734, line: 133, type: !737)
!1115 = !DILocalVariable(name: "__ap", arg: 3, scope: !1110, file: !734, line: 133, type: !323)
!1116 = !DILocation(line: 0, scope: !1110, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 229, column: 3, scope: !1101)
!1118 = !DILocation(line: 135, column: 10, scope: !1110, inlinedAt: !1117)
!1119 = !DILocation(line: 232, column: 3, scope: !1101)
!1120 = !DILocation(line: 233, column: 7, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1101, file: !313, line: 233, column: 7)
!1122 = !DILocation(line: 233, column: 7, scope: !1101)
!1123 = !DILocalVariable(name: "errnum", arg: 1, scope: !1124, file: !313, line: 188, type: !95)
!1124 = distinct !DISubprogram(name: "print_errno_message", scope: !313, file: !313, line: 188, type: !712, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1125)
!1125 = !{!1123, !1126, !1127}
!1126 = !DILocalVariable(name: "s", scope: !1124, file: !313, line: 190, type: !72)
!1127 = !DILocalVariable(name: "errbuf", scope: !1124, file: !313, line: 193, type: !1128)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 1024)
!1131 = !DILocation(line: 0, scope: !1124, inlinedAt: !1132)
!1132 = distinct !DILocation(line: 234, column: 5, scope: !1121)
!1133 = !DILocation(line: 193, column: 3, scope: !1124, inlinedAt: !1132)
!1134 = !DILocation(line: 193, column: 8, scope: !1124, inlinedAt: !1132)
!1135 = !DILocation(line: 195, column: 7, scope: !1124, inlinedAt: !1132)
!1136 = !DILocation(line: 207, column: 9, scope: !1137, inlinedAt: !1132)
!1137 = distinct !DILexicalBlock(scope: !1124, file: !313, line: 207, column: 7)
!1138 = !DILocation(line: 207, column: 7, scope: !1124, inlinedAt: !1132)
!1139 = !DILocation(line: 208, column: 9, scope: !1137, inlinedAt: !1132)
!1140 = !DILocation(line: 208, column: 5, scope: !1137, inlinedAt: !1132)
!1141 = !DILocation(line: 214, column: 3, scope: !1124, inlinedAt: !1132)
!1142 = !DILocation(line: 216, column: 1, scope: !1124, inlinedAt: !1132)
!1143 = !DILocation(line: 234, column: 5, scope: !1121)
!1144 = !DILocation(line: 238, column: 3, scope: !1101)
!1145 = !DILocalVariable(name: "__c", arg: 1, scope: !1146, file: !1147, line: 101, type: !95)
!1146 = distinct !DISubprogram(name: "putc_unlocked", scope: !1147, file: !1147, line: 101, type: !1148, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1150)
!1147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!95, !95, !1067}
!1150 = !{!1145, !1151}
!1151 = !DILocalVariable(name: "__stream", arg: 2, scope: !1146, file: !1147, line: 101, type: !1067)
!1152 = !DILocation(line: 0, scope: !1146, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 238, column: 3, scope: !1101)
!1154 = !DILocation(line: 103, column: 10, scope: !1146, inlinedAt: !1153)
!1155 = !{!1156, !719, i64 40}
!1156 = !{!"_IO_FILE", !741, i64 0, !719, i64 8, !719, i64 16, !719, i64 24, !719, i64 32, !719, i64 40, !719, i64 48, !719, i64 56, !719, i64 64, !719, i64 72, !719, i64 80, !719, i64 88, !719, i64 96, !719, i64 104, !741, i64 112, !741, i64 116, !1157, i64 120, !782, i64 128, !720, i64 130, !720, i64 131, !719, i64 136, !1157, i64 144, !719, i64 152, !719, i64 160, !719, i64 168, !719, i64 176, !1157, i64 184, !741, i64 192, !720, i64 196}
!1157 = !{!"long", !720, i64 0}
!1158 = !{!1156, !719, i64 48}
!1159 = !{!"branch_weights", i32 2000, i32 1}
!1160 = !DILocation(line: 240, column: 3, scope: !1101)
!1161 = !DILocation(line: 241, column: 7, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1101, file: !313, line: 241, column: 7)
!1163 = !DILocation(line: 241, column: 7, scope: !1101)
!1164 = !DILocation(line: 242, column: 5, scope: !1162)
!1165 = !DILocation(line: 243, column: 1, scope: !1101)
!1166 = !DISubprogram(name: "__vfprintf_chk", scope: !734, file: !734, line: 96, type: !1167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!95, !1066, !95, !737, !323}
!1169 = !DISubprogram(name: "strerror_r", scope: !894, file: !894, line: 444, type: !1170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!93, !95, !93, !97}
!1172 = !DISubprogram(name: "__overflow", scope: !898, file: !898, line: 886, type: !1173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!95, !1067, !95}
!1175 = !DISubprogram(name: "fflush_unlocked", scope: !898, file: !898, line: 239, type: !1176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!95, !1067}
!1178 = !DISubprogram(name: "fcntl", scope: !1179, file: !1179, line: 149, type: !1180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1179 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!95, !95, !95, null}
!1182 = distinct !DISubprogram(name: "error", scope: !313, file: !313, line: 285, type: !1183, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1185)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{null, !95, !95, !72, null}
!1185 = !{!1186, !1187, !1188, !1189}
!1186 = !DILocalVariable(name: "status", arg: 1, scope: !1182, file: !313, line: 285, type: !95)
!1187 = !DILocalVariable(name: "errnum", arg: 2, scope: !1182, file: !313, line: 285, type: !95)
!1188 = !DILocalVariable(name: "message", arg: 3, scope: !1182, file: !313, line: 285, type: !72)
!1189 = !DILocalVariable(name: "ap", scope: !1182, file: !313, line: 287, type: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !898, line: 52, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1192, line: 14, baseType: !1193)
!1192 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !327, baseType: !1194)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 192, elements: !37)
!1195 = !DILocation(line: 0, scope: !1182)
!1196 = !DILocation(line: 287, column: 3, scope: !1182)
!1197 = !DILocation(line: 287, column: 11, scope: !1182)
!1198 = !DILocation(line: 288, column: 3, scope: !1182)
!1199 = !DILocation(line: 289, column: 3, scope: !1182)
!1200 = !DILocation(line: 290, column: 3, scope: !1182)
!1201 = !DILocation(line: 291, column: 1, scope: !1182)
!1202 = !DILocation(line: 0, scope: !320)
!1203 = !DILocation(line: 302, column: 7, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !320, file: !313, line: 302, column: 7)
!1205 = !DILocation(line: 302, column: 7, scope: !320)
!1206 = !DILocation(line: 307, column: 11, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !313, line: 307, column: 11)
!1208 = distinct !DILexicalBlock(scope: !1204, file: !313, line: 303, column: 5)
!1209 = !DILocation(line: 307, column: 27, scope: !1207)
!1210 = !DILocation(line: 308, column: 11, scope: !1207)
!1211 = !DILocation(line: 308, column: 28, scope: !1207)
!1212 = !DILocation(line: 308, column: 25, scope: !1207)
!1213 = !DILocation(line: 309, column: 15, scope: !1207)
!1214 = !DILocation(line: 309, column: 33, scope: !1207)
!1215 = !DILocation(line: 310, column: 19, scope: !1207)
!1216 = !DILocation(line: 311, column: 22, scope: !1207)
!1217 = !DILocation(line: 311, column: 56, scope: !1207)
!1218 = !DILocation(line: 307, column: 11, scope: !1208)
!1219 = !DILocation(line: 316, column: 21, scope: !1208)
!1220 = !DILocation(line: 317, column: 23, scope: !1208)
!1221 = !DILocation(line: 318, column: 5, scope: !1208)
!1222 = !DILocation(line: 327, column: 3, scope: !320)
!1223 = !DILocation(line: 331, column: 7, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !320, file: !313, line: 331, column: 7)
!1225 = !DILocation(line: 331, column: 7, scope: !320)
!1226 = !DILocation(line: 332, column: 5, scope: !1224)
!1227 = !DILocation(line: 338, column: 7, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1224, file: !313, line: 334, column: 5)
!1229 = !DILocation(line: 346, column: 3, scope: !320)
!1230 = !DILocation(line: 350, column: 3, scope: !320)
!1231 = !DILocation(line: 356, column: 1, scope: !320)
!1232 = distinct !DISubprogram(name: "error_at_line", scope: !313, file: !313, line: 359, type: !1233, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1235)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !95, !95, !72, !78, !72, null}
!1235 = !{!1236, !1237, !1238, !1239, !1240, !1241}
!1236 = !DILocalVariable(name: "status", arg: 1, scope: !1232, file: !313, line: 359, type: !95)
!1237 = !DILocalVariable(name: "errnum", arg: 2, scope: !1232, file: !313, line: 359, type: !95)
!1238 = !DILocalVariable(name: "file_name", arg: 3, scope: !1232, file: !313, line: 359, type: !72)
!1239 = !DILocalVariable(name: "line_number", arg: 4, scope: !1232, file: !313, line: 360, type: !78)
!1240 = !DILocalVariable(name: "message", arg: 5, scope: !1232, file: !313, line: 360, type: !72)
!1241 = !DILocalVariable(name: "ap", scope: !1232, file: !313, line: 362, type: !1190)
!1242 = !DILocation(line: 0, scope: !1232)
!1243 = !DILocation(line: 362, column: 3, scope: !1232)
!1244 = !DILocation(line: 362, column: 11, scope: !1232)
!1245 = !DILocation(line: 363, column: 3, scope: !1232)
!1246 = !DILocation(line: 364, column: 3, scope: !1232)
!1247 = !DILocation(line: 366, column: 3, scope: !1232)
!1248 = !DILocation(line: 367, column: 1, scope: !1232)
!1249 = distinct !DISubprogram(name: "getprogname", scope: !641, file: !641, line: 54, type: !1250, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !640, retainedNodes: !732)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!72}
!1252 = !DILocation(line: 58, column: 10, scope: !1249)
!1253 = !DILocation(line: 58, column: 3, scope: !1249)
!1254 = distinct !DISubprogram(name: "set_program_name", scope: !365, file: !365, line: 37, type: !972, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !364, retainedNodes: !1255)
!1255 = !{!1256, !1257, !1258}
!1256 = !DILocalVariable(name: "argv0", arg: 1, scope: !1254, file: !365, line: 37, type: !72)
!1257 = !DILocalVariable(name: "slash", scope: !1254, file: !365, line: 44, type: !72)
!1258 = !DILocalVariable(name: "base", scope: !1254, file: !365, line: 45, type: !72)
!1259 = !DILocation(line: 0, scope: !1254)
!1260 = !DILocation(line: 44, column: 23, scope: !1254)
!1261 = !DILocation(line: 45, column: 22, scope: !1254)
!1262 = !DILocation(line: 46, column: 17, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1254, file: !365, line: 46, column: 7)
!1264 = !DILocation(line: 46, column: 9, scope: !1263)
!1265 = !DILocation(line: 46, column: 25, scope: !1263)
!1266 = !DILocation(line: 46, column: 40, scope: !1263)
!1267 = !DILocalVariable(name: "__s1", arg: 1, scope: !1268, file: !753, line: 974, type: !925)
!1268 = distinct !DISubprogram(name: "memeq", scope: !753, file: !753, line: 974, type: !1269, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !364, retainedNodes: !1271)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!217, !925, !925, !97}
!1271 = !{!1267, !1272, !1273}
!1272 = !DILocalVariable(name: "__s2", arg: 2, scope: !1268, file: !753, line: 974, type: !925)
!1273 = !DILocalVariable(name: "__n", arg: 3, scope: !1268, file: !753, line: 974, type: !97)
!1274 = !DILocation(line: 0, scope: !1268, inlinedAt: !1275)
!1275 = distinct !DILocation(line: 46, column: 28, scope: !1263)
!1276 = !DILocation(line: 976, column: 11, scope: !1268, inlinedAt: !1275)
!1277 = !DILocation(line: 976, column: 10, scope: !1268, inlinedAt: !1275)
!1278 = !DILocation(line: 46, column: 7, scope: !1254)
!1279 = !DILocation(line: 49, column: 11, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1281, file: !365, line: 49, column: 11)
!1281 = distinct !DILexicalBlock(scope: !1263, file: !365, line: 47, column: 5)
!1282 = !DILocation(line: 49, column: 36, scope: !1280)
!1283 = !DILocation(line: 49, column: 11, scope: !1281)
!1284 = !DILocation(line: 65, column: 16, scope: !1254)
!1285 = !DILocation(line: 71, column: 27, scope: !1254)
!1286 = !DILocation(line: 74, column: 33, scope: !1254)
!1287 = !DILocation(line: 76, column: 1, scope: !1254)
!1288 = !DISubprogram(name: "strrchr", scope: !894, file: !894, line: 273, type: !912, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !732)
!1289 = !DILocation(line: 0, scope: !374)
!1290 = !DILocation(line: 40, column: 29, scope: !374)
!1291 = !DILocation(line: 41, column: 19, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !374, file: !375, line: 41, column: 7)
!1293 = !DILocation(line: 41, column: 7, scope: !374)
!1294 = !DILocation(line: 47, column: 3, scope: !374)
!1295 = !DILocation(line: 48, column: 3, scope: !374)
!1296 = !DILocation(line: 48, column: 13, scope: !374)
!1297 = !DILocalVariable(name: "ps", arg: 1, scope: !1298, file: !1299, line: 1135, type: !1302)
!1298 = distinct !DISubprogram(name: "mbszero", scope: !1299, file: !1299, line: 1135, type: !1300, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1303)
!1299 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1300 = !DISubroutineType(types: !1301)
!1301 = !{null, !1302}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!1303 = !{!1297}
!1304 = !DILocation(line: 0, scope: !1298, inlinedAt: !1305)
!1305 = distinct !DILocation(line: 48, column: 18, scope: !374)
!1306 = !DILocalVariable(name: "__dest", arg: 1, scope: !1307, file: !1308, line: 57, type: !94)
!1307 = distinct !DISubprogram(name: "memset", scope: !1308, file: !1308, line: 57, type: !1309, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1311)
!1308 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!94, !94, !95, !97}
!1311 = !{!1306, !1312, !1313}
!1312 = !DILocalVariable(name: "__ch", arg: 2, scope: !1307, file: !1308, line: 57, type: !95)
!1313 = !DILocalVariable(name: "__len", arg: 3, scope: !1307, file: !1308, line: 57, type: !97)
!1314 = !DILocation(line: 0, scope: !1307, inlinedAt: !1315)
!1315 = distinct !DILocation(line: 1137, column: 3, scope: !1298, inlinedAt: !1305)
!1316 = !DILocation(line: 59, column: 10, scope: !1307, inlinedAt: !1315)
!1317 = !DILocation(line: 49, column: 7, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !374, file: !375, line: 49, column: 7)
