; ModuleID = 'src/truncate.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... FILE...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [275 x i8] c"Shrink or extend the size of each FILE to the specified size\0A\0AA FILE argument that does not exist is created.\0A\0AIf a FILE is larger than the specified size, the extra data is lost.\0AIf a FILE is shorter, it is extended and the sparse extended part (hole)\0Areads as zero bytes.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [9 x i8] c"truncate\00", align 1, !dbg !17

!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 308, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 32)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 308, type: !180, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 21)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !154, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 26)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 367, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 27)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 19)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "no_create", scope: !76, file: !2, line: 39, type: !137, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "block_mode", scope: !76, file: !2, line: 42, type: !137, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "ref_file", scope: !76, file: !2, line: 45, type: !134, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !103, line: 736, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 75)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !227, file: !103, line: 575, type: !104, isLocal: true, isDefinition: true)
!227 = distinct !DISubprogram(name: "oputs_", scope: !103, file: !103, line: 573, type: !228, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !230)
!228 = !DISubroutineType(cc: DW_CC_nocall, types: !229)
!229 = !{null, !134, !134}
!230 = !{!231, !232, !233, !236, !237, !238, !239, !243, !244, !245, !246, !248, !298, !299, !300, !302, !303}
!231 = !DILocalVariable(name: "program", arg: 1, scope: !227, file: !103, line: 573, type: !134)
!232 = !DILocalVariable(name: "option", arg: 2, scope: !227, file: !103, line: 573, type: !134)
!233 = !DILocalVariable(name: "term", scope: !234, file: !103, line: 585, type: !134)
!234 = distinct !DILexicalBlock(scope: !235, file: !103, line: 582, column: 5)
!235 = distinct !DILexicalBlock(scope: !227, file: !103, line: 581, column: 7)
!236 = !DILocalVariable(name: "double_space", scope: !227, file: !103, line: 594, type: !137)
!237 = !DILocalVariable(name: "first_word", scope: !227, file: !103, line: 595, type: !134)
!238 = !DILocalVariable(name: "option_text", scope: !227, file: !103, line: 596, type: !134)
!239 = !DILocalVariable(name: "s", scope: !240, file: !103, line: 608, type: !134)
!240 = distinct !DILexicalBlock(scope: !241, file: !103, line: 605, column: 5)
!241 = distinct !DILexicalBlock(scope: !242, file: !103, line: 604, column: 12)
!242 = distinct !DILexicalBlock(scope: !227, file: !103, line: 597, column: 7)
!243 = !DILocalVariable(name: "spaces", scope: !240, file: !103, line: 609, type: !131)
!244 = !DILocalVariable(name: "anchor_len", scope: !227, file: !103, line: 620, type: !131)
!245 = !DILocalVariable(name: "desc_text", scope: !227, file: !103, line: 625, type: !134)
!246 = !DILocalVariable(name: "__ptr", scope: !247, file: !103, line: 644, type: !134)
!247 = distinct !DILexicalBlock(scope: !227, file: !103, line: 644, column: 3)
!248 = !DILocalVariable(name: "__stream", scope: !247, file: !103, line: 644, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !251, line: 7, baseType: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !253, line: 49, size: 1728, elements: !254)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !270, !272, !273, !274, !275, !276, !278, !279, !282, !284, !287, !290, !291, !292, !293, !294}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !252, file: !253, line: 51, baseType: !104, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !252, file: !253, line: 54, baseType: !129, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !252, file: !253, line: 55, baseType: !129, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !252, file: !253, line: 56, baseType: !129, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !252, file: !253, line: 57, baseType: !129, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !252, file: !253, line: 58, baseType: !129, size: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !252, file: !253, line: 59, baseType: !129, size: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !252, file: !253, line: 60, baseType: !129, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !252, file: !253, line: 61, baseType: !129, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !252, file: !253, line: 64, baseType: !129, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !252, file: !253, line: 65, baseType: !129, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !252, file: !253, line: 66, baseType: !129, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !252, file: !253, line: 68, baseType: !268, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !253, line: 36, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !252, file: !253, line: 70, baseType: !271, size: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !252, file: !253, line: 72, baseType: !104, size: 32, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !252, file: !253, line: 73, baseType: !104, size: 32, offset: 928)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !252, file: !253, line: 74, baseType: !126, size: 64, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !252, file: !253, line: 77, baseType: !123, size: 16, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !252, file: !253, line: 78, baseType: !277, size: 8, offset: 1040)
!277 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !252, file: !253, line: 79, baseType: !56, size: 8, offset: 1048)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !252, file: !253, line: 81, baseType: !280, size: 64, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !253, line: 43, baseType: null)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !252, file: !253, line: 89, baseType: !283, size: 64, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !127, line: 153, baseType: !128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !252, file: !253, line: 91, baseType: !285, size: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !253, line: 37, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !252, file: !253, line: 92, baseType: !288, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !253, line: 38, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !252, file: !253, line: 93, baseType: !271, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !252, file: !253, line: 94, baseType: !130, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !252, file: !253, line: 95, baseType: !131, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !252, file: !253, line: 96, baseType: !104, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !252, file: !253, line: 98, baseType: !295, size: 160, offset: 1568)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 20)
!298 = !DILocalVariable(name: "__cnt", scope: !247, file: !103, line: 644, type: !131)
!299 = !DILocalVariable(name: "url_program", scope: !227, file: !103, line: 648, type: !134)
!300 = !DILocalVariable(name: "__ptr", scope: !301, file: !103, line: 686, type: !134)
!301 = distinct !DILexicalBlock(scope: !227, file: !103, line: 686, column: 3)
!302 = !DILocalVariable(name: "__stream", scope: !301, file: !103, line: 686, type: !249)
!303 = !DILocalVariable(name: "__cnt", scope: !301, file: !103, line: 686, type: !131)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !103, line: 585, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 5)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !103, line: 586, type: !306, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !103, line: 595, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 4)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !103, line: 620, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 6)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !103, line: 648, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 2)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !103, line: 648, type: !306, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !103, line: 649, type: !313, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !103, line: 649, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 3)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !103, line: 650, type: !306, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !103, line: 651, type: !318, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !103, line: 651, type: !318, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !103, line: 652, type: !71, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !103, line: 653, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !103, line: 654, type: !61, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !103, line: 655, type: !61, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !103, line: 656, type: !61, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !103, line: 657, type: !61, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !103, line: 663, type: !71, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !103, line: 664, type: !61, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !103, line: 669, type: !159, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !103, line: 669, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 40)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !103, line: 676, type: !154, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !103, line: 676, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 61)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !103, line: 679, type: !332, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !103, line: 683, type: !306, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !103, line: 688, type: !306, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !103, line: 691, type: !345, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !103, line: 744, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 216)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !103, line: 839, type: !149, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !103, line: 840, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 22)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !103, line: 841, type: !154, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !103, line: 862, type: !313, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !103, line: 868, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 71)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !103, line: 875, type: !206, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !103, line: 877, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 51)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !103, line: 877, type: !180, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !61, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !61, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !61, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !306, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !306, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !345, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !149, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 46)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 42)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 179, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 35)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !438, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1792, elements: !72)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !446, line: 50, size: 256, elements: !447)
!446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!447 = !{!448, !449, !450, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !446, line: 52, baseType: !134, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !445, file: !446, line: 55, baseType: !104, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !446, line: 56, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !445, file: !446, line: 57, baseType: !104, size: 32, offset: 192)
!453 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!454 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !457, line: 3, type: !154, isLocal: true, isDefinition: true)
!457 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "Version", scope: !460, file: !457, line: 3, type: !134, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !457, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !461, splitDebugInlining: false, nameTableKind: None)
!461 = !{!455, !458}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "file_name", scope: !464, file: !465, line: 45, type: !134, isLocal: true, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C11, file: !465, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !466, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!466 = !{!467, !469, !471, !473, !462, !475}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !71, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !180, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !465, line: 123, type: !71, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !465, line: 126, type: !332, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !464, file: !465, line: 55, type: !137, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !479, file: !480, line: 66, type: !523, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C11, file: !480, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!481 = !{!130, !136}
!482 = !{!483, !485, !505, !507, !509, !511, !477, !513, !515, !517, !519, !521}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !480, line: 272, type: !306, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "old_file_name", scope: !487, file: !480, line: 304, type: !134, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "verror_at_line", scope: !480, file: !480, line: 298, type: !488, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !498)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !104, !104, !134, !79, !134, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !492)
!492 = !{!493, !495, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !491, file: !494, baseType: !79, size: 32)
!494 = !DIFile(filename: "lib/error.c", directory: "/src")
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !491, file: !494, baseType: !79, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !491, file: !494, baseType: !130, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !491, file: !494, baseType: !130, size: 64, offset: 128)
!498 = !{!499, !500, !501, !502, !503, !504}
!499 = !DILocalVariable(name: "status", arg: 1, scope: !487, file: !480, line: 298, type: !104)
!500 = !DILocalVariable(name: "errnum", arg: 2, scope: !487, file: !480, line: 298, type: !104)
!501 = !DILocalVariable(name: "file_name", arg: 3, scope: !487, file: !480, line: 298, type: !134)
!502 = !DILocalVariable(name: "line_number", arg: 4, scope: !487, file: !480, line: 298, type: !79)
!503 = !DILocalVariable(name: "message", arg: 5, scope: !487, file: !480, line: 298, type: !134)
!504 = !DILocalVariable(name: "args", arg: 6, scope: !487, file: !480, line: 298, type: !490)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "old_line_number", scope: !487, file: !480, line: 305, type: !79, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !480, line: 338, type: !313, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !345, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !323, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "error_message_count", scope: !479, file: !480, line: 69, type: !79, isLocal: false, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !479, file: !480, line: 295, type: !104, isLocal: false, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !71, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !194, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !480, line: 214, type: !306, isLocal: true, isDefinition: true)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "program_name", scope: !528, file: !529, line: 31, type: !134, isLocal: false, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C11, file: !529, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !530, globals: !531, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!530 = !{!129}
!531 = !{!526, !532, !534}
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !529, line: 46, type: !345, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !529, line: 49, type: !313, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "utf07FF", scope: !538, file: !539, line: 46, type: !566, isLocal: true, isDefinition: true)
!538 = distinct !DISubprogram(name: "proper_name_lite", scope: !539, file: !539, line: 38, type: !540, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !542, retainedNodes: !544)
!539 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!540 = !DISubroutineType(types: !541)
!541 = !{!134, !134, !134}
!542 = distinct !DICompileUnit(language: DW_LANG_C11, file: !539, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !543, splitDebugInlining: false, nameTableKind: None)
!543 = !{!536}
!544 = !{!545, !546, !547, !548, !553}
!545 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !538, file: !539, line: 38, type: !134)
!546 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !538, file: !539, line: 38, type: !134)
!547 = !DILocalVariable(name: "translation", scope: !538, file: !539, line: 40, type: !134)
!548 = !DILocalVariable(name: "w", scope: !538, file: !539, line: 47, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !550, line: 37, baseType: !551)
!550 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !127, line: 57, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !127, line: 42, baseType: !79)
!553 = !DILocalVariable(name: "mbs", scope: !538, file: !539, line: 48, type: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !555, line: 6, baseType: !556)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !557, line: 21, baseType: !558)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 13, size: 64, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !558, file: !557, line: 15, baseType: !104, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !558, file: !557, line: 20, baseType: !562, size: 32, offset: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !557, line: 16, size: 32, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !562, file: !557, line: 18, baseType: !79, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !562, file: !557, line: 19, baseType: !313, size: 32)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 16, elements: !324)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !569, line: 78, type: !345, isLocal: true, isDefinition: true)
!569 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !569, line: 79, type: !318, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !569, line: 80, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 13)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !569, line: 81, type: !574, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !569, line: 82, type: !295, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !569, line: 83, type: !323, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !569, line: 84, type: !345, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !569, line: 85, type: !71, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !569, line: 86, type: !71, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !569, line: 87, type: !345, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !593, file: !569, line: 76, type: !665, isLocal: false, isDefinition: true)
!593 = distinct !DICompileUnit(language: DW_LANG_C11, file: !569, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !594, retainedTypes: !600, globals: !601, splitDebugInlining: false, nameTableKind: None)
!594 = !{!108, !595, !87}
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !109, line: 254, baseType: !79, size: 32, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!598 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!599 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!600 = !{!104, !123, !131}
!601 = !{!567, !570, !572, !577, !579, !581, !583, !585, !587, !589, !591, !602, !606, !616, !618, !623, !625, !627, !629, !631, !654, !661, !663}
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !593, file: !569, line: 92, type: !604, isLocal: false, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 320, elements: !62)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !593, file: !569, line: 1040, type: !608, isLocal: false, isDefinition: true)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !569, line: 56, size: 448, elements: !609)
!609 = !{!610, !611, !612, !614, !615}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !608, file: !569, line: 59, baseType: !108, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !569, line: 62, baseType: !104, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !608, file: !569, line: 66, baseType: !613, size: 256, offset: 64)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, elements: !346)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !608, file: !569, line: 69, baseType: !134, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !608, file: !569, line: 72, baseType: !134, size: 64, offset: 384)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !593, file: !569, line: 107, type: !608, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "slot0", scope: !593, file: !569, line: 831, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 256)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !569, line: 321, type: !323, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !569, line: 357, type: !323, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !569, line: 358, type: !323, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !569, line: 199, type: !71, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "quote", scope: !633, file: !569, line: 228, type: !652, isLocal: true, isDefinition: true)
!633 = distinct !DISubprogram(name: "gettext_quote", scope: !569, file: !569, line: 197, type: !634, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !593, retainedNodes: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{!134, !134, !108}
!636 = !{!637, !638, !639, !640, !641}
!637 = !DILocalVariable(name: "msgid", arg: 1, scope: !633, file: !569, line: 197, type: !134)
!638 = !DILocalVariable(name: "s", arg: 2, scope: !633, file: !569, line: 197, type: !108)
!639 = !DILocalVariable(name: "translation", scope: !633, file: !569, line: 199, type: !134)
!640 = !DILocalVariable(name: "w", scope: !633, file: !569, line: 229, type: !549)
!641 = !DILocalVariable(name: "mbs", scope: !633, file: !569, line: 230, type: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !555, line: 6, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !557, line: 21, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 13, size: 64, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !644, file: !557, line: 15, baseType: !104, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !644, file: !557, line: 20, baseType: !648, size: 32, offset: 32)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !557, line: 16, size: 32, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !648, file: !557, line: 18, baseType: !79, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !648, file: !557, line: 19, baseType: !313, size: 32)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !653)
!653 = !{!325, !315}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "slotvec", scope: !593, file: !569, line: 834, type: !656, isLocal: true, isDefinition: true)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !569, line: 823, size: 128, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !657, file: !569, line: 825, baseType: !131, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !657, file: !569, line: 826, baseType: !129, size: 64, offset: 64)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "nslots", scope: !593, file: !569, line: 832, type: !104, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "slotvec0", scope: !593, file: !569, line: 833, type: !657, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 704, elements: !667)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!667 = !{!668}
!668 = !DISubrange(count: 11)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !671, line: 67, type: !180, isLocal: true, isDefinition: true)
!671 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !671, line: 69, type: !71, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !671, line: 83, type: !71, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !671, line: 83, type: !313, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !671, line: 85, type: !323, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !671, line: 88, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 171)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !671, line: 88, type: !687, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 34)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !671, line: 105, type: !149, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !671, line: 109, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 23)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !671, line: 113, type: !699, isLocal: true, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 28)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !671, line: 120, type: !187, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !671, line: 127, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 36)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !671, line: 134, type: !364, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !671, line: 142, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 44)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !671, line: 150, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 48)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !671, line: 159, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 52)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !671, line: 170, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 60)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !671, line: 248, type: !295, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !671, line: 248, type: !391, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !671, line: 254, type: !295, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !671, line: 254, type: !164, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !671, line: 254, type: !364, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !671, line: 259, type: !3, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !671, line: 259, type: !9, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !747, file: !748, line: 26, type: !750, isLocal: false, isDefinition: true)
!747 = distinct !DICompileUnit(language: DW_LANG_C11, file: !748, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !749, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!749 = !{!745}
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 376, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 47)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "exit_failure", scope: !755, file: !756, line: 24, type: !758, isLocal: false, isDefinition: true)
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !757, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!757 = !{!753}
!758 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !761, line: 34, type: !332, isLocal: true, isDefinition: true)
!761 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !761, line: 34, type: !71, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !761, line: 34, type: !159, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !768, line: 80, type: !71, isLocal: true, isDefinition: true)
!768 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !771, line: 108, type: !56, isLocal: true, isDefinition: true)
!771 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "internal_state", scope: !774, file: !771, line: 97, type: !777, isLocal: true, isDefinition: true)
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !775, globals: !776, splitDebugInlining: false, nameTableKind: None)
!775 = !{!130, !131, !136}
!776 = !{!769, !772}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !555, line: 6, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !557, line: 21, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 13, size: 64, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !779, file: !557, line: 15, baseType: !104, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !779, file: !557, line: 20, baseType: !783, size: 32, offset: 32)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !779, file: !557, line: 16, size: 32, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !783, file: !557, line: 18, baseType: !79, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !783, file: !557, line: 19, baseType: !313, size: 32)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !789, line: 35, type: !318, isLocal: true, isDefinition: true)
!789 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!790 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!792 = distinct !DICompileUnit(language: DW_LANG_C11, file: !671, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !793, retainedTypes: !797, globals: !798, splitDebugInlining: false, nameTableKind: None)
!793 = !{!794}
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !671, line: 40, baseType: !79, size: 32, elements: !795)
!795 = !{!796}
!796 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!797 = !{!130}
!798 = !{!669, !672, !674, !676, !678, !680, !685, !690, !692, !697, !702, !704, !709, !711, !716, !721, !726, !731, !733, !735, !737, !739, !741, !743}
!799 = distinct !DICompileUnit(language: DW_LANG_C11, file: !800, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !801, retainedTypes: !832, splitDebugInlining: false, nameTableKind: None)
!800 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!801 = !{!802, !814}
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !803, file: !800, line: 188, baseType: !79, size: 32, elements: !812)
!803 = distinct !DISubprogram(name: "x2nrealloc", scope: !800, file: !800, line: 176, type: !804, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !799, retainedNodes: !807)
!804 = !DISubroutineType(types: !805)
!805 = !{!130, !130, !806, !131}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!807 = !{!808, !809, !810, !811}
!808 = !DILocalVariable(name: "p", arg: 1, scope: !803, file: !800, line: 176, type: !130)
!809 = !DILocalVariable(name: "pn", arg: 2, scope: !803, file: !800, line: 176, type: !806)
!810 = !DILocalVariable(name: "s", arg: 3, scope: !803, file: !800, line: 176, type: !131)
!811 = !DILocalVariable(name: "n", scope: !803, file: !800, line: 178, type: !131)
!812 = !{!813}
!813 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !815, file: !800, line: 228, baseType: !79, size: 32, elements: !812)
!815 = distinct !DISubprogram(name: "xpalloc", scope: !800, file: !800, line: 223, type: !816, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !799, retainedNodes: !822)
!816 = !DISubroutineType(types: !817)
!817 = !{!130, !130, !818, !819, !821, !819}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !820, line: 130, baseType: !821)
!820 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !132, line: 35, baseType: !128)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831}
!823 = !DILocalVariable(name: "pa", arg: 1, scope: !815, file: !800, line: 223, type: !130)
!824 = !DILocalVariable(name: "pn", arg: 2, scope: !815, file: !800, line: 223, type: !818)
!825 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !815, file: !800, line: 223, type: !819)
!826 = !DILocalVariable(name: "n_max", arg: 4, scope: !815, file: !800, line: 223, type: !821)
!827 = !DILocalVariable(name: "s", arg: 5, scope: !815, file: !800, line: 223, type: !819)
!828 = !DILocalVariable(name: "n0", scope: !815, file: !800, line: 230, type: !819)
!829 = !DILocalVariable(name: "n", scope: !815, file: !800, line: 237, type: !819)
!830 = !DILocalVariable(name: "nbytes", scope: !815, file: !800, line: 248, type: !819)
!831 = !DILocalVariable(name: "adjusted_nbytes", scope: !815, file: !800, line: 252, type: !819)
!832 = !{!129, !130, !137, !128, !133}
!833 = distinct !DICompileUnit(language: DW_LANG_C11, file: !761, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !834, splitDebugInlining: false, nameTableKind: None)
!834 = !{!759, !762, !764}
!835 = distinct !DICompileUnit(language: DW_LANG_C11, file: !836, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !837, globals: !853, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!837 = !{!838, !846}
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !839, line: 30, baseType: !79, size: 32, elements: !840)
!839 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!840 = !{!841, !842, !843, !844, !845}
!841 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!842 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!843 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!844 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!845 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !847, line: 24, baseType: !79, size: 32, elements: !848)
!847 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!848 = !{!849, !850, !851, !852}
!849 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!850 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!851 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!852 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!853 = !{!766}
!854 = distinct !DICompileUnit(language: DW_LANG_C11, file: !855, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !856, retainedTypes: !857, splitDebugInlining: false, nameTableKind: None)
!855 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!856 = !{!838}
!857 = !{!137, !128, !133, !138}
!858 = distinct !DICompileUnit(language: DW_LANG_C11, file: !859, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!860 = distinct !DICompileUnit(language: DW_LANG_C11, file: !861, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!862 = distinct !DICompileUnit(language: DW_LANG_C11, file: !863, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !797, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!864 = distinct !DICompileUnit(language: DW_LANG_C11, file: !865, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !797, splitDebugInlining: false, nameTableKind: None)
!865 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!866 = distinct !DICompileUnit(language: DW_LANG_C11, file: !867, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !868, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!868 = !{!137, !133, !130}
!869 = distinct !DICompileUnit(language: DW_LANG_C11, file: !789, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !870, splitDebugInlining: false, nameTableKind: None)
!870 = !{!871, !787}
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !789, line: 35, type: !323, isLocal: true, isDefinition: true)
!873 = distinct !DICompileUnit(language: DW_LANG_C11, file: !874, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!874 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!875 = distinct !DICompileUnit(language: DW_LANG_C11, file: !876, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !797, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!877 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!878 = !{i32 7, !"Dwarf Version", i32 5}
!879 = !{i32 2, !"Debug Info Version", i32 3}
!880 = !{i32 1, !"wchar_size", i32 4}
!881 = !{i32 8, !"PIC Level", i32 2}
!882 = !{i32 7, !"PIE Level", i32 2}
!883 = !{i32 7, !"uwtable", i32 2}
!884 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 62, type: !885, scopeLine: 63, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !887)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !104}
!887 = !{!888}
!888 = !DILocalVariable(name: "status", arg: 1, scope: !884, file: !2, line: 62, type: !104)
!889 = !DILocation(line: 0, scope: !884)
!890 = !DILocation(line: 64, column: 14, scope: !891)
!891 = distinct !DILexicalBlock(scope: !884, file: !2, line: 64, column: 7)
!892 = !DILocation(line: 64, column: 7, scope: !884)
!893 = !DILocation(line: 65, column: 5, scope: !894)
!894 = distinct !DILexicalBlock(scope: !891, file: !2, line: 65, column: 5)
!895 = !{!896, !896, i64 0}
!896 = !{!"any pointer", !897, i64 0}
!897 = !{!"omnipotent char", !898, i64 0}
!898 = !{!"Simple C/C++ TBAA"}
!899 = !DILocation(line: 68, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !891, file: !2, line: 67, column: 5)
!901 = !DILocation(line: 69, column: 7, scope: !900)
!902 = !DILocation(line: 736, column: 3, scope: !903, inlinedAt: !905)
!903 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !103, file: !103, line: 734, type: !524, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !904)
!904 = !{}
!905 = distinct !DILocation(line: 79, column: 7, scope: !900)
!906 = !DILocation(line: 81, column: 7, scope: !900)
!907 = !DILocation(line: 84, column: 7, scope: !900)
!908 = !DILocation(line: 87, column: 7, scope: !900)
!909 = !DILocation(line: 90, column: 7, scope: !900)
!910 = !DILocation(line: 93, column: 7, scope: !900)
!911 = !DILocation(line: 94, column: 7, scope: !900)
!912 = !DILocation(line: 744, column: 3, scope: !913, inlinedAt: !914)
!913 = distinct !DISubprogram(name: "emit_size_note", scope: !103, file: !103, line: 742, type: !524, scopeLine: 743, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !904)
!914 = distinct !DILocation(line: 95, column: 7, scope: !900)
!915 = !DILocation(line: 96, column: 7, scope: !900)
!916 = !DILocalVariable(name: "program", arg: 1, scope: !917, file: !103, line: 836, type: !134)
!917 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !103, file: !103, line: 836, type: !918, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !920)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !134}
!920 = !{!916, !921, !928, !929, !931, !932}
!921 = !DILocalVariable(name: "infomap", scope: !917, file: !103, line: 838, type: !922)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 896, elements: !72)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !917, file: !103, line: 838, size: 128, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !924, file: !103, line: 838, baseType: !134, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !924, file: !103, line: 838, baseType: !134, size: 64, offset: 64)
!928 = !DILocalVariable(name: "node", scope: !917, file: !103, line: 848, type: !134)
!929 = !DILocalVariable(name: "map_prog", scope: !917, file: !103, line: 849, type: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!931 = !DILocalVariable(name: "lc_messages", scope: !917, file: !103, line: 861, type: !134)
!932 = !DILocalVariable(name: "url_program", scope: !917, file: !103, line: 874, type: !134)
!933 = !DILocation(line: 0, scope: !917, inlinedAt: !934)
!934 = distinct !DILocation(line: 100, column: 7, scope: !900)
!935 = !DILocation(line: 857, column: 3, scope: !917, inlinedAt: !934)
!936 = !DILocation(line: 861, column: 29, scope: !917, inlinedAt: !934)
!937 = !DILocation(line: 862, column: 7, scope: !938, inlinedAt: !934)
!938 = distinct !DILexicalBlock(scope: !917, file: !103, line: 862, column: 7)
!939 = !DILocation(line: 862, column: 19, scope: !938, inlinedAt: !934)
!940 = !DILocation(line: 862, column: 22, scope: !938, inlinedAt: !934)
!941 = !DILocation(line: 862, column: 7, scope: !917, inlinedAt: !934)
!942 = !DILocation(line: 868, column: 7, scope: !943, inlinedAt: !934)
!943 = distinct !DILexicalBlock(scope: !938, file: !103, line: 863, column: 5)
!944 = !DILocation(line: 870, column: 5, scope: !943, inlinedAt: !934)
!945 = !DILocation(line: 875, column: 3, scope: !917, inlinedAt: !934)
!946 = !DILocation(line: 877, column: 3, scope: !917, inlinedAt: !934)
!947 = !DILocation(line: 102, column: 3, scope: !884)
!948 = !DISubprogram(name: "dcgettext", scope: !949, file: !949, line: 51, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!949 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!950 = !DISubroutineType(types: !951)
!951 = !{!129, !134, !134, !104}
!952 = !DISubprogram(name: "__fprintf_chk", scope: !953, file: !953, line: 93, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!953 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!954 = !DISubroutineType(types: !955)
!955 = !{!104, !956, !104, !957, null}
!956 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !249)
!957 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !134)
!958 = !DISubprogram(name: "__printf_chk", scope: !953, file: !953, line: 95, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!959 = !DISubroutineType(types: !960)
!960 = !{!104, !104, !957, null}
!961 = !DISubprogram(name: "fputs_unlocked", scope: !125, file: !125, line: 691, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!962 = !DISubroutineType(types: !963)
!963 = !{!104, !957, !956}
!964 = !DILocation(line: 0, scope: !227)
!965 = !DILocation(line: 581, column: 7, scope: !235)
!966 = !{!967, !967, i64 0}
!967 = !{!"int", !897, i64 0}
!968 = !DILocation(line: 581, column: 19, scope: !235)
!969 = !DILocation(line: 581, column: 7, scope: !227)
!970 = !DILocation(line: 585, column: 26, scope: !234)
!971 = !DILocation(line: 0, scope: !234)
!972 = !DILocation(line: 586, column: 23, scope: !234)
!973 = !DILocation(line: 586, column: 28, scope: !234)
!974 = !DILocation(line: 586, column: 32, scope: !234)
!975 = !{!897, !897, i64 0}
!976 = !DILocation(line: 586, column: 38, scope: !234)
!977 = !DILocalVariable(name: "__s1", arg: 1, scope: !978, file: !979, line: 1359, type: !134)
!978 = distinct !DISubprogram(name: "streq", scope: !979, file: !979, line: 1359, type: !980, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !982)
!979 = !DIFile(filename: "./lib/string.h", directory: "/src")
!980 = !DISubroutineType(types: !981)
!981 = !{!137, !134, !134}
!982 = !{!977, !983}
!983 = !DILocalVariable(name: "__s2", arg: 2, scope: !978, file: !979, line: 1359, type: !134)
!984 = !DILocation(line: 0, scope: !978, inlinedAt: !985)
!985 = distinct !DILocation(line: 586, column: 41, scope: !234)
!986 = !DILocation(line: 1361, column: 11, scope: !978, inlinedAt: !985)
!987 = !DILocation(line: 1361, column: 10, scope: !978, inlinedAt: !985)
!988 = !DILocation(line: 586, column: 19, scope: !234)
!989 = !DILocation(line: 587, column: 5, scope: !234)
!990 = !DILocation(line: 588, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !227, file: !103, line: 588, column: 7)
!992 = !DILocation(line: 588, column: 7, scope: !227)
!993 = !DILocation(line: 590, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !103, line: 589, column: 5)
!995 = !DILocation(line: 591, column: 7, scope: !994)
!996 = !DILocation(line: 595, column: 37, scope: !227)
!997 = !DILocation(line: 595, column: 35, scope: !227)
!998 = !DILocation(line: 596, column: 29, scope: !227)
!999 = !DILocation(line: 597, column: 8, scope: !242)
!1000 = !DILocation(line: 597, column: 7, scope: !227)
!1001 = !DILocation(line: 604, column: 24, scope: !241)
!1002 = !DILocation(line: 604, column: 12, scope: !242)
!1003 = !DILocation(line: 0, scope: !240)
!1004 = !DILocation(line: 610, column: 16, scope: !240)
!1005 = !DILocation(line: 610, column: 7, scope: !240)
!1006 = !DILocation(line: 611, column: 21, scope: !240)
!1007 = !{!1008, !1008, i64 0}
!1008 = !{!"short", !897, i64 0}
!1009 = !DILocation(line: 611, column: 19, scope: !240)
!1010 = !DILocation(line: 611, column: 16, scope: !240)
!1011 = !DILocation(line: 610, column: 30, scope: !240)
!1012 = distinct !{!1012, !1005, !1006, !1013}
!1013 = !{!"llvm.loop.mustprogress"}
!1014 = !DILocation(line: 612, column: 18, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !240, file: !103, line: 612, column: 11)
!1016 = !DILocation(line: 612, column: 11, scope: !240)
!1017 = !DILocation(line: 618, column: 5, scope: !240)
!1018 = !DILocation(line: 620, column: 23, scope: !227)
!1019 = !DILocation(line: 625, column: 39, scope: !227)
!1020 = !DILocation(line: 626, column: 3, scope: !227)
!1021 = !DILocation(line: 626, column: 10, scope: !227)
!1022 = !DILocation(line: 626, column: 21, scope: !227)
!1023 = !DILocation(line: 628, column: 44, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !103, line: 628, column: 11)
!1025 = distinct !DILexicalBlock(scope: !227, file: !103, line: 627, column: 5)
!1026 = !DILocation(line: 628, column: 32, scope: !1024)
!1027 = !DILocation(line: 628, column: 49, scope: !1024)
!1028 = !DILocation(line: 628, column: 11, scope: !1025)
!1029 = !DILocation(line: 630, column: 11, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1025, file: !103, line: 630, column: 11)
!1031 = !DILocation(line: 630, column: 11, scope: !1025)
!1032 = !DILocation(line: 632, column: 26, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !103, line: 632, column: 15)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !103, line: 631, column: 9)
!1035 = !DILocation(line: 632, column: 34, scope: !1033)
!1036 = !DILocation(line: 632, column: 37, scope: !1033)
!1037 = !DILocation(line: 632, column: 15, scope: !1034)
!1038 = !DILocation(line: 636, column: 16, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1034, file: !103, line: 636, column: 15)
!1040 = !DILocation(line: 636, column: 29, scope: !1039)
!1041 = !DILocation(line: 640, column: 16, scope: !1025)
!1042 = distinct !{!1042, !1020, !1043, !1013}
!1043 = !DILocation(line: 641, column: 5, scope: !227)
!1044 = !DILocation(line: 644, column: 3, scope: !227)
!1045 = !DILocation(line: 0, scope: !978, inlinedAt: !1046)
!1046 = distinct !DILocation(line: 648, column: 31, scope: !227)
!1047 = !DILocation(line: 0, scope: !978, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 649, column: 31, scope: !227)
!1049 = !DILocation(line: 0, scope: !978, inlinedAt: !1050)
!1050 = distinct !DILocation(line: 650, column: 31, scope: !227)
!1051 = !DILocation(line: 0, scope: !978, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 651, column: 31, scope: !227)
!1053 = !DILocation(line: 0, scope: !978, inlinedAt: !1054)
!1054 = distinct !DILocation(line: 652, column: 31, scope: !227)
!1055 = !DILocation(line: 0, scope: !978, inlinedAt: !1056)
!1056 = distinct !DILocation(line: 653, column: 31, scope: !227)
!1057 = !DILocation(line: 0, scope: !978, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 654, column: 31, scope: !227)
!1059 = !DILocation(line: 0, scope: !978, inlinedAt: !1060)
!1060 = distinct !DILocation(line: 655, column: 31, scope: !227)
!1061 = !DILocation(line: 0, scope: !978, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 656, column: 31, scope: !227)
!1063 = !DILocation(line: 0, scope: !978, inlinedAt: !1064)
!1064 = distinct !DILocation(line: 657, column: 31, scope: !227)
!1065 = !DILocation(line: 663, column: 7, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !227, file: !103, line: 663, column: 7)
!1067 = !DILocation(line: 664, column: 7, scope: !1066)
!1068 = !DILocation(line: 664, column: 10, scope: !1066)
!1069 = !DILocation(line: 663, column: 7, scope: !227)
!1070 = !DILocation(line: 669, column: 7, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1066, file: !103, line: 665, column: 5)
!1072 = !DILocation(line: 671, column: 5, scope: !1071)
!1073 = !DILocation(line: 676, column: 7, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1066, file: !103, line: 673, column: 5)
!1075 = !DILocation(line: 679, column: 3, scope: !227)
!1076 = !DILocation(line: 683, column: 3, scope: !227)
!1077 = !DILocation(line: 686, column: 3, scope: !227)
!1078 = !DILocation(line: 688, column: 3, scope: !227)
!1079 = !DILocation(line: 691, column: 3, scope: !227)
!1080 = !DILocation(line: 695, column: 3, scope: !227)
!1081 = !DILocation(line: 696, column: 1, scope: !227)
!1082 = !DISubprogram(name: "setlocale", scope: !1083, file: !1083, line: 122, type: !1084, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1083 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!129, !104, !134}
!1086 = !DISubprogram(name: "strncmp", scope: !1087, file: !1087, line: 159, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1087 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!104, !134, !134, !131}
!1090 = !DISubprogram(name: "exit", scope: !1091, file: !1091, line: 624, type: !885, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1091 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1092 = !DISubprogram(name: "getenv", scope: !1091, file: !1091, line: 641, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!129, !134}
!1095 = !DISubprogram(name: "strcmp", scope: !1087, file: !1087, line: 156, type: !1096, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!104, !134, !134}
!1098 = !DISubprogram(name: "strspn", scope: !1087, file: !1087, line: 297, type: !1099, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!133, !134, !134}
!1101 = !DISubprogram(name: "strchr", scope: !1087, file: !1087, line: 246, type: !1102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!129, !134, !104}
!1104 = !DISubprogram(name: "__ctype_b_loc", scope: !88, file: !88, line: 79, type: !1105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!1110 = !DISubprogram(name: "strcspn", scope: !1087, file: !1087, line: 293, type: !1099, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1111 = !DISubprogram(name: "fwrite_unlocked", scope: !125, file: !125, line: 704, type: !1112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !904)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!131, !1114, !131, !131, !956}
!1114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1117 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 201, type: !1118, scopeLine: 202, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1121)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!104, !104, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1129, !1130, !1167, !1168, !1171, !1174, !1175, !1176, !1177, !1179}
!1122 = !DILocalVariable(name: "argc", arg: 1, scope: !1117, file: !2, line: 201, type: !104)
!1123 = !DILocalVariable(name: "argv", arg: 2, scope: !1117, file: !2, line: 201, type: !1120)
!1124 = !DILocalVariable(name: "got_size", scope: !1117, file: !2, line: 203, type: !137)
!1125 = !DILocalVariable(name: "size", scope: !1117, file: !2, line: 204, type: !124)
!1126 = !DILocalVariable(name: "rsize", scope: !1117, file: !2, line: 205, type: !124)
!1127 = !DILocalVariable(name: "rel_mode", scope: !1117, file: !2, line: 206, type: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_mode_t", file: !2, line: 59, baseType: !78)
!1129 = !DILocalVariable(name: "c", scope: !1117, file: !2, line: 207, type: !104)
!1130 = !DILocalVariable(name: "sb", scope: !1131, file: !2, line: 321, type: !1133)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 320, column: 5)
!1132 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 319, column: 7)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1134, line: 26, size: 1152, elements: !1135)
!1134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1135 = !{!1136, !1138, !1140, !1142, !1144, !1146, !1148, !1149, !1150, !1151, !1153, !1155, !1163, !1164, !1165}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1133, file: !1134, line: 31, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !127, line: 145, baseType: !133)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1133, file: !1134, line: 36, baseType: !1139, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !127, line: 148, baseType: !133)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1133, file: !1134, line: 44, baseType: !1141, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !127, line: 151, baseType: !133)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1133, file: !1134, line: 45, baseType: !1143, size: 32, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !127, line: 150, baseType: !79)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1133, file: !1134, line: 47, baseType: !1145, size: 32, offset: 224)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !127, line: 146, baseType: !79)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1133, file: !1134, line: 48, baseType: !1147, size: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !127, line: 147, baseType: !79)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1133, file: !1134, line: 50, baseType: !104, size: 32, offset: 288)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1133, file: !1134, line: 52, baseType: !1137, size: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1133, file: !1134, line: 57, baseType: !126, size: 64, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1133, file: !1134, line: 61, baseType: !1152, size: 64, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !127, line: 175, baseType: !128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1133, file: !1134, line: 63, baseType: !1154, size: 64, offset: 512)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !127, line: 180, baseType: !128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1133, file: !1134, line: 74, baseType: !1156, size: 128, offset: 576)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1157, line: 11, size: 128, elements: !1158)
!1157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1158 = !{!1159, !1161}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1156, file: !1157, line: 16, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !127, line: 160, baseType: !128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1156, file: !1157, line: 21, baseType: !1162, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !127, line: 197, baseType: !128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1133, file: !1134, line: 75, baseType: !1156, size: 128, offset: 704)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1133, file: !1134, line: 76, baseType: !1156, size: 128, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1133, file: !1134, line: 89, baseType: !1166, size: 192, offset: 960)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 192, elements: !333)
!1167 = !DILocalVariable(name: "file_size", scope: !1131, file: !2, line: 322, type: !124)
!1168 = !DILocalVariable(name: "ref_fd", scope: !1169, file: !2, line: 329, type: !104)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !2, line: 328, column: 9)
!1170 = distinct !DILexicalBlock(scope: !1131, file: !2, line: 325, column: 11)
!1171 = !DILocalVariable(name: "file_end", scope: !1172, file: !2, line: 332, type: !124)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !2, line: 331, column: 13)
!1173 = distinct !DILexicalBlock(scope: !1169, file: !2, line: 330, column: 15)
!1174 = !DILocalVariable(name: "saved_errno", scope: !1172, file: !2, line: 333, type: !104)
!1175 = !DILocalVariable(name: "oflags", scope: !1117, file: !2, line: 353, type: !104)
!1176 = !DILocalVariable(name: "errors", scope: !1117, file: !2, line: 354, type: !137)
!1177 = !DILocalVariable(name: "fname", scope: !1178, file: !2, line: 356, type: !134)
!1178 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 356, column: 3)
!1179 = !DILocalVariable(name: "fd", scope: !1180, file: !2, line: 358, type: !104)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !2, line: 357, column: 5)
!1181 = distinct !DILexicalBlock(scope: !1178, file: !2, line: 356, column: 3)
!1182 = !DILocation(line: 0, scope: !1117)
!1183 = !DILocation(line: 210, column: 21, scope: !1117)
!1184 = !DILocation(line: 210, column: 3, scope: !1117)
!1185 = !DILocation(line: 211, column: 3, scope: !1117)
!1186 = !DILocation(line: 212, column: 3, scope: !1117)
!1187 = !DILocation(line: 213, column: 3, scope: !1117)
!1188 = !DILocation(line: 215, column: 3, scope: !1117)
!1189 = !DILocation(line: 217, column: 3, scope: !1117)
!1190 = !DILocation(line: 217, column: 15, scope: !1117)
!1191 = !DILocation(line: 235, column: 18, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !2, line: 220, column: 9)
!1193 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 218, column: 5)
!1194 = !DILocation(line: 235, column: 11, scope: !1192)
!1195 = !DILocation(line: 222, column: 21, scope: !1192)
!1196 = !DILocation(line: 223, column: 11, scope: !1192)
!1197 = !DILocation(line: 226, column: 22, scope: !1192)
!1198 = !DILocation(line: 227, column: 11, scope: !1192)
!1199 = !DILocation(line: 230, column: 22, scope: !1192)
!1200 = !DILocation(line: 230, column: 20, scope: !1192)
!1201 = !DILocation(line: 231, column: 11, scope: !1192)
!1202 = distinct !{!1202, !1189, !1203, !1013}
!1203 = !DILocation(line: 286, column: 5, scope: !1117)
!1204 = !DILocation(line: 236, column: 19, scope: !1192)
!1205 = distinct !{!1205, !1194, !1204, !1013}
!1206 = !DILocation(line: 237, column: 19, scope: !1192)
!1207 = !DILocation(line: 237, column: 11, scope: !1192)
!1208 = !DILocation(line: 246, column: 15, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 238, column: 13)
!1210 = !DILocation(line: 250, column: 15, scope: !1209)
!1211 = !DILocation(line: 254, column: 15, scope: !1209)
!1212 = !DILocation(line: 0, scope: !1209)
!1213 = !DILocation(line: 257, column: 18, scope: !1192)
!1214 = !DILocation(line: 257, column: 11, scope: !1192)
!1215 = !DILocation(line: 258, column: 19, scope: !1192)
!1216 = distinct !{!1216, !1214, !1215, !1013}
!1217 = !DILocation(line: 259, column: 30, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 259, column: 15)
!1219 = !DILocation(line: 261, column: 19, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 261, column: 19)
!1221 = distinct !DILexicalBlock(scope: !1218, file: !2, line: 260, column: 13)
!1222 = !DILocation(line: 261, column: 19, scope: !1221)
!1223 = !DILocation(line: 263, column: 19, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1220, file: !2, line: 262, column: 17)
!1225 = !DILocation(line: 265, column: 19, scope: !1224)
!1226 = !DILocation(line: 272, column: 30, scope: !1192)
!1227 = !DILocation(line: 271, column: 18, scope: !1192)
!1228 = !DILocation(line: 274, column: 35, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 274, column: 15)
!1230 = !DILocation(line: 275, column: 13, scope: !1229)
!1231 = !DILocation(line: 279, column: 9, scope: !1192)
!1232 = !DILocation(line: 281, column: 9, scope: !1192)
!1233 = !DILocation(line: 284, column: 11, scope: !1192)
!1234 = !DILocation(line: 288, column: 11, scope: !1117)
!1235 = !DILocation(line: 288, column: 8, scope: !1117)
!1236 = !DILocation(line: 292, column: 8, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 292, column: 7)
!1238 = !DILocation(line: 292, column: 17, scope: !1237)
!1239 = !DILocation(line: 294, column: 7, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1237, file: !2, line: 293, column: 5)
!1241 = !DILocation(line: 296, column: 7, scope: !1240)
!1242 = !DILocation(line: 299, column: 16, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 299, column: 7)
!1244 = !DILocation(line: 301, column: 7, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1243, file: !2, line: 300, column: 5)
!1246 = !DILocation(line: 303, column: 7, scope: !1245)
!1247 = !DILocation(line: 306, column: 7, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 306, column: 7)
!1249 = !DILocation(line: 306, column: 18, scope: !1248)
!1250 = !DILocation(line: 308, column: 7, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1248, file: !2, line: 307, column: 5)
!1252 = !DILocation(line: 310, column: 7, scope: !1251)
!1253 = !DILocation(line: 313, column: 12, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 313, column: 7)
!1255 = !DILocation(line: 313, column: 7, scope: !1117)
!1256 = !DILocation(line: 315, column: 7, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1254, file: !2, line: 314, column: 5)
!1258 = !DILocation(line: 316, column: 7, scope: !1257)
!1259 = !DILocation(line: 319, column: 7, scope: !1117)
!1260 = !DILocation(line: 321, column: 7, scope: !1131)
!1261 = !DILocation(line: 321, column: 19, scope: !1131)
!1262 = !DILocation(line: 0, scope: !1131)
!1263 = !DILocation(line: 323, column: 11, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1131, file: !2, line: 323, column: 11)
!1265 = !DILocation(line: 323, column: 32, scope: !1264)
!1266 = !DILocation(line: 323, column: 11, scope: !1131)
!1267 = !DILocation(line: 324, column: 9, scope: !1264)
!1268 = !DILocalVariable(name: "sb", arg: 1, scope: !1269, file: !103, line: 911, type: !1272)
!1269 = distinct !DISubprogram(name: "usable_st_size", scope: !103, file: !103, line: 911, type: !1270, scopeLine: 912, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1274)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!137, !1272}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1274 = !{!1268}
!1275 = !DILocation(line: 0, scope: !1269, inlinedAt: !1276)
!1276 = distinct !DILocation(line: 325, column: 11, scope: !1170)
!1277 = !DILocation(line: 913, column: 11, scope: !1269, inlinedAt: !1276)
!1278 = !{!1279, !967, i64 24}
!1279 = !{!"stat", !1280, i64 0, !1280, i64 8, !1280, i64 16, !967, i64 24, !967, i64 28, !967, i64 32, !967, i64 36, !1280, i64 40, !1280, i64 48, !1280, i64 56, !1280, i64 64, !1281, i64 72, !1281, i64 88, !1281, i64 104, !897, i64 120}
!1280 = !{!"long", !897, i64 0}
!1281 = !{!"timespec", !1280, i64 0, !1280, i64 8}
!1282 = !DILocation(line: 913, column: 33, scope: !1269, inlinedAt: !1276)
!1283 = !DILocation(line: 325, column: 11, scope: !1131)
!1284 = !DILocation(line: 329, column: 30, scope: !1169)
!1285 = !DILocation(line: 329, column: 24, scope: !1169)
!1286 = !DILocation(line: 0, scope: !1169)
!1287 = !DILocation(line: 330, column: 17, scope: !1173)
!1288 = !DILocation(line: 330, column: 15, scope: !1169)
!1289 = !DILocation(line: 332, column: 32, scope: !1172)
!1290 = !DILocation(line: 0, scope: !1172)
!1291 = !DILocation(line: 333, column: 33, scope: !1172)
!1292 = !DILocation(line: 334, column: 15, scope: !1172)
!1293 = !DILocation(line: 335, column: 21, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 335, column: 19)
!1295 = !DILocation(line: 335, column: 19, scope: !1172)
!1296 = !DILocation(line: 340, column: 25, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1294, file: !2, line: 338, column: 17)
!1298 = !DILocation(line: 326, column: 24, scope: !1170)
!1299 = !{!1279, !1280, i64 48}
!1300 = !DILocation(line: 344, column: 21, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1131, file: !2, line: 344, column: 11)
!1302 = !DILocation(line: 344, column: 11, scope: !1131)
!1303 = !DILocation(line: 345, column: 9, scope: !1301)
!1304 = !DILocation(line: 351, column: 5, scope: !1132)
!1305 = !DILocation(line: 351, column: 5, scope: !1131)
!1306 = !DILocation(line: 353, column: 28, scope: !1117)
!1307 = !DILocation(line: 353, column: 53, scope: !1117)
!1308 = !DILocation(line: 356, column: 36, scope: !1181)
!1309 = !DILocation(line: 0, scope: !1178)
!1310 = !DILocation(line: 356, column: 3, scope: !1178)
!1311 = !DILocation(line: 354, column: 8, scope: !1117)
!1312 = !DILocation(line: 383, column: 10, scope: !1117)
!1313 = !DILocation(line: 383, column: 3, scope: !1117)
!1314 = !DILocation(line: 358, column: 16, scope: !1180)
!1315 = !DILocation(line: 0, scope: !1180)
!1316 = !DILocation(line: 359, column: 14, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1180, file: !2, line: 359, column: 11)
!1318 = !DILocation(line: 359, column: 11, scope: !1180)
!1319 = !DILocation(line: 365, column: 17, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1321, file: !2, line: 365, column: 15)
!1321 = distinct !DILexicalBlock(scope: !1317, file: !2, line: 360, column: 9)
!1322 = !DILocation(line: 0, scope: !1320)
!1323 = !DILocation(line: 365, column: 27, scope: !1320)
!1324 = !DILocation(line: 365, column: 30, scope: !1320)
!1325 = !DILocation(line: 365, column: 36, scope: !1320)
!1326 = !DILocation(line: 365, column: 15, scope: !1321)
!1327 = !DILocalVariable(name: "fd", arg: 1, scope: !1328, file: !2, line: 107, type: !104)
!1328 = distinct !DISubprogram(name: "do_ftruncate", scope: !2, file: !2, line: 107, type: !1329, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1331)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!137, !104, !134, !124, !124, !1128}
!1331 = !{!1327, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1341, !1342, !1345}
!1332 = !DILocalVariable(name: "fname", arg: 2, scope: !1328, file: !2, line: 107, type: !134)
!1333 = !DILocalVariable(name: "ssize", arg: 3, scope: !1328, file: !2, line: 107, type: !124)
