; ModuleID = 'src/tsort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.tokenbuffer = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.item = type { ptr, ptr, ptr, i8, i8, i64, ptr, ptr }
%struct.successor = type { ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [100 x i8] c"Usage: %s [OPTION] [FILE]\0AWrite totally ordered list consistent with the partial ordering in FILE.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"tsort\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !111, !116, !47, !121, !123, !128, !130, !135, !137, !142, !225, !227, !229, !234, !236, !238, !240, !242, !247, !249, !251, !253, !258, !260, !262, !264, !266, !268, !270, !272, !274, !279, !284, !289, !291, !293, !295, !297, !302, !307, !309, !311, !316, !321, !326, !331, !333, !335, !337, !342, !344, !349, !354, !356, !358, !360, !365, !367, !369, !387, !389}
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 5)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 546, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 8)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 549, type: !14, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 14)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !125, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 17)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 574, type: !14, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !58, line: 729, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 56)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !144, file: !58, line: 575, type: !52, isLocal: true, isDefinition: true)
!144 = distinct !DISubprogram(name: "oputs_", scope: !58, file: !58, line: 573, type: !145, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !147)
!145 = !DISubroutineType(cc: DW_CC_nocall, types: !146)
!146 = !{null, !107, !107}
!147 = !{!148, !149, !150, !153, !155, !156, !157, !161, !162, !163, !164, !166, !219, !220, !221, !223, !224}
!148 = !DILocalVariable(name: "program", arg: 1, scope: !144, file: !58, line: 573, type: !107)
!149 = !DILocalVariable(name: "option", arg: 2, scope: !144, file: !58, line: 573, type: !107)
!150 = !DILocalVariable(name: "term", scope: !151, file: !58, line: 585, type: !107)
!151 = distinct !DILexicalBlock(scope: !152, file: !58, line: 582, column: 5)
!152 = distinct !DILexicalBlock(scope: !144, file: !58, line: 581, column: 7)
!153 = !DILocalVariable(name: "double_space", scope: !144, file: !58, line: 594, type: !154)
!154 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!155 = !DILocalVariable(name: "first_word", scope: !144, file: !58, line: 595, type: !107)
!156 = !DILocalVariable(name: "option_text", scope: !144, file: !58, line: 596, type: !107)
!157 = !DILocalVariable(name: "s", scope: !158, file: !58, line: 608, type: !107)
!158 = distinct !DILexicalBlock(scope: !159, file: !58, line: 605, column: 5)
!159 = distinct !DILexicalBlock(scope: !160, file: !58, line: 604, column: 12)
!160 = distinct !DILexicalBlock(scope: !144, file: !58, line: 597, column: 7)
!161 = !DILocalVariable(name: "spaces", scope: !158, file: !58, line: 609, type: !104)
!162 = !DILocalVariable(name: "anchor_len", scope: !144, file: !58, line: 620, type: !104)
!163 = !DILocalVariable(name: "desc_text", scope: !144, file: !58, line: 625, type: !107)
!164 = !DILocalVariable(name: "__ptr", scope: !165, file: !58, line: 644, type: !107)
!165 = distinct !DILexicalBlock(scope: !144, file: !58, line: 644, column: 3)
!166 = !DILocalVariable(name: "__stream", scope: !165, file: !58, line: 644, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !169, line: 7, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !171, line: 49, size: 1728, elements: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !188, !190, !191, !192, !196, !197, !199, !200, !203, !205, !208, !211, !212, !213, !214, !215}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !170, file: !171, line: 51, baseType: !52, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !170, file: !171, line: 54, baseType: !54, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !170, file: !171, line: 55, baseType: !54, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !170, file: !171, line: 56, baseType: !54, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !170, file: !171, line: 57, baseType: !54, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !170, file: !171, line: 58, baseType: !54, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !170, file: !171, line: 59, baseType: !54, size: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !170, file: !171, line: 60, baseType: !54, size: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !170, file: !171, line: 61, baseType: !54, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !170, file: !171, line: 64, baseType: !54, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !170, file: !171, line: 65, baseType: !54, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !170, file: !171, line: 66, baseType: !54, size: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !170, file: !171, line: 68, baseType: !186, size: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !171, line: 36, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !170, file: !171, line: 70, baseType: !189, size: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !170, file: !171, line: 72, baseType: !52, size: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !170, file: !171, line: 73, baseType: !52, size: 32, offset: 928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !170, file: !171, line: 74, baseType: !193, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !194, line: 152, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!195 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !170, file: !171, line: 77, baseType: !103, size: 16, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !170, file: !171, line: 78, baseType: !198, size: 8, offset: 1040)
!198 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !170, file: !171, line: 79, baseType: !34, size: 8, offset: 1048)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !170, file: !171, line: 81, baseType: !201, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !171, line: 43, baseType: null)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !170, file: !171, line: 89, baseType: !204, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !194, line: 153, baseType: !195)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !170, file: !171, line: 91, baseType: !206, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !171, line: 37, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !170, file: !171, line: 92, baseType: !209, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !171, line: 38, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !170, file: !171, line: 93, baseType: !189, size: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !170, file: !171, line: 94, baseType: !102, size: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !170, file: !171, line: 95, baseType: !104, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !170, file: !171, line: 96, baseType: !52, size: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !170, file: !171, line: 98, baseType: !216, size: 160, offset: 1568)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 20)
!219 = !DILocalVariable(name: "__cnt", scope: !165, file: !58, line: 644, type: !104)
!220 = !DILocalVariable(name: "url_program", scope: !144, file: !58, line: 648, type: !107)
!221 = !DILocalVariable(name: "__ptr", scope: !222, file: !58, line: 686, type: !107)
!222 = distinct !DILexicalBlock(scope: !144, file: !58, line: 686, column: 3)
!223 = !DILocalVariable(name: "__stream", scope: !222, file: !58, line: 686, type: !167)
!224 = !DILocalVariable(name: "__cnt", scope: !222, file: !58, line: 686, type: !104)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !58, line: 585, type: !113, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !58, line: 586, type: !113, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !58, line: 595, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 4)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !58, line: 620, type: !19, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !58, line: 648, type: !14, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !58, line: 648, type: !113, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !58, line: 649, type: !231, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !58, line: 649, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !58, line: 650, type: !113, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !58, line: 651, type: !19, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !58, line: 651, type: !19, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !58, line: 652, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 7)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !58, line: 653, type: !118, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !58, line: 654, type: !39, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !58, line: 655, type: !39, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !58, line: 656, type: !39, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !58, line: 657, type: !39, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !58, line: 663, type: !255, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !58, line: 664, type: !39, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !58, line: 669, type: !132, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !58, line: 669, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 40)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !58, line: 676, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 15)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !58, line: 676, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 61)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !58, line: 679, type: !244, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !58, line: 683, type: !113, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !58, line: 688, type: !113, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !58, line: 691, type: !118, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !58, line: 839, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 16)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !58, line: 840, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 22)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !58, line: 841, type: !281, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !58, line: 862, type: !231, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !58, line: 868, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 71)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !58, line: 875, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 27)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !58, line: 877, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 51)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !58, line: 877, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 12)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !14, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !244, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !281, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 9)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !328, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 200, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 25)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 472, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 43)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !318, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 524, type: !281, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !19, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 432, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 54)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !118, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "n_strings", scope: !55, file: !2, line: 72, type: !104, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "head", scope: !55, file: !2, line: 63, type: !371, isLocal: true, isDefinition: true)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "item", file: !2, line: 51, size: 448, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !372, file: !2, line: 53, baseType: !107, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !372, file: !2, line: 54, baseType: !371, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !372, file: !2, line: 54, baseType: !371, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !372, file: !2, line: 55, baseType: !198, size: 8, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !372, file: !2, line: 56, baseType: !154, size: 8, offset: 200)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !372, file: !2, line: 57, baseType: !104, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "qlink", scope: !372, file: !2, line: 58, baseType: !371, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !372, file: !2, line: 59, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "successor", file: !2, line: 44, size: 128, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "suc", scope: !383, file: !2, line: 46, baseType: !371, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !2, line: 47, baseType: !382, size: 64, offset: 64)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "zeros", scope: !55, file: !2, line: 66, type: !371, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "loop", scope: !55, file: !2, line: 69, type: !371, isLocal: true, isDefinition: true)
!391 = !{!392, !393, !394}
!392 = !DILocalVariable(name: "argc", arg: 1, scope: !49, file: !2, line: 531, type: !52)
!393 = !DILocalVariable(name: "argv", arg: 2, scope: !49, file: !2, line: 531, type: !53)
!394 = !DILocalVariable(name: "c", scope: !395, file: !2, line: 549, type: !52)
!395 = distinct !DILexicalBlock(scope: !49, file: !2, line: 542, column: 5)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 768, elements: !245)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !399, line: 50, size: 256, elements: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!400 = !{!401, !402, !403, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !399, line: 52, baseType: !107, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !398, file: !399, line: 55, baseType: !52, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !399, line: 56, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !398, file: !399, line: 57, baseType: !52, size: 32, offset: 192)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !408, line: 3, type: !281, isLocal: true, isDefinition: true)
!408 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "Version", scope: !411, file: !408, line: 3, type: !107, isLocal: false, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C11, file: !408, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !412, splitDebugInlining: false, nameTableKind: None)
!412 = !{!406, !409}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "file_name", scope: !415, file: !416, line: 45, type: !107, isLocal: true, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C11, file: !416, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !417, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!417 = !{!418, !420, !422, !424, !413, !426}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !416, line: 121, type: !255, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !416, line: 121, type: !328, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !416, line: 123, type: !255, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !416, line: 126, type: !244, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !415, file: !416, line: 55, type: !154, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !430, file: !431, line: 66, type: !477, isLocal: false, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C11, file: !431, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !432, globals: !433, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!432 = !{!102, !109}
!433 = !{!434, !436, !456, !458, !460, !462, !428, !464, !466, !468, !470, !475}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !431, line: 272, type: !113, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "old_file_name", scope: !438, file: !431, line: 304, type: !107, isLocal: true, isDefinition: true)
!438 = distinct !DISubprogram(name: "verror_at_line", scope: !431, file: !431, line: 298, type: !439, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !430, retainedNodes: !449)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !52, !52, !107, !64, !107, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !443)
!443 = !{!444, !446, !447, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !442, file: !445, baseType: !64, size: 32)
!445 = !DIFile(filename: "lib/error.c", directory: "/src")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !442, file: !445, baseType: !64, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !442, file: !445, baseType: !102, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !442, file: !445, baseType: !102, size: 64, offset: 128)
!449 = !{!450, !451, !452, !453, !454, !455}
!450 = !DILocalVariable(name: "status", arg: 1, scope: !438, file: !431, line: 298, type: !52)
!451 = !DILocalVariable(name: "errnum", arg: 2, scope: !438, file: !431, line: 298, type: !52)
!452 = !DILocalVariable(name: "file_name", arg: 3, scope: !438, file: !431, line: 298, type: !107)
!453 = !DILocalVariable(name: "line_number", arg: 4, scope: !438, file: !431, line: 298, type: !64)
!454 = !DILocalVariable(name: "message", arg: 5, scope: !438, file: !431, line: 298, type: !107)
!455 = !DILocalVariable(name: "args", arg: 6, scope: !438, file: !431, line: 298, type: !441)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "old_line_number", scope: !438, file: !431, line: 305, type: !64, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !431, line: 338, type: !231, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !431, line: 346, type: !118, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !431, line: 346, type: !14, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "error_message_count", scope: !430, file: !431, line: 69, type: !64, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !430, file: !431, line: 295, type: !52, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !431, line: 208, type: !255, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !431, line: 208, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 21)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !431, line: 214, type: !113, isLocal: true, isDefinition: true)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null}
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !482, line: 40, type: !39, isLocal: true, isDefinition: true)
!482 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "program_name", scope: !485, file: !486, line: 31, type: !107, isLocal: false, isDefinition: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C11, file: !486, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !487, globals: !488, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!487 = !{!54}
!488 = !{!483, !489, !491}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !486, line: 46, type: !118, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !486, line: 49, type: !231, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "utf07FF", scope: !495, file: !496, line: 46, type: !523, isLocal: true, isDefinition: true)
!495 = distinct !DISubprogram(name: "proper_name_lite", scope: !496, file: !496, line: 38, type: !497, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !501)
!496 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!497 = !DISubroutineType(types: !498)
!498 = !{!107, !107, !107}
!499 = distinct !DICompileUnit(language: DW_LANG_C11, file: !496, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !500, splitDebugInlining: false, nameTableKind: None)
!500 = !{!493}
!501 = !{!502, !503, !504, !505, !510}
!502 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !495, file: !496, line: 38, type: !107)
!503 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !495, file: !496, line: 38, type: !107)
!504 = !DILocalVariable(name: "translation", scope: !495, file: !496, line: 40, type: !107)
!505 = !DILocalVariable(name: "w", scope: !495, file: !496, line: 47, type: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !507, line: 37, baseType: !508)
!507 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !194, line: 57, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !194, line: 42, baseType: !64)
!510 = !DILocalVariable(name: "mbs", scope: !495, file: !496, line: 48, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !512, line: 6, baseType: !513)
!512 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !514, line: 21, baseType: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 13, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !515, file: !514, line: 15, baseType: !52, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !515, file: !514, line: 20, baseType: !519, size: 32, offset: 32)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !515, file: !514, line: 16, size: 32, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !519, file: !514, line: 18, baseType: !64, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !519, file: !514, line: 19, baseType: !231, size: 32)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16, elements: !15)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !526, line: 78, type: !118, isLocal: true, isDefinition: true)
!526 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !526, line: 79, type: !19, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !526, line: 80, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 13)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !526, line: 81, type: !531, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !526, line: 82, type: !216, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !526, line: 83, type: !14, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !526, line: 84, type: !118, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !526, line: 85, type: !255, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !526, line: 86, type: !255, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !526, line: 87, type: !118, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !550, file: !526, line: 76, type: !622, isLocal: false, isDefinition: true)
!550 = distinct !DICompileUnit(language: DW_LANG_C11, file: !526, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, retainedTypes: !557, globals: !558, splitDebugInlining: false, nameTableKind: None)
!551 = !{!78, !552, !62}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !79, line: 254, baseType: !64, size: 32, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!555 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!556 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!557 = !{!52, !103, !104}
!558 = !{!524, !527, !529, !534, !536, !538, !540, !542, !544, !546, !548, !559, !563, !573, !575, !580, !582, !584, !586, !588, !611, !618, !620}
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !550, file: !526, line: 92, type: !561, isLocal: false, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 320, elements: !40)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !550, file: !526, line: 1040, type: !565, isLocal: false, isDefinition: true)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !526, line: 56, size: 448, elements: !566)
!566 = !{!567, !568, !569, !571, !572}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !565, file: !526, line: 59, baseType: !78, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !565, file: !526, line: 62, baseType: !52, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !565, file: !526, line: 66, baseType: !570, size: 256, offset: 64)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !119)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !565, file: !526, line: 69, baseType: !107, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !565, file: !526, line: 72, baseType: !107, size: 64, offset: 384)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !550, file: !526, line: 107, type: !565, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "slot0", scope: !550, file: !526, line: 831, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 256)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !526, line: 321, type: !14, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !526, line: 357, type: !14, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !526, line: 358, type: !14, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !526, line: 199, type: !255, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "quote", scope: !590, file: !526, line: 228, type: !609, isLocal: true, isDefinition: true)
!590 = distinct !DISubprogram(name: "gettext_quote", scope: !526, file: !526, line: 197, type: !591, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !550, retainedNodes: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{!107, !107, !78}
!593 = !{!594, !595, !596, !597, !598}
!594 = !DILocalVariable(name: "msgid", arg: 1, scope: !590, file: !526, line: 197, type: !107)
!595 = !DILocalVariable(name: "s", arg: 2, scope: !590, file: !526, line: 197, type: !78)
!596 = !DILocalVariable(name: "translation", scope: !590, file: !526, line: 199, type: !107)
!597 = !DILocalVariable(name: "w", scope: !590, file: !526, line: 229, type: !506)
!598 = !DILocalVariable(name: "mbs", scope: !590, file: !526, line: 230, type: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !512, line: 6, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !514, line: 21, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 13, size: 64, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !601, file: !514, line: 15, baseType: !52, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !601, file: !514, line: 20, baseType: !605, size: 32, offset: 32)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !601, file: !514, line: 16, size: 32, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !605, file: !514, line: 18, baseType: !64, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !605, file: !514, line: 19, baseType: !231, size: 32)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !610)
!610 = !{!16, !233}
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "slotvec", scope: !550, file: !526, line: 834, type: !613, isLocal: true, isDefinition: true)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !526, line: 823, size: 128, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !614, file: !526, line: 825, baseType: !104, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !614, file: !526, line: 826, baseType: !54, size: 64, offset: 64)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "nslots", scope: !550, file: !526, line: 832, type: !52, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "slotvec0", scope: !550, file: !526, line: 833, type: !614, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 704, elements: !624)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!624 = !{!625}
!625 = !DISubrange(count: 11)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !628, line: 67, type: !328, isLocal: true, isDefinition: true)
!628 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !628, line: 69, type: !255, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !628, line: 83, type: !255, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !628, line: 83, type: !231, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !628, line: 85, type: !14, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !628, line: 88, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 171)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !628, line: 88, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 34)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !628, line: 105, type: !299, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !628, line: 109, type: !651, isLocal: true, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 23)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !628, line: 113, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 28)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !628, line: 120, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 32)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !628, line: 127, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 36)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !628, line: 134, type: !276, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !628, line: 142, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 44)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !628, line: 150, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 48)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !628, line: 159, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 52)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !628, line: 170, type: !688, isLocal: true, isDefinition: true)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 60)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !628, line: 248, type: !216, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !628, line: 248, type: !304, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !628, line: 254, type: !216, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !628, line: 254, type: !125, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !628, line: 254, type: !276, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !628, line: 259, type: !3, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !628, line: 259, type: !705, isLocal: true, isDefinition: true)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 29)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !710, file: !711, line: 26, type: !713, isLocal: false, isDefinition: true)
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !712, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!712 = !{!708}
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 376, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 47)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "exit_failure", scope: !718, file: !719, line: 24, type: !721, isLocal: false, isDefinition: true)
!718 = distinct !DICompileUnit(language: DW_LANG_C11, file: !719, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !720, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!720 = !{!716}
!721 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !724, line: 34, type: !244, isLocal: true, isDefinition: true)
!724 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !724, line: 34, type: !255, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !724, line: 34, type: !132, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !731, line: 108, type: !34, isLocal: true, isDefinition: true)
!731 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "internal_state", scope: !734, file: !731, line: 97, type: !737, isLocal: true, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !735, globals: !736, splitDebugInlining: false, nameTableKind: None)
!735 = !{!102, !104, !109}
!736 = !{!729, !732}
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !512, line: 6, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !514, line: 21, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 13, size: 64, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !739, file: !514, line: 15, baseType: !52, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !739, file: !514, line: 20, baseType: !743, size: 32, offset: 32)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !739, file: !514, line: 16, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !743, file: !514, line: 18, baseType: !64, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !743, file: !514, line: 19, baseType: !231, size: 32)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !749, line: 35, type: !19, isLocal: true, isDefinition: true)
!749 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!750 = distinct !DICompileUnit(language: DW_LANG_C11, file: !751, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !752, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!752 = !{!92}
!753 = distinct !DICompileUnit(language: DW_LANG_C11, file: !754, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !757, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!757 = !{!102}
!758 = distinct !DICompileUnit(language: DW_LANG_C11, file: !482, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !759, splitDebugInlining: false, nameTableKind: None)
!759 = !{!480}
!760 = distinct !DICompileUnit(language: DW_LANG_C11, file: !761, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !757, splitDebugInlining: false, nameTableKind: None)
!761 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!762 = distinct !DICompileUnit(language: DW_LANG_C11, file: !763, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!764 = distinct !DICompileUnit(language: DW_LANG_C11, file: !765, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !766, retainedTypes: !770, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/readtokens.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bd27ae043f20cb5dd96b528a940c0bf9")
!766 = !{!767}
!767 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !765, line: 50, baseType: !64, size: 32, elements: !768)
!768 = !{!769}
!769 = !DIEnumerator(name: "bits_per_word", value: 64)
!770 = !{!104, !102, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !628, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !773, retainedTypes: !757, globals: !777, splitDebugInlining: false, nameTableKind: None)
!773 = !{!774}
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !628, line: 40, baseType: !64, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!777 = !{!626, !629, !631, !633, !635, !637, !642, !647, !649, !654, !659, !664, !669, !671, !676, !681, !686, !691, !693, !695, !697, !699, !701, !703}
!778 = distinct !DICompileUnit(language: DW_LANG_C11, file: !779, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !811, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!780 = !{!781, !793}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !782, file: !779, line: 188, baseType: !64, size: 32, elements: !791)
!782 = distinct !DISubprogram(name: "x2nrealloc", scope: !779, file: !779, line: 176, type: !783, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !778, retainedNodes: !786)
!783 = !DISubroutineType(types: !784)
!784 = !{!102, !102, !785, !104}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!786 = !{!787, !788, !789, !790}
!787 = !DILocalVariable(name: "p", arg: 1, scope: !782, file: !779, line: 176, type: !102)
!788 = !DILocalVariable(name: "pn", arg: 2, scope: !782, file: !779, line: 176, type: !785)
!789 = !DILocalVariable(name: "s", arg: 3, scope: !782, file: !779, line: 176, type: !104)
!790 = !DILocalVariable(name: "n", scope: !782, file: !779, line: 178, type: !104)
!791 = !{!792}
!792 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !794, file: !779, line: 228, baseType: !64, size: 32, elements: !791)
!794 = distinct !DISubprogram(name: "xpalloc", scope: !779, file: !779, line: 223, type: !795, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !778, retainedNodes: !801)
!795 = !DISubroutineType(types: !796)
!796 = !{!102, !102, !797, !798, !800, !798}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !799, line: 130, baseType: !800)
!799 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !105, line: 35, baseType: !195)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810}
!802 = !DILocalVariable(name: "pa", arg: 1, scope: !794, file: !779, line: 223, type: !102)
!803 = !DILocalVariable(name: "pn", arg: 2, scope: !794, file: !779, line: 223, type: !797)
!804 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !794, file: !779, line: 223, type: !798)
!805 = !DILocalVariable(name: "n_max", arg: 4, scope: !794, file: !779, line: 223, type: !800)
!806 = !DILocalVariable(name: "s", arg: 5, scope: !794, file: !779, line: 223, type: !798)
!807 = !DILocalVariable(name: "n0", scope: !794, file: !779, line: 230, type: !798)
!808 = !DILocalVariable(name: "n", scope: !794, file: !779, line: 237, type: !798)
!809 = !DILocalVariable(name: "nbytes", scope: !794, file: !779, line: 248, type: !798)
!810 = !DILocalVariable(name: "adjusted_nbytes", scope: !794, file: !779, line: 252, type: !798)
!811 = !{!54, !102, !154, !195, !106}
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !813, splitDebugInlining: false, nameTableKind: None)
!813 = !{!722, !725, !727}
!814 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!816 = distinct !DICompileUnit(language: DW_LANG_C11, file: !817, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !818, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!818 = !{!154, !106, !102}
!819 = distinct !DICompileUnit(language: DW_LANG_C11, file: !749, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !820, splitDebugInlining: false, nameTableKind: None)
!820 = !{!821, !747}
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !749, line: 35, type: !14, isLocal: true, isDefinition: true)
!823 = distinct !DICompileUnit(language: DW_LANG_C11, file: !824, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !826, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !757, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!827 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!828 = !{i32 7, !"Dwarf Version", i32 5}
!829 = !{i32 2, !"Debug Info Version", i32 3}
!830 = !{i32 1, !"wchar_size", i32 4}
!831 = !{i32 8, !"PIC Level", i32 2}
!832 = !{i32 7, !"PIE Level", i32 2}
!833 = !{i32 7, !"uwtable", i32 2}
!834 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 75, type: !835, scopeLine: 76, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !52}
!837 = !{!838}
!838 = !DILocalVariable(name: "status", arg: 1, scope: !834, file: !2, line: 75, type: !52)
!839 = !DILocation(line: 0, scope: !834)
!840 = !DILocation(line: 77, column: 14, scope: !841)
!841 = distinct !DILexicalBlock(scope: !834, file: !2, line: 77, column: 7)
!842 = !DILocation(line: 77, column: 7, scope: !834)
!843 = !DILocation(line: 78, column: 5, scope: !844)
!844 = distinct !DILexicalBlock(scope: !841, file: !2, line: 78, column: 5)
!845 = !{!846, !846, i64 0}
!846 = !{!"any pointer", !847, i64 0}
!847 = !{!"omnipotent char", !848, i64 0}
!848 = !{!"Simple C/C++ TBAA"}
!849 = !DILocation(line: 81, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !841, file: !2, line: 80, column: 5)
!851 = !DILocation(line: 729, column: 3, scope: !852, inlinedAt: !854)
!852 = distinct !DISubprogram(name: "emit_stdin_note", scope: !58, file: !58, line: 727, type: !478, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !853)
!853 = !{}
!854 = distinct !DILocation(line: 86, column: 7, scope: !850)
!855 = !DILocation(line: 88, column: 7, scope: !850)
!856 = !DILocation(line: 91, column: 7, scope: !850)
!857 = !DILocation(line: 92, column: 7, scope: !850)
!858 = !DILocalVariable(name: "program", arg: 1, scope: !859, file: !58, line: 836, type: !107)
!859 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !58, file: !58, line: 836, type: !860, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !862)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !107}
!862 = !{!858, !863, !870, !871, !873, !874}
!863 = !DILocalVariable(name: "infomap", scope: !859, file: !58, line: 838, type: !864)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 896, elements: !256)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !859, file: !58, line: 838, size: 128, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !866, file: !58, line: 838, baseType: !107, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !866, file: !58, line: 838, baseType: !107, size: 64, offset: 64)
!870 = !DILocalVariable(name: "node", scope: !859, file: !58, line: 848, type: !107)
!871 = !DILocalVariable(name: "map_prog", scope: !859, file: !58, line: 849, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!873 = !DILocalVariable(name: "lc_messages", scope: !859, file: !58, line: 861, type: !107)
!874 = !DILocalVariable(name: "url_program", scope: !859, file: !58, line: 874, type: !107)
!875 = !DILocation(line: 0, scope: !859, inlinedAt: !876)
!876 = distinct !DILocation(line: 93, column: 7, scope: !850)
!877 = !DILocation(line: 857, column: 3, scope: !859, inlinedAt: !876)
!878 = !DILocation(line: 861, column: 29, scope: !859, inlinedAt: !876)
!879 = !DILocation(line: 862, column: 7, scope: !880, inlinedAt: !876)
!880 = distinct !DILexicalBlock(scope: !859, file: !58, line: 862, column: 7)
!881 = !DILocation(line: 862, column: 19, scope: !880, inlinedAt: !876)
!882 = !DILocation(line: 862, column: 22, scope: !880, inlinedAt: !876)
!883 = !DILocation(line: 862, column: 7, scope: !859, inlinedAt: !876)
!884 = !DILocation(line: 868, column: 7, scope: !885, inlinedAt: !876)
!885 = distinct !DILexicalBlock(scope: !880, file: !58, line: 863, column: 5)
!886 = !DILocation(line: 870, column: 5, scope: !885, inlinedAt: !876)
!887 = !DILocation(line: 875, column: 3, scope: !859, inlinedAt: !876)
!888 = !DILocation(line: 877, column: 3, scope: !859, inlinedAt: !876)
!889 = !DILocation(line: 96, column: 3, scope: !834)
!890 = !DISubprogram(name: "dcgettext", scope: !891, file: !891, line: 51, type: !892, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!891 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!892 = !DISubroutineType(types: !893)
!893 = !{!54, !107, !107, !52}
!894 = !DISubprogram(name: "__fprintf_chk", scope: !895, file: !895, line: 93, type: !896, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!895 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!896 = !DISubroutineType(types: !897)
!897 = !{!52, !898, !52, !899, null}
!898 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !167)
!899 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!900 = !DISubprogram(name: "__printf_chk", scope: !895, file: !895, line: 95, type: !901, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!901 = !DISubroutineType(types: !902)
!902 = !{!52, !52, !899, null}
!903 = !DISubprogram(name: "fputs_unlocked", scope: !904, file: !904, line: 691, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!904 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!905 = !DISubroutineType(types: !906)
!906 = !{!52, !899, !898}
!907 = !DILocation(line: 0, scope: !144)
!908 = !DILocation(line: 581, column: 7, scope: !152)
!909 = !{!910, !910, i64 0}
!910 = !{!"int", !847, i64 0}
!911 = !DILocation(line: 581, column: 19, scope: !152)
!912 = !DILocation(line: 581, column: 7, scope: !144)
!913 = !DILocation(line: 585, column: 26, scope: !151)
!914 = !DILocation(line: 0, scope: !151)
!915 = !DILocation(line: 586, column: 23, scope: !151)
!916 = !DILocation(line: 586, column: 28, scope: !151)
!917 = !DILocation(line: 586, column: 32, scope: !151)
!918 = !{!847, !847, i64 0}
!919 = !DILocation(line: 586, column: 38, scope: !151)
!920 = !DILocalVariable(name: "__s1", arg: 1, scope: !921, file: !922, line: 1359, type: !107)
!921 = distinct !DISubprogram(name: "streq", scope: !922, file: !922, line: 1359, type: !923, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !925)
!922 = !DIFile(filename: "./lib/string.h", directory: "/src")
!923 = !DISubroutineType(types: !924)
!924 = !{!154, !107, !107}
!925 = !{!920, !926}
!926 = !DILocalVariable(name: "__s2", arg: 2, scope: !921, file: !922, line: 1359, type: !107)
!927 = !DILocation(line: 0, scope: !921, inlinedAt: !928)
!928 = distinct !DILocation(line: 586, column: 41, scope: !151)
!929 = !DILocation(line: 1361, column: 11, scope: !921, inlinedAt: !928)
!930 = !DILocation(line: 1361, column: 10, scope: !921, inlinedAt: !928)
!931 = !DILocation(line: 586, column: 19, scope: !151)
!932 = !DILocation(line: 587, column: 5, scope: !151)
!933 = !DILocation(line: 588, column: 7, scope: !934)
!934 = distinct !DILexicalBlock(scope: !144, file: !58, line: 588, column: 7)
!935 = !DILocation(line: 588, column: 7, scope: !144)
!936 = !DILocation(line: 590, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !934, file: !58, line: 589, column: 5)
!938 = !DILocation(line: 591, column: 7, scope: !937)
!939 = !DILocation(line: 595, column: 37, scope: !144)
!940 = !DILocation(line: 595, column: 35, scope: !144)
!941 = !DILocation(line: 596, column: 29, scope: !144)
!942 = !DILocation(line: 597, column: 8, scope: !160)
!943 = !DILocation(line: 597, column: 7, scope: !144)
!944 = !DILocation(line: 604, column: 24, scope: !159)
!945 = !DILocation(line: 604, column: 12, scope: !160)
!946 = !DILocation(line: 0, scope: !158)
!947 = !DILocation(line: 610, column: 16, scope: !158)
!948 = !DILocation(line: 610, column: 7, scope: !158)
!949 = !DILocation(line: 611, column: 21, scope: !158)
!950 = !{!951, !951, i64 0}
!951 = !{!"short", !847, i64 0}
!952 = !DILocation(line: 611, column: 19, scope: !158)
!953 = !DILocation(line: 611, column: 16, scope: !158)
!954 = !DILocation(line: 610, column: 30, scope: !158)
!955 = distinct !{!955, !948, !949, !956}
!956 = !{!"llvm.loop.mustprogress"}
!957 = !DILocation(line: 612, column: 18, scope: !958)
!958 = distinct !DILexicalBlock(scope: !158, file: !58, line: 612, column: 11)
!959 = !DILocation(line: 612, column: 11, scope: !158)
!960 = !DILocation(line: 618, column: 5, scope: !158)
!961 = !DILocation(line: 620, column: 23, scope: !144)
!962 = !DILocation(line: 625, column: 39, scope: !144)
!963 = !DILocation(line: 626, column: 3, scope: !144)
!964 = !DILocation(line: 626, column: 10, scope: !144)
!965 = !DILocation(line: 626, column: 21, scope: !144)
!966 = !DILocation(line: 628, column: 44, scope: !967)
!967 = distinct !DILexicalBlock(scope: !968, file: !58, line: 628, column: 11)
!968 = distinct !DILexicalBlock(scope: !144, file: !58, line: 627, column: 5)
!969 = !DILocation(line: 628, column: 32, scope: !967)
!970 = !DILocation(line: 628, column: 49, scope: !967)
!971 = !DILocation(line: 628, column: 11, scope: !968)
!972 = !DILocation(line: 630, column: 11, scope: !973)
!973 = distinct !DILexicalBlock(scope: !968, file: !58, line: 630, column: 11)
!974 = !DILocation(line: 630, column: 11, scope: !968)
!975 = !DILocation(line: 632, column: 26, scope: !976)
!976 = distinct !DILexicalBlock(scope: !977, file: !58, line: 632, column: 15)
!977 = distinct !DILexicalBlock(scope: !973, file: !58, line: 631, column: 9)
!978 = !DILocation(line: 632, column: 34, scope: !976)
!979 = !DILocation(line: 632, column: 37, scope: !976)
!980 = !DILocation(line: 632, column: 15, scope: !977)
!981 = !DILocation(line: 636, column: 16, scope: !982)
!982 = distinct !DILexicalBlock(scope: !977, file: !58, line: 636, column: 15)
!983 = !DILocation(line: 636, column: 29, scope: !982)
!984 = !DILocation(line: 640, column: 16, scope: !968)
!985 = distinct !{!985, !963, !986, !956}
!986 = !DILocation(line: 641, column: 5, scope: !144)
!987 = !DILocation(line: 644, column: 3, scope: !144)
!988 = !DILocation(line: 0, scope: !921, inlinedAt: !989)
!989 = distinct !DILocation(line: 648, column: 31, scope: !144)
!990 = !DILocation(line: 0, scope: !921, inlinedAt: !991)
!991 = distinct !DILocation(line: 649, column: 31, scope: !144)
!992 = !DILocation(line: 0, scope: !921, inlinedAt: !993)
!993 = distinct !DILocation(line: 650, column: 31, scope: !144)
!994 = !DILocation(line: 0, scope: !921, inlinedAt: !995)
!995 = distinct !DILocation(line: 651, column: 31, scope: !144)
!996 = !DILocation(line: 0, scope: !921, inlinedAt: !997)
!997 = distinct !DILocation(line: 652, column: 31, scope: !144)
!998 = !DILocation(line: 0, scope: !921, inlinedAt: !999)
!999 = distinct !DILocation(line: 653, column: 31, scope: !144)
!1000 = !DILocation(line: 0, scope: !921, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 654, column: 31, scope: !144)
!1002 = !DILocation(line: 0, scope: !921, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 655, column: 31, scope: !144)
!1004 = !DILocation(line: 0, scope: !921, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 656, column: 31, scope: !144)
!1006 = !DILocation(line: 0, scope: !921, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 657, column: 31, scope: !144)
!1008 = !DILocation(line: 663, column: 7, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !144, file: !58, line: 663, column: 7)
!1010 = !DILocation(line: 664, column: 7, scope: !1009)
!1011 = !DILocation(line: 664, column: 10, scope: !1009)
!1012 = !DILocation(line: 663, column: 7, scope: !144)
!1013 = !DILocation(line: 669, column: 7, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !58, line: 665, column: 5)
!1015 = !DILocation(line: 671, column: 5, scope: !1014)
!1016 = !DILocation(line: 676, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1009, file: !58, line: 673, column: 5)
!1018 = !DILocation(line: 679, column: 3, scope: !144)
!1019 = !DILocation(line: 683, column: 3, scope: !144)
!1020 = !DILocation(line: 686, column: 3, scope: !144)
!1021 = !DILocation(line: 688, column: 3, scope: !144)
!1022 = !DILocation(line: 691, column: 3, scope: !144)
!1023 = !DILocation(line: 695, column: 3, scope: !144)
!1024 = !DILocation(line: 696, column: 1, scope: !144)
!1025 = !DISubprogram(name: "setlocale", scope: !1026, file: !1026, line: 122, type: !1027, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1026 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!54, !52, !107}
!1029 = !DISubprogram(name: "strncmp", scope: !1030, file: !1030, line: 159, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1030 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!52, !107, !107, !104}
!1033 = !DISubprogram(name: "exit", scope: !1034, file: !1034, line: 624, type: !835, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1034 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1035 = !DISubprogram(name: "getenv", scope: !1034, file: !1034, line: 641, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!54, !107}
!1038 = !DISubprogram(name: "strcmp", scope: !1030, file: !1030, line: 156, type: !1039, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!52, !107, !107}
!1041 = !DISubprogram(name: "strspn", scope: !1030, file: !1030, line: 297, type: !1042, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!106, !107, !107}
!1044 = !DISubprogram(name: "strchr", scope: !1030, file: !1030, line: 246, type: !1045, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!54, !107, !52}
!1047 = !DISubprogram(name: "__ctype_b_loc", scope: !63, file: !63, line: 79, type: !1048, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!1053 = !DISubprogram(name: "strcspn", scope: !1030, file: !1030, line: 293, type: !1042, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1054 = !DISubprogram(name: "fwrite_unlocked", scope: !904, file: !904, line: 704, type: !1055, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!104, !1057, !104, !104, !898}
!1057 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1060 = !DILocation(line: 0, scope: !49)
!1061 = !DILocation(line: 534, column: 21, scope: !49)
!1062 = !DILocation(line: 534, column: 3, scope: !49)
!1063 = !DILocation(line: 535, column: 3, scope: !49)
!1064 = !DILocation(line: 536, column: 3, scope: !49)
!1065 = !DILocation(line: 537, column: 3, scope: !49)
!1066 = !DILocation(line: 539, column: 3, scope: !49)
!1067 = !DILocation(line: 541, column: 3, scope: !49)
!1068 = !DILocation(line: 549, column: 15, scope: !395)
!1069 = !DILocation(line: 0, scope: !395)
!1070 = !DILocation(line: 551, column: 11, scope: !395)
!1071 = !DILocation(line: 559, column: 9, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !395, file: !2, line: 555, column: 9)
!1073 = !DILocation(line: 561, column: 9, scope: !1072)
!1074 = !DILocation(line: 564, column: 11, scope: !1072)
!1075 = !DILocation(line: 568, column: 18, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !49, file: !2, line: 568, column: 7)
!1077 = !DILocation(line: 568, column: 16, scope: !1076)
!1078 = !DILocation(line: 568, column: 9, scope: !1076)
!1079 = !DILocation(line: 568, column: 7, scope: !49)
!1080 = !DILocation(line: 570, column: 7, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1076, file: !2, line: 569, column: 5)
!1082 = !DILocation(line: 571, column: 7, scope: !1081)
!1083 = !DILocation(line: 574, column: 17, scope: !49)
!1084 = !DILocation(line: 574, column: 10, scope: !49)
!1085 = !DILocation(line: 574, column: 33, scope: !49)
!1086 = !DILocation(line: 574, column: 3, scope: !49)
!1087 = !DISubprogram(name: "bindtextdomain", scope: !891, file: !891, line: 86, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!54, !107, !107}
!1090 = !DISubprogram(name: "textdomain", scope: !891, file: !891, line: 82, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1091 = !DISubprogram(name: "atexit", scope: !1034, file: !1034, line: 602, type: !1092, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!52, !477}
!1094 = !DISubprogram(name: "getopt_long", scope: !399, file: !399, line: 66, type: !1095, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !853)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!52, !52, !1097, !107, !1099, !404}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!1100 = distinct !DISubprogram(name: "tsort", scope: !2, file: !2, line: 429, type: !860, scopeLine: 430, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1113, !1114, !1115, !1117}
!1102 = !DILocalVariable(name: "file", arg: 1, scope: !1100, file: !2, line: 429, type: !107)
!1103 = !DILocalVariable(name: "ok", scope: !1100, file: !2, line: 431, type: !154)
!1104 = !DILocalVariable(name: "j", scope: !1100, file: !2, line: 432, type: !371)
!1105 = !DILocalVariable(name: "k", scope: !1100, file: !2, line: 433, type: !371)
!1106 = !DILocalVariable(name: "tokenbuffer", scope: !1100, file: !2, line: 434, type: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "token_buffer", file: !1108, line: 38, baseType: !1109)
!1108 = !DIFile(filename: "./lib/readtokens.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75cc48641d199743577b153a0d1c82de")
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenbuffer", file: !1108, line: 33, size: 128, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !1108, line: 35, baseType: !104, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1109, file: !1108, line: 36, baseType: !54, size: 64, offset: 64)
!1113 = !DILocalVariable(name: "is_stdin", scope: !1100, file: !2, line: 435, type: !154)
!1114 = !DILocalVariable(name: "root", scope: !1100, file: !2, line: 438, type: !371)
!1115 = !DILocalVariable(name: "len", scope: !1116, file: !2, line: 450, type: !104)
!1116 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 448, column: 5)
!1117 = !DILocalVariable(name: "p", scope: !1118, file: !2, line: 485, type: !382)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 484, column: 9)
!1119 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 479, column: 5)
!1120 = !DILocation(line: 0, scope: !1100)
!1121 = !DILocation(line: 434, column: 3, scope: !1100)
!1122 = !DILocation(line: 434, column: 16, scope: !1100)
!1123 = !DILocation(line: 0, scope: !921, inlinedAt: !1124)
!1124 = distinct !DILocation(line: 435, column: 19, scope: !1100)
!1125 = !DILocation(line: 1361, column: 11, scope: !921, inlinedAt: !1124)
!1126 = !DILocation(line: 1361, column: 10, scope: !921, inlinedAt: !1124)
!1127 = !DILocalVariable(name: "str", arg: 1, scope: !1128, file: !2, line: 101, type: !107)
!1128 = distinct !DISubprogram(name: "new_item", scope: !2, file: !2, line: 101, type: !1129, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1131)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!371, !107}
!1131 = !{!1127, !1132}
!1132 = !DILocalVariable(name: "k", scope: !1128, file: !2, line: 104, type: !371)
!1133 = !DILocation(line: 0, scope: !1128, inlinedAt: !1134)
!1134 = distinct !DILocation(line: 438, column: 23, scope: !1100)
!1135 = !DILocation(line: 104, column: 20, scope: !1128, inlinedAt: !1134)
!1136 = !DILocation(line: 440, column: 17, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 440, column: 7)
!1138 = !DILocation(line: 440, column: 42, scope: !1137)
!1139 = !DILocation(line: 440, column: 22, scope: !1137)
!1140 = !DILocation(line: 440, column: 7, scope: !1100)
!1141 = !DILocation(line: 441, column: 5, scope: !1137)
!1142 = !DILocation(line: 443, column: 12, scope: !1100)
!1143 = !DILocation(line: 443, column: 3, scope: !1100)
!1144 = !DILocation(line: 445, column: 3, scope: !1100)
!1145 = !DILocation(line: 447, column: 3, scope: !1100)
!1146 = !DILocation(line: 433, column: 16, scope: !1100)
!1147 = !DILocation(line: 450, column: 31, scope: !1116)
!1148 = !DILocation(line: 450, column: 20, scope: !1116)
!1149 = !DILocation(line: 0, scope: !1116)
!1150 = !DILocation(line: 451, column: 11, scope: !1116)
!1151 = !DILocation(line: 453, column: 15, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !2, line: 453, column: 15)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 452, column: 9)
!1154 = distinct !DILexicalBlock(scope: !1116, file: !2, line: 451, column: 11)
!1155 = !DILocalVariable(name: "__stream", arg: 1, scope: !1156, file: !1157, line: 135, type: !167)
!1156 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1157, file: !1157, line: 135, type: !1158, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1160)
!1157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!52, !167}
!1160 = !{!1155}
!1161 = !DILocation(line: 0, scope: !1156, inlinedAt: !1162)
!1162 = distinct !DILocation(line: 453, column: 15, scope: !1152)
!1163 = !DILocation(line: 137, column: 10, scope: !1156, inlinedAt: !1162)
!1164 = !{!1165, !910, i64 0}
!1165 = !{!"_IO_FILE", !910, i64 0, !846, i64 8, !846, i64 16, !846, i64 24, !846, i64 32, !846, i64 40, !846, i64 48, !846, i64 56, !846, i64 64, !846, i64 72, !846, i64 80, !846, i64 88, !846, i64 96, !846, i64 104, !910, i64 112, !910, i64 116, !1166, i64 120, !951, i64 128, !847, i64 130, !847, i64 131, !846, i64 136, !1166, i64 144, !846, i64 152, !846, i64 160, !846, i64 168, !846, i64 176, !1166, i64 184, !910, i64 192, !847, i64 196}
!1166 = !{!"long", !847, i64 0}
!1167 = !DILocation(line: 453, column: 15, scope: !1153)
!1168 = !DILocation(line: 454, column: 13, scope: !1152)
!1169 = !DILocation(line: 458, column: 7, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 458, column: 7)
!1171 = distinct !DILexicalBlock(scope: !1116, file: !2, line: 458, column: 7)
!1172 = !DILocation(line: 460, column: 42, scope: !1116)
!1173 = !{!1174, !846, i64 8}
!1174 = !{!"tokenbuffer", !1166, i64 0, !846, i64 8}
!1175 = !DILocalVariable(name: "root", arg: 1, scope: !1176, file: !2, line: 119, type: !371)
!1176 = distinct !DISubprogram(name: "search_item", scope: !2, file: !2, line: 119, type: !1177, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1179)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!371, !371, !107}
!1179 = !{!1175, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!1180 = !DILocalVariable(name: "str", arg: 2, scope: !1176, file: !2, line: 119, type: !107)
!1181 = !DILocalVariable(name: "p", scope: !1176, file: !2, line: 121, type: !371)
!1182 = !DILocalVariable(name: "q", scope: !1176, file: !2, line: 121, type: !371)
!1183 = !DILocalVariable(name: "r", scope: !1176, file: !2, line: 121, type: !371)
!1184 = !DILocalVariable(name: "s", scope: !1176, file: !2, line: 121, type: !371)
!1185 = !DILocalVariable(name: "t", scope: !1176, file: !2, line: 121, type: !371)
!1186 = !DILocalVariable(name: "a", scope: !1176, file: !2, line: 122, type: !52)
!1187 = !DILocalVariable(name: "cmp", scope: !1188, file: !2, line: 173, type: !52)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 172, column: 13)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 147, column: 9)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !2, line: 146, column: 11)
!1191 = distinct !DILexicalBlock(scope: !1176, file: !2, line: 134, column: 5)
!1192 = !DILocation(line: 0, scope: !1176, inlinedAt: !1193)
!1193 = distinct !DILocation(line: 460, column: 11, scope: !1116)
!1194 = !DILocation(line: 126, column: 13, scope: !1195, inlinedAt: !1193)
!1195 = distinct !DILexicalBlock(scope: !1176, file: !2, line: 126, column: 7)
!1196 = !{!1197, !846, i64 16}
!1197 = !{!"item", !846, i64 0, !846, i64 8, !846, i64 16, !847, i64 24, !1198, i64 25, !1166, i64 32, !846, i64 40, !846, i64 48}
!1198 = !{!"_Bool", !847, i64 0}
!1199 = !DILocation(line: 126, column: 19, scope: !1195, inlinedAt: !1193)
!1200 = !DILocation(line: 126, column: 7, scope: !1176, inlinedAt: !1193)
!1201 = !DILocation(line: 136, column: 27, scope: !1191, inlinedAt: !1193)
!1202 = !{!1197, !846, i64 0}
!1203 = !DILocation(line: 136, column: 11, scope: !1191, inlinedAt: !1193)
!1204 = !DILocation(line: 137, column: 13, scope: !1205, inlinedAt: !1193)
!1205 = distinct !DILexicalBlock(scope: !1191, file: !2, line: 137, column: 11)
!1206 = !DILocation(line: 137, column: 11, scope: !1191, inlinedAt: !1193)
!1207 = !DILocation(line: 0, scope: !1128, inlinedAt: !1208)
!1208 = distinct !DILocation(line: 127, column: 27, scope: !1195, inlinedAt: !1193)
!1209 = !DILocation(line: 104, column: 20, scope: !1128, inlinedAt: !1208)
!1210 = !DILocation(line: 105, column: 7, scope: !1211, inlinedAt: !1208)
!1211 = distinct !DILexicalBlock(scope: !1128, file: !2, line: 105, column: 7)
!1212 = !DILocation(line: 105, column: 7, scope: !1128, inlinedAt: !1208)
!1213 = !DILocation(line: 106, column: 14, scope: !1211, inlinedAt: !1208)
!1214 = !DILocation(line: 106, column: 12, scope: !1211, inlinedAt: !1208)
!1215 = !DILocation(line: 106, column: 5, scope: !1211, inlinedAt: !1208)
!1216 = !DILocation(line: 127, column: 25, scope: !1195, inlinedAt: !1193)
!1217 = !DILocation(line: 127, column: 5, scope: !1195, inlinedAt: !1193)
!1218 = !DILocation(line: 141, column: 13, scope: !1219, inlinedAt: !1193)
!1219 = distinct !DILexicalBlock(scope: !1191, file: !2, line: 141, column: 11)
!1220 = !DILocation(line: 141, column: 11, scope: !1191, inlinedAt: !1193)
!1221 = !DILocation(line: 0, scope: !1219, inlinedAt: !1193)
!1222 = !DILocation(line: 146, column: 13, scope: !1190, inlinedAt: !1193)
!1223 = !DILocation(line: 146, column: 11, scope: !1191, inlinedAt: !1193)
!1224 = !DILocation(line: 0, scope: !1128, inlinedAt: !1225)
!1225 = distinct !DILocation(line: 149, column: 15, scope: !1189, inlinedAt: !1193)
!1226 = !DILocation(line: 104, column: 20, scope: !1128, inlinedAt: !1225)
!1227 = !DILocation(line: 105, column: 7, scope: !1211, inlinedAt: !1225)
!1228 = !DILocation(line: 105, column: 7, scope: !1128, inlinedAt: !1225)
!1229 = !DILocation(line: 106, column: 14, scope: !1211, inlinedAt: !1225)
!1230 = !DILocation(line: 106, column: 12, scope: !1211, inlinedAt: !1225)
!1231 = !DILocation(line: 106, column: 5, scope: !1211, inlinedAt: !1225)
!1232 = !DILocation(line: 0, scope: !1233, inlinedAt: !1193)
!1233 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 152, column: 15)
!1234 = !DILocation(line: 158, column: 31, scope: !1189, inlinedAt: !1193)
!1235 = !DILocation(line: 158, column: 15, scope: !1189, inlinedAt: !1193)
!1236 = !DILocation(line: 159, column: 17, scope: !1237, inlinedAt: !1193)
!1237 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 159, column: 15)
!1238 = !DILocation(line: 159, column: 15, scope: !1189, inlinedAt: !1193)
!1239 = !DILocation(line: 161, column: 26, scope: !1240, inlinedAt: !1193)
!1240 = distinct !DILexicalBlock(scope: !1237, file: !2, line: 160, column: 13)
!1241 = !DILocation(line: 163, column: 13, scope: !1240, inlinedAt: !1193)
!1242 = !DILocation(line: 166, column: 15, scope: !1243, inlinedAt: !1193)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !2, line: 166, column: 15)
!1244 = distinct !DILexicalBlock(scope: !1245, file: !2, line: 166, column: 15)
!1245 = distinct !DILexicalBlock(scope: !1237, file: !2, line: 165, column: 13)
!1246 = !DILocation(line: 166, column: 15, scope: !1244, inlinedAt: !1193)
!1247 = !DILocation(line: 167, column: 26, scope: !1245, inlinedAt: !1193)
!1248 = !DILocation(line: 0, scope: !1237, inlinedAt: !1193)
!1249 = !DILocation(line: 171, column: 20, scope: !1189, inlinedAt: !1193)
!1250 = !DILocation(line: 171, column: 11, scope: !1189, inlinedAt: !1193)
!1251 = !DILocation(line: 173, column: 41, scope: !1188, inlinedAt: !1193)
