; ModuleID = 'src/tty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [67 x i8] c"Print the file name of the terminal connected to standard input.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"tty\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [76 x i8] c"  -s, --silent, --quiet\0A         print nothing, only return an exit status\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !27

!86 = !DIEnumerator(name: "_IScntrl", value: 2)
!87 = !DIEnumerator(name: "_ISpunct", value: 4)
!88 = !DIEnumerator(name: "_ISalnum", value: 8)
!89 = !{!90, !91, !70, !92, !93, !96, !98}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !100, !105, !110, !115, !117, !119, !122, !204, !209, !211, !213, !218, !220, !222, !224, !229, !231, !233, !235, !240, !245, !247, !249, !251, !253, !255, !257, !259, !264, !269, !274, !276, !278, !280, !282, !284, !289, !291, !293, !298, !303, !308, !313, !315, !317, !319, !57}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 14)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 16)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 17)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !102, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !44, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "silent", scope: !59, file: !2, line: 47, type: !121, isLocal: true, isDefinition: true)
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !124, file: !69, line: 575, type: !70, isLocal: true, isDefinition: true)
!124 = distinct !DISubprogram(name: "oputs_", scope: !69, file: !69, line: 573, type: !125, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !127)
!125 = !DISubroutineType(cc: DW_CC_nocall, types: !126)
!126 = !{null, !96, !96}
!127 = !{!128, !129, !130, !133, !134, !135, !136, !140, !141, !142, !143, !145, !198, !199, !200, !202, !203}
!128 = !DILocalVariable(name: "program", arg: 1, scope: !124, file: !69, line: 573, type: !96)
!129 = !DILocalVariable(name: "option", arg: 2, scope: !124, file: !69, line: 573, type: !96)
!130 = !DILocalVariable(name: "term", scope: !131, file: !69, line: 585, type: !96)
!131 = distinct !DILexicalBlock(scope: !132, file: !69, line: 582, column: 5)
!132 = distinct !DILexicalBlock(scope: !124, file: !69, line: 581, column: 7)
!133 = !DILocalVariable(name: "double_space", scope: !124, file: !69, line: 594, type: !121)
!134 = !DILocalVariable(name: "first_word", scope: !124, file: !69, line: 595, type: !96)
!135 = !DILocalVariable(name: "option_text", scope: !124, file: !69, line: 596, type: !96)
!136 = !DILocalVariable(name: "s", scope: !137, file: !69, line: 608, type: !96)
!137 = distinct !DILexicalBlock(scope: !138, file: !69, line: 605, column: 5)
!138 = distinct !DILexicalBlock(scope: !139, file: !69, line: 604, column: 12)
!139 = distinct !DILexicalBlock(scope: !124, file: !69, line: 597, column: 7)
!140 = !DILocalVariable(name: "spaces", scope: !137, file: !69, line: 609, type: !93)
!141 = !DILocalVariable(name: "anchor_len", scope: !124, file: !69, line: 620, type: !93)
!142 = !DILocalVariable(name: "desc_text", scope: !124, file: !69, line: 625, type: !96)
!143 = !DILocalVariable(name: "__ptr", scope: !144, file: !69, line: 644, type: !96)
!144 = distinct !DILexicalBlock(scope: !124, file: !69, line: 644, column: 3)
!145 = !DILocalVariable(name: "__stream", scope: !144, file: !69, line: 644, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !148, line: 7, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !150, line: 49, size: 1728, elements: !151)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !167, !169, !170, !171, !175, !176, !178, !179, !182, !184, !187, !190, !191, !192, !193, !194}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !149, file: !150, line: 51, baseType: !70, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !149, file: !150, line: 54, baseType: !90, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !149, file: !150, line: 55, baseType: !90, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !149, file: !150, line: 56, baseType: !90, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !149, file: !150, line: 57, baseType: !90, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !149, file: !150, line: 58, baseType: !90, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !149, file: !150, line: 59, baseType: !90, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !149, file: !150, line: 60, baseType: !90, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !149, file: !150, line: 61, baseType: !90, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !149, file: !150, line: 64, baseType: !90, size: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !149, file: !150, line: 65, baseType: !90, size: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !149, file: !150, line: 66, baseType: !90, size: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !149, file: !150, line: 68, baseType: !165, size: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !150, line: 36, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !149, file: !150, line: 70, baseType: !168, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !149, file: !150, line: 72, baseType: !70, size: 32, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !149, file: !150, line: 73, baseType: !70, size: 32, offset: 928)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !149, file: !150, line: 74, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !173, line: 152, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!174 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !149, file: !150, line: 77, baseType: !92, size: 16, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !149, file: !150, line: 78, baseType: !177, size: 8, offset: 1040)
!177 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !149, file: !150, line: 79, baseType: !39, size: 8, offset: 1048)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !149, file: !150, line: 81, baseType: !180, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !150, line: 43, baseType: null)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !149, file: !150, line: 89, baseType: !183, size: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !173, line: 153, baseType: !174)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !149, file: !150, line: 91, baseType: !185, size: 64, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !150, line: 37, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !149, file: !150, line: 92, baseType: !188, size: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !150, line: 38, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !149, file: !150, line: 93, baseType: !168, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !149, file: !150, line: 94, baseType: !91, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !149, file: !150, line: 95, baseType: !93, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !149, file: !150, line: 96, baseType: !70, size: 32, offset: 1536)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !149, file: !150, line: 98, baseType: !195, size: 160, offset: 1568)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 20)
!198 = !DILocalVariable(name: "__cnt", scope: !144, file: !69, line: 644, type: !93)
!199 = !DILocalVariable(name: "url_program", scope: !124, file: !69, line: 648, type: !96)
!200 = !DILocalVariable(name: "__ptr", scope: !201, file: !69, line: 686, type: !96)
!201 = distinct !DILexicalBlock(scope: !124, file: !69, line: 686, column: 3)
!202 = !DILocalVariable(name: "__stream", scope: !201, file: !69, line: 686, type: !146)
!203 = !DILocalVariable(name: "__cnt", scope: !201, file: !69, line: 686, type: !93)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !69, line: 585, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 5)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !69, line: 586, type: !206, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !69, line: 595, type: !19, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !69, line: 620, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 6)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !54, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !206, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !19, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !69, line: 650, type: !206, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !215, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !215, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !69, line: 652, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 7)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !69, line: 653, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 8)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !69, line: 654, type: !44, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !69, line: 655, type: !44, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !69, line: 656, type: !44, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !69, line: 657, type: !44, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !69, line: 663, type: !237, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !69, line: 664, type: !44, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !112, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 40)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 15)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 61)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !226, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !206, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !206, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !242, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !107, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 22)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !266, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !19, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 71)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 27)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 51)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 12)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !237, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !215, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !206, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !242, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 1280, elements: !207)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !324, line: 50, size: 256, elements: !325)
!324 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!325 = !{!326, !327, !328, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !323, file: !324, line: 52, baseType: !96, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !323, file: !324, line: 55, baseType: !70, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !324, line: 56, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !323, file: !324, line: 57, baseType: !70, size: 32, offset: 192)
!331 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !334, line: 3, type: !266, isLocal: true, isDefinition: true)
!334 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "Version", scope: !337, file: !334, line: 3, type: !96, isLocal: false, isDefinition: true)
!337 = distinct !DICompileUnit(language: DW_LANG_C11, file: !334, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !338, splitDebugInlining: false, nameTableKind: None)
!338 = !{!332, !335}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "file_name", scope: !341, file: !342, line: 45, type: !96, isLocal: true, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C11, file: !342, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !343, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!343 = !{!344, !346, !348, !350, !339, !352}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !342, line: 121, type: !237, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !342, line: 121, type: !310, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !342, line: 123, type: !237, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !342, line: 126, type: !226, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !341, file: !342, line: 55, type: !121, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !356, file: !357, line: 66, type: !403, isLocal: false, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C11, file: !357, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!358 = !{!91, !98}
!359 = !{!360, !362, !382, !384, !386, !388, !354, !390, !392, !394, !396, !401}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !357, line: 272, type: !206, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "old_file_name", scope: !364, file: !357, line: 304, type: !96, isLocal: true, isDefinition: true)
!364 = distinct !DISubprogram(name: "verror_at_line", scope: !357, file: !357, line: 298, type: !365, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !375)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !70, !70, !96, !62, !96, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !369)
!369 = !{!370, !372, !373, !374}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !368, file: !371, baseType: !62, size: 32)
!371 = !DIFile(filename: "lib/error.c", directory: "/src")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !368, file: !371, baseType: !62, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !368, file: !371, baseType: !91, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !368, file: !371, baseType: !91, size: 64, offset: 128)
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DILocalVariable(name: "status", arg: 1, scope: !364, file: !357, line: 298, type: !70)
!377 = !DILocalVariable(name: "errnum", arg: 2, scope: !364, file: !357, line: 298, type: !70)
!378 = !DILocalVariable(name: "file_name", arg: 3, scope: !364, file: !357, line: 298, type: !96)
!379 = !DILocalVariable(name: "line_number", arg: 4, scope: !364, file: !357, line: 298, type: !62)
!380 = !DILocalVariable(name: "message", arg: 5, scope: !364, file: !357, line: 298, type: !96)
!381 = !DILocalVariable(name: "args", arg: 6, scope: !364, file: !357, line: 298, type: !367)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "old_line_number", scope: !364, file: !357, line: 305, type: !62, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !357, line: 338, type: !19, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !357, line: 346, type: !242, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !357, line: 346, type: !54, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "error_message_count", scope: !356, file: !357, line: 69, type: !62, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !356, file: !357, line: 295, type: !70, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !357, line: 208, type: !237, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !357, line: 208, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 21)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !357, line: 214, type: !206, isLocal: true, isDefinition: true)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null}
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "program_name", scope: !408, file: !409, line: 31, type: !96, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, globals: !411, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!410 = !{!90}
!411 = !{!406, !412, !414}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !409, line: 46, type: !242, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !409, line: 49, type: !19, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "utf07FF", scope: !418, file: !419, line: 46, type: !446, isLocal: true, isDefinition: true)
!418 = distinct !DISubprogram(name: "proper_name_lite", scope: !419, file: !419, line: 38, type: !420, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !424)
!419 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!420 = !DISubroutineType(types: !421)
!421 = !{!96, !96, !96}
!422 = distinct !DICompileUnit(language: DW_LANG_C11, file: !419, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !423, splitDebugInlining: false, nameTableKind: None)
!423 = !{!416}
!424 = !{!425, !426, !427, !428, !433}
!425 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !418, file: !419, line: 38, type: !96)
!426 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !418, file: !419, line: 38, type: !96)
!427 = !DILocalVariable(name: "translation", scope: !418, file: !419, line: 40, type: !96)
!428 = !DILocalVariable(name: "w", scope: !418, file: !419, line: 47, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !430, line: 37, baseType: !431)
!430 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !173, line: 57, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !173, line: 42, baseType: !62)
!433 = !DILocalVariable(name: "mbs", scope: !418, file: !419, line: 48, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !435, line: 6, baseType: !436)
!435 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !437, line: 21, baseType: !438)
!437 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 13, size: 64, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !438, file: !437, line: 15, baseType: !70, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !438, file: !437, line: 20, baseType: !442, size: 32, offset: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !438, file: !437, line: 16, size: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !442, file: !437, line: 18, baseType: !62, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !442, file: !437, line: 19, baseType: !19, size: 32)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 16, elements: !55)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !449, line: 78, type: !242, isLocal: true, isDefinition: true)
!449 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !449, line: 79, type: !215, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !449, line: 80, type: !454, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 13)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !449, line: 81, type: !454, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !449, line: 82, type: !195, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !449, line: 83, type: !54, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !449, line: 84, type: !242, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !449, line: 85, type: !237, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !449, line: 86, type: !237, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !449, line: 87, type: !242, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !473, file: !449, line: 76, type: !559, isLocal: false, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C11, file: !449, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !474, retainedTypes: !494, globals: !495, splitDebugInlining: false, nameTableKind: None)
!474 = !{!475, !489, !74}
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !476, line: 42, baseType: !62, size: 32, elements: !477)
!476 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!478 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!479 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!480 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!481 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!482 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!483 = !DIEnumerator(name: "c_quoting_style", value: 5)
!484 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!485 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!486 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!487 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!488 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !476, line: 254, baseType: !62, size: 32, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!492 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!493 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!494 = !{!70, !92, !93}
!495 = !{!447, !450, !452, !457, !459, !461, !463, !465, !467, !469, !471, !496, !500, !510, !512, !517, !519, !521, !523, !525, !548, !555, !557}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !473, file: !449, line: 92, type: !498, isLocal: false, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 320, elements: !45)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !473, file: !449, line: 1040, type: !502, isLocal: false, isDefinition: true)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !449, line: 56, size: 448, elements: !503)
!503 = !{!504, !505, !506, !508, !509}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !502, file: !449, line: 59, baseType: !475, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !449, line: 62, baseType: !70, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !502, file: !449, line: 66, baseType: !507, size: 256, offset: 64)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !243)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !502, file: !449, line: 69, baseType: !96, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !502, file: !449, line: 72, baseType: !96, size: 64, offset: 384)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !473, file: !449, line: 107, type: !502, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "slot0", scope: !473, file: !449, line: 831, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 256)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !449, line: 321, type: !54, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !449, line: 357, type: !54, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !449, line: 358, type: !54, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !449, line: 199, type: !237, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "quote", scope: !527, file: !449, line: 228, type: !546, isLocal: true, isDefinition: true)
!527 = distinct !DISubprogram(name: "gettext_quote", scope: !449, file: !449, line: 197, type: !528, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !473, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!96, !96, !475}
!530 = !{!531, !532, !533, !534, !535}
!531 = !DILocalVariable(name: "msgid", arg: 1, scope: !527, file: !449, line: 197, type: !96)
!532 = !DILocalVariable(name: "s", arg: 2, scope: !527, file: !449, line: 197, type: !475)
!533 = !DILocalVariable(name: "translation", scope: !527, file: !449, line: 199, type: !96)
!534 = !DILocalVariable(name: "w", scope: !527, file: !449, line: 229, type: !429)
!535 = !DILocalVariable(name: "mbs", scope: !527, file: !449, line: 230, type: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !435, line: 6, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !437, line: 21, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 13, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !538, file: !437, line: 15, baseType: !70, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !538, file: !437, line: 20, baseType: !542, size: 32, offset: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !538, file: !437, line: 16, size: 32, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !542, file: !437, line: 18, baseType: !62, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !542, file: !437, line: 19, baseType: !19, size: 32)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !547)
!547 = !{!56, !21}
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "slotvec", scope: !473, file: !449, line: 834, type: !550, isLocal: true, isDefinition: true)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !449, line: 823, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !551, file: !449, line: 825, baseType: !93, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !551, file: !449, line: 826, baseType: !90, size: 64, offset: 64)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "nslots", scope: !473, file: !449, line: 832, type: !70, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "slotvec0", scope: !473, file: !449, line: 833, type: !551, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 704, elements: !561)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!561 = !{!562}
!562 = !DISubrange(count: 11)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !565, line: 67, type: !310, isLocal: true, isDefinition: true)
!565 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !565, line: 69, type: !237, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !565, line: 83, type: !237, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !565, line: 83, type: !19, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !565, line: 85, type: !54, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !565, line: 88, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 171)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !565, line: 88, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 34)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !565, line: 105, type: !107, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !565, line: 109, type: !9, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !565, line: 113, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 28)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !565, line: 120, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !565, line: 127, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 36)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !565, line: 134, type: !261, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !565, line: 142, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 44)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !565, line: 150, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 48)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !565, line: 159, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 52)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !565, line: 170, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 60)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !565, line: 248, type: !195, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !565, line: 248, type: !286, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !565, line: 254, type: !195, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !565, line: 254, type: !102, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !565, line: 254, type: !261, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !565, line: 259, type: !3, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !565, line: 259, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 29)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !644, file: !645, line: 26, type: !647, isLocal: false, isDefinition: true)
!644 = distinct !DICompileUnit(language: DW_LANG_C11, file: !645, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !646, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!646 = !{!642}
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 376, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 47)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "exit_failure", scope: !652, file: !653, line: 24, type: !655, isLocal: false, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C11, file: !653, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !654, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!654 = !{!650}
!655 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !658, line: 34, type: !226, isLocal: true, isDefinition: true)
!658 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !658, line: 34, type: !237, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !658, line: 34, type: !112, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !665, line: 108, type: !39, isLocal: true, isDefinition: true)
!665 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "internal_state", scope: !668, file: !665, line: 97, type: !671, isLocal: true, isDefinition: true)
!668 = distinct !DICompileUnit(language: DW_LANG_C11, file: !665, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !669, globals: !670, splitDebugInlining: false, nameTableKind: None)
!669 = !{!91, !93, !98}
!670 = !{!663, !666}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !435, line: 6, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !437, line: 21, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 13, size: 64, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !673, file: !437, line: 15, baseType: !70, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !673, file: !437, line: 20, baseType: !677, size: 32, offset: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !673, file: !437, line: 16, size: 32, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !677, file: !437, line: 18, baseType: !62, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !677, file: !437, line: 19, baseType: !19, size: 32)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !683, line: 35, type: !215, isLocal: true, isDefinition: true)
!683 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!684 = distinct !DICompileUnit(language: DW_LANG_C11, file: !685, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!686 = distinct !DICompileUnit(language: DW_LANG_C11, file: !565, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !687, retainedTypes: !691, globals: !692, splitDebugInlining: false, nameTableKind: None)
!687 = !{!688}
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !565, line: 40, baseType: !62, size: 32, elements: !689)
!689 = !{!690}
!690 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!691 = !{!91}
!692 = !{!563, !566, !568, !570, !572, !574, !579, !584, !586, !588, !593, !598, !603, !605, !610, !615, !620, !625, !627, !629, !631, !633, !635, !637}
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !694, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !695, retainedTypes: !726, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!695 = !{!696, !708}
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !697, file: !694, line: 188, baseType: !62, size: 32, elements: !706)
!697 = distinct !DISubprogram(name: "x2nrealloc", scope: !694, file: !694, line: 176, type: !698, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !693, retainedNodes: !701)
!698 = !DISubroutineType(types: !699)
!699 = !{!91, !91, !700, !93}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!701 = !{!702, !703, !704, !705}
!702 = !DILocalVariable(name: "p", arg: 1, scope: !697, file: !694, line: 176, type: !91)
!703 = !DILocalVariable(name: "pn", arg: 2, scope: !697, file: !694, line: 176, type: !700)
!704 = !DILocalVariable(name: "s", arg: 3, scope: !697, file: !694, line: 176, type: !93)
!705 = !DILocalVariable(name: "n", scope: !697, file: !694, line: 178, type: !93)
!706 = !{!707}
!707 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !709, file: !694, line: 228, baseType: !62, size: 32, elements: !706)
!709 = distinct !DISubprogram(name: "xpalloc", scope: !694, file: !694, line: 223, type: !710, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !693, retainedNodes: !716)
!710 = !DISubroutineType(types: !711)
!711 = !{!91, !91, !712, !713, !715, !713}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !714, line: 130, baseType: !715)
!714 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !94, line: 35, baseType: !174)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725}
!717 = !DILocalVariable(name: "pa", arg: 1, scope: !709, file: !694, line: 223, type: !91)
!718 = !DILocalVariable(name: "pn", arg: 2, scope: !709, file: !694, line: 223, type: !712)
!719 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !709, file: !694, line: 223, type: !713)
!720 = !DILocalVariable(name: "n_max", arg: 4, scope: !709, file: !694, line: 223, type: !715)
!721 = !DILocalVariable(name: "s", arg: 5, scope: !709, file: !694, line: 223, type: !713)
!722 = !DILocalVariable(name: "n0", scope: !709, file: !694, line: 230, type: !713)
!723 = !DILocalVariable(name: "n", scope: !709, file: !694, line: 237, type: !713)
!724 = !DILocalVariable(name: "nbytes", scope: !709, file: !694, line: 248, type: !713)
!725 = !DILocalVariable(name: "adjusted_nbytes", scope: !709, file: !694, line: 252, type: !713)
!726 = !{!90, !91, !121, !174, !95}
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !658, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !728, splitDebugInlining: false, nameTableKind: None)
!728 = !{!656, !659, !661}
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !730, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !732, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!733 = distinct !DICompileUnit(language: DW_LANG_C11, file: !734, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !691, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!735 = distinct !DICompileUnit(language: DW_LANG_C11, file: !736, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !691, splitDebugInlining: false, nameTableKind: None)
!736 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!737 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !739, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!739 = !{!121, !95, !91}
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !683, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !741, splitDebugInlining: false, nameTableKind: None)
!741 = !{!742, !681}
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !683, line: 35, type: !54, isLocal: true, isDefinition: true)
!744 = distinct !DICompileUnit(language: DW_LANG_C11, file: !745, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!746 = distinct !DICompileUnit(language: DW_LANG_C11, file: !747, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !691, splitDebugInlining: false, nameTableKind: None)
!747 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!748 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!749 = !{i32 7, !"Dwarf Version", i32 5}
!750 = !{i32 2, !"Debug Info Version", i32 3}
!751 = !{i32 1, !"wchar_size", i32 4}
!752 = !{i32 8, !"PIC Level", i32 2}
!753 = !{i32 7, !"PIE Level", i32 2}
!754 = !{i32 7, !"uwtable", i32 2}
!755 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 59, type: !756, scopeLine: 60, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !758)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !70}
!758 = !{!759}
!759 = !DILocalVariable(name: "status", arg: 1, scope: !755, file: !2, line: 59, type: !70)
!760 = !DILocation(line: 0, scope: !755)
!761 = !DILocation(line: 61, column: 14, scope: !762)
!762 = distinct !DILexicalBlock(scope: !755, file: !2, line: 61, column: 7)
!763 = !DILocation(line: 61, column: 7, scope: !755)
!764 = !DILocation(line: 62, column: 5, scope: !765)
!765 = distinct !DILexicalBlock(scope: !762, file: !2, line: 62, column: 5)
!766 = !{!767, !767, i64 0}
!767 = !{!"any pointer", !768, i64 0}
!768 = !{!"omnipotent char", !769, i64 0}
!769 = !{!"Simple C/C++ TBAA"}
!770 = !DILocation(line: 65, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !762, file: !2, line: 64, column: 5)
!772 = !DILocation(line: 66, column: 7, scope: !771)
!773 = !DILocation(line: 70, column: 7, scope: !771)
!774 = !DILocation(line: 74, column: 7, scope: !771)
!775 = !DILocation(line: 75, column: 7, scope: !771)
!776 = !DILocalVariable(name: "program", arg: 1, scope: !777, file: !69, line: 836, type: !96)
!777 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !778, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !780)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !96}
!780 = !{!776, !781, !788, !789, !791, !792}
!781 = !DILocalVariable(name: "infomap", scope: !777, file: !69, line: 838, type: !782)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 896, elements: !238)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !777, file: !69, line: 838, size: 128, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !784, file: !69, line: 838, baseType: !96, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !784, file: !69, line: 838, baseType: !96, size: 64, offset: 64)
!788 = !DILocalVariable(name: "node", scope: !777, file: !69, line: 848, type: !96)
!789 = !DILocalVariable(name: "map_prog", scope: !777, file: !69, line: 849, type: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!791 = !DILocalVariable(name: "lc_messages", scope: !777, file: !69, line: 861, type: !96)
!792 = !DILocalVariable(name: "url_program", scope: !777, file: !69, line: 874, type: !96)
!793 = !DILocation(line: 0, scope: !777, inlinedAt: !794)
!794 = distinct !DILocation(line: 76, column: 7, scope: !771)
!795 = !DILocation(line: 857, column: 3, scope: !777, inlinedAt: !794)
!796 = !DILocation(line: 861, column: 29, scope: !777, inlinedAt: !794)
!797 = !DILocation(line: 862, column: 7, scope: !798, inlinedAt: !794)
!798 = distinct !DILexicalBlock(scope: !777, file: !69, line: 862, column: 7)
!799 = !DILocation(line: 862, column: 19, scope: !798, inlinedAt: !794)
!800 = !DILocation(line: 862, column: 22, scope: !798, inlinedAt: !794)
!801 = !DILocation(line: 862, column: 7, scope: !777, inlinedAt: !794)
!802 = !DILocation(line: 868, column: 7, scope: !803, inlinedAt: !794)
!803 = distinct !DILexicalBlock(scope: !798, file: !69, line: 863, column: 5)
!804 = !DILocation(line: 870, column: 5, scope: !803, inlinedAt: !794)
!805 = !DILocation(line: 875, column: 3, scope: !777, inlinedAt: !794)
!806 = !DILocation(line: 877, column: 3, scope: !777, inlinedAt: !794)
!807 = !DILocation(line: 78, column: 3, scope: !755)
!808 = !DISubprogram(name: "dcgettext", scope: !809, file: !809, line: 51, type: !810, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!809 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!810 = !DISubroutineType(types: !811)
!811 = !{!90, !96, !96, !70}
!812 = !{}
!813 = !DISubprogram(name: "__fprintf_chk", scope: !814, file: !814, line: 93, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!814 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!815 = !DISubroutineType(types: !816)
!816 = !{!70, !817, !70, !818, null}
!817 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !146)
!818 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !96)
!819 = !DISubprogram(name: "__printf_chk", scope: !814, file: !814, line: 95, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!820 = !DISubroutineType(types: !821)
!821 = !{!70, !70, !818, null}
!822 = !DISubprogram(name: "fputs_unlocked", scope: !823, file: !823, line: 691, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!823 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!824 = !DISubroutineType(types: !825)
!825 = !{!70, !818, !817}
!826 = !DILocation(line: 0, scope: !124)
!827 = !DILocation(line: 581, column: 7, scope: !132)
!828 = !{!829, !829, i64 0}
!829 = !{!"int", !768, i64 0}
!830 = !DILocation(line: 581, column: 19, scope: !132)
!831 = !DILocation(line: 581, column: 7, scope: !124)
!832 = !DILocation(line: 585, column: 26, scope: !131)
!833 = !DILocation(line: 0, scope: !131)
!834 = !DILocation(line: 586, column: 23, scope: !131)
!835 = !DILocation(line: 586, column: 28, scope: !131)
!836 = !DILocation(line: 586, column: 32, scope: !131)
!837 = !{!768, !768, i64 0}
!838 = !DILocation(line: 586, column: 38, scope: !131)
!839 = !DILocalVariable(name: "__s1", arg: 1, scope: !840, file: !841, line: 1359, type: !96)
!840 = distinct !DISubprogram(name: "streq", scope: !841, file: !841, line: 1359, type: !842, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !844)
!841 = !DIFile(filename: "./lib/string.h", directory: "/src")
!842 = !DISubroutineType(types: !843)
!843 = !{!121, !96, !96}
!844 = !{!839, !845}
!845 = !DILocalVariable(name: "__s2", arg: 2, scope: !840, file: !841, line: 1359, type: !96)
!846 = !DILocation(line: 0, scope: !840, inlinedAt: !847)
!847 = distinct !DILocation(line: 586, column: 41, scope: !131)
!848 = !DILocation(line: 1361, column: 11, scope: !840, inlinedAt: !847)
!849 = !DILocation(line: 1361, column: 10, scope: !840, inlinedAt: !847)
!850 = !DILocation(line: 586, column: 19, scope: !131)
!851 = !DILocation(line: 587, column: 5, scope: !131)
!852 = !DILocation(line: 588, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !124, file: !69, line: 588, column: 7)
!854 = !DILocation(line: 588, column: 7, scope: !124)
!855 = !DILocation(line: 590, column: 7, scope: !856)
!856 = distinct !DILexicalBlock(scope: !853, file: !69, line: 589, column: 5)
!857 = !DILocation(line: 591, column: 7, scope: !856)
!858 = !DILocation(line: 595, column: 37, scope: !124)
!859 = !DILocation(line: 595, column: 35, scope: !124)
!860 = !DILocation(line: 596, column: 29, scope: !124)
!861 = !DILocation(line: 597, column: 8, scope: !139)
!862 = !DILocation(line: 597, column: 7, scope: !124)
!863 = !DILocation(line: 604, column: 24, scope: !138)
!864 = !DILocation(line: 604, column: 12, scope: !139)
!865 = !DILocation(line: 0, scope: !137)
!866 = !DILocation(line: 610, column: 16, scope: !137)
!867 = !DILocation(line: 610, column: 7, scope: !137)
!868 = !DILocation(line: 611, column: 21, scope: !137)
!869 = !{!870, !870, i64 0}
!870 = !{!"short", !768, i64 0}
!871 = !DILocation(line: 611, column: 19, scope: !137)
!872 = !DILocation(line: 611, column: 16, scope: !137)
!873 = !DILocation(line: 610, column: 30, scope: !137)
!874 = distinct !{!874, !867, !868, !875}
!875 = !{!"llvm.loop.mustprogress"}
!876 = !DILocation(line: 612, column: 18, scope: !877)
!877 = distinct !DILexicalBlock(scope: !137, file: !69, line: 612, column: 11)
!878 = !DILocation(line: 612, column: 11, scope: !137)
!879 = !DILocation(line: 618, column: 5, scope: !137)
!880 = !DILocation(line: 620, column: 23, scope: !124)
!881 = !DILocation(line: 625, column: 39, scope: !124)
!882 = !DILocation(line: 626, column: 3, scope: !124)
!883 = !DILocation(line: 626, column: 10, scope: !124)
!884 = !DILocation(line: 626, column: 21, scope: !124)
!885 = !DILocation(line: 628, column: 44, scope: !886)
!886 = distinct !DILexicalBlock(scope: !887, file: !69, line: 628, column: 11)
!887 = distinct !DILexicalBlock(scope: !124, file: !69, line: 627, column: 5)
!888 = !DILocation(line: 628, column: 32, scope: !886)
!889 = !DILocation(line: 628, column: 49, scope: !886)
!890 = !DILocation(line: 628, column: 11, scope: !887)
!891 = !DILocation(line: 630, column: 11, scope: !892)
!892 = distinct !DILexicalBlock(scope: !887, file: !69, line: 630, column: 11)
!893 = !DILocation(line: 630, column: 11, scope: !887)
!894 = !DILocation(line: 632, column: 26, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !69, line: 632, column: 15)
!896 = distinct !DILexicalBlock(scope: !892, file: !69, line: 631, column: 9)
!897 = !DILocation(line: 632, column: 34, scope: !895)
!898 = !DILocation(line: 632, column: 37, scope: !895)
!899 = !DILocation(line: 632, column: 15, scope: !896)
!900 = !DILocation(line: 636, column: 16, scope: !901)
!901 = distinct !DILexicalBlock(scope: !896, file: !69, line: 636, column: 15)
!902 = !DILocation(line: 636, column: 29, scope: !901)
!903 = !DILocation(line: 640, column: 16, scope: !887)
!904 = distinct !{!904, !882, !905, !875}
!905 = !DILocation(line: 641, column: 5, scope: !124)
!906 = !DILocation(line: 644, column: 3, scope: !124)
!907 = !DILocation(line: 0, scope: !840, inlinedAt: !908)
!908 = distinct !DILocation(line: 648, column: 31, scope: !124)
!909 = !DILocation(line: 0, scope: !840, inlinedAt: !910)
!910 = distinct !DILocation(line: 649, column: 31, scope: !124)
!911 = !DILocation(line: 0, scope: !840, inlinedAt: !912)
!912 = distinct !DILocation(line: 650, column: 31, scope: !124)
!913 = !DILocation(line: 0, scope: !840, inlinedAt: !914)
!914 = distinct !DILocation(line: 651, column: 31, scope: !124)
!915 = !DILocation(line: 0, scope: !840, inlinedAt: !916)
!916 = distinct !DILocation(line: 652, column: 31, scope: !124)
!917 = !DILocation(line: 0, scope: !840, inlinedAt: !918)
!918 = distinct !DILocation(line: 653, column: 31, scope: !124)
!919 = !DILocation(line: 0, scope: !840, inlinedAt: !920)
!920 = distinct !DILocation(line: 654, column: 31, scope: !124)
!921 = !DILocation(line: 0, scope: !840, inlinedAt: !922)
!922 = distinct !DILocation(line: 655, column: 31, scope: !124)
!923 = !DILocation(line: 0, scope: !840, inlinedAt: !924)
!924 = distinct !DILocation(line: 656, column: 31, scope: !124)
!925 = !DILocation(line: 0, scope: !840, inlinedAt: !926)
!926 = distinct !DILocation(line: 657, column: 31, scope: !124)
!927 = !DILocation(line: 663, column: 7, scope: !928)
!928 = distinct !DILexicalBlock(scope: !124, file: !69, line: 663, column: 7)
!929 = !DILocation(line: 664, column: 7, scope: !928)
!930 = !DILocation(line: 664, column: 10, scope: !928)
!931 = !DILocation(line: 663, column: 7, scope: !124)
!932 = !DILocation(line: 669, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !928, file: !69, line: 665, column: 5)
!934 = !DILocation(line: 671, column: 5, scope: !933)
!935 = !DILocation(line: 676, column: 7, scope: !936)
!936 = distinct !DILexicalBlock(scope: !928, file: !69, line: 673, column: 5)
!937 = !DILocation(line: 679, column: 3, scope: !124)
!938 = !DILocation(line: 683, column: 3, scope: !124)
!939 = !DILocation(line: 686, column: 3, scope: !124)
!940 = !DILocation(line: 688, column: 3, scope: !124)
!941 = !DILocation(line: 691, column: 3, scope: !124)
!942 = !DILocation(line: 695, column: 3, scope: !124)
!943 = !DILocation(line: 696, column: 1, scope: !124)
!944 = !DISubprogram(name: "setlocale", scope: !945, file: !945, line: 122, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!945 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!946 = !DISubroutineType(types: !947)
!947 = !{!90, !70, !96}
!948 = !DISubprogram(name: "strncmp", scope: !949, file: !949, line: 159, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!949 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!950 = !DISubroutineType(types: !951)
!951 = !{!70, !96, !96, !93}
!952 = !DISubprogram(name: "exit", scope: !953, file: !953, line: 624, type: !756, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !812)
!953 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!954 = !DISubprogram(name: "getenv", scope: !953, file: !953, line: 641, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!955 = !DISubroutineType(types: !956)
!956 = !{!90, !96}
!957 = !DISubprogram(name: "strcmp", scope: !949, file: !949, line: 156, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!958 = !DISubroutineType(types: !959)
!959 = !{!70, !96, !96}
!960 = !DISubprogram(name: "strspn", scope: !949, file: !949, line: 297, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!961 = !DISubroutineType(types: !962)
!962 = !{!95, !96, !96}
!963 = !DISubprogram(name: "strchr", scope: !949, file: !949, line: 246, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!964 = !DISubroutineType(types: !965)
!965 = !{!90, !96, !70}
!966 = !DISubprogram(name: "__ctype_b_loc", scope: !75, file: !75, line: 79, type: !967, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!967 = !DISubroutineType(types: !968)
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!972 = !DISubprogram(name: "strcspn", scope: !949, file: !949, line: 293, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!973 = !DISubprogram(name: "fwrite_unlocked", scope: !823, file: !823, line: 704, type: !974, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!974 = !DISubroutineType(types: !975)
!975 = !{!93, !976, !93, !93, !817}
!976 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!979 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 82, type: !980, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !983)
!980 = !DISubroutineType(types: !981)
!981 = !{!70, !70, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!983 = !{!984, !985, !986, !987, !988, !989}
!984 = !DILocalVariable(name: "argc", arg: 1, scope: !979, file: !2, line: 82, type: !70)
!985 = !DILocalVariable(name: "argv", arg: 2, scope: !979, file: !2, line: 82, type: !982)
!986 = !DILocalVariable(name: "optc", scope: !979, file: !2, line: 84, type: !70)
!987 = !DILocalVariable(name: "status", scope: !979, file: !2, line: 121, type: !70)
!988 = !DILocalVariable(name: "tty", scope: !979, file: !2, line: 122, type: !96)
!989 = !DILocalVariable(name: "ttyname_err", scope: !990, file: !2, line: 128, type: !70)
!990 = distinct !DILexicalBlock(scope: !991, file: !2, line: 127, column: 5)
!991 = distinct !DILexicalBlock(scope: !979, file: !2, line: 124, column: 7)
!992 = !DILocation(line: 0, scope: !979)
!993 = !DILocation(line: 87, column: 21, scope: !979)
!994 = !DILocation(line: 87, column: 3, scope: !979)
!995 = !DILocation(line: 88, column: 3, scope: !979)
!996 = !DILocation(line: 89, column: 3, scope: !979)
!997 = !DILocation(line: 90, column: 3, scope: !979)
!998 = !DILocalVariable(name: "status", arg: 1, scope: !999, file: !69, line: 102, type: !70)
!999 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !69, file: !69, line: 102, type: !756, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1000)
!1000 = !{!998}
!1001 = !DILocation(line: 0, scope: !999, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 92, column: 3, scope: !979)
!1003 = !DILocation(line: 105, column: 18, scope: !1004, inlinedAt: !1002)
!1004 = distinct !DILexicalBlock(scope: !999, file: !69, line: 104, column: 7)
!1005 = !DILocation(line: 93, column: 3, scope: !979)
!1006 = !DILocation(line: 95, column: 3, scope: !979)
!1007 = !DILocation(line: 95, column: 18, scope: !979)
!1008 = !DILocation(line: 100, column: 18, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !2, line: 98, column: 9)
!1010 = distinct !DILexicalBlock(scope: !979, file: !2, line: 96, column: 5)
!1011 = distinct !{!1011, !1006, !1012, !875}
!1012 = !DILocation(line: 110, column: 5, scope: !979)
!1013 = !DILocation(line: 103, column: 9, scope: !1009)
!1014 = !DILocation(line: 105, column: 9, scope: !1009)
!1015 = !DILocation(line: 108, column: 11, scope: !1009)
!1016 = !DILocation(line: 112, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !979, file: !2, line: 112, column: 7)
!1018 = !DILocation(line: 112, column: 14, scope: !1017)
!1019 = !DILocation(line: 112, column: 7, scope: !979)
!1020 = !DILocation(line: 114, column: 7, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 113, column: 5)
!1022 = !DILocation(line: 115, column: 7, scope: !1021)
!1023 = !DILocation(line: 118, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !979, file: !2, line: 118, column: 7)
!1025 = !DILocation(line: 118, column: 7, scope: !979)
!1026 = !DILocation(line: 119, column: 12, scope: !1024)
!1027 = !DILocation(line: 119, column: 5, scope: !1024)
!1028 = !DILocation(line: 122, column: 21, scope: !979)
!1029 = !DILocation(line: 124, column: 7, scope: !991)
!1030 = !DILocation(line: 124, column: 7, scope: !979)
!1031 = !DILocation(line: 128, column: 25, scope: !990)
!1032 = !DILocation(line: 0, scope: !990)
!1033 = !DILocation(line: 129, column: 11, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !990, file: !2, line: 129, column: 11)
!1035 = !DILocation(line: 129, column: 11, scope: !990)
!1036 = !DILocation(line: 130, column: 9, scope: !1034)
!1037 = !DILocation(line: 131, column: 13, scope: !990)
!1038 = !DILocation(line: 0, scope: !991)
!1039 = !DILocation(line: 135, column: 3, scope: !979)
!1040 = !DILocation(line: 137, column: 1, scope: !979)
!1041 = !DISubprogram(name: "bindtextdomain", scope: !809, file: !809, line: 86, type: !1042, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!90, !96, !96}
!1044 = !DISubprogram(name: "textdomain", scope: !809, file: !809, line: 82, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1045 = !DISubprogram(name: "atexit", scope: !953, file: !953, line: 602, type: !1046, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!70, !403}
!1048 = !DISubprogram(name: "getopt_long", scope: !324, file: !324, line: 66, type: !1049, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!70, !70, !1051, !96, !1053, !329}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!1054 = !DISubprogram(name: "isatty", scope: !1055, file: !1055, line: 809, type: !1056, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1055 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!70, !70}
!1058 = !DISubprogram(name: "ttyname", scope: !1055, file: !1055, line: 799, type: !1059, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!90, !70}
!1061 = !DISubprogram(name: "__errno_location", scope: !1062, file: !1062, line: 37, type: !1063, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1062 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!329}
!1065 = !DISubprogram(name: "puts", scope: !823, file: !823, line: 661, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!70, !96}
!1068 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !342, file: !342, line: 50, type: !778, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !1069)
!1069 = !{!1070}
!1070 = !DILocalVariable(name: "file", arg: 1, scope: !1068, file: !342, line: 50, type: !96)
!1071 = !DILocation(line: 0, scope: !1068)
!1072 = !DILocation(line: 52, column: 13, scope: !1068)
!1073 = !DILocation(line: 53, column: 1, scope: !1068)
!1074 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !342, file: !342, line: 87, type: !1075, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !1077)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !121}
!1077 = !{!1078}
!1078 = !DILocalVariable(name: "ignore", arg: 1, scope: !1074, file: !342, line: 87, type: !121)
!1079 = !DILocation(line: 0, scope: !1074)
!1080 = !DILocation(line: 89, column: 16, scope: !1074)
!1081 = !{!1082, !1082, i64 0}
!1082 = !{!"_Bool", !768, i64 0}
!1083 = !DILocation(line: 90, column: 1, scope: !1074)
!1084 = distinct !DISubprogram(name: "close_stdout", scope: !342, file: !342, line: 116, type: !404, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !1085)
!1085 = !{!1086}
!1086 = !DILocalVariable(name: "write_error", scope: !1087, file: !342, line: 121, type: !96)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !342, line: 120, column: 5)
!1088 = distinct !DILexicalBlock(scope: !1084, file: !342, line: 118, column: 7)
!1089 = !DILocation(line: 118, column: 21, scope: !1088)
!1090 = !DILocation(line: 118, column: 7, scope: !1088)
!1091 = !DILocation(line: 118, column: 29, scope: !1088)
!1092 = !DILocation(line: 119, column: 7, scope: !1088)
!1093 = !DILocation(line: 119, column: 12, scope: !1088)
!1094 = !{i8 0, i8 2}
!1095 = !DILocation(line: 119, column: 25, scope: !1088)
!1096 = !DILocation(line: 119, column: 28, scope: !1088)
!1097 = !DILocation(line: 119, column: 34, scope: !1088)
!1098 = !DILocation(line: 118, column: 7, scope: !1084)
!1099 = !DILocation(line: 121, column: 33, scope: !1087)
!1100 = !DILocation(line: 0, scope: !1087)
!1101 = !DILocation(line: 122, column: 11, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1087, file: !342, line: 122, column: 11)
!1103 = !DILocation(line: 0, scope: !1102)
!1104 = !DILocation(line: 122, column: 11, scope: !1087)
!1105 = !DILocation(line: 123, column: 9, scope: !1102)
!1106 = !DILocation(line: 126, column: 9, scope: !1102)
!1107 = !DILocation(line: 128, column: 14, scope: !1087)
!1108 = !DILocation(line: 128, column: 7, scope: !1087)
!1109 = !DILocation(line: 133, column: 42, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1084, file: !342, line: 133, column: 7)
!1111 = !DILocation(line: 133, column: 28, scope: !1110)
!1112 = !DILocation(line: 133, column: 50, scope: !1110)
!1113 = !DILocation(line: 133, column: 7, scope: !1084)
!1114 = !DILocation(line: 134, column: 12, scope: !1110)
!1115 = !DILocation(line: 134, column: 5, scope: !1110)
!1116 = !DILocation(line: 135, column: 1, scope: !1084)
!1117 = !DISubprogram(name: "_exit", scope: !1055, file: !1055, line: 624, type: !756, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !812)
!1118 = distinct !DISubprogram(name: "verror", scope: !357, file: !357, line: 251, type: !1119, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1121)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !70, !70, !96, !367}
!1121 = !{!1122, !1123, !1124, !1125}
!1122 = !DILocalVariable(name: "status", arg: 1, scope: !1118, file: !357, line: 251, type: !70)
!1123 = !DILocalVariable(name: "errnum", arg: 2, scope: !1118, file: !357, line: 251, type: !70)
!1124 = !DILocalVariable(name: "message", arg: 3, scope: !1118, file: !357, line: 251, type: !96)
!1125 = !DILocalVariable(name: "args", arg: 4, scope: !1118, file: !357, line: 251, type: !367)
!1126 = !DILocation(line: 0, scope: !1118)
!1127 = !DILocation(line: 261, column: 3, scope: !1118)
!1128 = !DILocation(line: 265, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1118, file: !357, line: 265, column: 7)
!1130 = !DILocation(line: 265, column: 7, scope: !1118)
!1131 = !DILocation(line: 266, column: 5, scope: !1129)
!1132 = !DILocation(line: 272, column: 7, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1129, file: !357, line: 268, column: 5)
!1134 = !DILocation(line: 276, column: 3, scope: !1118)
!1135 = !DILocation(line: 282, column: 1, scope: !1118)
!1136 = distinct !DISubprogram(name: "flush_stdout", scope: !357, file: !357, line: 163, type: !404, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1137)
!1137 = !{!1138}
!1138 = !DILocalVariable(name: "stdout_fd", scope: !1136, file: !357, line: 166, type: !70)
!1139 = !DILocation(line: 0, scope: !1136)
!1140 = !DILocalVariable(name: "fd", arg: 1, scope: !1141, file: !357, line: 145, type: !70)
!1141 = distinct !DISubprogram(name: "is_open", scope: !357, file: !357, line: 145, type: !1056, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1142)
!1142 = !{!1140}
!1143 = !DILocation(line: 0, scope: !1141, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 182, column: 25, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1136, file: !357, line: 182, column: 7)
!1146 = !DILocation(line: 157, column: 15, scope: !1141, inlinedAt: !1144)
!1147 = !DILocation(line: 157, column: 12, scope: !1141, inlinedAt: !1144)
!1148 = !DILocation(line: 182, column: 7, scope: !1136)
!1149 = !DILocation(line: 184, column: 5, scope: !1145)
!1150 = !DILocation(line: 185, column: 1, scope: !1136)
!1151 = distinct !DISubprogram(name: "error_tail", scope: !357, file: !357, line: 219, type: !1119, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1152)
!1152 = !{!1153, !1154, !1155, !1156}
!1153 = !DILocalVariable(name: "status", arg: 1, scope: !1151, file: !357, line: 219, type: !70)
!1154 = !DILocalVariable(name: "errnum", arg: 2, scope: !1151, file: !357, line: 219, type: !70)
!1155 = !DILocalVariable(name: "message", arg: 3, scope: !1151, file: !357, line: 219, type: !96)
!1156 = !DILocalVariable(name: "args", arg: 4, scope: !1151, file: !357, line: 219, type: !367)
!1157 = !DILocation(line: 0, scope: !1151)
!1158 = !DILocation(line: 229, column: 13, scope: !1151)
!1159 = !DILocalVariable(name: "__stream", arg: 1, scope: !1160, file: !814, line: 132, type: !1163)
!1160 = distinct !DISubprogram(name: "vfprintf", scope: !814, file: !814, line: 132, type: !1161, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1198)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!70, !1163, !818, !367}
!1163 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !148, line: 7, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !150, line: 49, size: 1728, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1166, file: !150, line: 51, baseType: !70, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1166, file: !150, line: 54, baseType: !90, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1166, file: !150, line: 55, baseType: !90, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1166, file: !150, line: 56, baseType: !90, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1166, file: !150, line: 57, baseType: !90, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1166, file: !150, line: 58, baseType: !90, size: 64, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1166, file: !150, line: 59, baseType: !90, size: 64, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1166, file: !150, line: 60, baseType: !90, size: 64, offset: 448)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1166, file: !150, line: 61, baseType: !90, size: 64, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1166, file: !150, line: 64, baseType: !90, size: 64, offset: 576)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1166, file: !150, line: 65, baseType: !90, size: 64, offset: 640)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1166, file: !150, line: 66, baseType: !90, size: 64, offset: 704)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1166, file: !150, line: 68, baseType: !165, size: 64, offset: 768)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1166, file: !150, line: 70, baseType: !1182, size: 64, offset: 832)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1166, file: !150, line: 72, baseType: !70, size: 32, offset: 896)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1166, file: !150, line: 73, baseType: !70, size: 32, offset: 928)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1166, file: !150, line: 74, baseType: !172, size: 64, offset: 960)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1166, file: !150, line: 77, baseType: !92, size: 16, offset: 1024)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1166, file: !150, line: 78, baseType: !177, size: 8, offset: 1040)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1166, file: !150, line: 79, baseType: !39, size: 8, offset: 1048)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1166, file: !150, line: 81, baseType: !180, size: 64, offset: 1088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1166, file: !150, line: 89, baseType: !183, size: 64, offset: 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1166, file: !150, line: 91, baseType: !185, size: 64, offset: 1216)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1166, file: !150, line: 92, baseType: !188, size: 64, offset: 1280)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1166, file: !150, line: 93, baseType: !1182, size: 64, offset: 1344)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1166, file: !150, line: 94, baseType: !91, size: 64, offset: 1408)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1166, file: !150, line: 95, baseType: !93, size: 64, offset: 1472)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1166, file: !150, line: 96, baseType: !70, size: 32, offset: 1536)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1166, file: !150, line: 98, baseType: !195, size: 160, offset: 1568)
!1198 = !{!1159, !1199, !1200}
!1199 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1160, file: !814, line: 133, type: !818)
!1200 = !DILocalVariable(name: "__ap", arg: 3, scope: !1160, file: !814, line: 133, type: !367)
!1201 = !DILocation(line: 0, scope: !1160, inlinedAt: !1202)
!1202 = distinct !DILocation(line: 229, column: 3, scope: !1151)
!1203 = !DILocation(line: 135, column: 10, scope: !1160, inlinedAt: !1202)
!1204 = !DILocation(line: 232, column: 3, scope: !1151)
!1205 = !DILocation(line: 233, column: 7, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1151, file: !357, line: 233, column: 7)
!1207 = !DILocation(line: 233, column: 7, scope: !1151)
!1208 = !DILocalVariable(name: "errnum", arg: 1, scope: !1209, file: !357, line: 188, type: !70)
!1209 = distinct !DISubprogram(name: "print_errno_message", scope: !357, file: !357, line: 188, type: !756, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1210)
!1210 = !{!1208, !1211, !1212}
!1211 = !DILocalVariable(name: "s", scope: !1209, file: !357, line: 190, type: !96)
!1212 = !DILocalVariable(name: "errbuf", scope: !1209, file: !357, line: 193, type: !1213)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1214)
!1214 = !{!1215}
!1215 = !DISubrange(count: 1024)
!1216 = !DILocation(line: 0, scope: !1209, inlinedAt: !1217)
!1217 = distinct !DILocation(line: 234, column: 5, scope: !1206)
!1218 = !DILocation(line: 193, column: 3, scope: !1209, inlinedAt: !1217)
!1219 = !DILocation(line: 193, column: 8, scope: !1209, inlinedAt: !1217)
!1220 = !DILocation(line: 195, column: 7, scope: !1209, inlinedAt: !1217)
!1221 = !DILocation(line: 207, column: 9, scope: !1222, inlinedAt: !1217)
!1222 = distinct !DILexicalBlock(scope: !1209, file: !357, line: 207, column: 7)
!1223 = !DILocation(line: 207, column: 7, scope: !1209, inlinedAt: !1217)
!1224 = !DILocation(line: 208, column: 9, scope: !1222, inlinedAt: !1217)
!1225 = !DILocation(line: 208, column: 5, scope: !1222, inlinedAt: !1217)
!1226 = !DILocation(line: 214, column: 3, scope: !1209, inlinedAt: !1217)
!1227 = !DILocation(line: 216, column: 1, scope: !1209, inlinedAt: !1217)
