; ModuleID = 'src/unlink.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s FILE\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [57 x i8] c"Call the unlink function to remove the specified FILE.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"unlink\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 15)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 61)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !143, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !117, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !117, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !156, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !56, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 22)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !180, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !124, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 71)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 27)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 51)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 12)
!227 = !{!228, !229, !230, !233, !235, !236, !237, !241, !242, !243, !244, !246, !300, !301, !302, !304, !305}
!228 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!229 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!230 = !DILocalVariable(name: "term", scope: !231, file: !69, line: 585, type: !72)
!231 = distinct !DILexicalBlock(scope: !232, file: !69, line: 582, column: 5)
!232 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!233 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !234)
!234 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!236 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!237 = !DILocalVariable(name: "s", scope: !238, file: !69, line: 608, type: !72)
!238 = distinct !DILexicalBlock(scope: !239, file: !69, line: 605, column: 5)
!239 = distinct !DILexicalBlock(scope: !240, file: !69, line: 604, column: 12)
!240 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!241 = !DILocalVariable(name: "spaces", scope: !238, file: !69, line: 609, type: !110)
!242 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !110)
!243 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!244 = !DILocalVariable(name: "__ptr", scope: !245, file: !69, line: 644, type: !72)
!245 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!246 = !DILocalVariable(name: "__stream", scope: !245, file: !69, line: 644, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !250)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!252 = !{!253, !254, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !269, !271, !272, !273, !277, !278, !280, !281, !284, !286, !289, !292, !293, !294, !295, !296}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !250, file: !251, line: 51, baseType: !108, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !250, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !250, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !250, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !250, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !250, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !250, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !250, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !250, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !250, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !250, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !250, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !250, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !251, line: 36, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !250, file: !251, line: 70, baseType: !270, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !250, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !250, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !250, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !275, line: 152, baseType: !276)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!276 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !250, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !250, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!279 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !250, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !250, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !251, line: 43, baseType: null)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !250, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !275, line: 153, baseType: !276)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !250, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !251, line: 37, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !250, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !251, line: 38, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !250, file: !251, line: 93, baseType: !270, size: 64, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !250, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !250, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !250, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !250, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 20)
!300 = !DILocalVariable(name: "__cnt", scope: !245, file: !69, line: 644, type: !110)
!301 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!302 = !DILocalVariable(name: "__ptr", scope: !303, file: !69, line: 686, type: !72)
!303 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!304 = !DILocalVariable(name: "__stream", scope: !303, file: !69, line: 686, type: !247)
!305 = !DILocalVariable(name: "__cnt", scope: !303, file: !69, line: 686, type: !110)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !308, line: 3, type: !180, isLocal: true, isDefinition: true)
!308 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "Version", scope: !311, file: !308, line: 3, type: !72, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C11, file: !308, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !312, splitDebugInlining: false, nameTableKind: None)
!312 = !{!306, !309}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "file_name", scope: !315, file: !316, line: 45, type: !72, isLocal: true, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C11, file: !316, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!316 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!317 = !{!318, !320, !322, !324, !313, !326}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !19, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !224, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !316, line: 123, type: !19, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !316, line: 126, type: !143, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !315, file: !316, line: 55, type: !234, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !330, file: !331, line: 66, type: !377, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C11, file: !331, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !332, globals: !333, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!332 = !{!107, !113}
!333 = !{!334, !336, !356, !358, !360, !362, !328, !364, !366, !368, !370, !375}
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !331, line: 272, type: !117, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "old_file_name", scope: !338, file: !331, line: 304, type: !72, isLocal: true, isDefinition: true)
!338 = distinct !DISubprogram(name: "verror_at_line", scope: !331, file: !331, line: 298, type: !339, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !349)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !108, !108, !72, !78, !72, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !343)
!343 = !{!344, !346, !347, !348}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !342, file: !345, baseType: !78, size: 32)
!345 = !DIFile(filename: "lib/error.c", directory: "/src")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !342, file: !345, baseType: !78, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !342, file: !345, baseType: !107, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !342, file: !345, baseType: !107, size: 64, offset: 128)
!349 = !{!350, !351, !352, !353, !354, !355}
!350 = !DILocalVariable(name: "status", arg: 1, scope: !338, file: !331, line: 298, type: !108)
!351 = !DILocalVariable(name: "errnum", arg: 2, scope: !338, file: !331, line: 298, type: !108)
!352 = !DILocalVariable(name: "file_name", arg: 3, scope: !338, file: !331, line: 298, type: !72)
!353 = !DILocalVariable(name: "line_number", arg: 4, scope: !338, file: !331, line: 298, type: !78)
!354 = !DILocalVariable(name: "message", arg: 5, scope: !338, file: !331, line: 298, type: !72)
!355 = !DILocalVariable(name: "args", arg: 6, scope: !338, file: !331, line: 298, type: !341)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "old_line_number", scope: !338, file: !331, line: 305, type: !78, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !331, line: 338, type: !124, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !156, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !134, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "error_message_count", scope: !330, file: !331, line: 69, type: !78, isLocal: false, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !330, file: !331, line: 295, type: !108, isLocal: false, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !19, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 21)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !331, line: 214, type: !117, isLocal: true, isDefinition: true)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null}
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !382, line: 60, type: !134, isLocal: true, isDefinition: true)
!382 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "long_options", scope: !385, file: !382, line: 34, type: !393, isLocal: true, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C11, file: !382, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !386, splitDebugInlining: false, nameTableKind: None)
!386 = !{!380, !387, !389, !391, !383}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !382, line: 112, type: !34, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !382, line: 36, type: !117, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !382, line: 37, type: !156, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 768, elements: !144)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !396, line: 50, size: 256, elements: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!397 = !{!398, !399, !400, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !396, line: 52, baseType: !72, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !395, file: !396, line: 55, baseType: !108, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !396, line: 56, baseType: !401, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !395, file: !396, line: 57, baseType: !108, size: 32, offset: 192)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "program_name", scope: !405, file: !406, line: 31, type: !72, isLocal: false, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C11, file: !406, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, globals: !408, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!407 = !{!255}
!408 = !{!403, !409, !411}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !406, line: 46, type: !156, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !406, line: 49, type: !124, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "utf07FF", scope: !415, file: !416, line: 46, type: !443, isLocal: true, isDefinition: true)
!415 = distinct !DISubprogram(name: "proper_name_lite", scope: !416, file: !416, line: 38, type: !417, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !419, retainedNodes: !421)
!416 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!417 = !DISubroutineType(types: !418)
!418 = !{!72, !72, !72}
!419 = distinct !DICompileUnit(language: DW_LANG_C11, file: !416, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !420, splitDebugInlining: false, nameTableKind: None)
!420 = !{!413}
!421 = !{!422, !423, !424, !425, !430}
!422 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !415, file: !416, line: 38, type: !72)
!423 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !415, file: !416, line: 38, type: !72)
!424 = !DILocalVariable(name: "translation", scope: !415, file: !416, line: 40, type: !72)
!425 = !DILocalVariable(name: "w", scope: !415, file: !416, line: 47, type: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !427, line: 37, baseType: !428)
!427 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !275, line: 57, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !275, line: 42, baseType: !78)
!430 = !DILocalVariable(name: "mbs", scope: !415, file: !416, line: 48, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !432, line: 6, baseType: !433)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !434, line: 21, baseType: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 13, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !435, file: !434, line: 15, baseType: !108, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !435, file: !434, line: 20, baseType: !439, size: 32, offset: 32)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !434, line: 16, size: 32, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !439, file: !434, line: 18, baseType: !78, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !439, file: !434, line: 19, baseType: !124, size: 32)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !135)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !446, line: 78, type: !156, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !446, line: 79, type: !129, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !446, line: 80, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 13)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !446, line: 81, type: !451, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !446, line: 82, type: !297, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !446, line: 83, type: !134, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !446, line: 84, type: !156, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !446, line: 85, type: !19, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !446, line: 86, type: !19, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !446, line: 87, type: !156, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !470, file: !446, line: 76, type: !542, isLocal: false, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C11, file: !446, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !477, globals: !478, splitDebugInlining: false, nameTableKind: None)
!471 = !{!76, !472, !91}
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !77, line: 254, baseType: !78, size: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!475 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!476 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!477 = !{!108, !109, !110}
!478 = !{!444, !447, !449, !454, !456, !458, !460, !462, !464, !466, !468, !479, !483, !493, !495, !500, !502, !504, !506, !508, !531, !538, !540}
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !470, file: !446, line: 92, type: !481, isLocal: false, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 320, elements: !40)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !470, file: !446, line: 1040, type: !485, isLocal: false, isDefinition: true)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !446, line: 56, size: 448, elements: !486)
!486 = !{!487, !488, !489, !491, !492}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !485, file: !446, line: 59, baseType: !76, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !446, line: 62, baseType: !108, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !485, file: !446, line: 66, baseType: !490, size: 256, offset: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !157)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !485, file: !446, line: 69, baseType: !72, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !485, file: !446, line: 72, baseType: !72, size: 64, offset: 384)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !470, file: !446, line: 107, type: !485, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "slot0", scope: !470, file: !446, line: 831, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 256)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !446, line: 321, type: !134, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !446, line: 357, type: !134, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !446, line: 358, type: !134, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !446, line: 199, type: !19, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "quote", scope: !510, file: !446, line: 228, type: !529, isLocal: true, isDefinition: true)
!510 = distinct !DISubprogram(name: "gettext_quote", scope: !446, file: !446, line: 197, type: !511, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !470, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!72, !72, !76}
!513 = !{!514, !515, !516, !517, !518}
!514 = !DILocalVariable(name: "msgid", arg: 1, scope: !510, file: !446, line: 197, type: !72)
!515 = !DILocalVariable(name: "s", arg: 2, scope: !510, file: !446, line: 197, type: !76)
!516 = !DILocalVariable(name: "translation", scope: !510, file: !446, line: 199, type: !72)
!517 = !DILocalVariable(name: "w", scope: !510, file: !446, line: 229, type: !426)
!518 = !DILocalVariable(name: "mbs", scope: !510, file: !446, line: 230, type: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !432, line: 6, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !434, line: 21, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 13, size: 64, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !521, file: !434, line: 15, baseType: !108, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !521, file: !434, line: 20, baseType: !525, size: 32, offset: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !521, file: !434, line: 16, size: 32, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !525, file: !434, line: 18, baseType: !78, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !525, file: !434, line: 19, baseType: !124, size: 32)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !530)
!530 = !{!136, !126}
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "slotvec", scope: !470, file: !446, line: 834, type: !533, isLocal: true, isDefinition: true)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !446, line: 823, size: 128, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !534, file: !446, line: 825, baseType: !110, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !534, file: !446, line: 826, baseType: !255, size: 64, offset: 64)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "nslots", scope: !470, file: !446, line: 832, type: !108, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "slotvec0", scope: !470, file: !446, line: 833, type: !534, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 704, elements: !544)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!544 = !{!545}
!545 = !DISubrange(count: 11)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !548, line: 67, type: !224, isLocal: true, isDefinition: true)
!548 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !548, line: 69, type: !19, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !548, line: 83, type: !19, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !548, line: 83, type: !124, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !548, line: 85, type: !134, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !548, line: 88, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 171)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !548, line: 88, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 34)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !548, line: 105, type: !56, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !548, line: 109, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 23)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !548, line: 113, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 28)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !548, line: 120, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !548, line: 127, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 36)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !548, line: 134, type: !175, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !548, line: 142, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 44)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !548, line: 150, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 48)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !548, line: 159, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 52)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !548, line: 170, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 60)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !548, line: 248, type: !297, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !548, line: 248, type: !200, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !548, line: 254, type: !297, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !548, line: 254, type: !49, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !548, line: 254, type: !175, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !548, line: 259, type: !3, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !548, line: 259, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 29)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !630, file: !631, line: 26, type: !633, isLocal: false, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C11, file: !631, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !632, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!632 = !{!628}
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 47)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "exit_failure", scope: !638, file: !639, line: 24, type: !641, isLocal: false, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !640, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!640 = !{!636}
!641 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 34, type: !143, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !644, line: 34, type: !19, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !644, line: 34, type: !61, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !651, line: 108, type: !34, isLocal: true, isDefinition: true)
!651 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "internal_state", scope: !654, file: !651, line: 97, type: !657, isLocal: true, isDefinition: true)
!654 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !655, globals: !656, splitDebugInlining: false, nameTableKind: None)
!655 = !{!107, !110, !113}
!656 = !{!649, !652}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !432, line: 6, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !434, line: 21, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 13, size: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !659, file: !434, line: 15, baseType: !108, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !659, file: !434, line: 20, baseType: !663, size: 32, offset: 32)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !659, file: !434, line: 16, size: 32, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !663, file: !434, line: 18, baseType: !78, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !663, file: !434, line: 19, baseType: !124, size: 32)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !669, line: 35, type: !129, isLocal: true, isDefinition: true)
!669 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!670 = distinct !DICompileUnit(language: DW_LANG_C11, file: !671, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!672 = distinct !DICompileUnit(language: DW_LANG_C11, file: !548, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !677, globals: !678, splitDebugInlining: false, nameTableKind: None)
!673 = !{!674}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !548, line: 40, baseType: !78, size: 32, elements: !675)
!675 = !{!676}
!676 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!677 = !{!107}
!678 = !{!546, !549, !551, !553, !555, !557, !562, !567, !569, !574, !579, !584, !589, !591, !596, !601, !606, !611, !613, !615, !617, !619, !621, !623}
!679 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, retainedTypes: !712, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!681 = !{!682, !694}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !683, file: !680, line: 188, baseType: !78, size: 32, elements: !692)
!683 = distinct !DISubprogram(name: "x2nrealloc", scope: !680, file: !680, line: 176, type: !684, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !679, retainedNodes: !687)
!684 = !DISubroutineType(types: !685)
!685 = !{!107, !107, !686, !110}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!687 = !{!688, !689, !690, !691}
!688 = !DILocalVariable(name: "p", arg: 1, scope: !683, file: !680, line: 176, type: !107)
!689 = !DILocalVariable(name: "pn", arg: 2, scope: !683, file: !680, line: 176, type: !686)
!690 = !DILocalVariable(name: "s", arg: 3, scope: !683, file: !680, line: 176, type: !110)
!691 = !DILocalVariable(name: "n", scope: !683, file: !680, line: 178, type: !110)
!692 = !{!693}
!693 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !695, file: !680, line: 228, baseType: !78, size: 32, elements: !692)
!695 = distinct !DISubprogram(name: "xpalloc", scope: !680, file: !680, line: 223, type: !696, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !679, retainedNodes: !702)
!696 = !DISubroutineType(types: !697)
!697 = !{!107, !107, !698, !699, !701, !699}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !700, line: 130, baseType: !701)
!700 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !111, line: 35, baseType: !276)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711}
!703 = !DILocalVariable(name: "pa", arg: 1, scope: !695, file: !680, line: 223, type: !107)
!704 = !DILocalVariable(name: "pn", arg: 2, scope: !695, file: !680, line: 223, type: !698)
!705 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !695, file: !680, line: 223, type: !699)
!706 = !DILocalVariable(name: "n_max", arg: 4, scope: !695, file: !680, line: 223, type: !701)
!707 = !DILocalVariable(name: "s", arg: 5, scope: !695, file: !680, line: 223, type: !699)
!708 = !DILocalVariable(name: "n0", scope: !695, file: !680, line: 230, type: !699)
!709 = !DILocalVariable(name: "n", scope: !695, file: !680, line: 237, type: !699)
!710 = !DILocalVariable(name: "nbytes", scope: !695, file: !680, line: 248, type: !699)
!711 = !DILocalVariable(name: "adjusted_nbytes", scope: !695, file: !680, line: 252, type: !699)
!712 = !{!255, !107, !234, !276, !112}
!713 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !714, splitDebugInlining: false, nameTableKind: None)
!714 = !{!642, !645, !647}
!715 = distinct !DICompileUnit(language: DW_LANG_C11, file: !716, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !718, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !677, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !722, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !677, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !725, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!725 = !{!234, !112, !107}
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !669, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !727, splitDebugInlining: false, nameTableKind: None)
!727 = !{!728, !667}
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !669, line: 35, type: !134, isLocal: true, isDefinition: true)
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!732 = distinct !DICompileUnit(language: DW_LANG_C11, file: !733, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !677, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!734 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!735 = !{i32 7, !"Dwarf Version", i32 5}
!736 = !{i32 2, !"Debug Info Version", i32 3}
!737 = !{i32 1, !"wchar_size", i32 4}
!738 = !{i32 8, !"PIC Level", i32 2}
!739 = !{i32 7, !"PIE Level", i32 2}
!740 = !{i32 7, !"uwtable", i32 2}
!741 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !742, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !108}
!744 = !{!745}
!745 = !DILocalVariable(name: "status", arg: 1, scope: !741, file: !2, line: 37, type: !108)
!746 = !DILocation(line: 0, scope: !741)
!747 = !DILocation(line: 39, column: 14, scope: !748)
!748 = distinct !DILexicalBlock(scope: !741, file: !2, line: 39, column: 7)
!749 = !DILocation(line: 39, column: 7, scope: !741)
!750 = !DILocation(line: 40, column: 5, scope: !751)
!751 = distinct !DILexicalBlock(scope: !748, file: !2, line: 40, column: 5)
!752 = !{!753, !753, i64 0}
!753 = !{!"any pointer", !754, i64 0}
!754 = !{!"omnipotent char", !755, i64 0}
!755 = !{!"Simple C/C++ TBAA"}
!756 = !DILocation(line: 43, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !748, file: !2, line: 42, column: 5)
!758 = !DILocation(line: 46, column: 7, scope: !757)
!759 = !DILocation(line: 48, column: 7, scope: !757)
!760 = !DILocation(line: 49, column: 7, scope: !757)
!761 = !DILocalVariable(name: "program", arg: 1, scope: !762, file: !69, line: 836, type: !72)
!762 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !763, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !72}
!765 = !{!761, !766, !773, !774, !776, !777}
!766 = !DILocalVariable(name: "infomap", scope: !762, file: !69, line: 838, type: !767)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 896, elements: !20)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !762, file: !69, line: 838, size: 128, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !769, file: !69, line: 838, baseType: !72, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !769, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!773 = !DILocalVariable(name: "node", scope: !762, file: !69, line: 848, type: !72)
!774 = !DILocalVariable(name: "map_prog", scope: !762, file: !69, line: 849, type: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!776 = !DILocalVariable(name: "lc_messages", scope: !762, file: !69, line: 861, type: !72)
!777 = !DILocalVariable(name: "url_program", scope: !762, file: !69, line: 874, type: !72)
!778 = !DILocation(line: 0, scope: !762, inlinedAt: !779)
!779 = distinct !DILocation(line: 50, column: 7, scope: !757)
!780 = !DILocation(line: 857, column: 3, scope: !762, inlinedAt: !779)
!781 = !DILocation(line: 861, column: 29, scope: !762, inlinedAt: !779)
!782 = !DILocation(line: 862, column: 7, scope: !783, inlinedAt: !779)
!783 = distinct !DILexicalBlock(scope: !762, file: !69, line: 862, column: 7)
!784 = !DILocation(line: 862, column: 19, scope: !783, inlinedAt: !779)
!785 = !DILocation(line: 862, column: 22, scope: !783, inlinedAt: !779)
!786 = !DILocation(line: 862, column: 7, scope: !762, inlinedAt: !779)
!787 = !DILocation(line: 868, column: 7, scope: !788, inlinedAt: !779)
!788 = distinct !DILexicalBlock(scope: !783, file: !69, line: 863, column: 5)
!789 = !DILocation(line: 870, column: 5, scope: !788, inlinedAt: !779)
!790 = !DILocation(line: 875, column: 3, scope: !762, inlinedAt: !779)
!791 = !DILocation(line: 877, column: 3, scope: !762, inlinedAt: !779)
!792 = !DILocation(line: 52, column: 3, scope: !741)
!793 = !DISubprogram(name: "dcgettext", scope: !794, file: !794, line: 51, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!794 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!795 = !DISubroutineType(types: !796)
!796 = !{!255, !72, !72, !108}
!797 = !{}
!798 = !DISubprogram(name: "__fprintf_chk", scope: !799, file: !799, line: 93, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!799 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!800 = !DISubroutineType(types: !801)
!801 = !{!108, !802, !108, !803, null}
!802 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !247)
!803 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!804 = !DISubprogram(name: "__printf_chk", scope: !799, file: !799, line: 95, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!805 = !DISubroutineType(types: !806)
!806 = !{!108, !108, !803, null}
!807 = !DISubprogram(name: "fputs_unlocked", scope: !808, file: !808, line: 691, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!808 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!809 = !DISubroutineType(types: !810)
!810 = !{!108, !803, !802}
!811 = !DILocation(line: 0, scope: !68)
!812 = !DILocation(line: 581, column: 7, scope: !232)
!813 = !{!814, !814, i64 0}
!814 = !{!"int", !754, i64 0}
!815 = !DILocation(line: 581, column: 19, scope: !232)
!816 = !DILocation(line: 581, column: 7, scope: !68)
!817 = !DILocation(line: 585, column: 26, scope: !231)
!818 = !DILocation(line: 0, scope: !231)
!819 = !DILocation(line: 586, column: 23, scope: !231)
!820 = !DILocation(line: 586, column: 28, scope: !231)
!821 = !DILocation(line: 586, column: 32, scope: !231)
!822 = !{!754, !754, i64 0}
!823 = !DILocation(line: 586, column: 38, scope: !231)
!824 = !DILocalVariable(name: "__s1", arg: 1, scope: !825, file: !826, line: 1359, type: !72)
!825 = distinct !DISubprogram(name: "streq", scope: !826, file: !826, line: 1359, type: !827, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !829)
!826 = !DIFile(filename: "./lib/string.h", directory: "/src")
!827 = !DISubroutineType(types: !828)
!828 = !{!234, !72, !72}
!829 = !{!824, !830}
!830 = !DILocalVariable(name: "__s2", arg: 2, scope: !825, file: !826, line: 1359, type: !72)
!831 = !DILocation(line: 0, scope: !825, inlinedAt: !832)
!832 = distinct !DILocation(line: 586, column: 41, scope: !231)
!833 = !DILocation(line: 1361, column: 11, scope: !825, inlinedAt: !832)
!834 = !DILocation(line: 1361, column: 10, scope: !825, inlinedAt: !832)
!835 = !DILocation(line: 586, column: 19, scope: !231)
!836 = !DILocation(line: 587, column: 5, scope: !231)
!837 = !DILocation(line: 588, column: 7, scope: !838)
!838 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!839 = !DILocation(line: 588, column: 7, scope: !68)
!840 = !DILocation(line: 590, column: 7, scope: !841)
!841 = distinct !DILexicalBlock(scope: !838, file: !69, line: 589, column: 5)
!842 = !DILocation(line: 591, column: 7, scope: !841)
!843 = !DILocation(line: 595, column: 37, scope: !68)
!844 = !DILocation(line: 595, column: 35, scope: !68)
!845 = !DILocation(line: 596, column: 29, scope: !68)
!846 = !DILocation(line: 597, column: 8, scope: !240)
!847 = !DILocation(line: 597, column: 7, scope: !68)
!848 = !DILocation(line: 604, column: 24, scope: !239)
!849 = !DILocation(line: 604, column: 12, scope: !240)
!850 = !DILocation(line: 0, scope: !238)
!851 = !DILocation(line: 610, column: 16, scope: !238)
!852 = !DILocation(line: 610, column: 7, scope: !238)
!853 = !DILocation(line: 611, column: 21, scope: !238)
!854 = !{!855, !855, i64 0}
!855 = !{!"short", !754, i64 0}
!856 = !DILocation(line: 611, column: 19, scope: !238)
!857 = !DILocation(line: 611, column: 16, scope: !238)
!858 = !DILocation(line: 610, column: 30, scope: !238)
!859 = distinct !{!859, !852, !853, !860}
!860 = !{!"llvm.loop.mustprogress"}
!861 = !DILocation(line: 612, column: 18, scope: !862)
!862 = distinct !DILexicalBlock(scope: !238, file: !69, line: 612, column: 11)
!863 = !DILocation(line: 612, column: 11, scope: !238)
!864 = !DILocation(line: 618, column: 5, scope: !238)
!865 = !DILocation(line: 620, column: 23, scope: !68)
!866 = !DILocation(line: 625, column: 39, scope: !68)
!867 = !DILocation(line: 626, column: 3, scope: !68)
!868 = !DILocation(line: 626, column: 10, scope: !68)
!869 = !DILocation(line: 626, column: 21, scope: !68)
!870 = !DILocation(line: 628, column: 44, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !69, line: 628, column: 11)
!872 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!873 = !DILocation(line: 628, column: 32, scope: !871)
!874 = !DILocation(line: 628, column: 49, scope: !871)
!875 = !DILocation(line: 628, column: 11, scope: !872)
!876 = !DILocation(line: 630, column: 11, scope: !877)
!877 = distinct !DILexicalBlock(scope: !872, file: !69, line: 630, column: 11)
!878 = !DILocation(line: 630, column: 11, scope: !872)
!879 = !DILocation(line: 632, column: 26, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !69, line: 632, column: 15)
!881 = distinct !DILexicalBlock(scope: !877, file: !69, line: 631, column: 9)
!882 = !DILocation(line: 632, column: 34, scope: !880)
!883 = !DILocation(line: 632, column: 37, scope: !880)
!884 = !DILocation(line: 632, column: 15, scope: !881)
!885 = !DILocation(line: 636, column: 16, scope: !886)
!886 = distinct !DILexicalBlock(scope: !881, file: !69, line: 636, column: 15)
!887 = !DILocation(line: 636, column: 29, scope: !886)
!888 = !DILocation(line: 640, column: 16, scope: !872)
!889 = distinct !{!889, !867, !890, !860}
!890 = !DILocation(line: 641, column: 5, scope: !68)
!891 = !DILocation(line: 644, column: 3, scope: !68)
!892 = !DILocation(line: 0, scope: !825, inlinedAt: !893)
!893 = distinct !DILocation(line: 648, column: 31, scope: !68)
!894 = !DILocation(line: 0, scope: !825, inlinedAt: !895)
!895 = distinct !DILocation(line: 649, column: 31, scope: !68)
!896 = !DILocation(line: 0, scope: !825, inlinedAt: !897)
!897 = distinct !DILocation(line: 650, column: 31, scope: !68)
!898 = !DILocation(line: 0, scope: !825, inlinedAt: !899)
!899 = distinct !DILocation(line: 651, column: 31, scope: !68)
!900 = !DILocation(line: 0, scope: !825, inlinedAt: !901)
!901 = distinct !DILocation(line: 652, column: 31, scope: !68)
!902 = !DILocation(line: 0, scope: !825, inlinedAt: !903)
!903 = distinct !DILocation(line: 653, column: 31, scope: !68)
!904 = !DILocation(line: 0, scope: !825, inlinedAt: !905)
!905 = distinct !DILocation(line: 654, column: 31, scope: !68)
!906 = !DILocation(line: 0, scope: !825, inlinedAt: !907)
!907 = distinct !DILocation(line: 655, column: 31, scope: !68)
!908 = !DILocation(line: 0, scope: !825, inlinedAt: !909)
!909 = distinct !DILocation(line: 656, column: 31, scope: !68)
!910 = !DILocation(line: 0, scope: !825, inlinedAt: !911)
!911 = distinct !DILocation(line: 657, column: 31, scope: !68)
!912 = !DILocation(line: 663, column: 7, scope: !913)
!913 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!914 = !DILocation(line: 664, column: 7, scope: !913)
!915 = !DILocation(line: 664, column: 10, scope: !913)
!916 = !DILocation(line: 663, column: 7, scope: !68)
!917 = !DILocation(line: 669, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !913, file: !69, line: 665, column: 5)
!919 = !DILocation(line: 671, column: 5, scope: !918)
!920 = !DILocation(line: 676, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !913, file: !69, line: 673, column: 5)
!922 = !DILocation(line: 679, column: 3, scope: !68)
!923 = !DILocation(line: 683, column: 3, scope: !68)
!924 = !DILocation(line: 686, column: 3, scope: !68)
!925 = !DILocation(line: 688, column: 3, scope: !68)
!926 = !DILocation(line: 691, column: 3, scope: !68)
!927 = !DILocation(line: 695, column: 3, scope: !68)
!928 = !DILocation(line: 696, column: 1, scope: !68)
!929 = !DISubprogram(name: "setlocale", scope: !930, file: !930, line: 122, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!930 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!931 = !DISubroutineType(types: !932)
!932 = !{!255, !108, !72}
!933 = !DISubprogram(name: "strncmp", scope: !934, file: !934, line: 159, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!934 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!935 = !DISubroutineType(types: !936)
!936 = !{!108, !72, !72, !110}
!937 = !DISubprogram(name: "exit", scope: !938, file: !938, line: 624, type: !742, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !797)
!938 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!939 = !DISubprogram(name: "getenv", scope: !938, file: !938, line: 641, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!940 = !DISubroutineType(types: !941)
!941 = !{!255, !72}
!942 = !DISubprogram(name: "strcmp", scope: !934, file: !934, line: 156, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!943 = !DISubroutineType(types: !944)
!944 = !{!108, !72, !72}
!945 = !DISubprogram(name: "strspn", scope: !934, file: !934, line: 297, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!946 = !DISubroutineType(types: !947)
!947 = !{!112, !72, !72}
!948 = !DISubprogram(name: "strchr", scope: !934, file: !934, line: 246, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!949 = !DISubroutineType(types: !950)
!950 = !{!255, !72, !108}
!951 = !DISubprogram(name: "__ctype_b_loc", scope: !92, file: !92, line: 79, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!952 = !DISubroutineType(types: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!957 = !DISubprogram(name: "strcspn", scope: !934, file: !934, line: 293, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!958 = !DISubprogram(name: "fwrite_unlocked", scope: !808, file: !808, line: 704, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!959 = !DISubroutineType(types: !960)
!960 = !{!110, !961, !110, !110, !802}
!961 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!964 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 56, type: !965, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !968)
!965 = !DISubroutineType(types: !966)
!966 = !{!108, !108, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!968 = !{!969, !970}
!969 = !DILocalVariable(name: "argc", arg: 1, scope: !964, file: !2, line: 56, type: !108)
!970 = !DILocalVariable(name: "argv", arg: 2, scope: !964, file: !2, line: 56, type: !967)
!971 = !DILocation(line: 0, scope: !964)
!972 = !DILocation(line: 59, column: 21, scope: !964)
!973 = !DILocation(line: 59, column: 3, scope: !964)
!974 = !DILocation(line: 60, column: 3, scope: !964)
!975 = !DILocation(line: 61, column: 3, scope: !964)
!976 = !DILocation(line: 62, column: 3, scope: !964)
!977 = !DILocation(line: 64, column: 3, scope: !964)
!978 = !DILocation(line: 67, column: 36, scope: !964)
!979 = !DILocation(line: 67, column: 58, scope: !964)
!980 = !DILocation(line: 66, column: 3, scope: !964)
!981 = !DILocation(line: 70, column: 14, scope: !982)
!982 = distinct !DILexicalBlock(scope: !964, file: !2, line: 70, column: 7)
!983 = !DILocation(line: 70, column: 12, scope: !982)
!984 = !DILocation(line: 70, column: 7, scope: !964)
!985 = !DILocation(line: 72, column: 7, scope: !986)
!986 = distinct !DILexicalBlock(scope: !982, file: !2, line: 71, column: 5)
!987 = !DILocation(line: 73, column: 7, scope: !986)
!988 = !DILocation(line: 70, column: 21, scope: !982)
!989 = !DILocation(line: 76, column: 18, scope: !990)
!990 = distinct !DILexicalBlock(scope: !964, file: !2, line: 76, column: 7)
!991 = !DILocation(line: 76, column: 7, scope: !964)
!992 = !DILocation(line: 78, column: 7, scope: !993)
!993 = distinct !DILexicalBlock(scope: !990, file: !2, line: 77, column: 5)
!994 = !DILocation(line: 79, column: 7, scope: !993)
!995 = !DILocation(line: 82, column: 15, scope: !996)
!996 = distinct !DILexicalBlock(scope: !964, file: !2, line: 82, column: 7)
!997 = !DILocation(line: 82, column: 7, scope: !996)
!998 = !DILocation(line: 82, column: 29, scope: !996)
!999 = !DILocation(line: 82, column: 7, scope: !964)
!1000 = !DILocation(line: 83, column: 5, scope: !996)
!1001 = !DILocation(line: 85, column: 3, scope: !964)
!1002 = !DISubprogram(name: "bindtextdomain", scope: !794, file: !794, line: 86, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!255, !72, !72}
!1005 = !DISubprogram(name: "textdomain", scope: !794, file: !794, line: 82, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1006 = !DISubprogram(name: "atexit", scope: !938, file: !938, line: 602, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!108, !377}
!1009 = !DISubprogram(name: "unlink", scope: !1010, file: !1010, line: 858, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1010 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!108, !72}
!1013 = !DISubprogram(name: "__errno_location", scope: !1014, file: !1014, line: 37, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1014 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!401}
!1017 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !316, file: !316, line: 50, type: !763, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1018)
!1018 = !{!1019}
!1019 = !DILocalVariable(name: "file", arg: 1, scope: !1017, file: !316, line: 50, type: !72)
!1020 = !DILocation(line: 0, scope: !1017)
!1021 = !DILocation(line: 52, column: 13, scope: !1017)
!1022 = !DILocation(line: 53, column: 1, scope: !1017)
!1023 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !316, file: !316, line: 87, type: !1024, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1026)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !234}
!1026 = !{!1027}
!1027 = !DILocalVariable(name: "ignore", arg: 1, scope: !1023, file: !316, line: 87, type: !234)
!1028 = !DILocation(line: 0, scope: !1023)
!1029 = !DILocation(line: 89, column: 16, scope: !1023)
!1030 = !{!1031, !1031, i64 0}
!1031 = !{!"_Bool", !754, i64 0}
!1032 = !DILocation(line: 90, column: 1, scope: !1023)
!1033 = distinct !DISubprogram(name: "close_stdout", scope: !316, file: !316, line: 116, type: !378, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1034)
!1034 = !{!1035}
!1035 = !DILocalVariable(name: "write_error", scope: !1036, file: !316, line: 121, type: !72)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !316, line: 120, column: 5)
!1037 = distinct !DILexicalBlock(scope: !1033, file: !316, line: 118, column: 7)
!1038 = !DILocation(line: 118, column: 21, scope: !1037)
!1039 = !DILocation(line: 118, column: 7, scope: !1037)
!1040 = !DILocation(line: 118, column: 29, scope: !1037)
!1041 = !DILocation(line: 119, column: 7, scope: !1037)
!1042 = !DILocation(line: 119, column: 12, scope: !1037)
!1043 = !{i8 0, i8 2}
!1044 = !DILocation(line: 119, column: 25, scope: !1037)
!1045 = !DILocation(line: 119, column: 28, scope: !1037)
!1046 = !DILocation(line: 119, column: 34, scope: !1037)
!1047 = !DILocation(line: 118, column: 7, scope: !1033)
!1048 = !DILocation(line: 121, column: 33, scope: !1036)
!1049 = !DILocation(line: 0, scope: !1036)
!1050 = !DILocation(line: 122, column: 11, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1036, file: !316, line: 122, column: 11)
!1052 = !DILocation(line: 0, scope: !1051)
!1053 = !DILocation(line: 122, column: 11, scope: !1036)
!1054 = !DILocation(line: 123, column: 9, scope: !1051)
!1055 = !DILocation(line: 126, column: 9, scope: !1051)
!1056 = !DILocation(line: 128, column: 14, scope: !1036)
!1057 = !DILocation(line: 128, column: 7, scope: !1036)
!1058 = !DILocation(line: 133, column: 42, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1033, file: !316, line: 133, column: 7)
!1060 = !DILocation(line: 133, column: 28, scope: !1059)
!1061 = !DILocation(line: 133, column: 50, scope: !1059)
!1062 = !DILocation(line: 133, column: 7, scope: !1033)
!1063 = !DILocation(line: 134, column: 12, scope: !1059)
!1064 = !DILocation(line: 134, column: 5, scope: !1059)
!1065 = !DILocation(line: 135, column: 1, scope: !1033)
!1066 = !DISubprogram(name: "_exit", scope: !1010, file: !1010, line: 624, type: !742, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1067 = distinct !DISubprogram(name: "verror", scope: !331, file: !331, line: 251, type: !1068, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !108, !108, !72, !341}
!1070 = !{!1071, !1072, !1073, !1074}
!1071 = !DILocalVariable(name: "status", arg: 1, scope: !1067, file: !331, line: 251, type: !108)
!1072 = !DILocalVariable(name: "errnum", arg: 2, scope: !1067, file: !331, line: 251, type: !108)
!1073 = !DILocalVariable(name: "message", arg: 3, scope: !1067, file: !331, line: 251, type: !72)
!1074 = !DILocalVariable(name: "args", arg: 4, scope: !1067, file: !331, line: 251, type: !341)
!1075 = !DILocation(line: 0, scope: !1067)
!1076 = !DILocation(line: 261, column: 3, scope: !1067)
!1077 = !DILocation(line: 265, column: 7, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1067, file: !331, line: 265, column: 7)
!1079 = !DILocation(line: 265, column: 7, scope: !1067)
!1080 = !DILocation(line: 266, column: 5, scope: !1078)
!1081 = !DILocation(line: 272, column: 7, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !331, line: 268, column: 5)
!1083 = !DILocation(line: 276, column: 3, scope: !1067)
!1084 = !DILocation(line: 282, column: 1, scope: !1067)
!1085 = distinct !DISubprogram(name: "flush_stdout", scope: !331, file: !331, line: 163, type: !378, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1086)
!1086 = !{!1087}
!1087 = !DILocalVariable(name: "stdout_fd", scope: !1085, file: !331, line: 166, type: !108)
!1088 = !DILocation(line: 0, scope: !1085)
!1089 = !DILocalVariable(name: "fd", arg: 1, scope: !1090, file: !331, line: 145, type: !108)
!1090 = distinct !DISubprogram(name: "is_open", scope: !331, file: !331, line: 145, type: !1091, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1093)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!108, !108}
!1093 = !{!1089}
!1094 = !DILocation(line: 0, scope: !1090, inlinedAt: !1095)
!1095 = distinct !DILocation(line: 182, column: 25, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1085, file: !331, line: 182, column: 7)
!1097 = !DILocation(line: 157, column: 15, scope: !1090, inlinedAt: !1095)
!1098 = !DILocation(line: 157, column: 12, scope: !1090, inlinedAt: !1095)
!1099 = !DILocation(line: 182, column: 7, scope: !1085)
!1100 = !DILocation(line: 184, column: 5, scope: !1096)
!1101 = !DILocation(line: 185, column: 1, scope: !1085)
!1102 = distinct !DISubprogram(name: "error_tail", scope: !331, file: !331, line: 219, type: !1068, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1103)
!1103 = !{!1104, !1105, !1106, !1107}
!1104 = !DILocalVariable(name: "status", arg: 1, scope: !1102, file: !331, line: 219, type: !108)
!1105 = !DILocalVariable(name: "errnum", arg: 2, scope: !1102, file: !331, line: 219, type: !108)
!1106 = !DILocalVariable(name: "message", arg: 3, scope: !1102, file: !331, line: 219, type: !72)
!1107 = !DILocalVariable(name: "args", arg: 4, scope: !1102, file: !331, line: 219, type: !341)
!1108 = !DILocation(line: 0, scope: !1102)
!1109 = !DILocation(line: 229, column: 13, scope: !1102)
!1110 = !DILocalVariable(name: "__stream", arg: 1, scope: !1111, file: !799, line: 132, type: !1114)
!1111 = distinct !DISubprogram(name: "vfprintf", scope: !799, file: !799, line: 132, type: !1112, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1149)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!108, !1114, !803, !341}
!1114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1117, file: !251, line: 51, baseType: !108, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1117, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1117, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1117, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1117, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1117, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1117, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1117, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1117, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1117, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1117, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1117, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1117, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1117, file: !251, line: 70, baseType: !1133, size: 64, offset: 832)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1117, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1117, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1117, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1117, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1117, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1117, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1117, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1117, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1117, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1117, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1117, file: !251, line: 93, baseType: !1133, size: 64, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1117, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1117, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1117, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1117, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!1149 = !{!1110, !1150, !1151}
!1150 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1111, file: !799, line: 133, type: !803)
!1151 = !DILocalVariable(name: "__ap", arg: 3, scope: !1111, file: !799, line: 133, type: !341)
!1152 = !DILocation(line: 0, scope: !1111, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 229, column: 3, scope: !1102)
!1154 = !DILocation(line: 135, column: 10, scope: !1111, inlinedAt: !1153)
!1155 = !DILocation(line: 232, column: 3, scope: !1102)
!1156 = !DILocation(line: 233, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1102, file: !331, line: 233, column: 7)
!1158 = !DILocation(line: 233, column: 7, scope: !1102)
!1159 = !DILocalVariable(name: "errnum", arg: 1, scope: !1160, file: !331, line: 188, type: !108)
!1160 = distinct !DISubprogram(name: "print_errno_message", scope: !331, file: !331, line: 188, type: !742, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1161)
!1161 = !{!1159, !1162, !1163}
!1162 = !DILocalVariable(name: "s", scope: !1160, file: !331, line: 190, type: !72)
!1163 = !DILocalVariable(name: "errbuf", scope: !1160, file: !331, line: 193, type: !1164)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 1024)
!1167 = !DILocation(line: 0, scope: !1160, inlinedAt: !1168)
!1168 = distinct !DILocation(line: 234, column: 5, scope: !1157)
!1169 = !DILocation(line: 193, column: 3, scope: !1160, inlinedAt: !1168)
!1170 = !DILocation(line: 193, column: 8, scope: !1160, inlinedAt: !1168)
!1171 = !DILocation(line: 195, column: 7, scope: !1160, inlinedAt: !1168)
!1172 = !DILocation(line: 207, column: 9, scope: !1173, inlinedAt: !1168)
!1173 = distinct !DILexicalBlock(scope: !1160, file: !331, line: 207, column: 7)
!1174 = !DILocation(line: 207, column: 7, scope: !1160, inlinedAt: !1168)
!1175 = !DILocation(line: 208, column: 9, scope: !1173, inlinedAt: !1168)
!1176 = !DILocation(line: 208, column: 5, scope: !1173, inlinedAt: !1168)
!1177 = !DILocation(line: 214, column: 3, scope: !1160, inlinedAt: !1168)
!1178 = !DILocation(line: 216, column: 1, scope: !1160, inlinedAt: !1168)
!1179 = !DILocation(line: 234, column: 5, scope: !1157)
!1180 = !DILocation(line: 238, column: 3, scope: !1102)
!1181 = !DILocalVariable(name: "__c", arg: 1, scope: !1182, file: !1183, line: 101, type: !108)
!1182 = distinct !DISubprogram(name: "putc_unlocked", scope: !1183, file: !1183, line: 101, type: !1184, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1186)
!1183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!108, !108, !1115}
!1186 = !{!1181, !1187}
!1187 = !DILocalVariable(name: "__stream", arg: 2, scope: !1182, file: !1183, line: 101, type: !1115)
!1188 = !DILocation(line: 0, scope: !1182, inlinedAt: !1189)
!1189 = distinct !DILocation(line: 238, column: 3, scope: !1102)
!1190 = !DILocation(line: 103, column: 10, scope: !1182, inlinedAt: !1189)
!1191 = !{!1192, !753, i64 40}
!1192 = !{!"_IO_FILE", !814, i64 0, !753, i64 8, !753, i64 16, !753, i64 24, !753, i64 32, !753, i64 40, !753, i64 48, !753, i64 56, !753, i64 64, !753, i64 72, !753, i64 80, !753, i64 88, !753, i64 96, !753, i64 104, !814, i64 112, !814, i64 116, !1193, i64 120, !855, i64 128, !754, i64 130, !754, i64 131, !753, i64 136, !1193, i64 144, !753, i64 152, !753, i64 160, !753, i64 168, !753, i64 176, !1193, i64 184, !814, i64 192, !754, i64 196}
!1193 = !{!"long", !754, i64 0}
!1194 = !{!1192, !753, i64 48}
!1195 = !{!"branch_weights", i32 2000, i32 1}
!1196 = !DILocation(line: 240, column: 3, scope: !1102)
!1197 = !DILocation(line: 241, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1102, file: !331, line: 241, column: 7)
!1199 = !DILocation(line: 241, column: 7, scope: !1102)
!1200 = !DILocation(line: 242, column: 5, scope: !1198)
!1201 = !DILocation(line: 243, column: 1, scope: !1102)
!1202 = !DISubprogram(name: "__vfprintf_chk", scope: !799, file: !799, line: 96, type: !1203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!108, !1114, !108, !803, !341}
!1205 = !DISubprogram(name: "strerror_r", scope: !934, file: !934, line: 444, type: !1206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!255, !108, !255, !110}
!1208 = !DISubprogram(name: "__overflow", scope: !808, file: !808, line: 886, type: !1209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!108, !1115, !108}
!1211 = !DISubprogram(name: "fflush_unlocked", scope: !808, file: !808, line: 239, type: !1212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!108, !1115}
!1214 = !DISubprogram(name: "fcntl", scope: !1215, file: !1215, line: 149, type: !1216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!1215 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!108, !108, !108, null}
!1218 = distinct !DISubprogram(name: "error", scope: !331, file: !331, line: 285, type: !1219, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1221)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{null, !108, !108, !72, null}
!1221 = !{!1222, !1223, !1224, !1225}
!1222 = !DILocalVariable(name: "status", arg: 1, scope: !1218, file: !331, line: 285, type: !108)
!1223 = !DILocalVariable(name: "errnum", arg: 2, scope: !1218, file: !331, line: 285, type: !108)
!1224 = !DILocalVariable(name: "message", arg: 3, scope: !1218, file: !331, line: 285, type: !72)
!1225 = !DILocalVariable(name: "ap", scope: !1218, file: !331, line: 287, type: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !808, line: 52, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1228, line: 14, baseType: !1229)
!1228 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !345, baseType: !1230)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 192, elements: !35)
!1231 = !DILocation(line: 0, scope: !1218)
!1232 = !DILocation(line: 287, column: 3, scope: !1218)
!1233 = !DILocation(line: 287, column: 11, scope: !1218)
!1234 = !DILocation(line: 288, column: 3, scope: !1218)
!1235 = !DILocation(line: 289, column: 3, scope: !1218)
!1236 = !DILocation(line: 290, column: 3, scope: !1218)
!1237 = !DILocation(line: 291, column: 1, scope: !1218)
!1238 = !DILocation(line: 0, scope: !338)
!1239 = !DILocation(line: 302, column: 7, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !338, file: !331, line: 302, column: 7)
!1241 = !DILocation(line: 302, column: 7, scope: !338)
!1242 = !DILocation(line: 307, column: 11, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !331, line: 307, column: 11)
!1244 = distinct !DILexicalBlock(scope: !1240, file: !331, line: 303, column: 5)
!1245 = !DILocation(line: 307, column: 27, scope: !1243)
!1246 = !DILocation(line: 308, column: 11, scope: !1243)
!1247 = !DILocation(line: 308, column: 28, scope: !1243)
!1248 = !DILocation(line: 308, column: 25, scope: !1243)
!1249 = !DILocation(line: 309, column: 15, scope: !1243)
!1250 = !DILocation(line: 309, column: 33, scope: !1243)
!1251 = !DILocation(line: 310, column: 19, scope: !1243)
!1252 = !DILocation(line: 311, column: 22, scope: !1243)
!1253 = !DILocation(line: 311, column: 56, scope: !1243)
!1254 = !DILocation(line: 307, column: 11, scope: !1244)
!1255 = !DILocation(line: 316, column: 21, scope: !1244)
!1256 = !DILocation(line: 317, column: 23, scope: !1244)
!1257 = !DILocation(line: 318, column: 5, scope: !1244)
!1258 = !DILocation(line: 327, column: 3, scope: !338)
!1259 = !DILocation(line: 331, column: 7, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !338, file: !331, line: 331, column: 7)
!1261 = !DILocation(line: 331, column: 7, scope: !338)
!1262 = !DILocation(line: 332, column: 5, scope: !1260)
!1263 = !DILocation(line: 338, column: 7, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1260, file: !331, line: 334, column: 5)
!1265 = !DILocation(line: 346, column: 3, scope: !338)
!1266 = !DILocation(line: 350, column: 3, scope: !338)
!1267 = !DILocation(line: 356, column: 1, scope: !338)
!1268 = distinct !DISubprogram(name: "error_at_line", scope: !331, file: !331, line: 359, type: !1269, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1271)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{null, !108, !108, !72, !78, !72, null}
!1271 = !{!1272, !1273, !1274, !1275, !1276, !1277}
!1272 = !DILocalVariable(name: "status", arg: 1, scope: !1268, file: !331, line: 359, type: !108)
!1273 = !DILocalVariable(name: "errnum", arg: 2, scope: !1268, file: !331, line: 359, type: !108)
!1274 = !DILocalVariable(name: "file_name", arg: 3, scope: !1268, file: !331, line: 359, type: !72)
!1275 = !DILocalVariable(name: "line_number", arg: 4, scope: !1268, file: !331, line: 360, type: !78)
!1276 = !DILocalVariable(name: "message", arg: 5, scope: !1268, file: !331, line: 360, type: !72)
!1277 = !DILocalVariable(name: "ap", scope: !1268, file: !331, line: 362, type: !1226)
!1278 = !DILocation(line: 0, scope: !1268)
!1279 = !DILocation(line: 362, column: 3, scope: !1268)
!1280 = !DILocation(line: 362, column: 11, scope: !1268)
!1281 = !DILocation(line: 363, column: 3, scope: !1268)
!1282 = !DILocation(line: 364, column: 3, scope: !1268)
!1283 = !DILocation(line: 366, column: 3, scope: !1268)
!1284 = !DILocation(line: 367, column: 1, scope: !1268)
!1285 = distinct !DISubprogram(name: "getprogname", scope: !671, file: !671, line: 54, type: !1286, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !670, retainedNodes: !797)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!72}
!1288 = !DILocation(line: 58, column: 10, scope: !1285)
!1289 = !DILocation(line: 58, column: 3, scope: !1285)
!1290 = distinct !DISubprogram(name: "parse_long_options", scope: !382, file: !382, line: 45, type: !1291, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !385, retainedNodes: !1294)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !108, !967, !72, !72, !72, !1293, null}
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1305}
!1295 = !DILocalVariable(name: "argc", arg: 1, scope: !1290, file: !382, line: 45, type: !108)
!1296 = !DILocalVariable(name: "argv", arg: 2, scope: !1290, file: !382, line: 46, type: !967)
!1297 = !DILocalVariable(name: "command_name", arg: 3, scope: !1290, file: !382, line: 47, type: !72)
!1298 = !DILocalVariable(name: "package", arg: 4, scope: !1290, file: !382, line: 48, type: !72)
!1299 = !DILocalVariable(name: "version", arg: 5, scope: !1290, file: !382, line: 49, type: !72)
!1300 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1290, file: !382, line: 50, type: !1293)
!1301 = !DILocalVariable(name: "saved_opterr", scope: !1290, file: !382, line: 53, type: !108)
!1302 = !DILocalVariable(name: "c", scope: !1303, file: !382, line: 60, type: !108)
!1303 = distinct !DILexicalBlock(scope: !1304, file: !382, line: 59, column: 5)
!1304 = distinct !DILexicalBlock(scope: !1290, file: !382, line: 58, column: 7)
!1305 = !DILocalVariable(name: "authors", scope: !1306, file: !382, line: 71, type: !1310)
!1306 = distinct !DILexicalBlock(scope: !1307, file: !382, line: 70, column: 15)
!1307 = distinct !DILexicalBlock(scope: !1308, file: !382, line: 64, column: 13)
!1308 = distinct !DILexicalBlock(scope: !1309, file: !382, line: 62, column: 9)
!1309 = distinct !DILexicalBlock(scope: !1303, file: !382, line: 61, column: 11)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !808, line: 52, baseType: !1311)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1228, line: 14, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1313, baseType: !1314)
!1313 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1315, size: 192, elements: !35)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1315, file: !1313, line: 71, baseType: !78, size: 32)
