; ModuleID = 'src/users.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !71, line: 676, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 61)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !71, line: 679, type: !151, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !71, line: 683, type: !128, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !71, line: 688, type: !128, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !71, line: 691, type: !167, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !71, line: 839, type: !63, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !71, line: 840, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 22)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !71, line: 841, type: !191, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !71, line: 862, type: !135, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !71, line: 868, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 71)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !71, line: 875, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 27)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 51)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 12)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !151, isLocal: true, isDefinition: true)
!240 = !{!241, !242, !243, !246, !248, !249, !250, !254, !255, !256, !257, !259, !312, !313, !314, !316, !317}
!241 = !DILocalVariable(name: "program", arg: 1, scope: !70, file: !71, line: 573, type: !74)
!242 = !DILocalVariable(name: "option", arg: 2, scope: !70, file: !71, line: 573, type: !74)
!243 = !DILocalVariable(name: "term", scope: !244, file: !71, line: 585, type: !74)
!244 = distinct !DILexicalBlock(scope: !245, file: !71, line: 582, column: 5)
!245 = distinct !DILexicalBlock(scope: !70, file: !71, line: 581, column: 7)
!246 = !DILocalVariable(name: "double_space", scope: !70, file: !71, line: 594, type: !247)
!247 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!248 = !DILocalVariable(name: "first_word", scope: !70, file: !71, line: 595, type: !74)
!249 = !DILocalVariable(name: "option_text", scope: !70, file: !71, line: 596, type: !74)
!250 = !DILocalVariable(name: "s", scope: !251, file: !71, line: 608, type: !74)
!251 = distinct !DILexicalBlock(scope: !252, file: !71, line: 605, column: 5)
!252 = distinct !DILexicalBlock(scope: !253, file: !71, line: 604, column: 12)
!253 = distinct !DILexicalBlock(scope: !70, file: !71, line: 597, column: 7)
!254 = !DILocalVariable(name: "spaces", scope: !251, file: !71, line: 609, type: !119)
!255 = !DILocalVariable(name: "anchor_len", scope: !70, file: !71, line: 620, type: !119)
!256 = !DILocalVariable(name: "desc_text", scope: !70, file: !71, line: 625, type: !74)
!257 = !DILocalVariable(name: "__ptr", scope: !258, file: !71, line: 644, type: !74)
!258 = distinct !DILexicalBlock(scope: !70, file: !71, line: 644, column: 3)
!259 = !DILocalVariable(name: "__stream", scope: !258, file: !71, line: 644, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !262, line: 7, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !264, line: 49, size: 1728, elements: !265)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !281, !283, !284, !285, !289, !290, !292, !293, !296, !298, !301, !304, !305, !306, !307, !308}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !264, line: 51, baseType: !117, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !264, line: 54, baseType: !124, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !264, line: 55, baseType: !124, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !264, line: 56, baseType: !124, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !264, line: 57, baseType: !124, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !264, line: 58, baseType: !124, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !264, line: 59, baseType: !124, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !264, line: 60, baseType: !124, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !264, line: 61, baseType: !124, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !264, line: 64, baseType: !124, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !264, line: 65, baseType: !124, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !264, line: 66, baseType: !124, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !264, line: 68, baseType: !279, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !264, line: 36, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !264, line: 70, baseType: !282, size: 64, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !264, line: 72, baseType: !117, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !264, line: 73, baseType: !117, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !264, line: 74, baseType: !286, size: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !287, line: 152, baseType: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!288 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !264, line: 77, baseType: !118, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !264, line: 78, baseType: !291, size: 8, offset: 1040)
!291 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !264, line: 79, baseType: !41, size: 8, offset: 1048)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !264, line: 81, baseType: !294, size: 64, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !264, line: 43, baseType: null)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !264, line: 89, baseType: !297, size: 64, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !287, line: 153, baseType: !288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !264, line: 91, baseType: !299, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !264, line: 37, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !264, line: 92, baseType: !302, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !264, line: 38, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !264, line: 93, baseType: !282, size: 64, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !264, line: 94, baseType: !116, size: 64, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !264, line: 95, baseType: !119, size: 64, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !264, line: 96, baseType: !117, size: 32, offset: 1536)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !264, line: 98, baseType: !309, size: 160, offset: 1568)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 20)
!312 = !DILocalVariable(name: "__cnt", scope: !258, file: !71, line: 644, type: !119)
!313 = !DILocalVariable(name: "url_program", scope: !70, file: !71, line: 648, type: !74)
!314 = !DILocalVariable(name: "__ptr", scope: !315, file: !71, line: 686, type: !74)
!315 = distinct !DILexicalBlock(scope: !70, file: !71, line: 686, column: 3)
!316 = !DILocalVariable(name: "__stream", scope: !315, file: !71, line: 686, type: !260)
!317 = !DILocalVariable(name: "__cnt", scope: !315, file: !71, line: 686, type: !119)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !320, line: 3, type: !191, isLocal: true, isDefinition: true)
!320 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "Version", scope: !323, file: !320, line: 3, type: !74, isLocal: false, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C11, file: !320, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!324 = !{!318, !321}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "file_name", scope: !327, file: !328, line: 45, type: !74, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C11, file: !328, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!329 = !{!330, !332, !334, !336, !325, !338}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !162, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !235, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !328, line: 123, type: !162, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !328, line: 126, type: !151, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !327, file: !328, line: 55, type: !247, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !342, file: !343, line: 66, type: !389, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C11, file: !343, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, globals: !345, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!344 = !{!116, !122}
!345 = !{!346, !348, !368, !370, !372, !374, !340, !376, !378, !380, !382, !387}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !343, line: 272, type: !128, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "old_file_name", scope: !350, file: !343, line: 304, type: !74, isLocal: true, isDefinition: true)
!350 = distinct !DISubprogram(name: "verror_at_line", scope: !343, file: !343, line: 298, type: !351, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !361)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !117, !117, !74, !80, !74, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !355)
!355 = !{!356, !358, !359, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !354, file: !357, baseType: !80, size: 32)
!357 = !DIFile(filename: "lib/error.c", directory: "/src")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !354, file: !357, baseType: !80, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !354, file: !357, baseType: !116, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !354, file: !357, baseType: !116, size: 64, offset: 128)
!361 = !{!362, !363, !364, !365, !366, !367}
!362 = !DILocalVariable(name: "status", arg: 1, scope: !350, file: !343, line: 298, type: !117)
!363 = !DILocalVariable(name: "errnum", arg: 2, scope: !350, file: !343, line: 298, type: !117)
!364 = !DILocalVariable(name: "file_name", arg: 3, scope: !350, file: !343, line: 298, type: !74)
!365 = !DILocalVariable(name: "line_number", arg: 4, scope: !350, file: !343, line: 298, type: !80)
!366 = !DILocalVariable(name: "message", arg: 5, scope: !350, file: !343, line: 298, type: !74)
!367 = !DILocalVariable(name: "args", arg: 6, scope: !350, file: !343, line: 298, type: !353)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "old_line_number", scope: !350, file: !343, line: 305, type: !80, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !343, line: 338, type: !135, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !167, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !142, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "error_message_count", scope: !342, file: !343, line: 69, type: !80, isLocal: false, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !342, file: !343, line: 295, type: !117, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !162, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 21)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !343, line: 214, type: !128, isLocal: true, isDefinition: true)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !394, line: 60, type: !142, isLocal: true, isDefinition: true)
!394 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "long_options", scope: !397, file: !394, line: 34, type: !405, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C11, file: !394, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !398, splitDebugInlining: false, nameTableKind: None)
!398 = !{!392, !399, !401, !403, !395}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !394, line: 112, type: !41, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !394, line: 36, type: !128, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !394, line: 37, type: !167, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 768, elements: !152)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !408, line: 50, size: 256, elements: !409)
!408 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!409 = !{!410, !411, !412, !414}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !407, file: !408, line: 52, baseType: !74, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !407, file: !408, line: 55, baseType: !117, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !407, file: !408, line: 56, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !407, file: !408, line: 57, baseType: !117, size: 32, offset: 192)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "program_name", scope: !417, file: !418, line: 31, type: !74, isLocal: false, isDefinition: true)
!417 = distinct !DICompileUnit(language: DW_LANG_C11, file: !418, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !419, globals: !420, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!419 = !{!124}
!420 = !{!415, !421, !423}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !418, line: 46, type: !167, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !418, line: 49, type: !135, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "utf07FF", scope: !427, file: !428, line: 46, type: !455, isLocal: true, isDefinition: true)
!427 = distinct !DISubprogram(name: "proper_name_lite", scope: !428, file: !428, line: 38, type: !429, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !431, retainedNodes: !433)
!428 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!429 = !DISubroutineType(types: !430)
!430 = !{!74, !74, !74}
!431 = distinct !DICompileUnit(language: DW_LANG_C11, file: !428, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !432, splitDebugInlining: false, nameTableKind: None)
!432 = !{!425}
!433 = !{!434, !435, !436, !437, !442}
!434 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !427, file: !428, line: 38, type: !74)
!435 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !427, file: !428, line: 38, type: !74)
!436 = !DILocalVariable(name: "translation", scope: !427, file: !428, line: 40, type: !74)
!437 = !DILocalVariable(name: "w", scope: !427, file: !428, line: 47, type: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !439, line: 37, baseType: !440)
!439 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !287, line: 57, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !287, line: 42, baseType: !80)
!442 = !DILocalVariable(name: "mbs", scope: !427, file: !428, line: 48, type: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !444, line: 6, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !446, line: 21, baseType: !447)
!446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 13, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !447, file: !446, line: 15, baseType: !117, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !447, file: !446, line: 20, baseType: !451, size: 32, offset: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !447, file: !446, line: 16, size: 32, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !451, file: !446, line: 18, baseType: !80, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !451, file: !446, line: 19, baseType: !135, size: 32)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16, elements: !143)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !458, line: 78, type: !167, isLocal: true, isDefinition: true)
!458 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !458, line: 79, type: !26, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !458, line: 80, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 13)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !458, line: 81, type: !463, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !458, line: 82, type: !309, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !458, line: 83, type: !142, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !458, line: 84, type: !167, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !458, line: 85, type: !162, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !458, line: 86, type: !162, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !458, line: 87, type: !167, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !482, file: !458, line: 76, type: !554, isLocal: false, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C11, file: !458, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !489, globals: !490, splitDebugInlining: false, nameTableKind: None)
!483 = !{!101, !484, !86}
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !102, line: 254, baseType: !80, size: 32, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!487 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!488 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!489 = !{!117, !118, !119}
!490 = !{!456, !459, !461, !466, !468, !470, !472, !474, !476, !478, !480, !491, !495, !505, !507, !512, !514, !516, !518, !520, !543, !550, !552}
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !482, file: !458, line: 92, type: !493, isLocal: false, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 320, elements: !47)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !482, file: !458, line: 1040, type: !497, isLocal: false, isDefinition: true)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !458, line: 56, size: 448, elements: !498)
!498 = !{!499, !500, !501, !503, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !497, file: !458, line: 59, baseType: !101, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !497, file: !458, line: 62, baseType: !117, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !497, file: !458, line: 66, baseType: !502, size: 256, offset: 64)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 256, elements: !168)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !497, file: !458, line: 69, baseType: !74, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !497, file: !458, line: 72, baseType: !74, size: 64, offset: 384)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !482, file: !458, line: 107, type: !497, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "slot0", scope: !482, file: !458, line: 831, type: !509, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 256)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !458, line: 321, type: !142, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !458, line: 357, type: !142, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !458, line: 358, type: !142, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !458, line: 199, type: !162, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "quote", scope: !522, file: !458, line: 228, type: !541, isLocal: true, isDefinition: true)
!522 = distinct !DISubprogram(name: "gettext_quote", scope: !458, file: !458, line: 197, type: !523, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !482, retainedNodes: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!74, !74, !101}
!525 = !{!526, !527, !528, !529, !530}
!526 = !DILocalVariable(name: "msgid", arg: 1, scope: !522, file: !458, line: 197, type: !74)
!527 = !DILocalVariable(name: "s", arg: 2, scope: !522, file: !458, line: 197, type: !101)
!528 = !DILocalVariable(name: "translation", scope: !522, file: !458, line: 199, type: !74)
!529 = !DILocalVariable(name: "w", scope: !522, file: !458, line: 229, type: !438)
!530 = !DILocalVariable(name: "mbs", scope: !522, file: !458, line: 230, type: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !444, line: 6, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !446, line: 21, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 13, size: 64, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !533, file: !446, line: 15, baseType: !117, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !533, file: !446, line: 20, baseType: !537, size: 32, offset: 32)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !446, line: 16, size: 32, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !537, file: !446, line: 18, baseType: !80, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !537, file: !446, line: 19, baseType: !135, size: 32)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !542)
!542 = !{!144, !137}
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "slotvec", scope: !482, file: !458, line: 834, type: !545, isLocal: true, isDefinition: true)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !458, line: 823, size: 128, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !546, file: !458, line: 825, baseType: !119, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !546, file: !458, line: 826, baseType: !124, size: 64, offset: 64)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "nslots", scope: !482, file: !458, line: 832, type: !117, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "slotvec0", scope: !482, file: !458, line: 833, type: !546, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 704, elements: !556)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!556 = !{!557}
!557 = !DISubrange(count: 11)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !560, line: 347, type: !19, isLocal: true, isDefinition: true)
!560 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !560, line: 398, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 9)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !560, line: 399, type: !142, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !560, line: 446, type: !162, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !560, line: 447, type: !41, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !574, line: 98, type: !575, isLocal: true, isDefinition: true)
!574 = !DIFile(filename: "./lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 29)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !574, line: 99, type: !575, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !574, line: 100, type: !384, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !574, line: 40, type: !463, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !574, line: 40, type: !151, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !588, line: 67, type: !235, isLocal: true, isDefinition: true)
!588 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !588, line: 69, type: !162, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !588, line: 83, type: !162, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !588, line: 83, type: !135, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !588, line: 85, type: !142, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !588, line: 88, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 171)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !588, line: 88, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 34)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !588, line: 105, type: !63, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !588, line: 109, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 23)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !588, line: 113, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 28)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !588, line: 120, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 32)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !588, line: 127, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 36)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !588, line: 134, type: !186, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !588, line: 142, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 44)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !588, line: 150, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 48)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !588, line: 159, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 52)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !588, line: 170, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 60)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !588, line: 248, type: !309, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !588, line: 248, type: !211, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !588, line: 254, type: !309, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !588, line: 254, type: !19, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !588, line: 254, type: !186, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !588, line: 259, type: !3, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !588, line: 259, type: !575, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !667, file: !668, line: 26, type: !670, isLocal: false, isDefinition: true)
!667 = distinct !DICompileUnit(language: DW_LANG_C11, file: !668, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !669, splitDebugInlining: false, nameTableKind: None)
!668 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!669 = !{!665}
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 47)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "exit_failure", scope: !675, file: !676, line: 24, type: !678, isLocal: false, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C11, file: !676, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !677, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!677 = !{!673}
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !681, line: 34, type: !151, isLocal: true, isDefinition: true)
!681 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !681, line: 34, type: !162, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !681, line: 34, type: !58, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !688, line: 108, type: !41, isLocal: true, isDefinition: true)
!688 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "internal_state", scope: !691, file: !688, line: 97, type: !694, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !692, globals: !693, splitDebugInlining: false, nameTableKind: None)
!692 = !{!116, !119, !122}
!693 = !{!686, !689}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !444, line: 6, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !446, line: 21, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 13, size: 64, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !696, file: !446, line: 15, baseType: !117, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !696, file: !446, line: 20, baseType: !700, size: 32, offset: 32)
!700 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !696, file: !446, line: 16, size: 32, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !700, file: !446, line: 18, baseType: !80, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !700, file: !446, line: 19, baseType: !135, size: 32)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !706, line: 35, type: !26, isLocal: true, isDefinition: true)
!706 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!707 = distinct !DICompileUnit(language: DW_LANG_C11, file: !708, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!709 = distinct !DICompileUnit(language: DW_LANG_C11, file: !560, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !710, retainedTypes: !711, globals: !742, splitDebugInlining: false, nameTableKind: None)
!710 = !{!78}
!711 = !{!124, !116, !712, !740, !119}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !715, line: 55, size: 3072, elements: !716)
!715 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!716 = !{!717, !719, !721, !722, !723, !724, !725, !730, !732, !737, !739}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !714, file: !715, line: 57, baseType: !718, size: 16)
!718 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !714, file: !715, line: 58, baseType: !720, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !287, line: 154, baseType: !117)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !714, file: !715, line: 59, baseType: !621, size: 256, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !714, file: !715, line: 61, baseType: !135, size: 32, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !714, file: !715, line: 63, baseType: !621, size: 256, offset: 352)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !714, file: !715, line: 65, baseType: !509, size: 2048, offset: 608)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !714, file: !715, line: 67, baseType: !726, size: 32, offset: 2656)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !715, line: 42, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !726, file: !715, line: 45, baseType: !718, size: 16)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !726, file: !715, line: 46, baseType: !718, size: 16, offset: 16)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !714, file: !715, line: 74, baseType: !731, size: 32, offset: 2688)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !287, line: 41, baseType: !117)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !714, file: !715, line: 79, baseType: !733, size: 64, offset: 2720)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !715, line: 75, size: 64, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !733, file: !715, line: 77, baseType: !731, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !733, file: !715, line: 78, baseType: !731, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !714, file: !715, line: 84, baseType: !738, size: 128, offset: 2784)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 128, elements: !136)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !714, file: !715, line: 85, baseType: !309, size: 160, offset: 2912)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !741, line: 87, baseType: !288)
!741 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!742 = !{!558, !561, !566, !568, !570, !572, !578, !580, !582, !584}
!743 = distinct !DICompileUnit(language: DW_LANG_C11, file: !588, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !744, retainedTypes: !748, globals: !749, splitDebugInlining: false, nameTableKind: None)
!744 = !{!745}
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !588, line: 40, baseType: !80, size: 32, elements: !746)
!746 = !{!747}
!747 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!748 = !{!116}
!749 = !{!586, !589, !591, !593, !595, !597, !602, !607, !609, !614, !619, !624, !629, !631, !636, !641, !646, !651, !653, !655, !657, !659, !661, !663}
!750 = distinct !DICompileUnit(language: DW_LANG_C11, file: !751, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !752, retainedTypes: !783, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!752 = !{!753, !765}
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !754, file: !751, line: 188, baseType: !80, size: 32, elements: !763)
!754 = distinct !DISubprogram(name: "x2nrealloc", scope: !751, file: !751, line: 176, type: !755, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !750, retainedNodes: !758)
!755 = !DISubroutineType(types: !756)
!756 = !{!116, !116, !757, !119}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!758 = !{!759, !760, !761, !762}
!759 = !DILocalVariable(name: "p", arg: 1, scope: !754, file: !751, line: 176, type: !116)
!760 = !DILocalVariable(name: "pn", arg: 2, scope: !754, file: !751, line: 176, type: !757)
!761 = !DILocalVariable(name: "s", arg: 3, scope: !754, file: !751, line: 176, type: !119)
!762 = !DILocalVariable(name: "n", scope: !754, file: !751, line: 178, type: !119)
!763 = !{!764}
!764 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !766, file: !751, line: 228, baseType: !80, size: 32, elements: !763)
!766 = distinct !DISubprogram(name: "xpalloc", scope: !751, file: !751, line: 223, type: !767, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !750, retainedNodes: !773)
!767 = !DISubroutineType(types: !768)
!768 = !{!116, !116, !769, !770, !772, !770}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !771, line: 130, baseType: !772)
!771 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !120, line: 35, baseType: !288)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782}
!774 = !DILocalVariable(name: "pa", arg: 1, scope: !766, file: !751, line: 223, type: !116)
!775 = !DILocalVariable(name: "pn", arg: 2, scope: !766, file: !751, line: 223, type: !769)
!776 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !766, file: !751, line: 223, type: !770)
!777 = !DILocalVariable(name: "n_max", arg: 4, scope: !766, file: !751, line: 223, type: !772)
!778 = !DILocalVariable(name: "s", arg: 5, scope: !766, file: !751, line: 223, type: !770)
!779 = !DILocalVariable(name: "n0", scope: !766, file: !751, line: 230, type: !770)
!780 = !DILocalVariable(name: "n", scope: !766, file: !751, line: 237, type: !770)
!781 = !DILocalVariable(name: "nbytes", scope: !766, file: !751, line: 248, type: !770)
!782 = !DILocalVariable(name: "adjusted_nbytes", scope: !766, file: !751, line: 252, type: !770)
!783 = !{!124, !116, !247, !288, !121}
!784 = distinct !DICompileUnit(language: DW_LANG_C11, file: !681, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !785, splitDebugInlining: false, nameTableKind: None)
!785 = !{!679, !682, !684}
!786 = distinct !DICompileUnit(language: DW_LANG_C11, file: !787, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !789, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!790 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!792 = distinct !DICompileUnit(language: DW_LANG_C11, file: !793, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!793 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !795, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!795 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !798, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!798 = !{!247, !121, !116}
!799 = distinct !DICompileUnit(language: DW_LANG_C11, file: !706, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !800, splitDebugInlining: false, nameTableKind: None)
!800 = !{!801, !704}
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !706, line: 35, type: !142, isLocal: true, isDefinition: true)
!803 = distinct !DICompileUnit(language: DW_LANG_C11, file: !804, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!804 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!805 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !748, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!807 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!808 = !{i32 7, !"Dwarf Version", i32 5}
!809 = !{i32 2, !"Debug Info Version", i32 3}
!810 = !{i32 1, !"wchar_size", i32 4}
!811 = !{i32 8, !"PIC Level", i32 2}
!812 = !{i32 7, !"PIE Level", i32 2}
!813 = !{i32 7, !"uwtable", i32 2}
!814 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 96, type: !815, scopeLine: 97, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !117}
!817 = !{!818}
!818 = !DILocalVariable(name: "status", arg: 1, scope: !814, file: !2, line: 96, type: !117)
!819 = !DILocation(line: 0, scope: !814)
!820 = !DILocation(line: 98, column: 14, scope: !821)
!821 = distinct !DILexicalBlock(scope: !814, file: !2, line: 98, column: 7)
!822 = !DILocation(line: 98, column: 7, scope: !814)
!823 = !DILocation(line: 99, column: 5, scope: !824)
!824 = distinct !DILexicalBlock(scope: !821, file: !2, line: 99, column: 5)
!825 = !{!826, !826, i64 0}
!826 = !{!"any pointer", !827, i64 0}
!827 = !{!"omnipotent char", !828, i64 0}
!828 = !{!"Simple C/C++ TBAA"}
!829 = !DILocation(line: 102, column: 7, scope: !830)
!830 = distinct !DILexicalBlock(scope: !821, file: !2, line: 101, column: 5)
!831 = !DILocation(line: 103, column: 7, scope: !830)
!832 = !DILocation(line: 109, column: 7, scope: !830)
!833 = !DILocation(line: 110, column: 7, scope: !830)
!834 = !DILocalVariable(name: "program", arg: 1, scope: !835, file: !71, line: 836, type: !74)
!835 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !71, file: !71, line: 836, type: !836, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !74}
!838 = !{!834, !839, !846, !847, !849, !850}
!839 = !DILocalVariable(name: "infomap", scope: !835, file: !71, line: 838, type: !840)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 896, elements: !163)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !835, file: !71, line: 838, size: 128, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !842, file: !71, line: 838, baseType: !74, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !842, file: !71, line: 838, baseType: !74, size: 64, offset: 64)
!846 = !DILocalVariable(name: "node", scope: !835, file: !71, line: 848, type: !74)
!847 = !DILocalVariable(name: "map_prog", scope: !835, file: !71, line: 849, type: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!849 = !DILocalVariable(name: "lc_messages", scope: !835, file: !71, line: 861, type: !74)
!850 = !DILocalVariable(name: "url_program", scope: !835, file: !71, line: 874, type: !74)
!851 = !DILocation(line: 0, scope: !835, inlinedAt: !852)
!852 = distinct !DILocation(line: 111, column: 7, scope: !830)
!853 = !DILocation(line: 857, column: 3, scope: !835, inlinedAt: !852)
!854 = !DILocation(line: 861, column: 29, scope: !835, inlinedAt: !852)
!855 = !DILocation(line: 862, column: 7, scope: !856, inlinedAt: !852)
!856 = distinct !DILexicalBlock(scope: !835, file: !71, line: 862, column: 7)
!857 = !DILocation(line: 862, column: 19, scope: !856, inlinedAt: !852)
!858 = !DILocation(line: 862, column: 22, scope: !856, inlinedAt: !852)
!859 = !DILocation(line: 862, column: 7, scope: !835, inlinedAt: !852)
!860 = !DILocation(line: 868, column: 7, scope: !861, inlinedAt: !852)
!861 = distinct !DILexicalBlock(scope: !856, file: !71, line: 863, column: 5)
!862 = !DILocation(line: 870, column: 5, scope: !861, inlinedAt: !852)
!863 = !DILocation(line: 875, column: 3, scope: !835, inlinedAt: !852)
!864 = !DILocation(line: 877, column: 3, scope: !835, inlinedAt: !852)
!865 = !DILocation(line: 113, column: 3, scope: !814)
!866 = !DISubprogram(name: "dcgettext", scope: !867, file: !867, line: 51, type: !868, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!867 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!868 = !DISubroutineType(types: !869)
!869 = !{!124, !74, !74, !117}
!870 = !{}
!871 = !DISubprogram(name: "__fprintf_chk", scope: !872, file: !872, line: 93, type: !873, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!872 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!873 = !DISubroutineType(types: !874)
!874 = !{!117, !875, !117, !876, null}
!875 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !260)
!876 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!877 = !DISubprogram(name: "__printf_chk", scope: !872, file: !872, line: 95, type: !878, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!878 = !DISubroutineType(types: !879)
!879 = !{!117, !117, !876, null}
!880 = !DILocation(line: 0, scope: !70)
!881 = !DILocation(line: 581, column: 7, scope: !245)
!882 = !{!883, !883, i64 0}
!883 = !{!"int", !827, i64 0}
!884 = !DILocation(line: 581, column: 19, scope: !245)
!885 = !DILocation(line: 581, column: 7, scope: !70)
!886 = !DILocation(line: 585, column: 26, scope: !244)
!887 = !DILocation(line: 0, scope: !244)
!888 = !DILocation(line: 586, column: 23, scope: !244)
!889 = !DILocation(line: 586, column: 28, scope: !244)
!890 = !DILocation(line: 586, column: 32, scope: !244)
!891 = !{!827, !827, i64 0}
!892 = !DILocation(line: 586, column: 38, scope: !244)
!893 = !DILocalVariable(name: "__s1", arg: 1, scope: !894, file: !895, line: 1359, type: !74)
!894 = distinct !DISubprogram(name: "streq", scope: !895, file: !895, line: 1359, type: !896, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !898)
!895 = !DIFile(filename: "./lib/string.h", directory: "/src")
!896 = !DISubroutineType(types: !897)
!897 = !{!247, !74, !74}
!898 = !{!893, !899}
!899 = !DILocalVariable(name: "__s2", arg: 2, scope: !894, file: !895, line: 1359, type: !74)
!900 = !DILocation(line: 0, scope: !894, inlinedAt: !901)
!901 = distinct !DILocation(line: 586, column: 41, scope: !244)
!902 = !DILocation(line: 1361, column: 11, scope: !894, inlinedAt: !901)
!903 = !DILocation(line: 1361, column: 10, scope: !894, inlinedAt: !901)
!904 = !DILocation(line: 586, column: 19, scope: !244)
!905 = !DILocation(line: 587, column: 5, scope: !244)
!906 = !DILocation(line: 588, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !70, file: !71, line: 588, column: 7)
!908 = !DILocation(line: 588, column: 7, scope: !70)
!909 = !DILocation(line: 590, column: 7, scope: !910)
!910 = distinct !DILexicalBlock(scope: !907, file: !71, line: 589, column: 5)
!911 = !DILocation(line: 591, column: 7, scope: !910)
!912 = !DILocation(line: 595, column: 37, scope: !70)
!913 = !DILocation(line: 595, column: 35, scope: !70)
!914 = !DILocation(line: 596, column: 29, scope: !70)
!915 = !DILocation(line: 597, column: 8, scope: !253)
!916 = !DILocation(line: 597, column: 7, scope: !70)
!917 = !DILocation(line: 604, column: 24, scope: !252)
!918 = !DILocation(line: 604, column: 12, scope: !253)
!919 = !DILocation(line: 0, scope: !251)
!920 = !DILocation(line: 610, column: 16, scope: !251)
!921 = !DILocation(line: 610, column: 7, scope: !251)
!922 = !DILocation(line: 611, column: 21, scope: !251)
!923 = !{!924, !924, i64 0}
!924 = !{!"short", !827, i64 0}
!925 = !DILocation(line: 611, column: 19, scope: !251)
!926 = !DILocation(line: 611, column: 16, scope: !251)
!927 = !DILocation(line: 610, column: 30, scope: !251)
!928 = distinct !{!928, !921, !922, !929}
!929 = !{!"llvm.loop.mustprogress"}
!930 = !DILocation(line: 612, column: 18, scope: !931)
!931 = distinct !DILexicalBlock(scope: !251, file: !71, line: 612, column: 11)
!932 = !DILocation(line: 612, column: 11, scope: !251)
!933 = !DILocation(line: 618, column: 5, scope: !251)
!934 = !DILocation(line: 620, column: 23, scope: !70)
!935 = !DILocation(line: 625, column: 39, scope: !70)
!936 = !DILocation(line: 626, column: 3, scope: !70)
!937 = !DILocation(line: 626, column: 10, scope: !70)
!938 = !DILocation(line: 626, column: 21, scope: !70)
!939 = !DILocation(line: 628, column: 44, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !71, line: 628, column: 11)
!941 = distinct !DILexicalBlock(scope: !70, file: !71, line: 627, column: 5)
!942 = !DILocation(line: 628, column: 32, scope: !940)
!943 = !DILocation(line: 628, column: 49, scope: !940)
!944 = !DILocation(line: 628, column: 11, scope: !941)
!945 = !DILocation(line: 630, column: 11, scope: !946)
!946 = distinct !DILexicalBlock(scope: !941, file: !71, line: 630, column: 11)
!947 = !DILocation(line: 630, column: 11, scope: !941)
!948 = !DILocation(line: 632, column: 26, scope: !949)
!949 = distinct !DILexicalBlock(scope: !950, file: !71, line: 632, column: 15)
!950 = distinct !DILexicalBlock(scope: !946, file: !71, line: 631, column: 9)
!951 = !DILocation(line: 632, column: 34, scope: !949)
!952 = !DILocation(line: 632, column: 37, scope: !949)
!953 = !DILocation(line: 632, column: 15, scope: !950)
!954 = !DILocation(line: 636, column: 16, scope: !955)
!955 = distinct !DILexicalBlock(scope: !950, file: !71, line: 636, column: 15)
!956 = !DILocation(line: 636, column: 29, scope: !955)
!957 = !DILocation(line: 640, column: 16, scope: !941)
!958 = distinct !{!958, !936, !959, !929}
!959 = !DILocation(line: 641, column: 5, scope: !70)
!960 = !DILocation(line: 644, column: 3, scope: !70)
!961 = !DILocation(line: 0, scope: !894, inlinedAt: !962)
!962 = distinct !DILocation(line: 648, column: 31, scope: !70)
!963 = !DILocation(line: 0, scope: !894, inlinedAt: !964)
!964 = distinct !DILocation(line: 649, column: 31, scope: !70)
!965 = !DILocation(line: 0, scope: !894, inlinedAt: !966)
!966 = distinct !DILocation(line: 650, column: 31, scope: !70)
!967 = !DILocation(line: 0, scope: !894, inlinedAt: !968)
!968 = distinct !DILocation(line: 651, column: 31, scope: !70)
!969 = !DILocation(line: 0, scope: !894, inlinedAt: !970)
!970 = distinct !DILocation(line: 652, column: 31, scope: !70)
!971 = !DILocation(line: 0, scope: !894, inlinedAt: !972)
!972 = distinct !DILocation(line: 653, column: 31, scope: !70)
!973 = !DILocation(line: 0, scope: !894, inlinedAt: !974)
!974 = distinct !DILocation(line: 654, column: 31, scope: !70)
!975 = !DILocation(line: 0, scope: !894, inlinedAt: !976)
!976 = distinct !DILocation(line: 655, column: 31, scope: !70)
!977 = !DILocation(line: 0, scope: !894, inlinedAt: !978)
!978 = distinct !DILocation(line: 656, column: 31, scope: !70)
!979 = !DILocation(line: 0, scope: !894, inlinedAt: !980)
!980 = distinct !DILocation(line: 657, column: 31, scope: !70)
!981 = !DILocation(line: 663, column: 7, scope: !982)
!982 = distinct !DILexicalBlock(scope: !70, file: !71, line: 663, column: 7)
!983 = !DILocation(line: 664, column: 7, scope: !982)
!984 = !DILocation(line: 664, column: 10, scope: !982)
!985 = !DILocation(line: 663, column: 7, scope: !70)
!986 = !DILocation(line: 669, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !982, file: !71, line: 665, column: 5)
!988 = !DILocation(line: 671, column: 5, scope: !987)
!989 = !DILocation(line: 676, column: 7, scope: !990)
!990 = distinct !DILexicalBlock(scope: !982, file: !71, line: 673, column: 5)
!991 = !DILocation(line: 679, column: 3, scope: !70)
!992 = !DILocation(line: 683, column: 3, scope: !70)
!993 = !DILocation(line: 686, column: 3, scope: !70)
!994 = !DILocation(line: 688, column: 3, scope: !70)
!995 = !DILocation(line: 691, column: 3, scope: !70)
!996 = !DILocation(line: 695, column: 3, scope: !70)
!997 = !DILocation(line: 696, column: 1, scope: !70)
!998 = !DISubprogram(name: "setlocale", scope: !999, file: !999, line: 122, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!999 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!124, !117, !74}
!1002 = !DISubprogram(name: "strncmp", scope: !1003, file: !1003, line: 159, type: !1004, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1003 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!117, !74, !74, !119}
!1006 = !DISubprogram(name: "fputs_unlocked", scope: !1007, file: !1007, line: 691, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1007 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!117, !876, !875}
!1010 = !DISubprogram(name: "exit", scope: !1011, file: !1011, line: 624, type: !815, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1011 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1012 = !DISubprogram(name: "getenv", scope: !1011, file: !1011, line: 641, type: !1013, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!124, !74}
!1015 = !DISubprogram(name: "strcmp", scope: !1003, file: !1003, line: 156, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!117, !74, !74}
!1018 = !DISubprogram(name: "strspn", scope: !1003, file: !1003, line: 297, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!121, !74, !74}
!1021 = !DISubprogram(name: "strchr", scope: !1003, file: !1003, line: 246, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!124, !74, !117}
!1024 = !DISubprogram(name: "__ctype_b_loc", scope: !87, file: !87, line: 79, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!1030 = !DISubprogram(name: "strcspn", scope: !1003, file: !1003, line: 293, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1031 = !DISubprogram(name: "fwrite_unlocked", scope: !1007, file: !1007, line: 704, type: !1032, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!119, !1034, !119, !119, !875}
!1034 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1037 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 117, type: !1038, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1040)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!117, !117, !123}
!1040 = !{!1041, !1042}
!1041 = !DILocalVariable(name: "argc", arg: 1, scope: !1037, file: !2, line: 117, type: !117)
!1042 = !DILocalVariable(name: "argv", arg: 2, scope: !1037, file: !2, line: 117, type: !123)
!1043 = !DILocation(line: 0, scope: !1037)
!1044 = !DILocation(line: 120, column: 21, scope: !1037)
!1045 = !DILocation(line: 120, column: 3, scope: !1037)
!1046 = !DILocation(line: 121, column: 3, scope: !1037)
!1047 = !DILocation(line: 122, column: 3, scope: !1037)
!1048 = !DILocation(line: 123, column: 3, scope: !1037)
!1049 = !DILocation(line: 125, column: 3, scope: !1037)
!1050 = !DILocation(line: 128, column: 36, scope: !1037)
!1051 = !DILocation(line: 128, column: 58, scope: !1037)
!1052 = !DILocation(line: 127, column: 3, scope: !1037)
!1053 = !DILocation(line: 131, column: 18, scope: !1037)
!1054 = !DILocation(line: 131, column: 16, scope: !1037)
!1055 = !DILocation(line: 131, column: 3, scope: !1037)
!1056 = !DILocation(line: 134, column: 7, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 132, column: 5)
!1058 = !DILocation(line: 135, column: 7, scope: !1057)
!1059 = !DILocation(line: 138, column: 14, scope: !1057)
!1060 = !DILocation(line: 138, column: 7, scope: !1057)
!1061 = !DILocation(line: 139, column: 7, scope: !1057)
!1062 = !DILocation(line: 142, column: 7, scope: !1057)
!1063 = !DILocation(line: 143, column: 7, scope: !1057)
!1064 = !DILocation(line: 146, column: 3, scope: !1037)
!1065 = !DISubprogram(name: "bindtextdomain", scope: !867, file: !867, line: 86, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!124, !74, !74}
!1068 = !DISubprogram(name: "textdomain", scope: !867, file: !867, line: 82, type: !1013, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1069 = !DISubprogram(name: "atexit", scope: !1011, file: !1011, line: 602, type: !1070, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!117, !389}
!1072 = distinct !DISubprogram(name: "users", scope: !2, file: !2, line: 82, type: !1073, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1075)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !74, !117}
!1075 = !{!1076, !1077, !1078, !1079}
!1076 = !DILocalVariable(name: "filename", arg: 1, scope: !1072, file: !2, line: 82, type: !74)
!1077 = !DILocalVariable(name: "options", arg: 2, scope: !1072, file: !2, line: 82, type: !117)
!1078 = !DILocalVariable(name: "n_users", scope: !1072, file: !2, line: 84, type: !770)
!1079 = !DILocalVariable(name: "utmp_buf", scope: !1072, file: !2, line: 85, type: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !79, line: 92, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !79, line: 65, size: 576, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1088, !1096, !1099, !1100, !1101}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1082, file: !79, line: 69, baseType: !124, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1082, file: !79, line: 70, baseType: !124, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1082, file: !79, line: 71, baseType: !124, size: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1082, file: !79, line: 72, baseType: !124, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !1082, file: !79, line: 74, baseType: !1089, size: 128, offset: 256)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1090, line: 11, size: 128, elements: !1091)
!1090 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1091 = !{!1092, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1089, file: !1090, line: 16, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !287, line: 160, baseType: !288)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1089, file: !1090, line: 21, baseType: !1095, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !287, line: 197, baseType: !288)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1082, file: !79, line: 75, baseType: !1097, size: 32, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1098, line: 97, baseType: !720)
!1098 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1082, file: !79, line: 76, baseType: !1097, size: 32, offset: 416)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1082, file: !79, line: 77, baseType: !718, size: 16, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1082, file: !79, line: 79, baseType: !1102, size: 64, offset: 480)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1082, file: !79, line: 79, size: 64, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1102, file: !79, line: 79, baseType: !117, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1102, file: !79, line: 79, baseType: !117, size: 32, offset: 32)
!1106 = !DILocation(line: 0, scope: !1072)
!1107 = !DILocation(line: 84, column: 3, scope: !1072)
!1108 = !DILocation(line: 85, column: 3, scope: !1072)
!1109 = !DILocation(line: 86, column: 11, scope: !1072)
!1110 = !DILocation(line: 87, column: 7, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 87, column: 7)
!1112 = !DILocation(line: 87, column: 58, scope: !1111)
!1113 = !DILocation(line: 87, column: 7, scope: !1072)
!1114 = !DILocation(line: 88, column: 5, scope: !1111)
!1115 = !DILocation(line: 90, column: 23, scope: !1072)
!1116 = !{!1117, !1117, i64 0}
!1117 = !{!"long", !827, i64 0}
!1118 = !DILocation(line: 90, column: 32, scope: !1072)
!1119 = !DILocalVariable(name: "n", arg: 1, scope: !1120, file: !2, line: 45, type: !770)
!1120 = distinct !DISubprogram(name: "list_entries_users", scope: !2, file: !2, line: 45, type: !1121, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1125)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !770, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1125 = !{!1119, !1126, !1127, !1128, !1129, !1133, !1135, !1138}
!1126 = !DILocalVariable(name: "this", arg: 2, scope: !1120, file: !2, line: 45, type: !1123)
!1127 = !DILocalVariable(name: "u", scope: !1120, file: !2, line: 47, type: !123)
!1128 = !DILocalVariable(name: "n_entries", scope: !1120, file: !2, line: 48, type: !770)
!1129 = !DILocalVariable(name: "trimmed_name", scope: !1130, file: !2, line: 54, type: !124)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !2, line: 53, column: 9)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 52, column: 11)
!1132 = distinct !DILexicalBlock(scope: !1120, file: !2, line: 51, column: 5)
!1133 = !DILocalVariable(name: "i", scope: !1134, file: !2, line: 66, type: !770)
!1134 = distinct !DILexicalBlock(scope: !1120, file: !2, line: 66, column: 3)
!1135 = !DILocalVariable(name: "c", scope: !1136, file: !2, line: 68, type: !4)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !2, line: 67, column: 5)
!1137 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 66, column: 3)
!1138 = !DILocalVariable(name: "i", scope: !1139, file: !2, line: 73, type: !770)
!1139 = distinct !DILexicalBlock(scope: !1120, file: !2, line: 73, column: 3)
!1140 = !DILocation(line: 0, scope: !1120, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 90, column: 3, scope: !1072)
!1142 = !DILocation(line: 47, column: 14, scope: !1120, inlinedAt: !1141)
!1143 = !DILocation(line: 50, column: 3, scope: !1120, inlinedAt: !1141)
!1144 = !DILocation(line: 64, column: 3, scope: !1120, inlinedAt: !1141)
!1145 = !DILocation(line: 0, scope: !1134, inlinedAt: !1141)
!1146 = !DILocation(line: 66, column: 3, scope: !1134, inlinedAt: !1141)
!1147 = !DILocation(line: 50, column: 11, scope: !1120, inlinedAt: !1141)
!1148 = !DILocation(line: 52, column: 11, scope: !1131, inlinedAt: !1141)
!1149 = !{!1150, !826, i64 0}
!1150 = !{!"gl_utmp", !826, i64 0, !826, i64 8, !826, i64 16, !826, i64 24, !1151, i64 32, !883, i64 48, !883, i64 52, !924, i64 56, !1152, i64 60}
!1151 = !{!"timespec", !1117, i64 0, !1117, i64 8}
!1152 = !{!"", !883, i64 0, !883, i64 4}
!1153 = !{!1150, !924, i64 56}
!1154 = !DILocation(line: 52, column: 11, scope: !1132, inlinedAt: !1141)
!1155 = !DILocation(line: 56, column: 26, scope: !1130, inlinedAt: !1141)
!1156 = !DILocation(line: 0, scope: !1130, inlinedAt: !1141)
!1157 = !DILocation(line: 58, column: 11, scope: !1130, inlinedAt: !1141)
!1158 = !DILocation(line: 58, column: 24, scope: !1130, inlinedAt: !1141)
!1159 = !DILocation(line: 59, column: 11, scope: !1130, inlinedAt: !1141)
!1160 = !DILocation(line: 60, column: 9, scope: !1130, inlinedAt: !1141)
!1161 = !DILocation(line: 61, column: 11, scope: !1132, inlinedAt: !1141)
!1162 = distinct !{!1162, !1143, !1163, !929}
!1163 = !DILocation(line: 62, column: 5, scope: !1120, inlinedAt: !1141)
!1164 = !DILocation(line: 66, column: 23, scope: !1137, inlinedAt: !1141)
!1165 = !DILocation(line: 68, column: 19, scope: !1136, inlinedAt: !1141)
!1166 = !DILocation(line: 0, scope: !1136, inlinedAt: !1141)
!1167 = !DILocation(line: 69, column: 7, scope: !1136, inlinedAt: !1141)
!1168 = !DILocation(line: 68, column: 16, scope: !1136, inlinedAt: !1141)
!1169 = !DILocalVariable(name: "__c", arg: 1, scope: !1170, file: !1171, line: 108, type: !117)
!1170 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1171, file: !1171, line: 108, type: !1172, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1174)
!1171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!117, !117}
!1174 = !{!1169}
!1175 = !DILocation(line: 0, scope: !1170, inlinedAt: !1176)
!1176 = distinct !DILocation(line: 70, column: 7, scope: !1136, inlinedAt: !1141)
!1177 = !DILocation(line: 110, column: 10, scope: !1170, inlinedAt: !1176)
!1178 = !{!1179, !826, i64 40}
!1179 = !{!"_IO_FILE", !883, i64 0, !826, i64 8, !826, i64 16, !826, i64 24, !826, i64 32, !826, i64 40, !826, i64 48, !826, i64 56, !826, i64 64, !826, i64 72, !826, i64 80, !826, i64 88, !826, i64 96, !826, i64 104, !883, i64 112, !883, i64 116, !1117, i64 120, !924, i64 128, !827, i64 130, !827, i64 131, !826, i64 136, !1117, i64 144, !826, i64 152, !826, i64 160, !826, i64 168, !826, i64 176, !1117, i64 184, !883, i64 192, !827, i64 196}
!1180 = !{!1179, !826, i64 48}
!1181 = !{!"branch_weights", i32 2000, i32 1}
!1182 = !DILocation(line: 66, column: 37, scope: !1137, inlinedAt: !1141)
!1183 = distinct !{!1183, !1146, !1184, !929}
!1184 = !DILocation(line: 71, column: 5, scope: !1134, inlinedAt: !1141)
!1185 = !DILocation(line: 0, scope: !1139, inlinedAt: !1141)
!1186 = !DILocation(line: 74, column: 11, scope: !1187, inlinedAt: !1141)
!1187 = distinct !DILexicalBlock(scope: !1139, file: !2, line: 73, column: 3)
!1188 = !DILocation(line: 74, column: 5, scope: !1187, inlinedAt: !1141)
!1189 = !DILocation(line: 73, column: 37, scope: !1187, inlinedAt: !1141)
!1190 = !DILocation(line: 73, column: 23, scope: !1187, inlinedAt: !1141)
!1191 = !DILocation(line: 73, column: 3, scope: !1139, inlinedAt: !1141)
!1192 = distinct !{!1192, !1191, !1193, !929}
!1193 = !DILocation(line: 74, column: 15, scope: !1139, inlinedAt: !1141)
!1194 = !DILocation(line: 75, column: 3, scope: !1120, inlinedAt: !1141)
!1195 = !DILocation(line: 92, column: 9, scope: !1072)
!1196 = !DILocation(line: 92, column: 3, scope: !1072)
!1197 = !DILocation(line: 93, column: 1, scope: !1072)
!1198 = !DISubprogram(name: "__errno_location", scope: !1199, file: !1199, line: 37, type: !1200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1199 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!413}
!1202 = distinct !DISubprogram(name: "userid_compare", scope: !2, file: !2, line: 37, type: !1203, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1205)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!117, !1035, !1035}
!1205 = !{!1206, !1207, !1208, !1209}
!1206 = !DILocalVariable(name: "v_a", arg: 1, scope: !1202, file: !2, line: 37, type: !1035)
!1207 = !DILocalVariable(name: "v_b", arg: 2, scope: !1202, file: !2, line: 37, type: !1035)
!1208 = !DILocalVariable(name: "a", scope: !1202, file: !2, line: 39, type: !123)
!1209 = !DILocalVariable(name: "b", scope: !1202, file: !2, line: 40, type: !123)
!1210 = !DILocation(line: 0, scope: !1202)
!1211 = !DILocation(line: 41, column: 18, scope: !1202)
!1212 = !DILocation(line: 41, column: 22, scope: !1202)
!1213 = !DILocation(line: 41, column: 10, scope: !1202)
!1214 = !DILocation(line: 41, column: 3, scope: !1202)
!1215 = !DISubprogram(name: "qsort", scope: !1011, file: !1011, line: 838, type: !1216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !116, !119, !119, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !1011, line: 816, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1220 = !DISubprogram(name: "__overflow", scope: !1007, file: !1007, line: 886, type: !1221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!117, !260, !117}
!1223 = !DISubprogram(name: "free", scope: !1011, file: !1011, line: 555, type: !1224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{null, !116}
!1226 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !328, file: !328, line: 50, type: !836, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !327, retainedNodes: !1227)
!1227 = !{!1228}
!1228 = !DILocalVariable(name: "file", arg: 1, scope: !1226, file: !328, line: 50, type: !74)
!1229 = !DILocation(line: 0, scope: !1226)
!1230 = !DILocation(line: 52, column: 13, scope: !1226)
!1231 = !DILocation(line: 53, column: 1, scope: !1226)
!1232 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !328, file: !328, line: 87, type: !1233, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !327, retainedNodes: !1235)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !247}
!1235 = !{!1236}
!1236 = !DILocalVariable(name: "ignore", arg: 1, scope: !1232, file: !328, line: 87, type: !247)
!1237 = !DILocation(line: 0, scope: !1232)
!1238 = !DILocation(line: 89, column: 16, scope: !1232)
!1239 = !{!1240, !1240, i64 0}
!1240 = !{!"_Bool", !827, i64 0}
!1241 = !DILocation(line: 90, column: 1, scope: !1232)
!1242 = distinct !DISubprogram(name: "close_stdout", scope: !328, file: !328, line: 116, type: !390, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !327, retainedNodes: !1243)
!1243 = !{!1244}
!1244 = !DILocalVariable(name: "write_error", scope: !1245, file: !328, line: 121, type: !74)
!1245 = distinct !DILexicalBlock(scope: !1246, file: !328, line: 120, column: 5)
!1246 = distinct !DILexicalBlock(scope: !1242, file: !328, line: 118, column: 7)
!1247 = !DILocation(line: 118, column: 21, scope: !1246)
!1248 = !DILocation(line: 118, column: 7, scope: !1246)
!1249 = !DILocation(line: 118, column: 29, scope: !1246)
!1250 = !DILocation(line: 119, column: 7, scope: !1246)
!1251 = !DILocation(line: 119, column: 12, scope: !1246)
!1252 = !{i8 0, i8 2}
!1253 = !DILocation(line: 119, column: 25, scope: !1246)
!1254 = !DILocation(line: 119, column: 28, scope: !1246)
!1255 = !DILocation(line: 119, column: 34, scope: !1246)
!1256 = !DILocation(line: 118, column: 7, scope: !1242)
!1257 = !DILocation(line: 121, column: 33, scope: !1245)
!1258 = !DILocation(line: 0, scope: !1245)
!1259 = !DILocation(line: 122, column: 11, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1245, file: !328, line: 122, column: 11)
!1261 = !DILocation(line: 0, scope: !1260)
!1262 = !DILocation(line: 122, column: 11, scope: !1245)
!1263 = !DILocation(line: 123, column: 9, scope: !1260)
!1264 = !DILocation(line: 126, column: 9, scope: !1260)
!1265 = !DILocation(line: 128, column: 14, scope: !1245)
!1266 = !DILocation(line: 128, column: 7, scope: !1245)
!1267 = !DILocation(line: 133, column: 42, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1242, file: !328, line: 133, column: 7)
!1269 = !DILocation(line: 133, column: 28, scope: !1268)
!1270 = !DILocation(line: 133, column: 50, scope: !1268)
!1271 = !DILocation(line: 133, column: 7, scope: !1242)
!1272 = !DILocation(line: 134, column: 12, scope: !1268)
!1273 = !DILocation(line: 134, column: 5, scope: !1268)
!1274 = !DILocation(line: 135, column: 1, scope: !1242)
!1275 = !DISubprogram(name: "_exit", scope: !1276, file: !1276, line: 624, type: !815, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !870)
!1276 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1277 = distinct !DISubprogram(name: "verror", scope: !343, file: !343, line: 251, type: !1278, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1280)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{null, !117, !117, !74, !353}
!1280 = !{!1281, !1282, !1283, !1284}
!1281 = !DILocalVariable(name: "status", arg: 1, scope: !1277, file: !343, line: 251, type: !117)
!1282 = !DILocalVariable(name: "errnum", arg: 2, scope: !1277, file: !343, line: 251, type: !117)
!1283 = !DILocalVariable(name: "message", arg: 3, scope: !1277, file: !343, line: 251, type: !74)
!1284 = !DILocalVariable(name: "args", arg: 4, scope: !1277, file: !343, line: 251, type: !353)
!1285 = !DILocation(line: 0, scope: !1277)
!1286 = !DILocation(line: 261, column: 3, scope: !1277)
!1287 = !DILocation(line: 265, column: 7, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1277, file: !343, line: 265, column: 7)
!1289 = !DILocation(line: 265, column: 7, scope: !1277)
!1290 = !DILocation(line: 266, column: 5, scope: !1288)
!1291 = !DILocation(line: 272, column: 7, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1288, file: !343, line: 268, column: 5)
!1293 = !DILocation(line: 276, column: 3, scope: !1277)
!1294 = !DILocation(line: 282, column: 1, scope: !1277)
!1295 = distinct !DISubprogram(name: "flush_stdout", scope: !343, file: !343, line: 163, type: !390, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1296)
!1296 = !{!1297}
!1297 = !DILocalVariable(name: "stdout_fd", scope: !1295, file: !343, line: 166, type: !117)
!1298 = !DILocation(line: 0, scope: !1295)
!1299 = !DILocalVariable(name: "fd", arg: 1, scope: !1300, file: !343, line: 145, type: !117)
!1300 = distinct !DISubprogram(name: "is_open", scope: !343, file: !343, line: 145, type: !1172, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1301)
!1301 = !{!1299}
!1302 = !DILocation(line: 0, scope: !1300, inlinedAt: !1303)
!1303 = distinct !DILocation(line: 182, column: 25, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1295, file: !343, line: 182, column: 7)
!1305 = !DILocation(line: 157, column: 15, scope: !1300, inlinedAt: !1303)
!1306 = !DILocation(line: 157, column: 12, scope: !1300, inlinedAt: !1303)
!1307 = !DILocation(line: 182, column: 7, scope: !1295)
!1308 = !DILocation(line: 184, column: 5, scope: !1304)
!1309 = !DILocation(line: 185, column: 1, scope: !1295)
!1310 = distinct !DISubprogram(name: "error_tail", scope: !343, file: !343, line: 219, type: !1278, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1311)
!1311 = !{!1312, !1313, !1314, !1315}
!1312 = !DILocalVariable(name: "status", arg: 1, scope: !1310, file: !343, line: 219, type: !117)
!1313 = !DILocalVariable(name: "errnum", arg: 2, scope: !1310, file: !343, line: 219, type: !117)
!1314 = !DILocalVariable(name: "message", arg: 3, scope: !1310, file: !343, line: 219, type: !74)
!1315 = !DILocalVariable(name: "args", arg: 4, scope: !1310, file: !343, line: 219, type: !353)
!1316 = !DILocation(line: 0, scope: !1310)
!1317 = !DILocation(line: 229, column: 13, scope: !1310)
!1318 = !DILocalVariable(name: "__stream", arg: 1, scope: !1319, file: !872, line: 132, type: !1322)
