; ModuleID = 'src/wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__mbstate_t = type { i32, %union.anon.2 }
%union.anon.2 = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.Tokens = type { i64, ptr, ptr, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, ptr, ptr, ptr, ptr, %union.anon, i64, %union.anon.0, %union.anon.0, ptr, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.fstatus = type { i32, %struct.stat }
%struct.wc_lines = type { i32, i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.argv_iterator = type { ptr, i64, ptr, i64, ptr, ptr }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct._obstack_chunk = type { ptr, ptr, [0 x i8] }


!173 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !59, !64, !69, !74, !79, !84, !174, !179, !184, !189, !194, !199, !201, !206, !211, !216, !221, !223, !228, !233, !424, !429, !431, !436, !438, !443, !448, !450, !452, !454, !456, !461, !463, !465, !470, !472, !474, !476, !478, !480, !482, !484, !488, !490, !492, !494, !496, !498, !500, !89, !502, !504, !509, !539, !544, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !569, !571, !573, !575, !577, !579, !581, !583, !585, !590, !592, !597, !599, !601, !603, !605, !607, !612, !614, !616, !618, !620, !622, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !654, !658, !660, !662, !664, !666, !670, !672, !674, !708, !710, !712, !717, !719, !724, !727, !729, !731, !733, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !760, !778, !780}
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !2, line: 814, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 6)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !2, line: 848, type: !186, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 14)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 11)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !176, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !2, line: 880, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 17)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 4)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 52)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 886, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 890, type: !218, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 27)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 906, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 31)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "stdin_only", scope: !235, file: !2, line: 921, type: !423, isLocal: true, isDefinition: true)
!235 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 792, type: !236, scopeLine: 793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !239)
!236 = !DISubroutineType(types: !237)
!237 = !{!101, !101, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!239 = !{!240, !241, !242, !243, !248, !249, !250, !292, !352, !355, !358, !359, !362, !414, !415, !416, !417, !418, !420}
!240 = !DILocalVariable(name: "argc", arg: 1, scope: !235, file: !2, line: 792, type: !101)
!241 = !DILocalVariable(name: "argv", arg: 2, scope: !235, file: !2, line: 792, type: !238)
!242 = !DILocalVariable(name: "optc", scope: !235, file: !2, line: 794, type: !101)
!243 = !DILocalVariable(name: "nfiles", scope: !235, file: !2, line: 795, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !245, line: 130, baseType: !246)
!245 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !167, line: 35, baseType: !247)
!247 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!248 = !DILocalVariable(name: "files", scope: !235, file: !2, line: 796, type: !238)
!249 = !DILocalVariable(name: "files_from", scope: !235, file: !2, line: 797, type: !164)
!250 = !DILocalVariable(name: "fstatus", scope: !235, file: !2, line: 798, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !2, line: 85, size: 1216, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !252, file: !2, line: 89, baseType: !101, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !252, file: !2, line: 92, baseType: !256, size: 1152, offset: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !257, line: 26, size: 1152, elements: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!258 = !{!259, !262, !264, !266, !268, !270, !272, !273, !274, !276, !278, !280, !288, !289, !290}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !256, file: !257, line: 31, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !261, line: 145, baseType: !168)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !256, file: !257, line: 36, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !261, line: 148, baseType: !168)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !256, file: !257, line: 44, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !261, line: 151, baseType: !168)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !256, file: !257, line: 45, baseType: !267, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !261, line: 150, baseType: !94)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !256, file: !257, line: 47, baseType: !269, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !261, line: 146, baseType: !94)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !256, file: !257, line: 48, baseType: !271, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !261, line: 147, baseType: !94)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !256, file: !257, line: 50, baseType: !101, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !256, file: !257, line: 52, baseType: !260, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !256, file: !257, line: 57, baseType: !275, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !261, line: 152, baseType: !247)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !256, file: !257, line: 61, baseType: !277, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !261, line: 175, baseType: !247)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !256, file: !257, line: 63, baseType: !279, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !261, line: 180, baseType: !247)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !256, file: !257, line: 74, baseType: !281, size: 128, offset: 576)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !282, line: 11, size: 128, elements: !283)
!282 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!283 = !{!284, !286}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !281, file: !282, line: 16, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !261, line: 160, baseType: !247)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !281, file: !282, line: 21, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !261, line: 197, baseType: !247)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !256, file: !257, line: 75, baseType: !281, size: 128, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !256, file: !257, line: 76, baseType: !281, size: 128, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !256, file: !257, line: 89, baseType: !291, size: 192, offset: 960)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 192, elements: !25)
!292 = !DILocalVariable(name: "tok", scope: !235, file: !2, line: 799, type: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !294, line: 32, size: 2304, elements: !295)
!294 = !DIFile(filename: "./lib/readtokens0.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bcc2e7cb98b6844cbfd13d7bab31a60d")
!295 = !{!296, !297, !298, !300, !350, !351}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !293, file: !294, line: 34, baseType: !166, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !293, file: !294, line: 35, baseType: !238, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !293, file: !294, line: 36, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !293, file: !294, line: 37, baseType: !301, size: 704, offset: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !302, line: 210, size: 704, elements: !303)
!302 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!303 = !{!304, !305, !315, !316, !317, !318, !323, !324, !335, !346, !347, !348, !349}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !301, file: !302, line: 212, baseType: !166, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !301, file: !302, line: 213, baseType: !306, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !302, line: 203, size: 128, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !307, file: !302, line: 205, baseType: !164, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !302, line: 206, baseType: !306, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !307, file: !302, line: 207, baseType: !312, offset: 128)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: -1)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !301, file: !302, line: 214, baseType: !164, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !301, file: !302, line: 215, baseType: !164, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !301, file: !302, line: 216, baseType: !164, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !301, file: !302, line: 221, baseType: !319, size: 64, offset: 320)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !302, line: 217, size: 64, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !319, file: !302, line: 219, baseType: !166, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !319, file: !302, line: 220, baseType: !161, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !301, file: !302, line: 222, baseType: !166, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !301, file: !302, line: 229, baseType: !325, size: 64, offset: 448)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !302, line: 225, size: 64, elements: !326)
!326 = !{!327, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !325, file: !302, line: 227, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!161, !166}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !325, file: !302, line: 228, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!161, !161, !166}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !301, file: !302, line: 234, baseType: !336, size: 64, offset: 512)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !302, line: 230, size: 64, elements: !337)
!337 = !{!338, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !336, file: !302, line: 232, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !161}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !336, file: !302, line: 233, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !161, !161}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !301, file: !302, line: 236, baseType: !161, size: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !301, file: !302, line: 237, baseType: !94, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !301, file: !302, line: 238, baseType: !94, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !301, file: !302, line: 242, baseType: !94, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !293, file: !294, line: 38, baseType: !301, size: 704, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !293, file: !294, line: 39, baseType: !301, size: 704, offset: 1600)
!352 = !DILocalVariable(name: "i", scope: !353, file: !2, line: 864, type: !101)
!353 = distinct !DILexicalBlock(scope: !354, file: !2, line: 864, column: 5)
!354 = distinct !DILexicalBlock(scope: !235, file: !2, line: 863, column: 7)
!355 = !DILocalVariable(name: "i", scope: !356, file: !2, line: 867, type: !101)
!356 = distinct !DILexicalBlock(scope: !357, file: !2, line: 867, column: 5)
!357 = distinct !DILexicalBlock(scope: !235, file: !2, line: 866, column: 7)
!358 = !DILocalVariable(name: "read_tokens", scope: !235, file: !2, line: 870, type: !172)
!359 = !DILocalVariable(name: "ai", scope: !235, file: !2, line: 871, type: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !141, line: 32, flags: DIFlagFwdDecl)
!362 = !DILocalVariable(name: "stream", scope: !363, file: !2, line: 874, type: !365)
!363 = distinct !DILexicalBlock(scope: !364, file: !2, line: 873, column: 5)
!364 = distinct !DILexicalBlock(scope: !235, file: !2, line: 872, column: 7)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !367, line: 7, baseType: !368)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !369, line: 49, size: 1728, elements: !370)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !386, !388, !389, !390, !391, !392, !394, !395, !398, !400, !403, !406, !407, !408, !409, !410}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !368, file: !369, line: 51, baseType: !101, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !368, file: !369, line: 54, baseType: !164, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !368, file: !369, line: 55, baseType: !164, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !368, file: !369, line: 56, baseType: !164, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !368, file: !369, line: 57, baseType: !164, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !368, file: !369, line: 58, baseType: !164, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !368, file: !369, line: 59, baseType: !164, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !368, file: !369, line: 60, baseType: !164, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !368, file: !369, line: 61, baseType: !164, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !368, file: !369, line: 64, baseType: !164, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !368, file: !369, line: 65, baseType: !164, size: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !368, file: !369, line: 66, baseType: !164, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !368, file: !369, line: 68, baseType: !384, size: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !369, line: 36, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !368, file: !369, line: 70, baseType: !387, size: 64, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !368, file: !369, line: 72, baseType: !101, size: 32, offset: 896)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !368, file: !369, line: 73, baseType: !101, size: 32, offset: 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !368, file: !369, line: 74, baseType: !275, size: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !368, file: !369, line: 77, baseType: !165, size: 16, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !368, file: !369, line: 78, baseType: !393, size: 8, offset: 1040)
!393 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !368, file: !369, line: 79, baseType: !76, size: 8, offset: 1048)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !368, file: !369, line: 81, baseType: !396, size: 64, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !369, line: 43, baseType: null)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !368, file: !369, line: 89, baseType: !399, size: 64, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !261, line: 153, baseType: !247)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !368, file: !369, line: 91, baseType: !401, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !369, line: 37, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !368, file: !369, line: 92, baseType: !404, size: 64, offset: 1280)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !369, line: 38, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !368, file: !369, line: 93, baseType: !387, size: 64, offset: 1344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !368, file: !369, line: 94, baseType: !161, size: 64, offset: 1408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !368, file: !369, line: 95, baseType: !166, size: 64, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !368, file: !369, line: 96, baseType: !101, size: 32, offset: 1536)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !368, file: !369, line: 98, baseType: !411, size: 160, offset: 1568)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 20)
!414 = !DILocalVariable(name: "st", scope: !363, file: !2, line: 898, type: !256)
!415 = !DILocalVariable(name: "ok", scope: !235, file: !2, line: 936, type: !172)
!416 = !DILocalVariable(name: "ai_err", scope: !235, file: !2, line: 937, type: !140)
!417 = !DILocalVariable(name: "file_name", scope: !235, file: !2, line: 938, type: !164)
!418 = !DILocalVariable(name: "i", scope: !419, file: !2, line: 939, type: !101)
!419 = distinct !DILexicalBlock(scope: !235, file: !2, line: 939, column: 3)
!420 = !DILocalVariable(name: "skip_file", scope: !421, file: !2, line: 941, type: !172)
!421 = distinct !DILexicalBlock(scope: !422, file: !2, line: 940, column: 5)
!422 = distinct !DILexicalBlock(scope: !419, file: !2, line: 939, column: 3)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !77)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 946, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 72)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !24, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 30)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !196, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 985, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 15)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 12)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1017, type: !445, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1023, type: !203, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1029, type: !445, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !181, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "wc_isprint", scope: !91, file: !2, line: 51, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 2048, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 256)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "wc_isspace", scope: !91, file: !2, line: 52, type: !458, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "debug", scope: !91, file: !2, line: 54, type: !172, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "total_lines", scope: !91, file: !2, line: 58, type: !467, isLocal: true, isDefinition: true)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !468, line: 102, baseType: !469)
!468 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !261, line: 73, baseType: !168)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "total_words", scope: !91, file: !2, line: 59, type: !467, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "total_chars", scope: !91, file: !2, line: 60, type: !467, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "total_bytes", scope: !91, file: !2, line: 61, type: !467, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "total_lines_overflow", scope: !91, file: !2, line: 62, type: !172, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "total_words_overflow", scope: !91, file: !2, line: 63, type: !172, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "total_chars_overflow", scope: !91, file: !2, line: 64, type: !172, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "total_bytes_overflow", scope: !91, file: !2, line: 65, type: !172, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "max_line_length", scope: !91, file: !2, line: 66, type: !486, isLocal: true, isDefinition: true)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !468, line: 101, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !261, line: 72, baseType: !247)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "print_lines", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "print_words", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "print_chars", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "print_bytes", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "print_linelength", scope: !91, file: !2, line: 70, type: !172, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "number_width", scope: !91, file: !2, line: 73, type: !101, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !91, file: !2, line: 76, type: !172, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !91, file: !2, line: 82, type: !172, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !100, line: 729, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 56)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !511, file: !100, line: 575, type: !101, isLocal: true, isDefinition: true)
!511 = distinct !DISubprogram(name: "oputs_", scope: !100, file: !100, line: 573, type: !512, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !514)
!512 = !DISubroutineType(cc: DW_CC_nocall, types: !513)
!513 = !{null, !169, !169}
!514 = !{!515, !516, !517, !520, !521, !522, !523, !527, !528, !529, !530, !532, !533, !534, !535, !537, !538}
!515 = !DILocalVariable(name: "program", arg: 1, scope: !511, file: !100, line: 573, type: !169)
!516 = !DILocalVariable(name: "option", arg: 2, scope: !511, file: !100, line: 573, type: !169)
!517 = !DILocalVariable(name: "term", scope: !518, file: !100, line: 585, type: !169)
!518 = distinct !DILexicalBlock(scope: !519, file: !100, line: 582, column: 5)
!519 = distinct !DILexicalBlock(scope: !511, file: !100, line: 581, column: 7)
!520 = !DILocalVariable(name: "double_space", scope: !511, file: !100, line: 594, type: !172)
!521 = !DILocalVariable(name: "first_word", scope: !511, file: !100, line: 595, type: !169)
!522 = !DILocalVariable(name: "option_text", scope: !511, file: !100, line: 596, type: !169)
!523 = !DILocalVariable(name: "s", scope: !524, file: !100, line: 608, type: !169)
!524 = distinct !DILexicalBlock(scope: !525, file: !100, line: 605, column: 5)
!525 = distinct !DILexicalBlock(scope: !526, file: !100, line: 604, column: 12)
!526 = distinct !DILexicalBlock(scope: !511, file: !100, line: 597, column: 7)
!527 = !DILocalVariable(name: "spaces", scope: !524, file: !100, line: 609, type: !166)
!528 = !DILocalVariable(name: "anchor_len", scope: !511, file: !100, line: 620, type: !166)
!529 = !DILocalVariable(name: "desc_text", scope: !511, file: !100, line: 625, type: !169)
!530 = !DILocalVariable(name: "__ptr", scope: !531, file: !100, line: 644, type: !169)
!531 = distinct !DILexicalBlock(scope: !511, file: !100, line: 644, column: 3)
!532 = !DILocalVariable(name: "__stream", scope: !531, file: !100, line: 644, type: !365)
!533 = !DILocalVariable(name: "__cnt", scope: !531, file: !100, line: 644, type: !166)
!534 = !DILocalVariable(name: "url_program", scope: !511, file: !100, line: 648, type: !169)
!535 = !DILocalVariable(name: "__ptr", scope: !536, file: !100, line: 686, type: !169)
!536 = distinct !DILexicalBlock(scope: !511, file: !100, line: 686, column: 3)
!537 = !DILocalVariable(name: "__stream", scope: !536, file: !100, line: 686, type: !365)
!538 = !DILocalVariable(name: "__cnt", scope: !536, file: !100, line: 686, type: !166)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !100, line: 585, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 5)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !100, line: 586, type: !541, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !100, line: 595, type: !208, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !100, line: 620, type: !181, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !218, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !541, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !208, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !24, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !100, line: 650, type: !541, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !181, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !181, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !100, line: 652, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 7)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !100, line: 653, type: !186, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !100, line: 654, type: !81, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !100, line: 655, type: !81, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !100, line: 656, type: !81, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !100, line: 657, type: !81, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !100, line: 663, type: !566, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !100, line: 664, type: !81, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !203, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 40)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !440, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 61)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !100, line: 679, type: !24, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !100, line: 683, type: !541, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !100, line: 688, type: !541, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !100, line: 691, type: !186, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !100, line: 839, type: !176, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !100, line: 840, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 22)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !100, line: 841, type: !440, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !100, line: 862, type: !208, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !100, line: 868, type: !9, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !100, line: 875, type: !225, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !34, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !445, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !181, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !181, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !181, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !181, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !181, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !445, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !176, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !541, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !186, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "longopts", scope: !91, file: !2, line: 104, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 2816, elements: !197)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !647, line: 50, size: 256, elements: !648)
!647 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!648 = !{!649, !650, !651, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !647, line: 52, baseType: !169, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !646, file: !647, line: 55, baseType: !101, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !646, file: !647, line: 56, baseType: !652, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !646, file: !647, line: 57, baseType: !101, size: 32, offset: 192)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "total_types", scope: !91, file: !2, line: 130, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 128, elements: !209)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !541, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !566, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !541, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !181, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "total_args", scope: !91, file: !2, line: 126, type: !668, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 320, elements: !542)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "total_mode", scope: !91, file: !2, line: 135, type: !134, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 378, type: !440, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "use_avx512", scope: !676, file: !2, line: 308, type: !393, isLocal: true, isDefinition: true)
!676 = distinct !DISubprogram(name: "wc_lines", scope: !2, file: !2, line: 305, type: !677, scopeLine: 306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !685)
!677 = !DISubroutineType(types: !678)
!678 = !{!679, !101}
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wc_lines", file: !680, line: 2, size: 192, elements: !681)
!680 = !DIFile(filename: "src/wc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f73f6c91eb8849cde32b7f2c7fc10330")
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !679, file: !680, line: 2, baseType: !101, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !679, file: !680, line: 2, baseType: !486, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !679, file: !680, line: 2, baseType: !486, size: 64, offset: 128)
!685 = !{!686, !687, !688, !689, !690, !695, !699, !700, !701, !705}
!686 = !DILocalVariable(name: "fd", arg: 1, scope: !676, file: !2, line: 305, type: !101)
!687 = !DILocalVariable(name: "lines", scope: !676, file: !2, line: 329, type: !486)
!688 = !DILocalVariable(name: "bytes", scope: !676, file: !2, line: 329, type: !486)
!689 = !DILocalVariable(name: "long_lines", scope: !676, file: !2, line: 330, type: !172)
!690 = !DILocalVariable(name: "buf", scope: !691, file: !2, line: 334, type: !692)
!691 = distinct !DILexicalBlock(scope: !676, file: !2, line: 333, column: 5)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097160, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 262145)
!695 = !DILocalVariable(name: "bytes_read", scope: !691, file: !2, line: 335, type: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !697, line: 77, baseType: !698)
!697 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !261, line: 194, baseType: !247)
!699 = !DILocalVariable(name: "end", scope: !691, file: !2, line: 340, type: !164)
!700 = !DILocalVariable(name: "buflines", scope: !691, file: !2, line: 341, type: !244)
!701 = !DILocalVariable(name: "p", scope: !702, file: !2, line: 346, type: !164)
!702 = distinct !DILexicalBlock(scope: !703, file: !2, line: 346, column: 11)
!703 = distinct !DILexicalBlock(scope: !704, file: !2, line: 344, column: 9)
!704 = distinct !DILexicalBlock(scope: !691, file: !2, line: 343, column: 11)
!705 = !DILocalVariable(name: "p", scope: !706, file: !2, line: 353, type: !164)
!706 = distinct !DILexicalBlock(scope: !707, file: !2, line: 353, column: 11)
!707 = distinct !DILexicalBlock(scope: !704, file: !2, line: 350, column: 9)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "use_avx2", scope: !676, file: !2, line: 315, type: !393, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 155, type: !186, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 9)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !433, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 28)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !726, line: 68, type: !208, isLocal: true, isDefinition: true)
!726 = !DIFile(filename: "./lib/cpu-supports.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9be339edc1bd703a3f96b2a763524c18")
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !726, line: 68, type: !541, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !726, line: 69, type: !541, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !726, line: 69, type: !181, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !726, line: 70, type: !81, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !726, line: 71, type: !714, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !726, line: 72, type: !566, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !726, line: 72, type: !196, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !726, line: 73, type: !196, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !726, line: 73, type: !445, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !726, line: 75, type: !181, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !726, line: 75, type: !566, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !726, line: 76, type: !181, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !726, line: 76, type: !566, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !721, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 26)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !762, file: !2, line: 268, type: !777, isLocal: true, isDefinition: true)
!762 = distinct !DISubprogram(name: "write_counts", scope: !2, file: !2, line: 261, type: !763, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !467, !467, !467, !467, !486, !169}
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773}
!766 = !DILocalVariable(name: "lines", arg: 1, scope: !762, file: !2, line: 261, type: !467)
!767 = !DILocalVariable(name: "words", arg: 2, scope: !762, file: !2, line: 262, type: !467)
!768 = !DILocalVariable(name: "chars", arg: 3, scope: !762, file: !2, line: 263, type: !467)
!769 = !DILocalVariable(name: "bytes", arg: 4, scope: !762, file: !2, line: 264, type: !467)
!770 = !DILocalVariable(name: "linelength", arg: 5, scope: !762, file: !2, line: 265, type: !486)
!771 = !DILocalVariable(name: "file", arg: 6, scope: !762, file: !2, line: 266, type: !169)
!772 = !DILocalVariable(name: "format_int", scope: !762, file: !2, line: 269, type: !169)
!773 = !DILocalVariable(name: "buf", scope: !762, file: !2, line: 270, type: !774)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 21)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 40, elements: !542)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !208, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !100, line: 952, type: !445, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!783 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!784 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!785 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!786 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!787 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !791, line: 3, type: !440, isLocal: true, isDefinition: true)
!791 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "Version", scope: !794, file: !791, line: 3, type: !169, isLocal: false, isDefinition: true)
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !795, splitDebugInlining: false, nameTableKind: None)
!795 = !{!789, !792}
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !798, file: !799, line: 65, type: !818, isLocal: false, isDefinition: true)
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !800, retainedTypes: !801, globals: !802, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!800 = !{!120}
!801 = !{!161, !169, !171}
!802 = !{!796, !803, !805, !807, !812, !814, !816}
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !799, line: 141, type: !566, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !799, line: 141, type: !225, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !799, line: 142, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 29)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !799, line: 160, type: !774, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !799, line: 165, type: !186, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !799, line: 170, type: !541, isLocal: true, isDefinition: true)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !819, line: 69, baseType: !820)
!819 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null}
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "file_name", scope: !825, file: !826, line: 45, type: !169, isLocal: true, isDefinition: true)
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !826, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !827, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!827 = !{!828, !830, !832, !834, !823, !836}
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !826, line: 121, type: !566, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !826, line: 121, type: !445, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !826, line: 123, type: !566, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !826, line: 126, type: !24, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !825, file: !826, line: 55, type: !172, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !840, file: !841, line: 25, type: !172, isLocal: false, isDefinition: true)
!840 = distinct !DICompileUnit(language: DW_LANG_C11, file: !841, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !842, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!842 = !{!838, !843, !858, !860, !865}
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "hwcaps", scope: !845, file: !841, line: 45, type: !169, isLocal: true, isDefinition: true)
!845 = distinct !DISubprogram(name: "hwcap_allowed", scope: !841, file: !841, line: 28, type: !846, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !840, retainedNodes: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{!172, !169}
!848 = !{!849, !850, !855, !856, !857}
!849 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !845, file: !841, line: 28, type: !169)
!850 = !DILocalVariable(name: "tunables_start", scope: !851, file: !841, line: 50, type: !169)
!851 = distinct !DILexicalBlock(scope: !852, file: !841, line: 49, column: 9)
!852 = distinct !DILexicalBlock(scope: !853, file: !841, line: 48, column: 11)
!853 = distinct !DILexicalBlock(scope: !854, file: !841, line: 47, column: 5)
!854 = distinct !DILexicalBlock(scope: !845, file: !841, line: 46, column: 7)
!855 = !DILocalVariable(name: "last_hwcaps", scope: !851, file: !841, line: 51, type: !169)
!856 = !DILocalVariable(name: "sentinel", scope: !845, file: !841, line: 67, type: !169)
!857 = !DILocalVariable(name: "cap", scope: !845, file: !841, line: 70, type: !169)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !841, line: 48, type: !440, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !841, line: 52, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 18)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !841, line: 55, type: !76, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !869, file: !870, line: 66, type: !820, isLocal: false, isDefinition: true)
!869 = distinct !DICompileUnit(language: DW_LANG_C11, file: !870, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !871, globals: !872, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!871 = !{!161, !171}
!872 = !{!873, !875, !895, !897, !899, !901, !867, !903, !905, !907, !909, !911}
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !870, line: 272, type: !541, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "old_file_name", scope: !877, file: !870, line: 304, type: !169, isLocal: true, isDefinition: true)
!877 = distinct !DISubprogram(name: "verror_at_line", scope: !870, file: !870, line: 298, type: !878, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !869, retainedNodes: !888)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !101, !101, !169, !94, !169, !880}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !882)
!882 = !{!883, !885, !886, !887}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !881, file: !884, baseType: !94, size: 32)
!884 = !DIFile(filename: "lib/error.c", directory: "/src")
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !881, file: !884, baseType: !94, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !881, file: !884, baseType: !161, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !881, file: !884, baseType: !161, size: 64, offset: 128)
!888 = !{!889, !890, !891, !892, !893, !894}
!889 = !DILocalVariable(name: "status", arg: 1, scope: !877, file: !870, line: 298, type: !101)
!890 = !DILocalVariable(name: "errnum", arg: 2, scope: !877, file: !870, line: 298, type: !101)
!891 = !DILocalVariable(name: "file_name", arg: 3, scope: !877, file: !870, line: 298, type: !169)
!892 = !DILocalVariable(name: "line_number", arg: 4, scope: !877, file: !870, line: 298, type: !94)
!893 = !DILocalVariable(name: "message", arg: 5, scope: !877, file: !870, line: 298, type: !169)
!894 = !DILocalVariable(name: "args", arg: 6, scope: !877, file: !870, line: 298, type: !880)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "old_line_number", scope: !877, file: !870, line: 305, type: !94, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !870, line: 338, type: !208, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !870, line: 346, type: !186, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !870, line: 346, type: !218, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "error_message_count", scope: !869, file: !870, line: 69, type: !94, isLocal: false, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !869, file: !870, line: 295, type: !101, isLocal: false, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !870, line: 208, type: !566, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !870, line: 208, type: !774, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !870, line: 214, type: !541, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !915, line: 108, type: !76, isLocal: true, isDefinition: true)
!915 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "internal_state", scope: !918, file: !915, line: 97, type: !921, isLocal: true, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C11, file: !915, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !919, globals: !920, splitDebugInlining: false, nameTableKind: None)
!919 = !{!161, !166, !171}
!920 = !{!913, !916}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !922, line: 6, baseType: !923)
!922 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !924, line: 21, baseType: !925)
!924 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !924, line: 13, size: 64, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !925, file: !924, line: 15, baseType: !101, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !925, file: !924, line: 20, baseType: !929, size: 32, offset: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !925, file: !924, line: 16, size: 32, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !929, file: !924, line: 18, baseType: !94, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !929, file: !924, line: 19, baseType: !208, size: 32)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !935, line: 182, type: !191, isLocal: true, isDefinition: true)
!935 = !DIFile(filename: "lib/physmem.c", directory: "/src", checksumkind: CSK_MD5, checksum: "df355a32f7975afeeeba505b6287e039")
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !935, line: 205, type: !203, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !935, line: 209, type: !86, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "program_name", scope: !942, file: !943, line: 31, type: !169, isLocal: false, isDefinition: true)
!942 = distinct !DICompileUnit(language: DW_LANG_C11, file: !943, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !944, globals: !945, splitDebugInlining: false, nameTableKind: None)
!943 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!944 = !{!164}
!945 = !{!940, !946, !948}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !943, line: 46, type: !186, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !943, line: 49, type: !208, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "utf07FF", scope: !952, file: !953, line: 46, type: !978, isLocal: true, isDefinition: true)
!952 = distinct !DISubprogram(name: "proper_name_lite", scope: !953, file: !953, line: 38, type: !954, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !956, retainedNodes: !958)
!953 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!954 = !DISubroutineType(types: !955)
!955 = !{!169, !169, !169}
!956 = distinct !DICompileUnit(language: DW_LANG_C11, file: !953, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !957, splitDebugInlining: false, nameTableKind: None)
!957 = !{!950}
!958 = !{!959, !960, !961, !962, !967}
!959 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !952, file: !953, line: 38, type: !169)
!960 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !952, file: !953, line: 38, type: !169)
!961 = !DILocalVariable(name: "translation", scope: !952, file: !953, line: 40, type: !169)
!962 = !DILocalVariable(name: "w", scope: !952, file: !953, line: 47, type: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !964, line: 37, baseType: !965)
!964 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !261, line: 57, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !261, line: 42, baseType: !94)
!967 = !DILocalVariable(name: "mbs", scope: !952, file: !953, line: 48, type: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !922, line: 6, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !924, line: 21, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !924, line: 13, size: 64, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !970, file: !924, line: 15, baseType: !101, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !970, file: !924, line: 20, baseType: !974, size: 32, offset: 32)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !924, line: 16, size: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !974, file: !924, line: 18, baseType: !94, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !974, file: !924, line: 19, baseType: !208, size: 32)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 16, elements: !219)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !981, line: 78, type: !186, isLocal: true, isDefinition: true)
!981 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !981, line: 79, type: !181, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !981, line: 80, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 13)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !981, line: 81, type: !986, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !981, line: 82, type: !411, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !981, line: 83, type: !218, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !981, line: 84, type: !186, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !981, line: 85, type: !566, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !981, line: 86, type: !566, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !981, line: 87, type: !186, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1005, file: !981, line: 76, type: !1075, isLocal: false, isDefinition: true)
!1005 = distinct !DICompileUnit(language: DW_LANG_C11, file: !981, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1006, retainedTypes: !1012, globals: !1013, splitDebugInlining: false, nameTableKind: None)
!1006 = !{!120, !1007, !105}
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !121, line: 254, baseType: !94, size: 32, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1010 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1011 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1012 = !{!101, !165, !166}
!1013 = !{!979, !982, !984, !989, !991, !993, !995, !997, !999, !1001, !1003, !1014, !1018, !1028, !1030, !1033, !1035, !1037, !1039, !1041, !1064, !1071, !1073}
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1005, file: !981, line: 92, type: !1016, isLocal: false, isDefinition: true)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 320, elements: !82)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1005, file: !981, line: 1040, type: !1020, isLocal: false, isDefinition: true)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !981, line: 56, size: 448, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1026, !1027}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1020, file: !981, line: 59, baseType: !120, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !981, line: 62, baseType: !101, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1020, file: !981, line: 66, baseType: !1025, size: 256, offset: 64)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !187)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1020, file: !981, line: 69, baseType: !169, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1020, file: !981, line: 72, baseType: !169, size: 64, offset: 384)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1005, file: !981, line: 107, type: !1020, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "slot0", scope: !1005, file: !981, line: 831, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !459)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !981, line: 321, type: !218, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !981, line: 357, type: !218, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !981, line: 358, type: !218, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !981, line: 199, type: !566, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "quote", scope: !1043, file: !981, line: 228, type: !1062, isLocal: true, isDefinition: true)
!1043 = distinct !DISubprogram(name: "gettext_quote", scope: !981, file: !981, line: 197, type: !1044, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1005, retainedNodes: !1046)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!169, !169, !120}
!1046 = !{!1047, !1048, !1049, !1050, !1051}
!1047 = !DILocalVariable(name: "msgid", arg: 1, scope: !1043, file: !981, line: 197, type: !169)
!1048 = !DILocalVariable(name: "s", arg: 2, scope: !1043, file: !981, line: 197, type: !120)
!1049 = !DILocalVariable(name: "translation", scope: !1043, file: !981, line: 199, type: !169)
!1050 = !DILocalVariable(name: "w", scope: !1043, file: !981, line: 229, type: !963)
!1051 = !DILocalVariable(name: "mbs", scope: !1043, file: !981, line: 230, type: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !922, line: 6, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !924, line: 21, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !924, line: 13, size: 64, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1054, file: !924, line: 15, baseType: !101, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1054, file: !924, line: 20, baseType: !1058, size: 32, offset: 32)
!1058 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1054, file: !924, line: 16, size: 32, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1058, file: !924, line: 18, baseType: !94, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1058, file: !924, line: 19, baseType: !208, size: 32)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !1063)
!1063 = !{!220, !210}
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(name: "slotvec", scope: !1005, file: !981, line: 834, type: !1066, isLocal: true, isDefinition: true)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !981, line: 823, size: 128, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1067, file: !981, line: 825, baseType: !166, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1067, file: !981, line: 826, baseType: !164, size: 64, offset: 64)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(name: "nslots", scope: !1005, file: !981, line: 832, type: !101, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1005, file: !981, line: 833, type: !1067, isLocal: true, isDefinition: true)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 704, elements: !197)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 67, type: !445, isLocal: true, isDefinition: true)
!1078 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 69, type: !566, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 83, type: !566, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 83, type: !208, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 85, type: !218, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 88, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 171)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 88, type: !1094, isLocal: true, isDefinition: true)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1095)
!1095 = !{!1096}
!1096 = !DISubrange(count: 34)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 105, type: !176, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 109, type: !1101, isLocal: true, isDefinition: true)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 23)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 113, type: !721, isLocal: true, isDefinition: true)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 120, type: !1108, isLocal: true, isDefinition: true)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1109)
!1109 = !{!1110}
!1110 = !DISubrange(count: 32)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 127, type: !1113, isLocal: true, isDefinition: true)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1114)
!1114 = !{!1115}
!1115 = !DISubrange(count: 36)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 134, type: !587, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 142, type: !1120, isLocal: true, isDefinition: true)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1121)
!1121 = !{!1122}
!1122 = !DISubrange(count: 44)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 150, type: !1125, isLocal: true, isDefinition: true)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 48)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 159, type: !213, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 170, type: !1132, isLocal: true, isDefinition: true)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1133)
!1133 = !{!1134}
!1134 = !DISubrange(count: 60)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 248, type: !411, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 248, type: !609, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 254, type: !411, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 254, type: !191, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 254, type: !587, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 259, type: !3, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1078, line: 259, type: !809, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1151, file: !1152, line: 26, type: !1154, isLocal: false, isDefinition: true)
!1151 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1152, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1153, splitDebugInlining: false, nameTableKind: None)
!1152 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1153 = !{!1149}
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 376, elements: !1155)
!1155 = !{!1156}
!1156 = !DISubrange(count: 47)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !1159, line: 34, type: !24, isLocal: true, isDefinition: true)
!1159 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !1159, line: 34, type: !566, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !1159, line: 34, type: !203, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(scope: null, file: !1166, line: 35, type: !181, isLocal: true, isDefinition: true)
!1166 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !1169, file: !1170, line: 53, type: !820, isLocal: false, isDefinition: true)
!1169 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1170, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1171, globals: !1172, splitDebugInlining: false, nameTableKind: None)
!1170 = !DIFile(filename: "lib/obstack.c", directory: "/src", checksumkind: CSK_MD5, checksum: "47f5bbc27e7c2d5a5cc3aab9403d8d27")
!1171 = !{!172, !161, !164, !168}
!1172 = !{!1167, !1173, !1175, !1177}
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !1170, line: 353, type: !208, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !1170, line: 353, type: !566, isLocal: true, isDefinition: true)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(scope: null, file: !1170, line: 353, type: !203, isLocal: true, isDefinition: true)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1181, file: !1182, line: 24, type: !1184, isLocal: false, isDefinition: true)
!1181 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1182, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1183, splitDebugInlining: false, nameTableKind: None)
!1182 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1183 = !{!1179}
!1184 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !101)
!1185 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1186, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1187, retainedTypes: !1188, splitDebugInlining: false, nameTableKind: None)
!1186 = !DIFile(filename: "lib/argv-iter.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0e394449b22995c9f56acaf5026a67a")
!1187 = !{!140}
!1188 = !{!161}
!1189 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1190, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1191, splitDebugInlining: false, nameTableKind: None)
!1190 = !DIFile(filename: "lib/btowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a7b66f5e99f59c6c11b5045aee41d6bc")
!1191 = !{!166}
!1192 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1193, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1194, splitDebugInlining: false, nameTableKind: None)
!1193 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1194 = !{!147}
!1195 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1196, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1196 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1197 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1198, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1188, splitDebugInlining: false, nameTableKind: None)
!1198 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1199 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1200, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1200 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
