; ModuleID = 'src/whoami.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [85 x i8] c"Print the user name associated with the current effective user ID.\0ASame as id -un.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"whoami\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 61)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !67, line: 679, type: !131, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !67, line: 683, type: !105, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !67, line: 688, type: !105, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !67, line: 691, type: !144, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !67, line: 839, type: !186, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 16)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !67, line: 840, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 22)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !67, line: 841, type: !168, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !67, line: 862, type: !112, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !67, line: 868, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 71)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !67, line: 875, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 27)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 51)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 12)
!218 = !{!219, !220, !221, !224, !226, !227, !228, !232, !233, !234, !235, !237, !290, !291, !292, !294, !295}
!219 = !DILocalVariable(name: "program", arg: 1, scope: !66, file: !67, line: 573, type: !70)
!220 = !DILocalVariable(name: "option", arg: 2, scope: !66, file: !67, line: 573, type: !70)
!221 = !DILocalVariable(name: "term", scope: !222, file: !67, line: 585, type: !70)
!222 = distinct !DILexicalBlock(scope: !223, file: !67, line: 582, column: 5)
!223 = distinct !DILexicalBlock(scope: !66, file: !67, line: 581, column: 7)
!224 = !DILocalVariable(name: "double_space", scope: !66, file: !67, line: 594, type: !225)
!225 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!226 = !DILocalVariable(name: "first_word", scope: !66, file: !67, line: 595, type: !70)
!227 = !DILocalVariable(name: "option_text", scope: !66, file: !67, line: 596, type: !70)
!228 = !DILocalVariable(name: "s", scope: !229, file: !67, line: 608, type: !70)
!229 = distinct !DILexicalBlock(scope: !230, file: !67, line: 605, column: 5)
!230 = distinct !DILexicalBlock(scope: !231, file: !67, line: 604, column: 12)
!231 = distinct !DILexicalBlock(scope: !66, file: !67, line: 597, column: 7)
!232 = !DILocalVariable(name: "spaces", scope: !229, file: !67, line: 609, type: !99)
!233 = !DILocalVariable(name: "anchor_len", scope: !66, file: !67, line: 620, type: !99)
!234 = !DILocalVariable(name: "desc_text", scope: !66, file: !67, line: 625, type: !70)
!235 = !DILocalVariable(name: "__ptr", scope: !236, file: !67, line: 644, type: !70)
!236 = distinct !DILexicalBlock(scope: !66, file: !67, line: 644, column: 3)
!237 = !DILocalVariable(name: "__stream", scope: !236, file: !67, line: 644, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!243 = !{!244, !245, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !260, !262, !263, !264, !267, !268, !270, !271, !274, !276, !279, !282, !283, !284, !285, !286}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !242, line: 51, baseType: !97, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !241, file: !242, line: 54, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !241, file: !242, line: 55, baseType: !246, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !241, file: !242, line: 56, baseType: !246, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !241, file: !242, line: 57, baseType: !246, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !241, file: !242, line: 58, baseType: !246, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !241, file: !242, line: 59, baseType: !246, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !241, file: !242, line: 60, baseType: !246, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !241, file: !242, line: 61, baseType: !246, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !241, file: !242, line: 64, baseType: !246, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !241, file: !242, line: 65, baseType: !246, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !241, file: !242, line: 66, baseType: !246, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !241, file: !242, line: 68, baseType: !258, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !242, line: 36, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !241, file: !242, line: 70, baseType: !261, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !241, file: !242, line: 72, baseType: !97, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !242, line: 73, baseType: !97, size: 32, offset: 928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !241, file: !242, line: 74, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !95, line: 152, baseType: !266)
!266 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !241, file: !242, line: 77, baseType: !98, size: 16, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !241, file: !242, line: 78, baseType: !269, size: 8, offset: 1040)
!269 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !241, file: !242, line: 79, baseType: !34, size: 8, offset: 1048)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !242, line: 81, baseType: !272, size: 64, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !242, line: 43, baseType: null)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !242, line: 89, baseType: !275, size: 64, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !95, line: 153, baseType: !266)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !241, file: !242, line: 91, baseType: !277, size: 64, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !242, line: 37, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !241, file: !242, line: 92, baseType: !280, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !242, line: 38, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !241, file: !242, line: 93, baseType: !261, size: 64, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !241, file: !242, line: 94, baseType: !91, size: 64, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !241, file: !242, line: 95, baseType: !99, size: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !241, file: !242, line: 96, baseType: !97, size: 32, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !241, file: !242, line: 98, baseType: !287, size: 160, offset: 1568)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 20)
!290 = !DILocalVariable(name: "__cnt", scope: !236, file: !67, line: 644, type: !99)
!291 = !DILocalVariable(name: "url_program", scope: !66, file: !67, line: 648, type: !70)
!292 = !DILocalVariable(name: "__ptr", scope: !293, file: !67, line: 686, type: !70)
!293 = distinct !DILexicalBlock(scope: !66, file: !67, line: 686, column: 3)
!294 = !DILocalVariable(name: "__stream", scope: !293, file: !67, line: 686, type: !238)
!295 = !DILocalVariable(name: "__cnt", scope: !293, file: !67, line: 686, type: !99)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !298, line: 3, type: !168, isLocal: true, isDefinition: true)
!298 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "Version", scope: !301, file: !298, line: 3, type: !70, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !302, splitDebugInlining: false, nameTableKind: None)
!302 = !{!296, !299}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "file_name", scope: !305, file: !306, line: 45, type: !70, isLocal: true, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C11, file: !306, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !307, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!307 = !{!308, !310, !312, !314, !303, !316}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !306, line: 121, type: !19, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !306, line: 121, type: !215, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !306, line: 123, type: !19, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !306, line: 126, type: !131, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !305, file: !306, line: 55, type: !225, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !320, file: !321, line: 66, type: !367, isLocal: false, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C11, file: !321, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !322, globals: !323, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!322 = !{!91, !101}
!323 = !{!324, !326, !346, !348, !350, !352, !318, !354, !356, !358, !360, !365}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !321, line: 272, type: !105, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "old_file_name", scope: !328, file: !321, line: 304, type: !70, isLocal: true, isDefinition: true)
!328 = distinct !DISubprogram(name: "verror_at_line", scope: !321, file: !321, line: 298, type: !329, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !339)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !97, !97, !70, !76, !70, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !333)
!333 = !{!334, !336, !337, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !332, file: !335, baseType: !76, size: 32)
!335 = !DIFile(filename: "lib/error.c", directory: "/src")
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !332, file: !335, baseType: !76, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !332, file: !335, baseType: !91, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !332, file: !335, baseType: !91, size: 64, offset: 128)
!339 = !{!340, !341, !342, !343, !344, !345}
!340 = !DILocalVariable(name: "status", arg: 1, scope: !328, file: !321, line: 298, type: !97)
!341 = !DILocalVariable(name: "errnum", arg: 2, scope: !328, file: !321, line: 298, type: !97)
!342 = !DILocalVariable(name: "file_name", arg: 3, scope: !328, file: !321, line: 298, type: !70)
!343 = !DILocalVariable(name: "line_number", arg: 4, scope: !328, file: !321, line: 298, type: !76)
!344 = !DILocalVariable(name: "message", arg: 5, scope: !328, file: !321, line: 298, type: !70)
!345 = !DILocalVariable(name: "args", arg: 6, scope: !328, file: !321, line: 298, type: !331)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "old_line_number", scope: !328, file: !321, line: 305, type: !76, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !321, line: 338, type: !112, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !321, line: 346, type: !144, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !321, line: 346, type: !122, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "error_message_count", scope: !320, file: !321, line: 69, type: !76, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !320, file: !321, line: 295, type: !97, isLocal: false, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !321, line: 208, type: !19, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !321, line: 208, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 21)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !321, line: 214, type: !105, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null}
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !372, line: 60, type: !122, isLocal: true, isDefinition: true)
!372 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "long_options", scope: !375, file: !372, line: 34, type: !383, isLocal: true, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C11, file: !372, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !376, splitDebugInlining: false, nameTableKind: None)
!376 = !{!370, !377, !379, !381, !373}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !372, line: 112, type: !34, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !372, line: 36, type: !105, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !372, line: 37, type: !144, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 768, elements: !132)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !386, line: 50, size: 256, elements: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!387 = !{!388, !389, !390, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !386, line: 52, baseType: !70, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !385, file: !386, line: 55, baseType: !97, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !385, file: !386, line: 56, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !385, file: !386, line: 57, baseType: !97, size: 32, offset: 192)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "program_name", scope: !395, file: !396, line: 31, type: !70, isLocal: false, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C11, file: !396, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !397, globals: !398, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!397 = !{!246}
!398 = !{!393, !399, !401}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !396, line: 46, type: !144, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !396, line: 49, type: !112, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "utf07FF", scope: !405, file: !406, line: 46, type: !433, isLocal: true, isDefinition: true)
!405 = distinct !DISubprogram(name: "proper_name_lite", scope: !406, file: !406, line: 38, type: !407, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !409, retainedNodes: !411)
!406 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!407 = !DISubroutineType(types: !408)
!408 = !{!70, !70, !70}
!409 = distinct !DICompileUnit(language: DW_LANG_C11, file: !406, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !410, splitDebugInlining: false, nameTableKind: None)
!410 = !{!403}
!411 = !{!412, !413, !414, !415, !420}
!412 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !405, file: !406, line: 38, type: !70)
!413 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !405, file: !406, line: 38, type: !70)
!414 = !DILocalVariable(name: "translation", scope: !405, file: !406, line: 40, type: !70)
!415 = !DILocalVariable(name: "w", scope: !405, file: !406, line: 47, type: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !417, line: 37, baseType: !418)
!417 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !95, line: 57, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 42, baseType: !76)
!420 = !DILocalVariable(name: "mbs", scope: !405, file: !406, line: 48, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !422, line: 6, baseType: !423)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !424, line: 21, baseType: !425)
!424 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 13, size: 64, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !425, file: !424, line: 15, baseType: !97, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !425, file: !424, line: 20, baseType: !429, size: 32, offset: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !425, file: !424, line: 16, size: 32, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !429, file: !424, line: 18, baseType: !76, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !429, file: !424, line: 19, baseType: !112, size: 32)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16, elements: !123)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !436, line: 78, type: !144, isLocal: true, isDefinition: true)
!436 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !436, line: 79, type: !117, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !436, line: 80, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 13)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !436, line: 81, type: !441, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !436, line: 82, type: !287, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !436, line: 83, type: !122, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !436, line: 84, type: !144, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !436, line: 85, type: !19, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !436, line: 86, type: !19, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !436, line: 87, type: !144, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !460, file: !436, line: 76, type: !546, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !436, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !461, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!461 = !{!462, !476, !74}
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !463, line: 42, baseType: !76, size: 32, elements: !464)
!463 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!465 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!466 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!467 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!468 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!469 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!470 = !DIEnumerator(name: "c_quoting_style", value: 5)
!471 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!472 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!473 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!474 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!475 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!476 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !463, line: 254, baseType: !76, size: 32, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!479 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!480 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!481 = !{!97, !98, !99}
!482 = !{!434, !437, !439, !444, !446, !448, !450, !452, !454, !456, !458, !483, !487, !497, !499, !504, !506, !508, !510, !512, !535, !542, !544}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !460, file: !436, line: 92, type: !485, isLocal: false, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 320, elements: !40)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !460, file: !436, line: 1040, type: !489, isLocal: false, isDefinition: true)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !436, line: 56, size: 448, elements: !490)
!490 = !{!491, !492, !493, !495, !496}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !489, file: !436, line: 59, baseType: !462, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !489, file: !436, line: 62, baseType: !97, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !489, file: !436, line: 66, baseType: !494, size: 256, offset: 64)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !145)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !489, file: !436, line: 69, baseType: !70, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !489, file: !436, line: 72, baseType: !70, size: 64, offset: 384)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !460, file: !436, line: 107, type: !489, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "slot0", scope: !460, file: !436, line: 831, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 256)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !436, line: 321, type: !122, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !436, line: 357, type: !122, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !436, line: 358, type: !122, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !436, line: 199, type: !19, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "quote", scope: !514, file: !436, line: 228, type: !533, isLocal: true, isDefinition: true)
!514 = distinct !DISubprogram(name: "gettext_quote", scope: !436, file: !436, line: 197, type: !515, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !460, retainedNodes: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{!70, !70, !462}
!517 = !{!518, !519, !520, !521, !522}
!518 = !DILocalVariable(name: "msgid", arg: 1, scope: !514, file: !436, line: 197, type: !70)
!519 = !DILocalVariable(name: "s", arg: 2, scope: !514, file: !436, line: 197, type: !462)
!520 = !DILocalVariable(name: "translation", scope: !514, file: !436, line: 199, type: !70)
!521 = !DILocalVariable(name: "w", scope: !514, file: !436, line: 229, type: !416)
!522 = !DILocalVariable(name: "mbs", scope: !514, file: !436, line: 230, type: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !422, line: 6, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !424, line: 21, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 13, size: 64, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !525, file: !424, line: 15, baseType: !97, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !525, file: !424, line: 20, baseType: !529, size: 32, offset: 32)
!529 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !525, file: !424, line: 16, size: 32, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !529, file: !424, line: 18, baseType: !76, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !529, file: !424, line: 19, baseType: !112, size: 32)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !534)
!534 = !{!124, !114}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "slotvec", scope: !460, file: !436, line: 834, type: !537, isLocal: true, isDefinition: true)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !436, line: 823, size: 128, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !538, file: !436, line: 825, baseType: !99, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !538, file: !436, line: 826, baseType: !246, size: 64, offset: 64)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "nslots", scope: !460, file: !436, line: 832, type: !97, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "slotvec0", scope: !460, file: !436, line: 833, type: !538, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 704, elements: !548)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!548 = !{!549}
!549 = !DISubrange(count: 11)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !552, line: 67, type: !215, isLocal: true, isDefinition: true)
!552 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !552, line: 69, type: !19, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !552, line: 83, type: !19, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !552, line: 83, type: !112, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !552, line: 85, type: !122, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !552, line: 88, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 171)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !552, line: 88, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 34)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !552, line: 105, type: !186, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !552, line: 109, type: !9, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !552, line: 113, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 28)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !552, line: 120, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 32)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !552, line: 127, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 36)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !552, line: 134, type: !163, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !552, line: 142, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 44)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !552, line: 150, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 48)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !552, line: 159, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 52)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !552, line: 170, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 60)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !552, line: 248, type: !287, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !552, line: 248, type: !191, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !552, line: 254, type: !287, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !552, line: 254, type: !49, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !552, line: 254, type: !163, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !552, line: 259, type: !3, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !552, line: 259, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 29)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !631, file: !632, line: 26, type: !634, isLocal: false, isDefinition: true)
!631 = distinct !DICompileUnit(language: DW_LANG_C11, file: !632, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !633, splitDebugInlining: false, nameTableKind: None)
!632 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!633 = !{!629}
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 376, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 47)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "exit_failure", scope: !639, file: !640, line: 24, type: !642, isLocal: false, isDefinition: true)
!639 = distinct !DICompileUnit(language: DW_LANG_C11, file: !640, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !641, splitDebugInlining: false, nameTableKind: None)
!640 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!641 = !{!637}
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !97)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !645, line: 34, type: !131, isLocal: true, isDefinition: true)
!645 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !645, line: 34, type: !19, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !645, line: 34, type: !54, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !652, line: 108, type: !34, isLocal: true, isDefinition: true)
!652 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "internal_state", scope: !655, file: !652, line: 97, type: !658, isLocal: true, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C11, file: !652, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !656, globals: !657, splitDebugInlining: false, nameTableKind: None)
!656 = !{!91, !99, !101}
!657 = !{!650, !653}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !422, line: 6, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !424, line: 21, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 13, size: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !660, file: !424, line: 15, baseType: !97, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !660, file: !424, line: 20, baseType: !664, size: 32, offset: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !424, line: 16, size: 32, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !664, file: !424, line: 18, baseType: !76, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !664, file: !424, line: 19, baseType: !112, size: 32)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !670, line: 35, type: !117, isLocal: true, isDefinition: true)
!670 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!671 = distinct !DICompileUnit(language: DW_LANG_C11, file: !672, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!673 = distinct !DICompileUnit(language: DW_LANG_C11, file: !552, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, retainedTypes: !678, globals: !679, splitDebugInlining: false, nameTableKind: None)
!674 = !{!675}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !552, line: 40, baseType: !76, size: 32, elements: !676)
!676 = !{!677}
!677 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!678 = !{!91}
!679 = !{!550, !553, !555, !557, !559, !561, !566, !571, !573, !575, !580, !585, !590, !592, !597, !602, !607, !612, !614, !616, !618, !620, !622, !624}
!680 = distinct !DICompileUnit(language: DW_LANG_C11, file: !681, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!682 = !{!683, !695}
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !684, file: !681, line: 188, baseType: !76, size: 32, elements: !693)
!684 = distinct !DISubprogram(name: "x2nrealloc", scope: !681, file: !681, line: 176, type: !685, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !688)
!685 = !DISubroutineType(types: !686)
!686 = !{!91, !91, !687, !99}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!688 = !{!689, !690, !691, !692}
!689 = !DILocalVariable(name: "p", arg: 1, scope: !684, file: !681, line: 176, type: !91)
!690 = !DILocalVariable(name: "pn", arg: 2, scope: !684, file: !681, line: 176, type: !687)
!691 = !DILocalVariable(name: "s", arg: 3, scope: !684, file: !681, line: 176, type: !99)
!692 = !DILocalVariable(name: "n", scope: !684, file: !681, line: 178, type: !99)
!693 = !{!694}
!694 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !696, file: !681, line: 228, baseType: !76, size: 32, elements: !693)
!696 = distinct !DISubprogram(name: "xpalloc", scope: !681, file: !681, line: 223, type: !697, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !703)
!697 = !DISubroutineType(types: !698)
!698 = !{!91, !91, !699, !700, !702, !700}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !701, line: 130, baseType: !702)
!701 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !100, line: 35, baseType: !266)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712}
!704 = !DILocalVariable(name: "pa", arg: 1, scope: !696, file: !681, line: 223, type: !91)
!705 = !DILocalVariable(name: "pn", arg: 2, scope: !696, file: !681, line: 223, type: !699)
!706 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !696, file: !681, line: 223, type: !700)
!707 = !DILocalVariable(name: "n_max", arg: 4, scope: !696, file: !681, line: 223, type: !702)
!708 = !DILocalVariable(name: "s", arg: 5, scope: !696, file: !681, line: 223, type: !700)
!709 = !DILocalVariable(name: "n0", scope: !696, file: !681, line: 230, type: !700)
!710 = !DILocalVariable(name: "n", scope: !696, file: !681, line: 237, type: !700)
!711 = !DILocalVariable(name: "nbytes", scope: !696, file: !681, line: 248, type: !700)
!712 = !DILocalVariable(name: "adjusted_nbytes", scope: !696, file: !681, line: 252, type: !700)
!713 = !{!246, !91, !225, !266, !96}
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !645, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !715, splitDebugInlining: false, nameTableKind: None)
!715 = !{!643, !646, !648}
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!718 = distinct !DICompileUnit(language: DW_LANG_C11, file: !719, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!720 = distinct !DICompileUnit(language: DW_LANG_C11, file: !721, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !678, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!722 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !678, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !726, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!726 = !{!225, !96, !91}
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !670, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !728, splitDebugInlining: false, nameTableKind: None)
!728 = !{!729, !668}
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !670, line: 35, type: !122, isLocal: true, isDefinition: true)
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !732, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!733 = distinct !DICompileUnit(language: DW_LANG_C11, file: !734, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !678, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!735 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!736 = !{i32 7, !"Dwarf Version", i32 5}
!737 = !{i32 2, !"Debug Info Version", i32 3}
!738 = !{i32 1, !"wchar_size", i32 4}
!739 = !{i32 8, !"PIC Level", i32 2}
!740 = !{i32 7, !"PIE Level", i32 2}
!741 = !{i32 7, !"uwtable", i32 2}
!742 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !743, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !745)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !97}
!745 = !{!746}
!746 = !DILocalVariable(name: "status", arg: 1, scope: !742, file: !2, line: 36, type: !97)
!747 = !DILocation(line: 0, scope: !742)
!748 = !DILocation(line: 38, column: 14, scope: !749)
!749 = distinct !DILexicalBlock(scope: !742, file: !2, line: 38, column: 7)
!750 = !DILocation(line: 38, column: 7, scope: !742)
!751 = !DILocation(line: 39, column: 5, scope: !752)
!752 = distinct !DILexicalBlock(scope: !749, file: !2, line: 39, column: 5)
!753 = !{!754, !754, i64 0}
!754 = !{!"any pointer", !755, i64 0}
!755 = !{!"omnipotent char", !756, i64 0}
!756 = !{!"Simple C/C++ TBAA"}
!757 = !DILocation(line: 42, column: 7, scope: !758)
!758 = distinct !DILexicalBlock(scope: !749, file: !2, line: 41, column: 5)
!759 = !DILocation(line: 43, column: 7, scope: !758)
!760 = !DILocation(line: 48, column: 7, scope: !758)
!761 = !DILocation(line: 49, column: 7, scope: !758)
!762 = !DILocalVariable(name: "program", arg: 1, scope: !763, file: !67, line: 836, type: !70)
!763 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !67, file: !67, line: 836, type: !764, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !70}
!766 = !{!762, !767, !774, !775, !777, !778}
!767 = !DILocalVariable(name: "infomap", scope: !763, file: !67, line: 838, type: !768)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 896, elements: !20)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !763, file: !67, line: 838, size: 128, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !770, file: !67, line: 838, baseType: !70, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !770, file: !67, line: 838, baseType: !70, size: 64, offset: 64)
!774 = !DILocalVariable(name: "node", scope: !763, file: !67, line: 848, type: !70)
!775 = !DILocalVariable(name: "map_prog", scope: !763, file: !67, line: 849, type: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!777 = !DILocalVariable(name: "lc_messages", scope: !763, file: !67, line: 861, type: !70)
!778 = !DILocalVariable(name: "url_program", scope: !763, file: !67, line: 874, type: !70)
!779 = !DILocation(line: 0, scope: !763, inlinedAt: !780)
!780 = distinct !DILocation(line: 50, column: 7, scope: !758)
!781 = !DILocation(line: 857, column: 3, scope: !763, inlinedAt: !780)
!782 = !DILocation(line: 861, column: 29, scope: !763, inlinedAt: !780)
!783 = !DILocation(line: 862, column: 7, scope: !784, inlinedAt: !780)
!784 = distinct !DILexicalBlock(scope: !763, file: !67, line: 862, column: 7)
!785 = !DILocation(line: 862, column: 19, scope: !784, inlinedAt: !780)
!786 = !DILocation(line: 862, column: 22, scope: !784, inlinedAt: !780)
!787 = !DILocation(line: 862, column: 7, scope: !763, inlinedAt: !780)
!788 = !DILocation(line: 868, column: 7, scope: !789, inlinedAt: !780)
!789 = distinct !DILexicalBlock(scope: !784, file: !67, line: 863, column: 5)
!790 = !DILocation(line: 870, column: 5, scope: !789, inlinedAt: !780)
!791 = !DILocation(line: 875, column: 3, scope: !763, inlinedAt: !780)
!792 = !DILocation(line: 877, column: 3, scope: !763, inlinedAt: !780)
!793 = !DILocation(line: 52, column: 3, scope: !742)
!794 = !DISubprogram(name: "dcgettext", scope: !795, file: !795, line: 51, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!795 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!796 = !DISubroutineType(types: !797)
!797 = !{!246, !70, !70, !97}
!798 = !{}
!799 = !DISubprogram(name: "__fprintf_chk", scope: !800, file: !800, line: 93, type: !801, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!800 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!801 = !DISubroutineType(types: !802)
!802 = !{!97, !803, !97, !804, null}
!803 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!804 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!805 = !DISubprogram(name: "__printf_chk", scope: !800, file: !800, line: 95, type: !806, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!806 = !DISubroutineType(types: !807)
!807 = !{!97, !97, !804, null}
!808 = !DISubprogram(name: "fputs_unlocked", scope: !809, file: !809, line: 691, type: !810, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!809 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!810 = !DISubroutineType(types: !811)
!811 = !{!97, !804, !803}
!812 = !DILocation(line: 0, scope: !66)
!813 = !DILocation(line: 581, column: 7, scope: !223)
!814 = !{!815, !815, i64 0}
!815 = !{!"int", !755, i64 0}
!816 = !DILocation(line: 581, column: 19, scope: !223)
!817 = !DILocation(line: 581, column: 7, scope: !66)
!818 = !DILocation(line: 585, column: 26, scope: !222)
!819 = !DILocation(line: 0, scope: !222)
!820 = !DILocation(line: 586, column: 23, scope: !222)
!821 = !DILocation(line: 586, column: 28, scope: !222)
!822 = !DILocation(line: 586, column: 32, scope: !222)
!823 = !{!755, !755, i64 0}
!824 = !DILocation(line: 586, column: 38, scope: !222)
!825 = !DILocalVariable(name: "__s1", arg: 1, scope: !826, file: !827, line: 1359, type: !70)
!826 = distinct !DISubprogram(name: "streq", scope: !827, file: !827, line: 1359, type: !828, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !830)
!827 = !DIFile(filename: "./lib/string.h", directory: "/src")
!828 = !DISubroutineType(types: !829)
!829 = !{!225, !70, !70}
!830 = !{!825, !831}
!831 = !DILocalVariable(name: "__s2", arg: 2, scope: !826, file: !827, line: 1359, type: !70)
!832 = !DILocation(line: 0, scope: !826, inlinedAt: !833)
!833 = distinct !DILocation(line: 586, column: 41, scope: !222)
!834 = !DILocation(line: 1361, column: 11, scope: !826, inlinedAt: !833)
!835 = !DILocation(line: 1361, column: 10, scope: !826, inlinedAt: !833)
!836 = !DILocation(line: 586, column: 19, scope: !222)
!837 = !DILocation(line: 587, column: 5, scope: !222)
!838 = !DILocation(line: 588, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !66, file: !67, line: 588, column: 7)
!840 = !DILocation(line: 588, column: 7, scope: !66)
!841 = !DILocation(line: 590, column: 7, scope: !842)
!842 = distinct !DILexicalBlock(scope: !839, file: !67, line: 589, column: 5)
!843 = !DILocation(line: 591, column: 7, scope: !842)
!844 = !DILocation(line: 595, column: 37, scope: !66)
!845 = !DILocation(line: 595, column: 35, scope: !66)
!846 = !DILocation(line: 596, column: 29, scope: !66)
!847 = !DILocation(line: 597, column: 8, scope: !231)
!848 = !DILocation(line: 597, column: 7, scope: !66)
!849 = !DILocation(line: 604, column: 24, scope: !230)
!850 = !DILocation(line: 604, column: 12, scope: !231)
!851 = !DILocation(line: 0, scope: !229)
!852 = !DILocation(line: 610, column: 16, scope: !229)
!853 = !DILocation(line: 610, column: 7, scope: !229)
!854 = !DILocation(line: 611, column: 21, scope: !229)
!855 = !{!856, !856, i64 0}
!856 = !{!"short", !755, i64 0}
!857 = !DILocation(line: 611, column: 19, scope: !229)
!858 = !DILocation(line: 611, column: 16, scope: !229)
!859 = !DILocation(line: 610, column: 30, scope: !229)
!860 = distinct !{!860, !853, !854, !861}
!861 = !{!"llvm.loop.mustprogress"}
!862 = !DILocation(line: 612, column: 18, scope: !863)
!863 = distinct !DILexicalBlock(scope: !229, file: !67, line: 612, column: 11)
!864 = !DILocation(line: 612, column: 11, scope: !229)
!865 = !DILocation(line: 618, column: 5, scope: !229)
!866 = !DILocation(line: 620, column: 23, scope: !66)
!867 = !DILocation(line: 625, column: 39, scope: !66)
!868 = !DILocation(line: 626, column: 3, scope: !66)
!869 = !DILocation(line: 626, column: 10, scope: !66)
!870 = !DILocation(line: 626, column: 21, scope: !66)
!871 = !DILocation(line: 628, column: 44, scope: !872)
!872 = distinct !DILexicalBlock(scope: !873, file: !67, line: 628, column: 11)
!873 = distinct !DILexicalBlock(scope: !66, file: !67, line: 627, column: 5)
!874 = !DILocation(line: 628, column: 32, scope: !872)
!875 = !DILocation(line: 628, column: 49, scope: !872)
!876 = !DILocation(line: 628, column: 11, scope: !873)
!877 = !DILocation(line: 630, column: 11, scope: !878)
!878 = distinct !DILexicalBlock(scope: !873, file: !67, line: 630, column: 11)
!879 = !DILocation(line: 630, column: 11, scope: !873)
!880 = !DILocation(line: 632, column: 26, scope: !881)
!881 = distinct !DILexicalBlock(scope: !882, file: !67, line: 632, column: 15)
!882 = distinct !DILexicalBlock(scope: !878, file: !67, line: 631, column: 9)
!883 = !DILocation(line: 632, column: 34, scope: !881)
!884 = !DILocation(line: 632, column: 37, scope: !881)
!885 = !DILocation(line: 632, column: 15, scope: !882)
!886 = !DILocation(line: 636, column: 16, scope: !887)
!887 = distinct !DILexicalBlock(scope: !882, file: !67, line: 636, column: 15)
!888 = !DILocation(line: 636, column: 29, scope: !887)
!889 = !DILocation(line: 640, column: 16, scope: !873)
!890 = distinct !{!890, !868, !891, !861}
!891 = !DILocation(line: 641, column: 5, scope: !66)
!892 = !DILocation(line: 644, column: 3, scope: !66)
!893 = !DILocation(line: 0, scope: !826, inlinedAt: !894)
!894 = distinct !DILocation(line: 648, column: 31, scope: !66)
!895 = !DILocation(line: 0, scope: !826, inlinedAt: !896)
!896 = distinct !DILocation(line: 649, column: 31, scope: !66)
!897 = !DILocation(line: 0, scope: !826, inlinedAt: !898)
!898 = distinct !DILocation(line: 650, column: 31, scope: !66)
!899 = !DILocation(line: 0, scope: !826, inlinedAt: !900)
!900 = distinct !DILocation(line: 651, column: 31, scope: !66)
!901 = !DILocation(line: 0, scope: !826, inlinedAt: !902)
!902 = distinct !DILocation(line: 652, column: 31, scope: !66)
!903 = !DILocation(line: 0, scope: !826, inlinedAt: !904)
!904 = distinct !DILocation(line: 653, column: 31, scope: !66)
!905 = !DILocation(line: 0, scope: !826, inlinedAt: !906)
!906 = distinct !DILocation(line: 654, column: 31, scope: !66)
!907 = !DILocation(line: 0, scope: !826, inlinedAt: !908)
!908 = distinct !DILocation(line: 655, column: 31, scope: !66)
!909 = !DILocation(line: 0, scope: !826, inlinedAt: !910)
!910 = distinct !DILocation(line: 656, column: 31, scope: !66)
!911 = !DILocation(line: 0, scope: !826, inlinedAt: !912)
!912 = distinct !DILocation(line: 657, column: 31, scope: !66)
!913 = !DILocation(line: 663, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !66, file: !67, line: 663, column: 7)
!915 = !DILocation(line: 664, column: 7, scope: !914)
!916 = !DILocation(line: 664, column: 10, scope: !914)
!917 = !DILocation(line: 663, column: 7, scope: !66)
!918 = !DILocation(line: 669, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !67, line: 665, column: 5)
!920 = !DILocation(line: 671, column: 5, scope: !919)
!921 = !DILocation(line: 676, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !914, file: !67, line: 673, column: 5)
!923 = !DILocation(line: 679, column: 3, scope: !66)
!924 = !DILocation(line: 683, column: 3, scope: !66)
!925 = !DILocation(line: 686, column: 3, scope: !66)
!926 = !DILocation(line: 688, column: 3, scope: !66)
!927 = !DILocation(line: 691, column: 3, scope: !66)
!928 = !DILocation(line: 695, column: 3, scope: !66)
!929 = !DILocation(line: 696, column: 1, scope: !66)
!930 = !DISubprogram(name: "setlocale", scope: !931, file: !931, line: 122, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!931 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!932 = !DISubroutineType(types: !933)
!933 = !{!246, !97, !70}
!934 = !DISubprogram(name: "strncmp", scope: !935, file: !935, line: 159, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!935 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!936 = !DISubroutineType(types: !937)
!937 = !{!97, !70, !70, !99}
!938 = !DISubprogram(name: "exit", scope: !939, file: !939, line: 624, type: !743, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !798)
!939 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!940 = !DISubprogram(name: "getenv", scope: !939, file: !939, line: 641, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!941 = !DISubroutineType(types: !942)
!942 = !{!246, !70}
!943 = !DISubprogram(name: "strcmp", scope: !935, file: !935, line: 156, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!944 = !DISubroutineType(types: !945)
!945 = !{!97, !70, !70}
!946 = !DISubprogram(name: "strspn", scope: !935, file: !935, line: 297, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!947 = !DISubroutineType(types: !948)
!948 = !{!96, !70, !70}
!949 = !DISubprogram(name: "strchr", scope: !935, file: !935, line: 246, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!950 = !DISubroutineType(types: !951)
!951 = !{!246, !70, !97}
!952 = !DISubprogram(name: "__ctype_b_loc", scope: !75, file: !75, line: 79, type: !953, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!953 = !DISubroutineType(types: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!958 = !DISubprogram(name: "strcspn", scope: !935, file: !935, line: 293, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!959 = !DISubprogram(name: "fwrite_unlocked", scope: !809, file: !809, line: 704, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!960 = !DISubroutineType(types: !961)
!961 = !{!99, !962, !99, !99, !803}
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!965 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 56, type: !966, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !969)
!966 = !DISubroutineType(types: !967)
!967 = !{!97, !97, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!969 = !{!970, !971, !972, !976, !977}
!970 = !DILocalVariable(name: "argc", arg: 1, scope: !965, file: !2, line: 56, type: !97)
!971 = !DILocalVariable(name: "argv", arg: 2, scope: !965, file: !2, line: 56, type: !968)
!972 = !DILocalVariable(name: "NO_UID", scope: !965, file: !2, line: 58, type: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !974, line: 79, baseType: !975)
!974 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !95, line: 146, baseType: !76)
!976 = !DILocalVariable(name: "uid", scope: !965, file: !2, line: 79, type: !973)
!977 = !DILocalVariable(name: "pw", scope: !965, file: !2, line: 80, type: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !980, line: 49, size: 384, elements: !981)
!980 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!981 = !{!982, !983, !984, !985, !987, !988, !989}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !979, file: !980, line: 51, baseType: !246, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !979, file: !980, line: 52, baseType: !246, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !979, file: !980, line: 54, baseType: !975, size: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !979, file: !980, line: 55, baseType: !986, size: 32, offset: 160)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !95, line: 147, baseType: !76)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !979, file: !980, line: 56, baseType: !246, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !979, file: !980, line: 57, baseType: !246, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !979, file: !980, line: 58, baseType: !246, size: 64, offset: 320)
!990 = !DILocation(line: 0, scope: !965)
!991 = !DILocation(line: 61, column: 21, scope: !965)
!992 = !DILocation(line: 61, column: 3, scope: !965)
!993 = !DILocation(line: 62, column: 3, scope: !965)
!994 = !DILocation(line: 63, column: 3, scope: !965)
!995 = !DILocation(line: 64, column: 3, scope: !965)
!996 = !DILocation(line: 66, column: 3, scope: !965)
!997 = !DILocation(line: 69, column: 36, scope: !965)
!998 = !DILocation(line: 69, column: 58, scope: !965)
!999 = !DILocation(line: 68, column: 3, scope: !965)
!1000 = !DILocation(line: 72, column: 7, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !965, file: !2, line: 72, column: 7)
!1002 = !DILocation(line: 72, column: 14, scope: !1001)
!1003 = !DILocation(line: 72, column: 7, scope: !965)
!1004 = !DILocation(line: 74, column: 7, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1001, file: !2, line: 73, column: 5)
!1006 = !DILocation(line: 75, column: 7, scope: !1005)
!1007 = !DILocation(line: 78, column: 3, scope: !965)
!1008 = !DILocation(line: 78, column: 9, scope: !965)
!1009 = !DILocation(line: 79, column: 15, scope: !965)
!1010 = !DILocation(line: 80, column: 27, scope: !965)
!1011 = !DILocation(line: 80, column: 37, scope: !965)
!1012 = !DILocation(line: 80, column: 40, scope: !965)
!1013 = !DILocation(line: 80, column: 23, scope: !965)
!1014 = !DILocation(line: 80, column: 55, scope: !965)
!1015 = !DILocation(line: 81, column: 8, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !965, file: !2, line: 81, column: 7)
!1017 = !DILocation(line: 81, column: 7, scope: !965)
!1018 = !DILocation(line: 82, column: 5, scope: !1016)
!1019 = !DILocation(line: 84, column: 13, scope: !965)
!1020 = !{!1021, !754, i64 0}
!1021 = !{!"passwd", !754, i64 0, !754, i64 8, !815, i64 16, !815, i64 20, !754, i64 24, !754, i64 32, !754, i64 40}
!1022 = !DILocation(line: 84, column: 3, scope: !965)
!1023 = !DILocation(line: 85, column: 3, scope: !965)
!1024 = !DISubprogram(name: "bindtextdomain", scope: !795, file: !795, line: 86, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!246, !70, !70}
!1027 = !DISubprogram(name: "textdomain", scope: !795, file: !795, line: 82, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1028 = !DISubprogram(name: "atexit", scope: !939, file: !939, line: 602, type: !1029, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!97, !367}
!1031 = !DISubprogram(name: "__errno_location", scope: !1032, file: !1032, line: 37, type: !1033, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1032 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!391}
!1035 = !DISubprogram(name: "geteuid", scope: !1036, file: !1036, line: 700, type: !1037, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1036 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!975}
!1039 = !DISubprogram(name: "getpwuid", scope: !980, file: !980, line: 110, type: !1040, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!978, !975}
!1042 = !DISubprogram(name: "puts", scope: !809, file: !809, line: 661, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!97, !70}
!1045 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !306, file: !306, line: 50, type: !764, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !1046)
!1046 = !{!1047}
!1047 = !DILocalVariable(name: "file", arg: 1, scope: !1045, file: !306, line: 50, type: !70)
!1048 = !DILocation(line: 0, scope: !1045)
!1049 = !DILocation(line: 52, column: 13, scope: !1045)
!1050 = !DILocation(line: 53, column: 1, scope: !1045)
!1051 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !306, file: !306, line: 87, type: !1052, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !1054)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !225}
!1054 = !{!1055}
!1055 = !DILocalVariable(name: "ignore", arg: 1, scope: !1051, file: !306, line: 87, type: !225)
!1056 = !DILocation(line: 0, scope: !1051)
!1057 = !DILocation(line: 89, column: 16, scope: !1051)
!1058 = !{!1059, !1059, i64 0}
!1059 = !{!"_Bool", !755, i64 0}
!1060 = !DILocation(line: 90, column: 1, scope: !1051)
!1061 = distinct !DISubprogram(name: "close_stdout", scope: !306, file: !306, line: 116, type: !368, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !1062)
!1062 = !{!1063}
!1063 = !DILocalVariable(name: "write_error", scope: !1064, file: !306, line: 121, type: !70)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !306, line: 120, column: 5)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !306, line: 118, column: 7)
!1066 = !DILocation(line: 118, column: 21, scope: !1065)
!1067 = !DILocation(line: 118, column: 7, scope: !1065)
!1068 = !DILocation(line: 118, column: 29, scope: !1065)
!1069 = !DILocation(line: 119, column: 7, scope: !1065)
!1070 = !DILocation(line: 119, column: 12, scope: !1065)
!1071 = !{i8 0, i8 2}
!1072 = !DILocation(line: 119, column: 25, scope: !1065)
!1073 = !DILocation(line: 119, column: 28, scope: !1065)
!1074 = !DILocation(line: 119, column: 34, scope: !1065)
!1075 = !DILocation(line: 118, column: 7, scope: !1061)
!1076 = !DILocation(line: 121, column: 33, scope: !1064)
!1077 = !DILocation(line: 0, scope: !1064)
!1078 = !DILocation(line: 122, column: 11, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1064, file: !306, line: 122, column: 11)
!1080 = !DILocation(line: 0, scope: !1079)
!1081 = !DILocation(line: 122, column: 11, scope: !1064)
!1082 = !DILocation(line: 123, column: 9, scope: !1079)
!1083 = !DILocation(line: 126, column: 9, scope: !1079)
!1084 = !DILocation(line: 128, column: 14, scope: !1064)
!1085 = !DILocation(line: 128, column: 7, scope: !1064)
!1086 = !DILocation(line: 133, column: 42, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1061, file: !306, line: 133, column: 7)
!1088 = !DILocation(line: 133, column: 28, scope: !1087)
!1089 = !DILocation(line: 133, column: 50, scope: !1087)
!1090 = !DILocation(line: 133, column: 7, scope: !1061)
!1091 = !DILocation(line: 134, column: 12, scope: !1087)
!1092 = !DILocation(line: 134, column: 5, scope: !1087)
!1093 = !DILocation(line: 135, column: 1, scope: !1061)
!1094 = !DISubprogram(name: "_exit", scope: !1036, file: !1036, line: 624, type: !743, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1095 = distinct !DISubprogram(name: "verror", scope: !321, file: !321, line: 251, type: !1096, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1098)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !97, !97, !70, !331}
!1098 = !{!1099, !1100, !1101, !1102}
!1099 = !DILocalVariable(name: "status", arg: 1, scope: !1095, file: !321, line: 251, type: !97)
!1100 = !DILocalVariable(name: "errnum", arg: 2, scope: !1095, file: !321, line: 251, type: !97)
!1101 = !DILocalVariable(name: "message", arg: 3, scope: !1095, file: !321, line: 251, type: !70)
!1102 = !DILocalVariable(name: "args", arg: 4, scope: !1095, file: !321, line: 251, type: !331)
!1103 = !DILocation(line: 0, scope: !1095)
!1104 = !DILocation(line: 261, column: 3, scope: !1095)
!1105 = !DILocation(line: 265, column: 7, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1095, file: !321, line: 265, column: 7)
!1107 = !DILocation(line: 265, column: 7, scope: !1095)
!1108 = !DILocation(line: 266, column: 5, scope: !1106)
!1109 = !DILocation(line: 272, column: 7, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1106, file: !321, line: 268, column: 5)
!1111 = !DILocation(line: 276, column: 3, scope: !1095)
!1112 = !DILocation(line: 282, column: 1, scope: !1095)
!1113 = distinct !DISubprogram(name: "flush_stdout", scope: !321, file: !321, line: 163, type: !368, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1114)
!1114 = !{!1115}
!1115 = !DILocalVariable(name: "stdout_fd", scope: !1113, file: !321, line: 166, type: !97)
!1116 = !DILocation(line: 0, scope: !1113)
!1117 = !DILocalVariable(name: "fd", arg: 1, scope: !1118, file: !321, line: 145, type: !97)
!1118 = distinct !DISubprogram(name: "is_open", scope: !321, file: !321, line: 145, type: !1119, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1121)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!97, !97}
!1121 = !{!1117}
!1122 = !DILocation(line: 0, scope: !1118, inlinedAt: !1123)
!1123 = distinct !DILocation(line: 182, column: 25, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1113, file: !321, line: 182, column: 7)
!1125 = !DILocation(line: 157, column: 15, scope: !1118, inlinedAt: !1123)
!1126 = !DILocation(line: 157, column: 12, scope: !1118, inlinedAt: !1123)
!1127 = !DILocation(line: 182, column: 7, scope: !1113)
!1128 = !DILocation(line: 184, column: 5, scope: !1124)
!1129 = !DILocation(line: 185, column: 1, scope: !1113)
!1130 = distinct !DISubprogram(name: "error_tail", scope: !321, file: !321, line: 219, type: !1096, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1131)
!1131 = !{!1132, !1133, !1134, !1135}
!1132 = !DILocalVariable(name: "status", arg: 1, scope: !1130, file: !321, line: 219, type: !97)
!1133 = !DILocalVariable(name: "errnum", arg: 2, scope: !1130, file: !321, line: 219, type: !97)
!1134 = !DILocalVariable(name: "message", arg: 3, scope: !1130, file: !321, line: 219, type: !70)
!1135 = !DILocalVariable(name: "args", arg: 4, scope: !1130, file: !321, line: 219, type: !331)
!1136 = !DILocation(line: 0, scope: !1130)
!1137 = !DILocation(line: 229, column: 13, scope: !1130)
!1138 = !DILocalVariable(name: "__stream", arg: 1, scope: !1139, file: !800, line: 132, type: !1142)
!1139 = distinct !DISubprogram(name: "vfprintf", scope: !800, file: !800, line: 132, type: !1140, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1177)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!97, !1142, !804, !331}
!1142 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1145, file: !242, line: 51, baseType: !97, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1145, file: !242, line: 54, baseType: !246, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1145, file: !242, line: 55, baseType: !246, size: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1145, file: !242, line: 56, baseType: !246, size: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1145, file: !242, line: 57, baseType: !246, size: 64, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1145, file: !242, line: 58, baseType: !246, size: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1145, file: !242, line: 59, baseType: !246, size: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1145, file: !242, line: 60, baseType: !246, size: 64, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1145, file: !242, line: 61, baseType: !246, size: 64, offset: 512)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1145, file: !242, line: 64, baseType: !246, size: 64, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1145, file: !242, line: 65, baseType: !246, size: 64, offset: 640)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1145, file: !242, line: 66, baseType: !246, size: 64, offset: 704)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1145, file: !242, line: 68, baseType: !258, size: 64, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1145, file: !242, line: 70, baseType: !1161, size: 64, offset: 832)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1145, file: !242, line: 72, baseType: !97, size: 32, offset: 896)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1145, file: !242, line: 73, baseType: !97, size: 32, offset: 928)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1145, file: !242, line: 74, baseType: !265, size: 64, offset: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1145, file: !242, line: 77, baseType: !98, size: 16, offset: 1024)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1145, file: !242, line: 78, baseType: !269, size: 8, offset: 1040)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1145, file: !242, line: 79, baseType: !34, size: 8, offset: 1048)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1145, file: !242, line: 81, baseType: !272, size: 64, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1145, file: !242, line: 89, baseType: !275, size: 64, offset: 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1145, file: !242, line: 91, baseType: !277, size: 64, offset: 1216)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1145, file: !242, line: 92, baseType: !280, size: 64, offset: 1280)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1145, file: !242, line: 93, baseType: !1161, size: 64, offset: 1344)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1145, file: !242, line: 94, baseType: !91, size: 64, offset: 1408)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1145, file: !242, line: 95, baseType: !99, size: 64, offset: 1472)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1145, file: !242, line: 96, baseType: !97, size: 32, offset: 1536)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1145, file: !242, line: 98, baseType: !287, size: 160, offset: 1568)
!1177 = !{!1138, !1178, !1179}
!1178 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1139, file: !800, line: 133, type: !804)
!1179 = !DILocalVariable(name: "__ap", arg: 3, scope: !1139, file: !800, line: 133, type: !331)
!1180 = !DILocation(line: 0, scope: !1139, inlinedAt: !1181)
!1181 = distinct !DILocation(line: 229, column: 3, scope: !1130)
!1182 = !DILocation(line: 135, column: 10, scope: !1139, inlinedAt: !1181)
!1183 = !DILocation(line: 232, column: 3, scope: !1130)
!1184 = !DILocation(line: 233, column: 7, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1130, file: !321, line: 233, column: 7)
!1186 = !DILocation(line: 233, column: 7, scope: !1130)
!1187 = !DILocalVariable(name: "errnum", arg: 1, scope: !1188, file: !321, line: 188, type: !97)
!1188 = distinct !DISubprogram(name: "print_errno_message", scope: !321, file: !321, line: 188, type: !743, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1189)
!1189 = !{!1187, !1190, !1191}
!1190 = !DILocalVariable(name: "s", scope: !1188, file: !321, line: 190, type: !70)
!1191 = !DILocalVariable(name: "errbuf", scope: !1188, file: !321, line: 193, type: !1192)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1193)
!1193 = !{!1194}
!1194 = !DISubrange(count: 1024)
!1195 = !DILocation(line: 0, scope: !1188, inlinedAt: !1196)
!1196 = distinct !DILocation(line: 234, column: 5, scope: !1185)
!1197 = !DILocation(line: 193, column: 3, scope: !1188, inlinedAt: !1196)
!1198 = !DILocation(line: 193, column: 8, scope: !1188, inlinedAt: !1196)
!1199 = !DILocation(line: 195, column: 7, scope: !1188, inlinedAt: !1196)
!1200 = !DILocation(line: 207, column: 9, scope: !1201, inlinedAt: !1196)
!1201 = distinct !DILexicalBlock(scope: !1188, file: !321, line: 207, column: 7)
!1202 = !DILocation(line: 207, column: 7, scope: !1188, inlinedAt: !1196)
!1203 = !DILocation(line: 208, column: 9, scope: !1201, inlinedAt: !1196)
!1204 = !DILocation(line: 208, column: 5, scope: !1201, inlinedAt: !1196)
!1205 = !DILocation(line: 214, column: 3, scope: !1188, inlinedAt: !1196)
!1206 = !DILocation(line: 216, column: 1, scope: !1188, inlinedAt: !1196)
!1207 = !DILocation(line: 234, column: 5, scope: !1185)
!1208 = !DILocation(line: 238, column: 3, scope: !1130)
!1209 = !DILocalVariable(name: "__c", arg: 1, scope: !1210, file: !1211, line: 101, type: !97)
!1210 = distinct !DISubprogram(name: "putc_unlocked", scope: !1211, file: !1211, line: 101, type: !1212, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1214)
!1211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!97, !97, !1143}
!1214 = !{!1209, !1215}
!1215 = !DILocalVariable(name: "__stream", arg: 2, scope: !1210, file: !1211, line: 101, type: !1143)
!1216 = !DILocation(line: 0, scope: !1210, inlinedAt: !1217)
!1217 = distinct !DILocation(line: 238, column: 3, scope: !1130)
!1218 = !DILocation(line: 103, column: 10, scope: !1210, inlinedAt: !1217)
!1219 = !{!1220, !754, i64 40}
!1220 = !{!"_IO_FILE", !815, i64 0, !754, i64 8, !754, i64 16, !754, i64 24, !754, i64 32, !754, i64 40, !754, i64 48, !754, i64 56, !754, i64 64, !754, i64 72, !754, i64 80, !754, i64 88, !754, i64 96, !754, i64 104, !815, i64 112, !815, i64 116, !1221, i64 120, !856, i64 128, !755, i64 130, !755, i64 131, !754, i64 136, !1221, i64 144, !754, i64 152, !754, i64 160, !754, i64 168, !754, i64 176, !1221, i64 184, !815, i64 192, !755, i64 196}
!1221 = !{!"long", !755, i64 0}
!1222 = !{!1220, !754, i64 48}
!1223 = !{!"branch_weights", i32 2000, i32 1}
!1224 = !DILocation(line: 240, column: 3, scope: !1130)
!1225 = !DILocation(line: 241, column: 7, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1130, file: !321, line: 241, column: 7)
!1227 = !DILocation(line: 241, column: 7, scope: !1130)
!1228 = !DILocation(line: 242, column: 5, scope: !1226)
!1229 = !DILocation(line: 243, column: 1, scope: !1130)
!1230 = !DISubprogram(name: "__vfprintf_chk", scope: !800, file: !800, line: 96, type: !1231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!97, !1142, !97, !804, !331}
!1233 = !DISubprogram(name: "strerror_r", scope: !935, file: !935, line: 444, type: !1234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!246, !97, !246, !99}
!1236 = !DISubprogram(name: "__overflow", scope: !809, file: !809, line: 886, type: !1237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!97, !1143, !97}
!1239 = !DISubprogram(name: "fflush_unlocked", scope: !809, file: !809, line: 239, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!97, !1143}
!1242 = !DISubprogram(name: "fcntl", scope: !1243, file: !1243, line: 149, type: !1244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!1243 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!97, !97, !97, null}
!1246 = distinct !DISubprogram(name: "error", scope: !321, file: !321, line: 285, type: !1247, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1249)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !97, !97, !70, null}
!1249 = !{!1250, !1251, !1252, !1253}
!1250 = !DILocalVariable(name: "status", arg: 1, scope: !1246, file: !321, line: 285, type: !97)
!1251 = !DILocalVariable(name: "errnum", arg: 2, scope: !1246, file: !321, line: 285, type: !97)
!1252 = !DILocalVariable(name: "message", arg: 3, scope: !1246, file: !321, line: 285, type: !70)
!1253 = !DILocalVariable(name: "ap", scope: !1246, file: !321, line: 287, type: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !809, line: 52, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1256, line: 14, baseType: !1257)
!1256 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !335, baseType: !1258)
!1258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 192, elements: !35)
!1259 = !DILocation(line: 0, scope: !1246)
!1260 = !DILocation(line: 287, column: 3, scope: !1246)
!1261 = !DILocation(line: 287, column: 11, scope: !1246)
!1262 = !DILocation(line: 288, column: 3, scope: !1246)
!1263 = !DILocation(line: 289, column: 3, scope: !1246)
!1264 = !DILocation(line: 290, column: 3, scope: !1246)
!1265 = !DILocation(line: 291, column: 1, scope: !1246)
!1266 = !DILocation(line: 0, scope: !328)
!1267 = !DILocation(line: 302, column: 7, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !328, file: !321, line: 302, column: 7)
!1269 = !DILocation(line: 302, column: 7, scope: !328)
!1270 = !DILocation(line: 307, column: 11, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !321, line: 307, column: 11)
!1272 = distinct !DILexicalBlock(scope: !1268, file: !321, line: 303, column: 5)
!1273 = !DILocation(line: 307, column: 27, scope: !1271)
!1274 = !DILocation(line: 308, column: 11, scope: !1271)
!1275 = !DILocation(line: 308, column: 28, scope: !1271)
!1276 = !DILocation(line: 308, column: 25, scope: !1271)
!1277 = !DILocation(line: 309, column: 15, scope: !1271)
!1278 = !DILocation(line: 309, column: 33, scope: !1271)
!1279 = !DILocation(line: 310, column: 19, scope: !1271)
!1280 = !DILocation(line: 311, column: 22, scope: !1271)
!1281 = !DILocation(line: 311, column: 56, scope: !1271)
!1282 = !DILocation(line: 307, column: 11, scope: !1272)
!1283 = !DILocation(line: 316, column: 21, scope: !1272)
!1284 = !DILocation(line: 317, column: 23, scope: !1272)
!1285 = !DILocation(line: 318, column: 5, scope: !1272)
!1286 = !DILocation(line: 327, column: 3, scope: !328)
!1287 = !DILocation(line: 331, column: 7, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !328, file: !321, line: 331, column: 7)
!1289 = !DILocation(line: 331, column: 7, scope: !328)
!1290 = !DILocation(line: 332, column: 5, scope: !1288)
!1291 = !DILocation(line: 338, column: 7, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1288, file: !321, line: 334, column: 5)
!1293 = !DILocation(line: 346, column: 3, scope: !328)
!1294 = !DILocation(line: 350, column: 3, scope: !328)
!1295 = !DILocation(line: 356, column: 1, scope: !328)
!1296 = distinct !DISubprogram(name: "error_at_line", scope: !321, file: !321, line: 359, type: !1297, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1299)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{null, !97, !97, !70, !76, !70, null}
!1299 = !{!1300, !1301, !1302, !1303, !1304, !1305}
!1300 = !DILocalVariable(name: "status", arg: 1, scope: !1296, file: !321, line: 359, type: !97)
!1301 = !DILocalVariable(name: "errnum", arg: 2, scope: !1296, file: !321, line: 359, type: !97)
!1302 = !DILocalVariable(name: "file_name", arg: 3, scope: !1296, file: !321, line: 359, type: !70)
!1303 = !DILocalVariable(name: "line_number", arg: 4, scope: !1296, file: !321, line: 360, type: !76)
!1304 = !DILocalVariable(name: "message", arg: 5, scope: !1296, file: !321, line: 360, type: !70)
!1305 = !DILocalVariable(name: "ap", scope: !1296, file: !321, line: 362, type: !1254)
!1306 = !DILocation(line: 0, scope: !1296)
!1307 = !DILocation(line: 362, column: 3, scope: !1296)
