; ModuleID = 'src/b2sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [39 x i8] c"Print or check %s (%d-bit) checksums.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"BLAKE2b\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [40 x i8] c"Legacy interface to the cksum utility.\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [6 x i8] c"b2sum\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [45 x i8] c"  -b, --binary\0A         read in binary mode\0A\00", align 1, !dbg !29

!293 = !DISubrange(count: 35)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1866, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1868, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 54)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1893, type: !226, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !110, file: !2, line: 194, type: !308, isLocal: true, isDefinition: true)
!308 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !110, file: !2, line: 197, type: !311, isLocal: true, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !312, line: 130, baseType: !313)
!312 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !314, line: 18, baseType: !315)
!314 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!315 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !110, file: !2, line: 200, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "digest_length", scope: !110, file: !2, line: 241, type: !311, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !132, line: 729, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 56)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !132, line: 736, type: !71, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !329, file: !132, line: 575, type: !133, isLocal: true, isDefinition: true)
!329 = distinct !DISubprogram(name: "oputs_", scope: !132, file: !132, line: 573, type: !330, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !332)
!330 = !DISubroutineType(cc: DW_CC_nocall, types: !331)
!331 = !{null, !202, !202}
!332 = !{!333, !334, !335, !338, !339, !340, !341, !345, !346, !347, !348, !350, !401, !402, !403, !405, !406}
!333 = !DILocalVariable(name: "program", arg: 1, scope: !329, file: !132, line: 573, type: !202)
!334 = !DILocalVariable(name: "option", arg: 2, scope: !329, file: !132, line: 573, type: !202)
!335 = !DILocalVariable(name: "term", scope: !336, file: !132, line: 585, type: !202)
!336 = distinct !DILexicalBlock(scope: !337, file: !132, line: 582, column: 5)
!337 = distinct !DILexicalBlock(scope: !329, file: !132, line: 581, column: 7)
!338 = !DILocalVariable(name: "double_space", scope: !329, file: !132, line: 594, type: !308)
!339 = !DILocalVariable(name: "first_word", scope: !329, file: !132, line: 595, type: !202)
!340 = !DILocalVariable(name: "option_text", scope: !329, file: !132, line: 596, type: !202)
!341 = !DILocalVariable(name: "s", scope: !342, file: !132, line: 608, type: !202)
!342 = distinct !DILexicalBlock(scope: !343, file: !132, line: 605, column: 5)
!343 = distinct !DILexicalBlock(scope: !344, file: !132, line: 604, column: 12)
!344 = distinct !DILexicalBlock(scope: !329, file: !132, line: 597, column: 7)
!345 = !DILocalVariable(name: "spaces", scope: !342, file: !132, line: 609, type: !200)
!346 = !DILocalVariable(name: "anchor_len", scope: !329, file: !132, line: 620, type: !200)
!347 = !DILocalVariable(name: "desc_text", scope: !329, file: !132, line: 625, type: !202)
!348 = !DILocalVariable(name: "__ptr", scope: !349, file: !132, line: 644, type: !202)
!349 = distinct !DILexicalBlock(scope: !329, file: !132, line: 644, column: 3)
!350 = !DILocalVariable(name: "__stream", scope: !349, file: !132, line: 644, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !353, line: 7, baseType: !354)
!353 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !355, line: 49, size: 1728, elements: !356)
!355 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !372, !374, !375, !376, !378, !379, !381, !382, !385, !387, !390, !393, !394, !395, !396, !397}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !354, file: !355, line: 51, baseType: !133, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !354, file: !355, line: 54, baseType: !197, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !354, file: !355, line: 55, baseType: !197, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !354, file: !355, line: 56, baseType: !197, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !354, file: !355, line: 57, baseType: !197, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !354, file: !355, line: 58, baseType: !197, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !354, file: !355, line: 59, baseType: !197, size: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !354, file: !355, line: 60, baseType: !197, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !354, file: !355, line: 61, baseType: !197, size: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !354, file: !355, line: 64, baseType: !197, size: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !354, file: !355, line: 65, baseType: !197, size: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !354, file: !355, line: 66, baseType: !197, size: 64, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !354, file: !355, line: 68, baseType: !370, size: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !355, line: 36, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !354, file: !355, line: 70, baseType: !373, size: 64, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !354, file: !355, line: 72, baseType: !133, size: 32, offset: 896)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !354, file: !355, line: 73, baseType: !133, size: 32, offset: 928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !354, file: !355, line: 74, baseType: !377, size: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !182, line: 152, baseType: !315)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !354, file: !355, line: 77, baseType: !199, size: 16, offset: 1024)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !354, file: !355, line: 78, baseType: !380, size: 8, offset: 1040)
!380 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !354, file: !355, line: 79, baseType: !209, size: 8, offset: 1048)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !354, file: !355, line: 81, baseType: !383, size: 64, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !355, line: 43, baseType: null)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !354, file: !355, line: 89, baseType: !386, size: 64, offset: 1152)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !182, line: 153, baseType: !315)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !354, file: !355, line: 91, baseType: !388, size: 64, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !355, line: 37, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !354, file: !355, line: 92, baseType: !391, size: 64, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !355, line: 38, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !354, file: !355, line: 93, baseType: !373, size: 64, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !354, file: !355, line: 94, baseType: !198, size: 64, offset: 1408)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !354, file: !355, line: 95, baseType: !200, size: 64, offset: 1472)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !354, file: !355, line: 96, baseType: !133, size: 32, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !354, file: !355, line: 98, baseType: !398, size: 160, offset: 1568)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 20)
!401 = !DILocalVariable(name: "__cnt", scope: !349, file: !132, line: 644, type: !200)
!402 = !DILocalVariable(name: "url_program", scope: !329, file: !132, line: 648, type: !202)
!403 = !DILocalVariable(name: "__ptr", scope: !404, file: !132, line: 686, type: !202)
!404 = distinct !DILexicalBlock(scope: !329, file: !132, line: 686, column: 3)
!405 = !DILocalVariable(name: "__stream", scope: !404, file: !132, line: 686, type: !351)
!406 = !DILocalVariable(name: "__cnt", scope: !404, file: !132, line: 686, type: !200)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !132, line: 585, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 5)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !132, line: 586, type: !409, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !132, line: 595, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 4)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !132, line: 620, type: !26, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !132, line: 648, type: !296, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !132, line: 648, type: !409, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !132, line: 649, type: !416, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !132, line: 649, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 3)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !132, line: 650, type: !409, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !132, line: 651, type: !26, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !132, line: 652, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 7)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !132, line: 653, type: !16, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !132, line: 654, type: !214, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !132, line: 655, type: !214, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !132, line: 656, type: !214, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !132, line: 657, type: !214, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !132, line: 663, type: !438, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !132, line: 664, type: !214, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !132, line: 669, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 17)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !132, line: 669, type: !21, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !132, line: 676, type: !226, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !132, line: 676, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 61)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !132, line: 679, type: !429, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !132, line: 683, type: !409, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !132, line: 688, type: !409, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !132, line: 691, type: !16, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !132, line: 839, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 16)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !132, line: 840, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 22)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !132, line: 841, type: !226, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !132, line: 862, type: !416, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !132, line: 868, type: !61, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !132, line: 875, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 27)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !132, line: 877, type: !51, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !132, line: 877, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 12)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !438, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !2, line: 460, type: !26, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !2, line: 461, type: !226, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !2, line: 462, type: !26, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !438, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !409, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 465, type: !438, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 466, type: !416, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !409, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 476, type: !438, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !409, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 483, type: !409, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !16, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "status_only", scope: !110, file: !2, line: 204, type: !308, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "warn", scope: !110, file: !2, line: 208, type: !308, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "quiet", scope: !110, file: !2, line: 214, type: !308, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !110, file: !2, line: 211, type: !308, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "strict", scope: !110, file: !2, line: 218, type: !308, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "digest_delim", scope: !110, file: !2, line: 224, type: !204, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!544 = distinct !DIGlobalVariable(name: "raw_digest", scope: !110, file: !2, line: 232, type: !308, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1390, type: !296, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1393, type: !429, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1410, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 28)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1440, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 47)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1461, type: !16, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1461, type: !398, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1490, type: !26, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1490, type: !438, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1492, type: !429, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1512, type: !226, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1520, type: !556, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 42)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !95, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1536, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 43)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1536, type: !95, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1544, type: !31, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1544, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 46)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1552, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 25)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !110, file: !2, line: 221, type: !133, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "bin2hex", scope: !603, file: !2, line: 1345, type: !613, isLocal: true, isDefinition: true)
!603 = distinct !DISubprogram(name: "hex_equal", scope: !2, file: !2, line: 1343, type: !604, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !608)
!604 = !DISubroutineType(types: !605)
!605 = !{!308, !606, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!608 = !{!609, !610, !611, !612}
!609 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !603, file: !2, line: 1343, type: !606)
!610 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !603, file: !2, line: 1343, type: !606)
!611 = !DILocalVariable(name: "digest_bin_bytes", scope: !603, file: !2, line: 1349, type: !311)
!612 = !DILocalVariable(name: "cnt", scope: !603, file: !2, line: 1353, type: !311)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !480)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !132, line: 952, type: !502, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1282, type: !416, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1292, type: !429, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1294, type: !409, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1309, type: !409, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 717, type: !416, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1152, type: !429, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1156, type: !429, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1160, type: !429, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 3584, elements: !232)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !635, line: 50, size: 256, elements: !636)
!635 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!636 = !{!637, !638, !639, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !634, file: !635, line: 52, baseType: !202, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !634, file: !635, line: 55, baseType: !133, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !634, file: !635, line: 56, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !634, file: !635, line: 57, baseType: !133, size: 32, offset: 192)
!642 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!643 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!644 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!645 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!646 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!647 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!648 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !651, file: !652, line: 27, type: !689, isLocal: true, isDefinition: true)
!651 = distinct !DICompileUnit(language: DW_LANG_C11, file: !652, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -D HASH_ALGO_BLAKE2=1 -D HAVE_CONFIG_H -I lib -I ./lib -I src -I ./src -g -O2 -MT src/blake2/b2sum-blake2b-ref.o -MD -MP -MF src/blake2/.deps/b2sum-blake2b-ref.Tpo -c src/blake2/blake2b-ref.c -o src/blake2/.b2sum-blake2b-ref.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !653, retainedTypes: !662, globals: !670, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28d09caefc730ba5ec0593f4ff5ef776")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !655, line: 42, baseType: !114, size: 32, elements: !656)
!655 = !DIFile(filename: "src/blake2/blake2.h", directory: "/src", checksumkind: CSK_MD5, checksum: "98dc573ce8fd1dd56441f8e485f7bd5e")
!656 = !{!657, !658, !659, !660, !661}
!657 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!658 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!659 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!660 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!661 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!662 = !{!663, !665, !606, !198, !668}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !666, line: 24, baseType: !667)
!666 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !182, line: 38, baseType: !204)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !666, line: 27, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !182, line: 45, baseType: !178)
!670 = !{!649, !671, !685}
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "memset_v", scope: !673, file: !674, line: 161, type: !680, isLocal: true, isDefinition: true)
!673 = distinct !DISubprogram(name: "secure_zero_memory", scope: !674, file: !674, line: 159, type: !675, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !651, retainedNodes: !677)
!674 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8e1e523af54e01275d11e95a252b1371")
!675 = !DISubroutineType(types: !676)
!676 = !{null, !198, !200}
!677 = !{!678, !679}
!678 = !DILocalVariable(name: "v", arg: 1, scope: !673, file: !674, line: 159, type: !198)
!679 = !DILocalVariable(name: "n", arg: 2, scope: !673, file: !674, line: 159, type: !200)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!198, !198, !133, !200}
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !651, file: !652, line: 35, type: !687, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 1536, elements: !688)
!688 = !{!504, !481}
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 512, elements: !17)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !693, line: 3, type: !226, isLocal: true, isDefinition: true)
!693 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "Version", scope: !696, file: !693, line: 3, type: !202, isLocal: false, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !693, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !697, splitDebugInlining: false, nameTableKind: None)
!697 = !{!691, !694}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "file_name", scope: !700, file: !701, line: 45, type: !202, isLocal: true, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !702, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!702 = !{!703, !705, !707, !709, !698, !711}
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !701, line: 121, type: !438, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !701, line: 121, type: !502, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !701, line: 123, type: !438, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !701, line: 126, type: !429, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !700, file: !701, line: 55, type: !308, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !715, file: !716, line: 66, type: !761, isLocal: false, isDefinition: true)
!715 = distinct !DICompileUnit(language: DW_LANG_C11, file: !716, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !717, globals: !718, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!717 = !{!198, !204}
!718 = !{!719, !721, !740, !742, !744, !746, !713, !748, !750, !752, !754, !759}
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !716, line: 272, type: !409, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "old_file_name", scope: !723, file: !716, line: 304, type: !202, isLocal: true, isDefinition: true)
!723 = distinct !DISubprogram(name: "verror_at_line", scope: !716, file: !716, line: 298, type: !724, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !715, retainedNodes: !733)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !133, !133, !202, !114, !202, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !727, file: !716, baseType: !114, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !727, file: !716, baseType: !114, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !727, file: !716, baseType: !198, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !727, file: !716, baseType: !198, size: 64, offset: 128)
!733 = !{!734, !735, !736, !737, !738, !739}
!734 = !DILocalVariable(name: "status", arg: 1, scope: !723, file: !716, line: 298, type: !133)
!735 = !DILocalVariable(name: "errnum", arg: 2, scope: !723, file: !716, line: 298, type: !133)
!736 = !DILocalVariable(name: "file_name", arg: 3, scope: !723, file: !716, line: 298, type: !202)
!737 = !DILocalVariable(name: "line_number", arg: 4, scope: !723, file: !716, line: 298, type: !114)
!738 = !DILocalVariable(name: "message", arg: 5, scope: !723, file: !716, line: 298, type: !202)
!739 = !DILocalVariable(name: "args", arg: 6, scope: !723, file: !716, line: 298, type: !726)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "old_line_number", scope: !723, file: !716, line: 305, type: !114, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !716, line: 338, type: !416, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !716, line: 346, type: !16, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !716, line: 346, type: !296, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "error_message_count", scope: !715, file: !716, line: 69, type: !114, isLocal: false, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !715, file: !716, line: 295, type: !133, isLocal: false, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !716, line: 208, type: !438, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !716, line: 208, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 21)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !716, line: 214, type: !409, isLocal: true, isDefinition: true)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null}
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "program_name", scope: !766, file: !767, line: 31, type: !202, isLocal: false, isDefinition: true)
!766 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !768, globals: !769, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!768 = !{!198, !197}
!769 = !{!764, !770, !772}
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !767, line: 46, type: !16, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !767, line: 49, type: !416, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "utf07FF", scope: !776, file: !777, line: 46, type: !804, isLocal: true, isDefinition: true)
!776 = distinct !DISubprogram(name: "proper_name_lite", scope: !777, file: !777, line: 38, type: !778, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !780, retainedNodes: !782)
!777 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!778 = !DISubroutineType(types: !779)
!779 = !{!202, !202, !202}
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !781, splitDebugInlining: false, nameTableKind: None)
!781 = !{!774}
!782 = !{!783, !784, !785, !786, !791}
!783 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !776, file: !777, line: 38, type: !202)
!784 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !776, file: !777, line: 38, type: !202)
!785 = !DILocalVariable(name: "translation", scope: !776, file: !777, line: 40, type: !202)
!786 = !DILocalVariable(name: "w", scope: !776, file: !777, line: 47, type: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !788, line: 37, baseType: !789)
!788 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !182, line: 57, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !182, line: 42, baseType: !114)
!791 = !DILocalVariable(name: "mbs", scope: !776, file: !777, line: 48, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !794)
!793 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !796)
!795 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !796, file: !795, line: 15, baseType: !133, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !796, file: !795, line: 20, baseType: !800, size: 32, offset: 32)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !796, file: !795, line: 16, size: 32, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !800, file: !795, line: 18, baseType: !114, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !800, file: !795, line: 19, baseType: !416, size: 32)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 16, elements: !297)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !807, line: 78, type: !16, isLocal: true, isDefinition: true)
!807 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !807, line: 79, type: !26, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !807, line: 80, type: !240, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !807, line: 81, type: !240, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !807, line: 82, type: !398, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !807, line: 83, type: !296, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !807, line: 84, type: !16, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !807, line: 85, type: !438, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !807, line: 86, type: !438, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !807, line: 87, type: !16, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !828, file: !807, line: 76, type: !902, isLocal: false, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !829, retainedTypes: !837, globals: !838, splitDebugInlining: false, nameTableKind: None)
!829 = !{!830, !832, !137}
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !831, line: 42, baseType: !114, size: 32, elements: !154)
!831 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!832 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !831, line: 254, baseType: !114, size: 32, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!835 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!836 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!837 = !{!198, !133, !199, !200}
!838 = !{!805, !808, !810, !812, !814, !816, !818, !820, !822, !824, !826, !839, !843, !853, !855, !860, !862, !864, !866, !868, !891, !898, !900}
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !828, file: !807, line: 92, type: !841, isLocal: false, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 320, elements: !215)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !828, file: !807, line: 1040, type: !845, isLocal: false, isDefinition: true)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !807, line: 56, size: 448, elements: !846)
!846 = !{!847, !848, !849, !851, !852}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !845, file: !807, line: 59, baseType: !830, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !845, file: !807, line: 62, baseType: !133, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !845, file: !807, line: 66, baseType: !850, size: 256, offset: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 256, elements: !17)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !845, file: !807, line: 69, baseType: !202, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !845, file: !807, line: 72, baseType: !202, size: 64, offset: 384)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !828, file: !807, line: 107, type: !845, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "slot0", scope: !828, file: !807, line: 831, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 256)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !807, line: 321, type: !296, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !807, line: 357, type: !296, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !807, line: 358, type: !296, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !807, line: 199, type: !438, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "quote", scope: !870, file: !807, line: 228, type: !889, isLocal: true, isDefinition: true)
!870 = distinct !DISubprogram(name: "gettext_quote", scope: !807, file: !807, line: 197, type: !871, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !828, retainedNodes: !873)
!871 = !DISubroutineType(types: !872)
!872 = !{!202, !202, !830}
!873 = !{!874, !875, !876, !877, !878}
!874 = !DILocalVariable(name: "msgid", arg: 1, scope: !870, file: !807, line: 197, type: !202)
!875 = !DILocalVariable(name: "s", arg: 2, scope: !870, file: !807, line: 197, type: !830)
!876 = !DILocalVariable(name: "translation", scope: !870, file: !807, line: 199, type: !202)
!877 = !DILocalVariable(name: "w", scope: !870, file: !807, line: 229, type: !787)
!878 = !DILocalVariable(name: "mbs", scope: !870, file: !807, line: 230, type: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !881, file: !795, line: 15, baseType: !133, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !881, file: !795, line: 20, baseType: !885, size: 32, offset: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !881, file: !795, line: 16, size: 32, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !885, file: !795, line: 18, baseType: !114, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !885, file: !795, line: 19, baseType: !416, size: 32)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, elements: !890)
!890 = !{!298, !418}
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "slotvec", scope: !828, file: !807, line: 834, type: !893, isLocal: true, isDefinition: true)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !807, line: 823, size: 128, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !894, file: !807, line: 825, baseType: !200, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !894, file: !807, line: 826, baseType: !197, size: 64, offset: 64)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "nslots", scope: !828, file: !807, line: 832, type: !133, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "slotvec0", scope: !828, file: !807, line: 833, type: !894, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 704, elements: !904)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!904 = !{!905}
!905 = !DISubrange(count: 11)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !908, line: 67, type: !502, isLocal: true, isDefinition: true)
!908 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !908, line: 69, type: !438, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !908, line: 83, type: !438, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !908, line: 83, type: !416, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !908, line: 85, type: !296, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !908, line: 88, type: !919, isLocal: true, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 171)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !908, line: 88, type: !924, isLocal: true, isDefinition: true)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 34)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !908, line: 105, type: !479, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !908, line: 109, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 23)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !908, line: 113, type: !551, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !908, line: 120, type: !938, isLocal: true, isDefinition: true)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 32)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !908, line: 127, type: !943, isLocal: true, isDefinition: true)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 36)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !908, line: 134, type: !21, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !908, line: 142, type: !95, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !908, line: 150, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 48)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !908, line: 159, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 52)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !908, line: 170, type: !257, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !908, line: 248, type: !398, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !908, line: 248, type: !484, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !908, line: 254, type: !398, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !908, line: 254, type: !231, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !908, line: 254, type: !21, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !908, line: 259, type: !3, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !908, line: 259, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 29)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !981, file: !982, line: 26, type: !984, isLocal: false, isDefinition: true)
!981 = distinct !DICompileUnit(language: DW_LANG_C11, file: !982, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !983, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!983 = !{!979}
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 376, elements: !557)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "exit_failure", scope: !987, file: !988, line: 24, type: !990, isLocal: false, isDefinition: true)
!987 = distinct !DICompileUnit(language: DW_LANG_C11, file: !988, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !989, splitDebugInlining: false, nameTableKind: None)
!988 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!989 = !{!985}
!990 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !993, line: 34, type: !429, isLocal: true, isDefinition: true)
!993 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !993, line: 34, type: !438, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !993, line: 34, type: !457, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 80, type: !438, isLocal: true, isDefinition: true)
!1000 = !DIFile(filename: "lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1003, file: !1004, line: 506, type: !133, isLocal: true, isDefinition: true)
!1003 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1004, file: !1004, line: 485, type: !1005, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1007, retainedNodes: !1009)
!1004 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!133, !133, !133}
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1004, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!1008 = !{!1001}
!1009 = !{!1010, !1011, !1012, !1013, !1016}
!1010 = !DILocalVariable(name: "fd", arg: 1, scope: !1003, file: !1004, line: 485, type: !133)
!1011 = !DILocalVariable(name: "target", arg: 2, scope: !1003, file: !1004, line: 485, type: !133)
!1012 = !DILocalVariable(name: "result", scope: !1003, file: !1004, line: 487, type: !133)
!1013 = !DILocalVariable(name: "flags", scope: !1014, file: !1004, line: 530, type: !133)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !1004, line: 529, column: 5)
!1015 = distinct !DILexicalBlock(scope: !1003, file: !1004, line: 528, column: 7)
!1016 = !DILocalVariable(name: "saved_errno", scope: !1017, file: !1004, line: 533, type: !133)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !1004, line: 532, column: 9)
!1018 = distinct !DILexicalBlock(scope: !1014, file: !1004, line: 531, column: 11)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !1021, line: 108, type: !209, isLocal: true, isDefinition: true)
!1021 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "internal_state", scope: !1024, file: !1021, line: 97, type: !1027, isLocal: true, isDefinition: true)
!1024 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1021, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1025, globals: !1026, splitDebugInlining: false, nameTableKind: None)
!1025 = !{!198, !200, !204}
!1026 = !{!1019, !1022}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1029, file: !795, line: 15, baseType: !133, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1029, file: !795, line: 20, baseType: !1033, size: 32, offset: 32)
!1033 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1029, file: !795, line: 16, size: 32, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1033, file: !795, line: 18, baseType: !114, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1033, file: !795, line: 19, baseType: !416, size: 32)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 35, type: !26, isLocal: true, isDefinition: true)
!1039 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1040 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1041, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -D HASH_ALGO_BLAKE2=1 -D HAVE_CONFIG_H -I lib -I ./lib -I src -I ./src -g -O2 -MT src/blake2/b2sum-b2sum.o -MD -MP -MF src/blake2/.deps/b2sum-b2sum.Tpo -c src/blake2/b2sum.c -o src/blake2/.b2sum-b2sum.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, globals: !1044, splitDebugInlining: false, nameTableKind: None)
!1041 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0871d6b54d956be5985a128a1aa50d97")
!1042 = !{!1043, !178}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!1044 = !{!1045}
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "buffer_length", scope: !1047, file: !1041, line: 83, type: !1111, isLocal: true, isDefinition: true)
!1047 = distinct !DISubprogram(name: "blake2b_stream", scope: !1041, file: !1041, line: 78, type: !1048, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1040, retainedNodes: !1084)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!133, !1050, !198, !200}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !353, line: 7, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !355, line: 49, size: 1728, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1052, file: !355, line: 51, baseType: !133, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1052, file: !355, line: 54, baseType: !197, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1052, file: !355, line: 55, baseType: !197, size: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1052, file: !355, line: 56, baseType: !197, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1052, file: !355, line: 57, baseType: !197, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1052, file: !355, line: 58, baseType: !197, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1052, file: !355, line: 59, baseType: !197, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1052, file: !355, line: 60, baseType: !197, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1052, file: !355, line: 61, baseType: !197, size: 64, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1052, file: !355, line: 64, baseType: !197, size: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1052, file: !355, line: 65, baseType: !197, size: 64, offset: 640)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1052, file: !355, line: 66, baseType: !197, size: 64, offset: 704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1052, file: !355, line: 68, baseType: !370, size: 64, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1052, file: !355, line: 70, baseType: !1068, size: 64, offset: 832)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1052, file: !355, line: 72, baseType: !133, size: 32, offset: 896)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1052, file: !355, line: 73, baseType: !133, size: 32, offset: 928)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1052, file: !355, line: 74, baseType: !377, size: 64, offset: 960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1052, file: !355, line: 77, baseType: !199, size: 16, offset: 1024)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1052, file: !355, line: 78, baseType: !380, size: 8, offset: 1040)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1052, file: !355, line: 79, baseType: !209, size: 8, offset: 1048)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1052, file: !355, line: 81, baseType: !383, size: 64, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1052, file: !355, line: 89, baseType: !386, size: 64, offset: 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1052, file: !355, line: 91, baseType: !388, size: 64, offset: 1216)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1052, file: !355, line: 92, baseType: !391, size: 64, offset: 1280)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1052, file: !355, line: 93, baseType: !1068, size: 64, offset: 1344)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1052, file: !355, line: 94, baseType: !198, size: 64, offset: 1408)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1052, file: !355, line: 95, baseType: !200, size: 64, offset: 1472)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1052, file: !355, line: 96, baseType: !133, size: 32, offset: 1536)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1052, file: !355, line: 98, baseType: !398, size: 160, offset: 1568)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1091, !1108, !1109, !1110}
!1085 = !DILocalVariable(name: "stream", arg: 1, scope: !1047, file: !1041, line: 78, type: !1050)
!1086 = !DILocalVariable(name: "resstream", arg: 2, scope: !1047, file: !1041, line: 78, type: !198)
!1087 = !DILocalVariable(name: "outbytes", arg: 3, scope: !1047, file: !1041, line: 78, type: !200)
!1088 = !DILocalVariable(name: "ret", scope: !1047, file: !1041, line: 80, type: !133)
!1089 = !DILocalVariable(name: "sum", scope: !1047, file: !1041, line: 81, type: !200)
!1090 = !DILocalVariable(name: "n", scope: !1047, file: !1041, line: 81, type: !200)
!1091 = !DILocalVariable(name: "S", scope: !1047, file: !1041, line: 82, type: !1092)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 1984, elements: !210)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !655, line: 71, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !655, line: 62, size: 1984, elements: !1095)
!1095 = !{!1096, !1098, !1100, !1101, !1105, !1106, !1107}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1094, file: !655, line: 64, baseType: !1097, size: 512)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 512, elements: !17)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1094, file: !655, line: 65, baseType: !1099, size: 128, offset: 512)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 128, elements: !297)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1094, file: !655, line: 66, baseType: !1099, size: 128, offset: 640)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1094, file: !655, line: 67, baseType: !1102, size: 1024, offset: 768)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 1024, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1094, file: !655, line: 68, baseType: !200, size: 64, offset: 1792)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !1094, file: !655, line: 69, baseType: !200, size: 64, offset: 1856)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !1094, file: !655, line: 70, baseType: !665, size: 8, offset: 1920)
!1108 = !DILocalVariable(name: "buffer", scope: !1047, file: !1041, line: 84, type: !1043)
!1109 = !DILabel(scope: !1047, name: "final_process", file: !1041, line: 117)
!1110 = !DILabel(scope: !1047, name: "cleanup_buffer", file: !1041, line: 123)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!1112 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1113, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1114, splitDebugInlining: false, nameTableKind: None)
!1113 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1114 = !{!1115}
!1115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1116, line: 44, baseType: !114, size: 32, elements: !189)
!1116 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!1117 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1118, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1118 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1119 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1120, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1121, splitDebugInlining: false, nameTableKind: None)
!1120 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1121 = !{!198}
!1122 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1123, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fopen-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-fopen-safer.Tpo -c lib/fopen-safer.c -o lib/.libcoreutils_a-fopen-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1123 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1125, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1125 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1127, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1121, splitDebugInlining: false, nameTableKind: None)
!1127 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1128 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1129, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1129 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1130 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1131, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-dup-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-dup-safer.Tpo -c lib/dup-safer.c -o lib/.libcoreutils_a-dup-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1132 = distinct !DICompileUnit(language: DW_LANG_C11, file: !908, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1133, retainedTypes: !1121, globals: !1137, splitDebugInlining: false, nameTableKind: None)
!1133 = !{!1134}
!1134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !908, line: 40, baseType: !114, size: 32, elements: !1135)
!1135 = !{!1136}
!1136 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1137 = !{!906, !909, !911, !913, !915, !917, !922, !927, !929, !934, !936, !941, !946, !948, !950, !955, !960, !962, !964, !966, !968, !970, !972, !974}
!1138 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1139, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1140, retainedTypes: !1170, splitDebugInlining: false, nameTableKind: None)
!1139 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1140 = !{!1141, !1153}
!1141 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1142, file: !1139, line: 188, baseType: !114, size: 32, elements: !1151)
!1142 = distinct !DISubprogram(name: "x2nrealloc", scope: !1139, file: !1139, line: 176, type: !1143, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1138, retainedNodes: !1146)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!198, !198, !1145, !200}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!1146 = !{!1147, !1148, !1149, !1150}
!1147 = !DILocalVariable(name: "p", arg: 1, scope: !1142, file: !1139, line: 176, type: !198)
!1148 = !DILocalVariable(name: "pn", arg: 2, scope: !1142, file: !1139, line: 176, type: !1145)
!1149 = !DILocalVariable(name: "s", arg: 3, scope: !1142, file: !1139, line: 176, type: !200)
!1150 = !DILocalVariable(name: "n", scope: !1142, file: !1139, line: 178, type: !200)
!1151 = !{!1152}
!1152 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1153 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1154, file: !1139, line: 228, baseType: !114, size: 32, elements: !1151)
!1154 = distinct !DISubprogram(name: "xpalloc", scope: !1139, file: !1139, line: 223, type: !1155, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1138, retainedNodes: !1160)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!198, !198, !1157, !1158, !313, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1159, line: 130, baseType: !313)
!1159 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1161 = !DILocalVariable(name: "pa", arg: 1, scope: !1154, file: !1139, line: 223, type: !198)
!1162 = !DILocalVariable(name: "pn", arg: 2, scope: !1154, file: !1139, line: 223, type: !1157)
!1163 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1154, file: !1139, line: 223, type: !1158)
!1164 = !DILocalVariable(name: "n_max", arg: 4, scope: !1154, file: !1139, line: 223, type: !313)
!1165 = !DILocalVariable(name: "s", arg: 5, scope: !1154, file: !1139, line: 223, type: !1158)
!1166 = !DILocalVariable(name: "n0", scope: !1154, file: !1139, line: 230, type: !1158)
!1167 = !DILocalVariable(name: "n", scope: !1154, file: !1139, line: 237, type: !1158)
!1168 = !DILocalVariable(name: "nbytes", scope: !1154, file: !1139, line: 248, type: !1158)
!1169 = !DILocalVariable(name: "adjusted_nbytes", scope: !1154, file: !1139, line: 252, type: !1158)
!1170 = !{!197, !198}
!1171 = distinct !DICompileUnit(language: DW_LANG_C11, file: !993, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1172, splitDebugInlining: false, nameTableKind: None)
!1172 = !{!991, !994, !996}
