; ModuleID = 'src/cat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"cat\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [47 x i8] c"  -A, --show-all           equivalent to -vET\0A\00", align 1, !dbg !22

!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 19)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 647, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 20)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 657, type: !155, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 2)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 699, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 3)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 736, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 30)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 821, type: !233, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 826, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 23)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "infile", scope: !89, file: !2, line: 50, type: !149, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "input_desc", scope: !89, file: !2, line: 53, type: !86, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !92, line: 729, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 56)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !264, file: !92, line: 575, type: !86, isLocal: true, isDefinition: true)
!264 = distinct !DISubprogram(name: "oputs_", scope: !92, file: !92, line: 573, type: !265, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !267)
!265 = !DISubroutineType(cc: DW_CC_nocall, types: !266)
!266 = !{null, !149, !149}
!267 = !{!268, !269, !270, !273, !275, !276, !277, !281, !282, !283, !284, !286, !336, !337, !338, !340, !341}
!268 = !DILocalVariable(name: "program", arg: 1, scope: !264, file: !92, line: 573, type: !149)
!269 = !DILocalVariable(name: "option", arg: 2, scope: !264, file: !92, line: 573, type: !149)
!270 = !DILocalVariable(name: "term", scope: !271, file: !92, line: 585, type: !149)
!271 = distinct !DILexicalBlock(scope: !272, file: !92, line: 582, column: 5)
!272 = distinct !DILexicalBlock(scope: !264, file: !92, line: 581, column: 7)
!273 = !DILocalVariable(name: "double_space", scope: !264, file: !92, line: 594, type: !274)
!274 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!275 = !DILocalVariable(name: "first_word", scope: !264, file: !92, line: 595, type: !149)
!276 = !DILocalVariable(name: "option_text", scope: !264, file: !92, line: 596, type: !149)
!277 = !DILocalVariable(name: "s", scope: !278, file: !92, line: 608, type: !149)
!278 = distinct !DILexicalBlock(scope: !279, file: !92, line: 605, column: 5)
!279 = distinct !DILexicalBlock(scope: !280, file: !92, line: 604, column: 12)
!280 = distinct !DILexicalBlock(scope: !264, file: !92, line: 597, column: 7)
!281 = !DILocalVariable(name: "spaces", scope: !278, file: !92, line: 609, type: !146)
!282 = !DILocalVariable(name: "anchor_len", scope: !264, file: !92, line: 620, type: !146)
!283 = !DILocalVariable(name: "desc_text", scope: !264, file: !92, line: 625, type: !149)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !92, line: 644, type: !149)
!285 = distinct !DILexicalBlock(scope: !264, file: !92, line: 644, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !92, line: 644, type: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !289, line: 7, baseType: !290)
!289 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !291, line: 49, size: 1728, elements: !292)
!291 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !308, !310, !311, !312, !316, !317, !319, !320, !323, !325, !328, !331, !332, !333, !334, !335}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !290, file: !291, line: 51, baseType: !86, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !290, file: !291, line: 54, baseType: !88, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !290, file: !291, line: 55, baseType: !88, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !290, file: !291, line: 56, baseType: !88, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !290, file: !291, line: 57, baseType: !88, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !290, file: !291, line: 58, baseType: !88, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !290, file: !291, line: 59, baseType: !88, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !290, file: !291, line: 60, baseType: !88, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !290, file: !291, line: 61, baseType: !88, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !290, file: !291, line: 64, baseType: !88, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !290, file: !291, line: 65, baseType: !88, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !290, file: !291, line: 66, baseType: !88, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !290, file: !291, line: 68, baseType: !306, size: 64, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !291, line: 36, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !290, file: !291, line: 70, baseType: !309, size: 64, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !290, file: !291, line: 72, baseType: !86, size: 32, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !290, file: !291, line: 73, baseType: !86, size: 32, offset: 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !290, file: !291, line: 74, baseType: !313, size: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !314, line: 152, baseType: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!315 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !290, file: !291, line: 77, baseType: !145, size: 16, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !290, file: !291, line: 78, baseType: !318, size: 8, offset: 1040)
!318 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !290, file: !291, line: 79, baseType: !197, size: 8, offset: 1048)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !290, file: !291, line: 81, baseType: !321, size: 64, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !291, line: 43, baseType: null)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !290, file: !291, line: 89, baseType: !324, size: 64, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !314, line: 153, baseType: !315)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !290, file: !291, line: 91, baseType: !326, size: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !291, line: 37, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !290, file: !291, line: 92, baseType: !329, size: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !291, line: 38, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !290, file: !291, line: 93, baseType: !309, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !290, file: !291, line: 94, baseType: !144, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !290, file: !291, line: 95, baseType: !146, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !290, file: !291, line: 96, baseType: !86, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !290, file: !291, line: 98, baseType: !226, size: 160, offset: 1568)
!336 = !DILocalVariable(name: "__cnt", scope: !285, file: !92, line: 644, type: !146)
!337 = !DILocalVariable(name: "url_program", scope: !264, file: !92, line: 648, type: !149)
!338 = !DILocalVariable(name: "__ptr", scope: !339, file: !92, line: 686, type: !149)
!339 = distinct !DILexicalBlock(scope: !264, file: !92, line: 686, column: 3)
!340 = !DILocalVariable(name: "__stream", scope: !339, file: !92, line: 686, type: !287)
!341 = !DILocalVariable(name: "__cnt", scope: !339, file: !92, line: 686, type: !146)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !92, line: 585, type: !187, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !92, line: 586, type: !187, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !92, line: 595, type: !19, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !92, line: 620, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 6)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !233, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !187, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !19, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !238, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !92, line: 650, type: !187, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !92, line: 652, type: !160, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !92, line: 653, type: !192, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !92, line: 654, type: !175, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !92, line: 655, type: !175, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !92, line: 656, type: !175, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !92, line: 657, type: !175, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !92, line: 663, type: !160, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !92, line: 664, type: !175, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !170, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 40)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 15)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 61)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !92, line: 679, type: !238, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !92, line: 683, type: !187, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !92, line: 688, type: !187, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !92, line: 691, type: !192, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !92, line: 839, type: !155, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !92, line: 840, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 22)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !92, line: 841, type: !392, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !92, line: 862, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !92, line: 868, type: !29, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !92, line: 875, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 27)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 51)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 12)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 312, type: !412, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "newlines2", scope: !89, file: !2, line: 77, type: !86, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "line_num_end", scope: !89, file: !2, line: 74, type: !88, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "line_num_start", scope: !89, file: !2, line: 71, type: !88, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "line_buf", scope: !89, file: !2, line: 59, type: !226, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "line_num_print", scope: !89, file: !2, line: 68, type: !88, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "pending_cr", scope: !89, file: !2, line: 80, type: !274, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !92, line: 952, type: !433, isLocal: true, isDefinition: true)
!452 = !{!453, !454, !455, !456, !491, !492, !493, !494, !495, !496, !497, !498, !499, !504, !505, !506, !507, !508, !509, !511, !512, !513, !518, !521, !522, !525, !527, !528}
!453 = !DILocalVariable(name: "argc", arg: 1, scope: !83, file: !2, line: 550, type: !86)
!454 = !DILocalVariable(name: "argv", arg: 2, scope: !83, file: !2, line: 550, type: !87)
!455 = !DILocalVariable(name: "have_read_stdin", scope: !83, file: !2, line: 553, type: !274)
!456 = !DILocalVariable(name: "ostat_buf", scope: !83, file: !2, line: 555, type: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !458, line: 26, size: 1152, elements: !459)
!458 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!459 = !{!460, !462, !464, !466, !468, !470, !472, !473, !474, !475, !477, !479, !487, !488, !489}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !457, file: !458, line: 31, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !314, line: 145, baseType: !148)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !457, file: !458, line: 36, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !314, line: 148, baseType: !148)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !457, file: !458, line: 44, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !314, line: 151, baseType: !148)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !457, file: !458, line: 45, baseType: !467, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !314, line: 150, baseType: !98)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !457, file: !458, line: 47, baseType: !469, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !314, line: 146, baseType: !98)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !457, file: !458, line: 48, baseType: !471, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !314, line: 147, baseType: !98)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !457, file: !458, line: 50, baseType: !86, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !457, file: !458, line: 52, baseType: !461, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !457, file: !458, line: 57, baseType: !313, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !457, file: !458, line: 61, baseType: !476, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !314, line: 175, baseType: !315)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !457, file: !458, line: 63, baseType: !478, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !314, line: 180, baseType: !315)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !457, file: !458, line: 74, baseType: !480, size: 128, offset: 576)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !481, line: 11, size: 128, elements: !482)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!482 = !{!483, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !480, file: !481, line: 16, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !314, line: 160, baseType: !315)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !480, file: !481, line: 21, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !314, line: 197, baseType: !315)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !457, file: !458, line: 75, baseType: !480, size: 128, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !457, file: !458, line: 76, baseType: !480, size: 128, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !457, file: !458, line: 89, baseType: !490, size: 192, offset: 960)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 192, elements: !239)
!491 = !DILocalVariable(name: "number", scope: !83, file: !2, line: 558, type: !274)
!492 = !DILocalVariable(name: "number_nonblank", scope: !83, file: !2, line: 559, type: !274)
!493 = !DILocalVariable(name: "squeeze_blank", scope: !83, file: !2, line: 560, type: !274)
!494 = !DILocalVariable(name: "show_ends", scope: !83, file: !2, line: 561, type: !274)
!495 = !DILocalVariable(name: "show_nonprinting", scope: !83, file: !2, line: 562, type: !274)
!496 = !DILocalVariable(name: "show_tabs", scope: !83, file: !2, line: 563, type: !274)
!497 = !DILocalVariable(name: "file_open_mode", scope: !83, file: !2, line: 564, type: !86)
!498 = !DILocalVariable(name: "c", scope: !83, file: !2, line: 594, type: !86)
!499 = !DILocalVariable(name: "outsize", scope: !83, file: !2, line: 660, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !501, line: 130, baseType: !502)
!501 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !503, line: 18, baseType: !315)
!503 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!504 = !DILocalVariable(name: "out_flags", scope: !83, file: !2, line: 663, type: !86)
!505 = !DILocalVariable(name: "out_isreg", scope: !83, file: !2, line: 666, type: !274)
!506 = !DILocalVariable(name: "argind", scope: !83, file: !2, line: 677, type: !86)
!507 = !DILocalVariable(name: "ok", scope: !83, file: !2, line: 678, type: !274)
!508 = !DILocalVariable(name: "page_size", scope: !83, file: !2, line: 679, type: !500)
!509 = !DILocalVariable(name: "reading_stdin", scope: !510, file: !2, line: 686, type: !274)
!510 = distinct !DILexicalBlock(scope: !83, file: !2, line: 682, column: 5)
!511 = !DILocalVariable(name: "istat_buf", scope: !510, file: !2, line: 705, type: !457)
!512 = !DILocalVariable(name: "insize", scope: !510, file: !2, line: 714, type: !500)
!513 = !DILocalVariable(name: "in_pos", scope: !514, file: !2, line: 727, type: !516)
!514 = distinct !DILexicalBlock(scope: !515, file: !2, line: 726, column: 9)
!515 = distinct !DILexicalBlock(scope: !510, file: !2, line: 722, column: 11)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !517, line: 63, baseType: !313)
!517 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!518 = !DILocalVariable(name: "whence", scope: !519, file: !2, line: 732, type: !86)
!519 = distinct !DILexicalBlock(scope: !520, file: !2, line: 729, column: 13)
!520 = distinct !DILexicalBlock(scope: !514, file: !2, line: 728, column: 15)
!521 = !DILocalVariable(name: "inbuf", scope: !510, file: !2, line: 745, type: !88)
!522 = !DILocalVariable(name: "copy_cat_status", scope: !523, file: !2, line: 754, type: !86)
!523 = distinct !DILexicalBlock(scope: !524, file: !2, line: 753, column: 9)
!524 = distinct !DILexicalBlock(scope: !510, file: !2, line: 751, column: 11)
!525 = !DILocalVariable(name: "bufsize", scope: !526, file: !2, line: 794, type: !500)
!526 = distinct !DILexicalBlock(scope: !524, file: !2, line: 769, column: 9)
!527 = !DILocalVariable(name: "outbuf", scope: !526, file: !2, line: 799, type: !88)
!528 = !DILabel(scope: !510, name: "contin", file: !2, line: 810)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 2560, elements: !176)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !532, line: 50, size: 256, elements: !533)
!532 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!533 = !{!534, !535, !536, !538}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !532, line: 52, baseType: !149, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !531, file: !532, line: 55, baseType: !86, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !532, line: 56, baseType: !537, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !531, file: !532, line: 57, baseType: !86, size: 32, offset: 192)
!539 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !542, line: 3, type: !392, isLocal: true, isDefinition: true)
!542 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "Version", scope: !545, file: !542, line: 3, type: !149, isLocal: false, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C11, file: !542, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !546, splitDebugInlining: false, nameTableKind: None)
!546 = !{!540, !543}
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "file_name", scope: !549, file: !550, line: 45, type: !149, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C11, file: !550, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !551, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!551 = !{!552, !554, !556, !558, !547, !560}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !550, line: 121, type: !160, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !550, line: 121, type: !433, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !550, line: 123, type: !160, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !550, line: 126, type: !238, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !549, file: !550, line: 55, type: !274, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !564, file: !565, line: 66, type: !610, isLocal: false, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C11, file: !565, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !566, globals: !567, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!566 = !{!144, !151}
!567 = !{!568, !570, !589, !591, !593, !595, !562, !597, !599, !601, !603, !608}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !565, line: 272, type: !187, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "old_file_name", scope: !572, file: !565, line: 304, type: !149, isLocal: true, isDefinition: true)
!572 = distinct !DISubprogram(name: "verror_at_line", scope: !565, file: !565, line: 298, type: !573, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !564, retainedNodes: !582)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !86, !86, !149, !98, !149, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !577)
!577 = !{!578, !579, !580, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !576, file: !565, baseType: !98, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !576, file: !565, baseType: !98, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !576, file: !565, baseType: !144, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !576, file: !565, baseType: !144, size: 64, offset: 128)
!582 = !{!583, !584, !585, !586, !587, !588}
!583 = !DILocalVariable(name: "status", arg: 1, scope: !572, file: !565, line: 298, type: !86)
!584 = !DILocalVariable(name: "errnum", arg: 2, scope: !572, file: !565, line: 298, type: !86)
!585 = !DILocalVariable(name: "file_name", arg: 3, scope: !572, file: !565, line: 298, type: !149)
!586 = !DILocalVariable(name: "line_number", arg: 4, scope: !572, file: !565, line: 298, type: !98)
!587 = !DILocalVariable(name: "message", arg: 5, scope: !572, file: !565, line: 298, type: !149)
!588 = !DILocalVariable(name: "args", arg: 6, scope: !572, file: !565, line: 298, type: !575)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "old_line_number", scope: !572, file: !565, line: 305, type: !98, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !565, line: 338, type: !19, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !565, line: 346, type: !192, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !565, line: 346, type: !233, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "error_message_count", scope: !564, file: !565, line: 69, type: !98, isLocal: false, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !564, file: !565, line: 295, type: !86, isLocal: false, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !565, line: 208, type: !160, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !565, line: 208, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 21)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !565, line: 214, type: !187, isLocal: true, isDefinition: true)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !615, file: !616, line: 506, type: !86, isLocal: true, isDefinition: true)
!615 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !616, file: !616, line: 485, type: !617, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !619, retainedNodes: !621)
!616 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!617 = !DISubroutineType(types: !618)
!618 = !{!86, !86, !86}
!619 = distinct !DICompileUnit(language: DW_LANG_C11, file: !616, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !620, splitDebugInlining: false, nameTableKind: None)
!620 = !{!613}
!621 = !{!622, !623, !624, !625, !628}
!622 = !DILocalVariable(name: "fd", arg: 1, scope: !615, file: !616, line: 485, type: !86)
!623 = !DILocalVariable(name: "target", arg: 2, scope: !615, file: !616, line: 485, type: !86)
!624 = !DILocalVariable(name: "result", scope: !615, file: !616, line: 487, type: !86)
!625 = !DILocalVariable(name: "flags", scope: !626, file: !616, line: 530, type: !86)
!626 = distinct !DILexicalBlock(scope: !627, file: !616, line: 529, column: 5)
!627 = distinct !DILexicalBlock(scope: !615, file: !616, line: 528, column: 7)
!628 = !DILocalVariable(name: "saved_errno", scope: !629, file: !616, line: 533, type: !86)
!629 = distinct !DILexicalBlock(scope: !630, file: !616, line: 532, column: 9)
!630 = distinct !DILexicalBlock(scope: !626, file: !616, line: 531, column: 11)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "program_name", scope: !633, file: !634, line: 31, type: !149, isLocal: false, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C11, file: !634, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, globals: !636, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!635 = !{!144, !88}
!636 = !{!631, !637, !639}
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !634, line: 46, type: !192, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !634, line: 49, type: !19, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "utf07FF", scope: !643, file: !644, line: 46, type: !671, isLocal: true, isDefinition: true)
!643 = distinct !DISubprogram(name: "proper_name_lite", scope: !644, file: !644, line: 38, type: !645, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !647, retainedNodes: !649)
!644 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!645 = !DISubroutineType(types: !646)
!646 = !{!149, !149, !149}
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !648, splitDebugInlining: false, nameTableKind: None)
!648 = !{!641}
!649 = !{!650, !651, !652, !653, !658}
!650 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !643, file: !644, line: 38, type: !149)
!651 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !643, file: !644, line: 38, type: !149)
!652 = !DILocalVariable(name: "translation", scope: !643, file: !644, line: 40, type: !149)
!653 = !DILocalVariable(name: "w", scope: !643, file: !644, line: 47, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !655, line: 37, baseType: !656)
!655 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !314, line: 57, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !314, line: 42, baseType: !98)
!658 = !DILocalVariable(name: "mbs", scope: !643, file: !644, line: 48, type: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !660, line: 6, baseType: !661)
!660 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !662, line: 21, baseType: !663)
!662 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 13, size: 64, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !663, file: !662, line: 15, baseType: !86, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !663, file: !662, line: 20, baseType: !667, size: 32, offset: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !662, line: 16, size: 32, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !667, file: !662, line: 18, baseType: !98, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !667, file: !662, line: 19, baseType: !19, size: 32)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 16, elements: !234)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !674, line: 78, type: !192, isLocal: true, isDefinition: true)
!674 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !674, line: 79, type: !350, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !674, line: 80, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 13)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !674, line: 81, type: !679, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !674, line: 82, type: !226, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !674, line: 83, type: !233, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !674, line: 84, type: !192, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !674, line: 85, type: !160, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !674, line: 86, type: !160, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !674, line: 87, type: !192, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !698, file: !674, line: 76, type: !772, isLocal: false, isDefinition: true)
!698 = distinct !DICompileUnit(language: DW_LANG_C11, file: !674, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !699, retainedTypes: !707, globals: !708, splitDebugInlining: false, nameTableKind: None)
!699 = !{!700, !702, !120}
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !701, line: 42, baseType: !98, size: 32, elements: !99)
!701 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !701, line: 254, baseType: !98, size: 32, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!705 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!706 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!707 = !{!144, !86, !145, !146}
!708 = !{!672, !675, !677, !682, !684, !686, !688, !690, !692, !694, !696, !709, !713, !723, !725, !730, !732, !734, !736, !738, !761, !768, !770}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !698, file: !674, line: 92, type: !711, isLocal: false, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 320, elements: !176)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !698, file: !674, line: 1040, type: !715, isLocal: false, isDefinition: true)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !674, line: 56, size: 448, elements: !716)
!716 = !{!717, !718, !719, !721, !722}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !715, file: !674, line: 59, baseType: !700, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !674, line: 62, baseType: !86, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !715, file: !674, line: 66, baseType: !720, size: 256, offset: 64)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !193)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !715, file: !674, line: 69, baseType: !149, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !715, file: !674, line: 72, baseType: !149, size: 64, offset: 384)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !698, file: !674, line: 107, type: !715, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "slot0", scope: !698, file: !674, line: 831, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 256)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !674, line: 321, type: !233, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !674, line: 357, type: !233, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !674, line: 358, type: !233, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !674, line: 199, type: !160, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "quote", scope: !740, file: !674, line: 228, type: !759, isLocal: true, isDefinition: true)
!740 = distinct !DISubprogram(name: "gettext_quote", scope: !674, file: !674, line: 197, type: !741, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !698, retainedNodes: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!149, !149, !700}
!743 = !{!744, !745, !746, !747, !748}
!744 = !DILocalVariable(name: "msgid", arg: 1, scope: !740, file: !674, line: 197, type: !149)
!745 = !DILocalVariable(name: "s", arg: 2, scope: !740, file: !674, line: 197, type: !700)
!746 = !DILocalVariable(name: "translation", scope: !740, file: !674, line: 199, type: !149)
!747 = !DILocalVariable(name: "w", scope: !740, file: !674, line: 229, type: !654)
!748 = !DILocalVariable(name: "mbs", scope: !740, file: !674, line: 230, type: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !660, line: 6, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !662, line: 21, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 13, size: 64, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !751, file: !662, line: 15, baseType: !86, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !751, file: !662, line: 20, baseType: !755, size: 32, offset: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !751, file: !662, line: 16, size: 32, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !755, file: !662, line: 18, baseType: !98, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !755, file: !662, line: 19, baseType: !19, size: 32)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !760)
!760 = !{!235, !21}
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "slotvec", scope: !698, file: !674, line: 834, type: !763, isLocal: true, isDefinition: true)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !674, line: 823, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !764, file: !674, line: 825, baseType: !146, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !764, file: !674, line: 826, baseType: !88, size: 64, offset: 64)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "nslots", scope: !698, file: !674, line: 832, type: !86, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "slotvec0", scope: !698, file: !674, line: 833, type: !764, isLocal: true, isDefinition: true)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 704, elements: !210)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !776, line: 67, type: !433, isLocal: true, isDefinition: true)
!776 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !776, line: 69, type: !160, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !776, line: 83, type: !160, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !776, line: 83, type: !19, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !776, line: 85, type: !233, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !776, line: 88, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 171)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !776, line: 88, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 34)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !776, line: 105, type: !155, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !776, line: 109, type: !250, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !776, line: 113, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 28)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !776, line: 120, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 32)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !776, line: 127, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 36)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !776, line: 134, type: !387, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !776, line: 142, type: !818, isLocal: true, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 44)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !776, line: 150, type: !823, isLocal: true, isDefinition: true)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 48)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !776, line: 159, type: !44, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !776, line: 170, type: !830, isLocal: true, isDefinition: true)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 60)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !776, line: 248, type: !226, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !776, line: 248, type: !412, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !776, line: 254, type: !226, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !776, line: 254, type: !165, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !776, line: 254, type: !387, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !776, line: 259, type: !3, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !776, line: 259, type: !847, isLocal: true, isDefinition: true)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 29)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !852, file: !853, line: 26, type: !855, isLocal: false, isDefinition: true)
!852 = distinct !DICompileUnit(language: DW_LANG_C11, file: !853, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !854, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!854 = !{!850}
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 376, elements: !25)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "exit_failure", scope: !858, file: !859, line: 24, type: !861, isLocal: false, isDefinition: true)
!858 = distinct !DICompileUnit(language: DW_LANG_C11, file: !859, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !860, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!860 = !{!856}
!861 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !864, line: 34, type: !238, isLocal: true, isDefinition: true)
!864 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !864, line: 34, type: !160, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !864, line: 34, type: !170, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !871, line: 108, type: !197, isLocal: true, isDefinition: true)
!871 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "internal_state", scope: !874, file: !871, line: 97, type: !877, isLocal: true, isDefinition: true)
!874 = distinct !DICompileUnit(language: DW_LANG_C11, file: !871, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !875, globals: !876, splitDebugInlining: false, nameTableKind: None)
!875 = !{!144, !146, !151}
!876 = !{!869, !872}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !660, line: 6, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !662, line: 21, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 13, size: 64, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !879, file: !662, line: 15, baseType: !86, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !879, file: !662, line: 20, baseType: !883, size: 32, offset: 32)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !879, file: !662, line: 16, size: 32, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !883, file: !662, line: 18, baseType: !98, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !883, file: !662, line: 19, baseType: !19, size: 32)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !889, line: 35, type: !350, isLocal: true, isDefinition: true)
!889 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!890 = distinct !DICompileUnit(language: DW_LANG_C11, file: !891, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-copy-file-range.o -MD -MP -MF lib/.deps/libcoreutils_a-copy-file-range.Tpo -c lib/copy-file-range.c -o lib/.libcoreutils_a-copy-file-range.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !892, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "lib/copy-file-range.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6733a97916f50c6b003a01ea6f4c9f0a")
!892 = !{!893}
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !894, line: 36, baseType: !98, size: 32, elements: !141)
!894 = !DIFile(filename: "lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!895 = distinct !DICompileUnit(language: DW_LANG_C11, file: !896, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !897, splitDebugInlining: false, nameTableKind: None)
!896 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!897 = !{!898}
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !899, line: 44, baseType: !98, size: 32, elements: !113)
!899 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!900 = distinct !DICompileUnit(language: DW_LANG_C11, file: !901, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!902 = distinct !DICompileUnit(language: DW_LANG_C11, file: !903, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-full-write.o -MD -MP -MF lib/.deps/libcoreutils_a-full-write.Tpo -c lib/full-write.c -o lib/.libcoreutils_a-full-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !904, splitDebugInlining: false, nameTableKind: None)
!903 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!904 = !{!149}
!905 = distinct !DICompileUnit(language: DW_LANG_C11, file: !906, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!907 = distinct !DICompileUnit(language: DW_LANG_C11, file: !908, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-safe-write.o -MD -MP -MF lib/.deps/libcoreutils_a-safe-write.Tpo -c lib/safe-write.c -o lib/.libcoreutils_a-safe-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !892, retainedTypes: !909, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!909 = !{!146}
!910 = distinct !DICompileUnit(language: DW_LANG_C11, file: !776, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !911, retainedTypes: !915, globals: !916, splitDebugInlining: false, nameTableKind: None)
!911 = !{!912}
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !776, line: 40, baseType: !98, size: 32, elements: !913)
!913 = !{!914}
!914 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!915 = !{!144}
!916 = !{!774, !777, !779, !781, !783, !785, !790, !795, !797, !799, !804, !809, !814, !816, !821, !826, !828, !833, !835, !837, !839, !841, !843, !845}
!917 = distinct !DICompileUnit(language: DW_LANG_C11, file: !918, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalignalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xalignalloc.Tpo -c lib/xalignalloc.c -o lib/.libcoreutils_a-xalignalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !909, splitDebugInlining: false, nameTableKind: None)
!918 = !DIFile(filename: "lib/xalignalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3b950fafb945919ba44141bc7f11141c")
!919 = distinct !DICompileUnit(language: DW_LANG_C11, file: !920, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !921, retainedTypes: !951, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!921 = !{!922, !934}
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !923, file: !920, line: 188, baseType: !98, size: 32, elements: !932)
!923 = distinct !DISubprogram(name: "x2nrealloc", scope: !920, file: !920, line: 176, type: !924, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !919, retainedNodes: !927)
!924 = !DISubroutineType(types: !925)
!925 = !{!144, !144, !926, !146}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!927 = !{!928, !929, !930, !931}
!928 = !DILocalVariable(name: "p", arg: 1, scope: !923, file: !920, line: 176, type: !144)
!929 = !DILocalVariable(name: "pn", arg: 2, scope: !923, file: !920, line: 176, type: !926)
!930 = !DILocalVariable(name: "s", arg: 3, scope: !923, file: !920, line: 176, type: !146)
!931 = !DILocalVariable(name: "n", scope: !923, file: !920, line: 178, type: !146)
!932 = !{!933}
!933 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!934 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !935, file: !920, line: 228, baseType: !98, size: 32, elements: !932)
!935 = distinct !DISubprogram(name: "xpalloc", scope: !920, file: !920, line: 223, type: !936, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !919, retainedNodes: !941)
!936 = !DISubroutineType(types: !937)
!937 = !{!144, !144, !938, !939, !502, !939}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !940, line: 130, baseType: !502)
!940 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !950}
!942 = !DILocalVariable(name: "pa", arg: 1, scope: !935, file: !920, line: 223, type: !144)
!943 = !DILocalVariable(name: "pn", arg: 2, scope: !935, file: !920, line: 223, type: !938)
!944 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !935, file: !920, line: 223, type: !939)
!945 = !DILocalVariable(name: "n_max", arg: 4, scope: !935, file: !920, line: 223, type: !502)
!946 = !DILocalVariable(name: "s", arg: 5, scope: !935, file: !920, line: 223, type: !939)
!947 = !DILocalVariable(name: "n0", scope: !935, file: !920, line: 230, type: !939)
!948 = !DILocalVariable(name: "n", scope: !935, file: !920, line: 237, type: !939)
!949 = !DILocalVariable(name: "nbytes", scope: !935, file: !920, line: 248, type: !939)
!950 = !DILocalVariable(name: "adjusted_nbytes", scope: !935, file: !920, line: 252, type: !939)
!951 = !{!88, !144}
!952 = distinct !DICompileUnit(language: DW_LANG_C11, file: !864, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !953, splitDebugInlining: false, nameTableKind: None)
!953 = !{!862, !865, !867}
!954 = distinct !DICompileUnit(language: DW_LANG_C11, file: !955, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!956 = distinct !DICompileUnit(language: DW_LANG_C11, file: !957, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!958 = distinct !DICompileUnit(language: DW_LANG_C11, file: !959, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !915, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!960 = distinct !DICompileUnit(language: DW_LANG_C11, file: !961, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !915, splitDebugInlining: false, nameTableKind: None)
!961 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!962 = distinct !DICompileUnit(language: DW_LANG_C11, file: !963, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !915, splitDebugInlining: false, nameTableKind: None)
!963 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!964 = distinct !DICompileUnit(language: DW_LANG_C11, file: !889, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !965, splitDebugInlining: false, nameTableKind: None)
!965 = !{!966, !887}
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !889, line: 35, type: !233, isLocal: true, isDefinition: true)
!968 = distinct !DICompileUnit(language: DW_LANG_C11, file: !969, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!969 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!970 = distinct !DICompileUnit(language: DW_LANG_C11, file: !971, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !915, splitDebugInlining: false, nameTableKind: None)
!971 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!972 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!973 = !{i32 7, !"Dwarf Version", i32 5}
!974 = !{i32 2, !"Debug Info Version", i32 3}
!975 = !{i32 1, !"wchar_size", i32 4}
!976 = !{i32 8, !"PIC Level", i32 2}
!977 = !{i32 7, !"PIE Level", i32 2}
!978 = !{i32 7, !"uwtable", i32 2}
!979 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!980 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 83, type: !981, scopeLine: 84, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !86}
!983 = !{!984}
!984 = !DILocalVariable(name: "status", arg: 1, scope: !980, file: !2, line: 83, type: !86)
!985 = !DILocation(line: 0, scope: !980)
!986 = !DILocation(line: 85, column: 14, scope: !987)
!987 = distinct !DILexicalBlock(scope: !980, file: !2, line: 85, column: 7)
!988 = !DILocation(line: 85, column: 7, scope: !980)
!989 = !DILocation(line: 86, column: 5, scope: !990)
!990 = distinct !DILexicalBlock(scope: !987, file: !2, line: 86, column: 5)
!991 = !{!992, !992, i64 0}
!992 = !{!"any pointer", !993, i64 0}
!993 = !{!"omnipotent char", !994, i64 0}
!994 = !{!"Simple C/C++ TBAA"}
!995 = !DILocation(line: 89, column: 7, scope: !996)
!996 = distinct !DILexicalBlock(scope: !987, file: !2, line: 88, column: 5)
!997 = !DILocation(line: 93, column: 7, scope: !996)
!998 = !DILocation(line: 729, column: 3, scope: !999, inlinedAt: !1000)
!999 = distinct !DISubprogram(name: "emit_stdin_note", scope: !92, file: !92, line: 727, type: !611, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89)
!1000 = distinct !DILocation(line: 97, column: 7, scope: !996)
!1001 = !DILocation(line: 99, column: 7, scope: !996)
!1002 = !DILocation(line: 102, column: 7, scope: !996)
!1003 = !DILocation(line: 105, column: 7, scope: !996)
!1004 = !DILocation(line: 108, column: 7, scope: !996)
!1005 = !DILocation(line: 111, column: 7, scope: !996)
!1006 = !DILocation(line: 114, column: 7, scope: !996)
!1007 = !DILocation(line: 117, column: 7, scope: !996)
!1008 = !DILocation(line: 120, column: 7, scope: !996)
!1009 = !DILocation(line: 123, column: 7, scope: !996)
!1010 = !DILocation(line: 126, column: 7, scope: !996)
!1011 = !DILocation(line: 129, column: 7, scope: !996)
!1012 = !DILocation(line: 130, column: 7, scope: !996)
!1013 = !DILocation(line: 131, column: 7, scope: !996)
!1014 = !DILocalVariable(name: "program", arg: 1, scope: !1015, file: !92, line: 836, type: !149)
!1015 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !92, file: !92, line: 836, type: !1016, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1018)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null, !149}
!1018 = !{!1014, !1019, !1026, !1027, !1029, !1030}
!1019 = !DILocalVariable(name: "infomap", scope: !1015, file: !92, line: 838, type: !1020)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 896, elements: !161)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1015, file: !92, line: 838, size: 128, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1022, file: !92, line: 838, baseType: !149, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1022, file: !92, line: 838, baseType: !149, size: 64, offset: 64)
!1026 = !DILocalVariable(name: "node", scope: !1015, file: !92, line: 848, type: !149)
!1027 = !DILocalVariable(name: "map_prog", scope: !1015, file: !92, line: 849, type: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1029 = !DILocalVariable(name: "lc_messages", scope: !1015, file: !92, line: 861, type: !149)
!1030 = !DILocalVariable(name: "url_program", scope: !1015, file: !92, line: 874, type: !149)
!1031 = !DILocation(line: 0, scope: !1015, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 138, column: 7, scope: !996)
!1033 = !{}
!1034 = !DILocation(line: 857, column: 3, scope: !1015, inlinedAt: !1032)
!1035 = !DILocation(line: 861, column: 29, scope: !1015, inlinedAt: !1032)
!1036 = !DILocation(line: 862, column: 7, scope: !1037, inlinedAt: !1032)
!1037 = distinct !DILexicalBlock(scope: !1015, file: !92, line: 862, column: 7)
!1038 = !DILocation(line: 862, column: 19, scope: !1037, inlinedAt: !1032)
!1039 = !DILocation(line: 862, column: 22, scope: !1037, inlinedAt: !1032)
!1040 = !DILocation(line: 862, column: 7, scope: !1015, inlinedAt: !1032)
!1041 = !DILocation(line: 868, column: 7, scope: !1042, inlinedAt: !1032)
!1042 = distinct !DILexicalBlock(scope: !1037, file: !92, line: 863, column: 5)
!1043 = !DILocation(line: 870, column: 5, scope: !1042, inlinedAt: !1032)
!1044 = !DILocation(line: 875, column: 3, scope: !1015, inlinedAt: !1032)
!1045 = !DILocation(line: 877, column: 3, scope: !1015, inlinedAt: !1032)
!1046 = !DILocation(line: 140, column: 3, scope: !980)
!1047 = !DISubprogram(name: "dcgettext", scope: !1048, file: !1048, line: 51, type: !1049, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1048 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!88, !149, !149, !86}
!1051 = !DISubprogram(name: "__fprintf_chk", scope: !1052, file: !1052, line: 93, type: !1053, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1052 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!86, !1055, !86, !1056, null}
!1055 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !287)
!1056 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !149)
!1057 = !DISubprogram(name: "__printf_chk", scope: !1052, file: !1052, line: 95, type: !1058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!86, !86, !1056, null}
!1060 = !DISubprogram(name: "fputs_unlocked", scope: !517, file: !517, line: 691, type: !1061, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!86, !1056, !1055}
!1063 = !DILocation(line: 0, scope: !264)
!1064 = !DILocation(line: 581, column: 7, scope: !272)
!1065 = !{!1066, !1066, i64 0}
!1066 = !{!"int", !993, i64 0}
!1067 = !DILocation(line: 581, column: 19, scope: !272)
!1068 = !DILocation(line: 581, column: 7, scope: !264)
!1069 = !DILocation(line: 585, column: 26, scope: !271)
!1070 = !DILocation(line: 0, scope: !271)
!1071 = !DILocation(line: 586, column: 23, scope: !271)
!1072 = !DILocation(line: 586, column: 28, scope: !271)
!1073 = !DILocation(line: 586, column: 32, scope: !271)
!1074 = !{!993, !993, i64 0}
!1075 = !DILocation(line: 586, column: 38, scope: !271)
!1076 = !DILocalVariable(name: "__s1", arg: 1, scope: !1077, file: !1078, line: 1359, type: !149)
!1077 = distinct !DISubprogram(name: "streq", scope: !1078, file: !1078, line: 1359, type: !1079, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1081)
!1078 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!274, !149, !149}
!1081 = !{!1076, !1082}
!1082 = !DILocalVariable(name: "__s2", arg: 2, scope: !1077, file: !1078, line: 1359, type: !149)
!1083 = !DILocation(line: 0, scope: !1077, inlinedAt: !1084)
!1084 = distinct !DILocation(line: 586, column: 41, scope: !271)
!1085 = !DILocation(line: 1361, column: 11, scope: !1077, inlinedAt: !1084)
!1086 = !DILocation(line: 1361, column: 10, scope: !1077, inlinedAt: !1084)
!1087 = !DILocation(line: 586, column: 19, scope: !271)
!1088 = !DILocation(line: 587, column: 5, scope: !271)
!1089 = !DILocation(line: 588, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !264, file: !92, line: 588, column: 7)
!1091 = !DILocation(line: 588, column: 7, scope: !264)
!1092 = !DILocation(line: 590, column: 7, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1090, file: !92, line: 589, column: 5)
!1094 = !DILocation(line: 591, column: 7, scope: !1093)
