; ModuleID = 'src/chmod.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.12 }
%union.anon.12 = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 465, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 75)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 10)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 24)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 498, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 72)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "long_options", scope: !109, file: !2, line: 106, type: !589, isLocal: true, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/chmod.o -MD -MP -MF src/.deps/chmod.Tpo -c src/chmod.c -o src/.chmod.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !174, globals: !184, splitDebugInlining: false, nameTableKind: None)
!110 = !{!111, !118, !123, !129, !143, !158}
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 98, baseType: !112, size: 32, elements: !113)
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !{!114, !115, !116, !117}
!114 = !DIEnumerator(name: "DEREFERENCE_OPTION", value: 128)
!115 = !DIEnumerator(name: "NO_PRESERVE_ROOT", value: 129)
!116 = !DIEnumerator(name: "PRESERVE_ROOT", value: 130)
!117 = !DIEnumerator(name: "REFERENCE_FILE_OPTION", value: 131)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !2, line: 56, baseType: !112, size: 32, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIEnumerator(name: "V_high", value: 0)
!121 = !DIEnumerator(name: "V_changes_only", value: 1)
!122 = !DIEnumerator(name: "V_off", value: 2)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 337, baseType: !125, size: 32, elements: !126)
!124 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!128 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !130, line: 42, baseType: !112, size: 32, elements: !131)
!130 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
!132 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!133 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!134 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!135 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!136 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!137 = !DIEnumerator(name: "c_quoting_style", value: 5)
!138 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!139 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!140 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!141 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!142 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 46, baseType: !112, size: 32, elements: !145)
!144 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!146 = !DIEnumerator(name: "_ISupper", value: 256)
!147 = !DIEnumerator(name: "_ISlower", value: 512)
!148 = !DIEnumerator(name: "_ISalpha", value: 1024)
!149 = !DIEnumerator(name: "_ISdigit", value: 2048)
!150 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!151 = !DIEnumerator(name: "_ISspace", value: 8192)
!152 = !DIEnumerator(name: "_ISprint", value: 16384)
!153 = !DIEnumerator(name: "_ISgraph", value: 32768)
!154 = !DIEnumerator(name: "_ISblank", value: 1)
!155 = !DIEnumerator(name: "_IScntrl", value: 2)
!156 = !DIEnumerator(name: "_ISpunct", value: 4)
!157 = !DIEnumerator(name: "_ISalnum", value: 8)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !159, file: !2, line: 43, baseType: !112, size: 32, elements: !168)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "change_status", file: !2, line: 41, size: 96, elements: !160)
!160 = !{!161, !162, !167}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !159, file: !2, line: 51, baseType: !158, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "old_mode", scope: !159, file: !2, line: 52, baseType: !163, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !164, line: 69, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !166, line: 150, baseType: !112)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "new_mode", scope: !159, file: !2, line: 53, baseType: !163, size: 32, offset: 64)
!168 = !{!169, !170, !171, !172, !173}
!169 = !DIEnumerator(name: "CH_NO_STAT", value: 0)
!170 = !DIEnumerator(name: "CH_FAILED", value: 1)
!171 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 2)
!172 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3)
!173 = !DIEnumerator(name: "CH_SUCCEEDED", value: 4)
!174 = !{!175, !176, !125, !177, !178, !181, !183}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 18, baseType: !180)
!179 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!180 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !102, !185, !190, !195, !200, !205, !210, !212, !217, !222, !227, !266, !271, !276, !278, !280, !282, !284, !287, !367, !372, !374, !379, !381, !383, !385, !387, !389, !391, !393, !395, !400, !405, !407, !409, !411, !413, !415, !417, !419, !424, !429, !434, !436, !438, !440, !442, !447, !452, !454, !459, !461, !466, !468, !470, !472, !477, !479, !484, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !506, !107, !508, !510, !512, !514, !516, !518, !520, !522, !527, !529, !534, !539, !544, !549, !551, !556, !561, !566, !571, !573, !578, !580, !582, !584}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 14)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 16)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 13)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 42)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 613, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 44)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 626, type: !192, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 628, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 25)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 636, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 31)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 644, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 17)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !229, file: !2, line: 652, type: !257, isLocal: true, isDefinition: true)
!229 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 478, type: !230, scopeLine: 479, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !109, retainedNodes: !233)
!230 = !DISubroutineType(types: !231)
!231 = !{!125, !125, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!233 = !{!234, !235, !236, !237, !243, !244, !246, !247, !248, !249, !250, !254, !255, !256}
!234 = !DILocalVariable(name: "argc", arg: 1, scope: !229, file: !2, line: 478, type: !125)
!235 = !DILocalVariable(name: "argv", arg: 2, scope: !229, file: !2, line: 478, type: !232)
!236 = !DILocalVariable(name: "mode", scope: !229, file: !2, line: 480, type: !175)
!237 = !DILocalVariable(name: "mode_len", scope: !229, file: !2, line: 481, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !239, line: 130, baseType: !240)
!239 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !241, line: 18, baseType: !242)
!241 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!242 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!243 = !DILocalVariable(name: "mode_alloc", scope: !229, file: !2, line: 482, type: !238)
!244 = !DILocalVariable(name: "ok", scope: !229, file: !2, line: 483, type: !245)
!245 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!246 = !DILocalVariable(name: "preserve_root", scope: !229, file: !2, line: 484, type: !245)
!247 = !DILocalVariable(name: "reference_file", scope: !229, file: !2, line: 485, type: !181)
!248 = !DILocalVariable(name: "c", scope: !229, file: !2, line: 486, type: !125)
!249 = !DILocalVariable(name: "bit_flags", scope: !229, file: !2, line: 487, type: !125)
!250 = !DILocalVariable(name: "arg", scope: !251, file: !2, line: 552, type: !181)
!251 = distinct !DILexicalBlock(scope: !252, file: !2, line: 546, column: 11)
!252 = distinct !DILexicalBlock(scope: !253, file: !2, line: 504, column: 9)
!253 = distinct !DILexicalBlock(scope: !229, file: !2, line: 502, column: 5)
!254 = !DILocalVariable(name: "arg_len", scope: !251, file: !2, line: 553, type: !238)
!255 = !DILocalVariable(name: "mode_comma_len", scope: !251, file: !2, line: 554, type: !238)
!256 = !DILocalVariable(name: "new_mode_len", scope: !251, file: !2, line: 555, type: !238)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !258, line: 30, size: 128, elements: !259)
!258 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !257, file: !258, line: 32, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !164, line: 47, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !166, line: 148, baseType: !180)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !257, file: !258, line: 33, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !164, line: 59, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !166, line: 145, baseType: !180)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 2)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "change", scope: !109, file: !2, line: 69, type: !273, isLocal: true, isDefinition: true)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !275, line: 35, flags: DIFlagFwdDecl)
!275 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "umask_value", scope: !109, file: !2, line: 72, type: !163, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "recurse", scope: !109, file: !2, line: 75, type: !245, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "force_silent", scope: !109, file: !2, line: 82, type: !245, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !109, file: !2, line: 87, type: !245, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !109, file: !2, line: 94, type: !286, isLocal: true, isDefinition: true)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !289, file: !124, line: 575, type: !125, isLocal: true, isDefinition: true)
!289 = distinct !DISubprogram(name: "oputs_", scope: !124, file: !124, line: 573, type: !290, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !109, retainedNodes: !292)
!290 = !DISubroutineType(cc: DW_CC_nocall, types: !291)
!291 = !{null, !181, !181}
!292 = !{!293, !294, !295, !298, !299, !300, !301, !305, !306, !307, !308, !310, !361, !362, !363, !365, !366}
!293 = !DILocalVariable(name: "program", arg: 1, scope: !289, file: !124, line: 573, type: !181)
!294 = !DILocalVariable(name: "option", arg: 2, scope: !289, file: !124, line: 573, type: !181)
!295 = !DILocalVariable(name: "term", scope: !296, file: !124, line: 585, type: !181)
!296 = distinct !DILexicalBlock(scope: !297, file: !124, line: 582, column: 5)
!297 = distinct !DILexicalBlock(scope: !289, file: !124, line: 581, column: 7)
!298 = !DILocalVariable(name: "double_space", scope: !289, file: !124, line: 594, type: !245)
!299 = !DILocalVariable(name: "first_word", scope: !289, file: !124, line: 595, type: !181)
!300 = !DILocalVariable(name: "option_text", scope: !289, file: !124, line: 596, type: !181)
!301 = !DILocalVariable(name: "s", scope: !302, file: !124, line: 608, type: !181)
!302 = distinct !DILexicalBlock(scope: !303, file: !124, line: 605, column: 5)
!303 = distinct !DILexicalBlock(scope: !304, file: !124, line: 604, column: 12)
!304 = distinct !DILexicalBlock(scope: !289, file: !124, line: 597, column: 7)
!305 = !DILocalVariable(name: "spaces", scope: !302, file: !124, line: 609, type: !178)
!306 = !DILocalVariable(name: "anchor_len", scope: !289, file: !124, line: 620, type: !178)
!307 = !DILocalVariable(name: "desc_text", scope: !289, file: !124, line: 625, type: !181)
!308 = !DILocalVariable(name: "__ptr", scope: !309, file: !124, line: 644, type: !181)
!309 = distinct !DILexicalBlock(scope: !289, file: !124, line: 644, column: 3)
!310 = !DILocalVariable(name: "__stream", scope: !309, file: !124, line: 644, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !313, line: 7, baseType: !314)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !315, line: 49, size: 1728, elements: !316)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !332, !334, !335, !336, !338, !339, !341, !342, !345, !347, !350, !353, !354, !355, !356, !357}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !314, file: !315, line: 51, baseType: !125, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !314, file: !315, line: 54, baseType: !175, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !314, file: !315, line: 55, baseType: !175, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !314, file: !315, line: 56, baseType: !175, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !314, file: !315, line: 57, baseType: !175, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !314, file: !315, line: 58, baseType: !175, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !314, file: !315, line: 59, baseType: !175, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !314, file: !315, line: 60, baseType: !175, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !314, file: !315, line: 61, baseType: !175, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !314, file: !315, line: 64, baseType: !175, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !314, file: !315, line: 65, baseType: !175, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !314, file: !315, line: 66, baseType: !175, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !314, file: !315, line: 68, baseType: !330, size: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !315, line: 36, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !314, file: !315, line: 70, baseType: !333, size: 64, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !314, file: !315, line: 72, baseType: !125, size: 32, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !314, file: !315, line: 73, baseType: !125, size: 32, offset: 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !314, file: !315, line: 74, baseType: !337, size: 64, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !166, line: 152, baseType: !242)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !314, file: !315, line: 77, baseType: !177, size: 16, offset: 1024)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !314, file: !315, line: 78, baseType: !340, size: 8, offset: 1040)
!340 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !314, file: !315, line: 79, baseType: !89, size: 8, offset: 1048)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !314, file: !315, line: 81, baseType: !343, size: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !315, line: 43, baseType: null)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !314, file: !315, line: 89, baseType: !346, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !166, line: 153, baseType: !242)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !314, file: !315, line: 91, baseType: !348, size: 64, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !315, line: 37, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !314, file: !315, line: 92, baseType: !351, size: 64, offset: 1280)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !315, line: 38, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !314, file: !315, line: 93, baseType: !333, size: 64, offset: 1344)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !314, file: !315, line: 94, baseType: !176, size: 64, offset: 1408)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !314, file: !315, line: 95, baseType: !178, size: 64, offset: 1472)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !314, file: !315, line: 96, baseType: !125, size: 32, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !314, file: !315, line: 98, baseType: !358, size: 160, offset: 1568)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DILocalVariable(name: "__cnt", scope: !309, file: !124, line: 644, type: !178)
!362 = !DILocalVariable(name: "url_program", scope: !289, file: !124, line: 648, type: !181)
!363 = !DILocalVariable(name: "__ptr", scope: !364, file: !124, line: 686, type: !181)
!364 = distinct !DILexicalBlock(scope: !289, file: !124, line: 686, column: 3)
!365 = !DILocalVariable(name: "__stream", scope: !364, file: !124, line: 686, type: !311)
!366 = !DILocalVariable(name: "__cnt", scope: !364, file: !124, line: 686, type: !178)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !124, line: 585, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 5)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !124, line: 586, type: !369, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !124, line: 595, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 4)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !124, line: 620, type: !19, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !268, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !369, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !376, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !69, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !124, line: 650, type: !369, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !19, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !19, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !124, line: 652, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 7)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !124, line: 653, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 8)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !124, line: 654, type: !94, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !124, line: 655, type: !94, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !124, line: 656, type: !94, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !124, line: 657, type: !94, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !124, line: 663, type: !397, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !124, line: 664, type: !94, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !224, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 40)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 15)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 61)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !124, line: 679, type: !69, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !124, line: 683, type: !369, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !124, line: 688, type: !369, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !124, line: 691, type: !402, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !124, line: 801, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1464, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 183)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !124, line: 808, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 83)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !124, line: 812, type: !34, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !124, line: 816, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 51)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !124, line: 839, type: !192, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !124, line: 840, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 22)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !124, line: 841, type: !426, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !124, line: 862, type: !376, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !124, line: 868, type: !34, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !124, line: 875, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 27)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !456, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 12)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !402, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !481, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !94, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !426, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !224, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !187, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !19, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !94, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !397, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !402, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !369, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !402, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "dereference", scope: !109, file: !2, line: 79, type: !125, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "verbosity", scope: !109, file: !2, line: 90, type: !118, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !2, line: 388, type: !192, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !2, line: 399, type: !224, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 239, type: !224, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !69, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 250, type: !214, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 38)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !463, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 186)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 45)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 58)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 49)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !474, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 35)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 29)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 56)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 26)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !74, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 59)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !553, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !268, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !481, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 520, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 65)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 3328, elements: !198)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !592, line: 50, size: 256, elements: !593)
!592 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!593 = !{!594, !595, !596, !598}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !591, file: !592, line: 52, baseType: !181, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !591, file: !592, line: 55, baseType: !125, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !591, file: !592, line: 56, baseType: !597, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !591, file: !592, line: 57, baseType: !125, size: 32, offset: 192)
!599 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!600 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!601 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !604, line: 3, type: !426, isLocal: true, isDefinition: true)
!604 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "Version", scope: !607, file: !604, line: 3, type: !181, isLocal: false, isDefinition: true)
!607 = distinct !DICompileUnit(language: DW_LANG_C11, file: !604, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !608, splitDebugInlining: false, nameTableKind: None)
!608 = !{!602, !605}
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "file_name", scope: !611, file: !612, line: 45, type: !181, isLocal: true, isDefinition: true)
!611 = distinct !DICompileUnit(language: DW_LANG_C11, file: !612, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !613, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!613 = !{!614, !616, !618, !620, !609, !622}
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !612, line: 121, type: !397, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !612, line: 121, type: !481, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !612, line: 123, type: !397, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !612, line: 126, type: !69, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !611, file: !612, line: 55, type: !245, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !626, file: !627, line: 66, type: !672, isLocal: false, isDefinition: true)
!626 = distinct !DICompileUnit(language: DW_LANG_C11, file: !627, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !628, globals: !629, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!628 = !{!176, !183}
!629 = !{!630, !632, !651, !653, !655, !657, !624, !659, !661, !663, !665, !670}
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !627, line: 272, type: !369, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "old_file_name", scope: !634, file: !627, line: 304, type: !181, isLocal: true, isDefinition: true)
!634 = distinct !DISubprogram(name: "verror_at_line", scope: !627, file: !627, line: 298, type: !635, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !626, retainedNodes: !644)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !125, !125, !181, !112, !181, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !638, file: !627, baseType: !112, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !638, file: !627, baseType: !112, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !638, file: !627, baseType: !176, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !638, file: !627, baseType: !176, size: 64, offset: 128)
!644 = !{!645, !646, !647, !648, !649, !650}
!645 = !DILocalVariable(name: "status", arg: 1, scope: !634, file: !627, line: 298, type: !125)
!646 = !DILocalVariable(name: "errnum", arg: 2, scope: !634, file: !627, line: 298, type: !125)
!647 = !DILocalVariable(name: "file_name", arg: 3, scope: !634, file: !627, line: 298, type: !181)
!648 = !DILocalVariable(name: "line_number", arg: 4, scope: !634, file: !627, line: 298, type: !112)
!649 = !DILocalVariable(name: "message", arg: 5, scope: !634, file: !627, line: 298, type: !181)
!650 = !DILocalVariable(name: "args", arg: 6, scope: !634, file: !627, line: 298, type: !637)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "old_line_number", scope: !634, file: !627, line: 305, type: !112, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !627, line: 338, type: !376, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !627, line: 346, type: !402, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !627, line: 346, type: !268, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "error_message_count", scope: !626, file: !627, line: 69, type: !112, isLocal: false, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !626, file: !627, line: 295, type: !125, isLocal: false, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !627, line: 208, type: !397, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !627, line: 208, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 21)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !627, line: 214, type: !369, isLocal: true, isDefinition: true)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null}
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !677, line: 399, type: !268, isLocal: true, isDefinition: true)
!677 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !677, line: 441, type: !89, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !677, line: 1080, type: !69, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !684, line: 226, type: !99, isLocal: true, isDefinition: true)
!684 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !684, line: 227, type: !99, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !684, line: 228, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 33)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !684, line: 231, type: !99, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "default_tuning", scope: !696, file: !684, line: 134, type: !700, isLocal: true, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !684, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !697, globals: !699, splitDebugInlining: false, nameTableKind: None)
!697 = !{!180, !176, !698, !178}
!698 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!699 = !{!682, !685, !687, !692, !694}
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !702, line: 52, baseType: !703)
!702 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !702, line: 40, size: 160, elements: !704)
!704 = !{!705, !706, !707, !708, !709}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !703, file: !702, line: 45, baseType: !698, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !703, file: !702, line: 46, baseType: !698, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !703, file: !702, line: 47, baseType: !698, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !703, file: !702, line: 48, baseType: !698, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !703, file: !702, line: 49, baseType: !245, size: 8, offset: 128)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "program_name", scope: !712, file: !713, line: 31, type: !181, isLocal: false, isDefinition: true)
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !714, globals: !715, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!714 = !{!176, !175}
!715 = !{!710, !716, !718}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !713, line: 46, type: !402, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !713, line: 49, type: !376, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "utf07FF", scope: !722, file: !723, line: 46, type: !750, isLocal: true, isDefinition: true)
!722 = distinct !DISubprogram(name: "proper_name_lite", scope: !723, file: !723, line: 38, type: !724, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !726, retainedNodes: !728)
!723 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!724 = !DISubroutineType(types: !725)
!725 = !{!181, !181, !181}
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !727, splitDebugInlining: false, nameTableKind: None)
!727 = !{!720}
!728 = !{!729, !730, !731, !732, !737}
!729 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !722, file: !723, line: 38, type: !181)
!730 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !722, file: !723, line: 38, type: !181)
!731 = !DILocalVariable(name: "translation", scope: !722, file: !723, line: 40, type: !181)
!732 = !DILocalVariable(name: "w", scope: !722, file: !723, line: 47, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !734, line: 37, baseType: !735)
!734 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !166, line: 57, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !166, line: 42, baseType: !112)
!737 = !DILocalVariable(name: "mbs", scope: !722, file: !723, line: 48, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !739, line: 6, baseType: !740)
!739 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !741, line: 21, baseType: !742)
!741 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 13, size: 64, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !742, file: !741, line: 15, baseType: !125, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !742, file: !741, line: 20, baseType: !746, size: 32, offset: 32)
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !742, file: !741, line: 16, size: 32, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !746, file: !741, line: 18, baseType: !112, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !746, file: !741, line: 19, baseType: !376, size: 32)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 16, elements: !269)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !753, line: 78, type: !402, isLocal: true, isDefinition: true)
!753 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !753, line: 79, type: !19, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !753, line: 80, type: !197, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !753, line: 81, type: !197, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !753, line: 82, type: !358, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !753, line: 83, type: !268, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !753, line: 84, type: !402, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !753, line: 85, type: !397, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !753, line: 86, type: !397, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !753, line: 87, type: !402, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !774, file: !753, line: 76, type: !848, isLocal: false, isDefinition: true)
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !753, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !775, retainedTypes: !783, globals: !784, splitDebugInlining: false, nameTableKind: None)
!775 = !{!776, !778, !143}
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !777, line: 42, baseType: !112, size: 32, elements: !131)
!777 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!778 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !777, line: 254, baseType: !112, size: 32, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!781 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!782 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!783 = !{!176, !125, !177, !178}
!784 = !{!751, !754, !756, !758, !760, !762, !764, !766, !768, !770, !772, !785, !789, !799, !801, !806, !808, !810, !812, !814, !837, !844, !846}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !774, file: !753, line: 92, type: !787, isLocal: false, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 320, elements: !95)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !774, file: !753, line: 1040, type: !791, isLocal: false, isDefinition: true)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !753, line: 56, size: 448, elements: !792)
!792 = !{!793, !794, !795, !797, !798}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !791, file: !753, line: 59, baseType: !776, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !791, file: !753, line: 62, baseType: !125, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !791, file: !753, line: 66, baseType: !796, size: 256, offset: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, elements: !403)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !791, file: !753, line: 69, baseType: !181, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !791, file: !753, line: 72, baseType: !181, size: 64, offset: 384)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !774, file: !753, line: 107, type: !791, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "slot0", scope: !774, file: !753, line: 831, type: !803, isLocal: true, isDefinition: true)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 256)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !753, line: 321, type: !268, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !753, line: 357, type: !268, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !753, line: 358, type: !268, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !753, line: 199, type: !397, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "quote", scope: !816, file: !753, line: 228, type: !835, isLocal: true, isDefinition: true)
!816 = distinct !DISubprogram(name: "gettext_quote", scope: !753, file: !753, line: 197, type: !817, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !774, retainedNodes: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{!181, !181, !776}
!819 = !{!820, !821, !822, !823, !824}
!820 = !DILocalVariable(name: "msgid", arg: 1, scope: !816, file: !753, line: 197, type: !181)
!821 = !DILocalVariable(name: "s", arg: 2, scope: !816, file: !753, line: 197, type: !776)
!822 = !DILocalVariable(name: "translation", scope: !816, file: !753, line: 199, type: !181)
!823 = !DILocalVariable(name: "w", scope: !816, file: !753, line: 229, type: !733)
!824 = !DILocalVariable(name: "mbs", scope: !816, file: !753, line: 230, type: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !739, line: 6, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !741, line: 21, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 13, size: 64, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !827, file: !741, line: 15, baseType: !125, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !827, file: !741, line: 20, baseType: !831, size: 32, offset: 32)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !827, file: !741, line: 16, size: 32, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !831, file: !741, line: 18, baseType: !112, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !831, file: !741, line: 19, baseType: !376, size: 32)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 64, elements: !836)
!836 = !{!270, !378}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "slotvec", scope: !774, file: !753, line: 834, type: !839, isLocal: true, isDefinition: true)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !753, line: 823, size: 128, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !840, file: !753, line: 825, baseType: !178, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !840, file: !753, line: 826, baseType: !175, size: 64, offset: 64)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "nslots", scope: !774, file: !753, line: 832, type: !125, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "slotvec0", scope: !774, file: !753, line: 833, type: !840, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 704, elements: !850)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!850 = !{!851}
!851 = !DISubrange(count: 11)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !854, line: 32, type: !268, isLocal: true, isDefinition: true)
!854 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !857, line: 67, type: !481, isLocal: true, isDefinition: true)
!857 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !857, line: 69, type: !397, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !857, line: 83, type: !397, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !857, line: 83, type: !376, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !857, line: 85, type: !268, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !857, line: 88, type: !868, isLocal: true, isDefinition: true)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 171)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !857, line: 88, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 34)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !857, line: 105, type: !192, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !857, line: 109, type: !880, isLocal: true, isDefinition: true)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 23)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !857, line: 113, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 28)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !857, line: 120, type: !890, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 32)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !857, line: 127, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 36)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !857, line: 134, type: !421, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !857, line: 142, type: !207, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !857, line: 150, type: !904, isLocal: true, isDefinition: true)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 48)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !857, line: 159, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 52)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !857, line: 170, type: !914, isLocal: true, isDefinition: true)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 60)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !857, line: 248, type: !358, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !857, line: 248, type: !463, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !857, line: 254, type: !358, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !857, line: 254, type: !187, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !857, line: 254, type: !421, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !857, line: 259, type: !3, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !857, line: 259, type: !558, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !933, file: !934, line: 26, type: !936, isLocal: false, isDefinition: true)
!933 = distinct !DICompileUnit(language: DW_LANG_C11, file: !934, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !935, splitDebugInlining: false, nameTableKind: None)
!934 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!935 = !{!931}
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 376, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 47)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "exit_failure", scope: !941, file: !942, line: 24, type: !944, isLocal: false, isDefinition: true)
!941 = distinct !DICompileUnit(language: DW_LANG_C11, file: !942, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !943, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!943 = !{!939}
!944 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !125)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !947, line: 34, type: !69, isLocal: true, isDefinition: true)
!947 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !947, line: 34, type: !397, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !947, line: 34, type: !224, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !954, line: 40, type: !558, isLocal: true, isDefinition: true)
!954 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !954, line: 40, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !850)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !954, line: 40, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 624, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 78)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !965, line: 59, type: !99, isLocal: true, isDefinition: true)
!965 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !965, line: 59, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 18)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !965, line: 59, type: !973, isLocal: true, isDefinition: true)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 536, elements: !55)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !976, file: !977, line: 506, type: !125, isLocal: true, isDefinition: true)
!976 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !977, file: !977, line: 485, type: !978, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !980, retainedNodes: !982)
!977 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!978 = !DISubroutineType(types: !979)
!979 = !{!125, !125, !125}
!980 = distinct !DICompileUnit(language: DW_LANG_C11, file: !977, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !981, splitDebugInlining: false, nameTableKind: None)
!981 = !{!974}
!982 = !{!983, !984, !985, !986, !989}
!983 = !DILocalVariable(name: "fd", arg: 1, scope: !976, file: !977, line: 485, type: !125)
!984 = !DILocalVariable(name: "target", arg: 2, scope: !976, file: !977, line: 485, type: !125)
!985 = !DILocalVariable(name: "result", scope: !976, file: !977, line: 487, type: !125)
!986 = !DILocalVariable(name: "flags", scope: !987, file: !977, line: 530, type: !125)
!987 = distinct !DILexicalBlock(scope: !988, file: !977, line: 529, column: 5)
!988 = distinct !DILexicalBlock(scope: !976, file: !977, line: 528, column: 7)
!989 = !DILocalVariable(name: "saved_errno", scope: !990, file: !977, line: 533, type: !125)
!990 = distinct !DILexicalBlock(scope: !991, file: !977, line: 532, column: 9)
!991 = distinct !DILexicalBlock(scope: !987, file: !977, line: 531, column: 11)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !994, line: 108, type: !89, isLocal: true, isDefinition: true)
!994 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "internal_state", scope: !997, file: !994, line: 97, type: !1000, isLocal: true, isDefinition: true)
!997 = distinct !DICompileUnit(language: DW_LANG_C11, file: !994, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !998, globals: !999, splitDebugInlining: false, nameTableKind: None)
!998 = !{!176, !178, !183}
!999 = !{!992, !995}
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !739, line: 6, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !741, line: 21, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 13, size: 64, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1002, file: !741, line: 15, baseType: !125, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1002, file: !741, line: 20, baseType: !1006, size: 32, offset: 32)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1002, file: !741, line: 16, size: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1006, file: !741, line: 18, baseType: !112, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1006, file: !741, line: 19, baseType: !376, size: 32)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !1012, line: 35, type: !19, isLocal: true, isDefinition: true)
!1012 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1013 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1014, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-filemode.o -MD -MP -MF lib/.deps/libcoreutils_a-filemode.Tpo -c lib/filemode.c -o lib/.libcoreutils_a-filemode.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1014 = !DIFile(filename: "lib/filemode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4709245c6350fbec3a6a0f5fa66bc341")
!1015 = distinct !DICompileUnit(language: DW_LANG_C11, file: !677, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fts.o -MD -MP -MF lib/.deps/libcoreutils_a-fts.Tpo -c lib/fts.c -o lib/.libcoreutils_a-fts.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1016, retainedTypes: !1172, globals: !1183, splitDebugInlining: false, nameTableKind: None)
!1016 = !{!1017, !1021, !1148, !1151, !1155, !1166, !1169}
!1017 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !677, line: 159, baseType: !112, size: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1020 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1021 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1023, file: !1022, line: 54, baseType: !112, size: 32, elements: !1146)
!1022 = !DIFile(filename: "lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1023 = distinct !DISubprogram(name: "setup_dir", scope: !1022, file: !1022, line: 50, type: !1024, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1015, retainedNodes: !1144)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!245, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1028, line: 233, baseType: !1029)
!1028 = !DIFile(filename: "lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1028, line: 115, size: 1024, elements: !1030)
!1030 = !{!1031, !1093, !1094, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1109, !1110, !1113, !1133}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1029, file: !1028, line: 116, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1028, line: 235, size: 2048, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1089}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1033, file: !1028, line: 236, baseType: !1032, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1033, file: !1028, line: 237, baseType: !1032, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1033, file: !1028, line: 238, baseType: !1032, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1033, file: !1028, line: 239, baseType: !1039, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1041, line: 127, baseType: !1042)
!1041 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1041, line: 127, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1033, file: !1028, line: 242, baseType: !242, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1033, file: !1028, line: 243, baseType: !176, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1033, file: !1028, line: 244, baseType: !175, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1033, file: !1028, line: 245, baseType: !175, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1033, file: !1028, line: 246, baseType: !125, size: 32, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1033, file: !1028, line: 247, baseType: !125, size: 32, offset: 544)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1033, file: !1028, line: 248, baseType: !178, size: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1033, file: !1028, line: 250, baseType: !1026, size: 64, offset: 640)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1033, file: !1028, line: 254, baseType: !240, size: 64, offset: 704)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1033, file: !1028, line: 256, baseType: !178, size: 64, offset: 768)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1033, file: !1028, line: 272, baseType: !177, size: 16, offset: 832)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1033, file: !1028, line: 276, baseType: !177, size: 16, offset: 848)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1033, file: !1028, line: 282, baseType: !177, size: 16, offset: 864)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1033, file: !1028, line: 284, baseType: !1057, size: 1152, offset: 896)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 1152, elements: !90)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1059, line: 26, size: 1152, elements: !1060)
!1059 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1060 = !{!1061, !1062, !1063, !1065, !1066, !1068, !1070, !1071, !1072, !1073, !1075, !1077, !1085, !1086, !1087}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1058, file: !1059, line: 31, baseType: !265, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1058, file: !1059, line: 36, baseType: !262, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1058, file: !1059, line: 44, baseType: !1064, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !166, line: 151, baseType: !180)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1058, file: !1059, line: 45, baseType: !165, size: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1058, file: !1059, line: 47, baseType: !1067, size: 32, offset: 224)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !166, line: 146, baseType: !112)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1058, file: !1059, line: 48, baseType: !1069, size: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !166, line: 147, baseType: !112)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1058, file: !1059, line: 50, baseType: !125, size: 32, offset: 288)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1058, file: !1059, line: 52, baseType: !265, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1058, file: !1059, line: 57, baseType: !337, size: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1058, file: !1059, line: 61, baseType: !1074, size: 64, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !166, line: 175, baseType: !242)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1058, file: !1059, line: 63, baseType: !1076, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !166, line: 180, baseType: !242)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1058, file: !1059, line: 74, baseType: !1078, size: 128, offset: 576)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1079, line: 11, size: 128, elements: !1080)
