; ModuleID = 'src/chown.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.11 }
%union.anon.11 = type { i32 }
%struct.Chown_option = type { i32, i8, ptr, i8, i8, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!200 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!201 = !{!0, !7, !12, !17, !22, !27, !32, !34, !36, !41, !46, !51, !56, !61, !66, !71, !76, !78, !83, !88, !93, !98, !103, !108, !113, !118, !123, !128, !202, !207, !212, !217, !222, !227, !229, !234, !239, !244, !340, !342, !344, !423, !428, !430, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !458, !460, !462, !464, !466, !468, !470, !475, !480, !485, !490, !492, !494, !496, !498, !503, !508, !510, !515, !517, !522, !524, !526, !528, !533, !535, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !133}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 7)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 14)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 16)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 13)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 42)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 298, type: !214, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 300, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 25)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 31)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !246, file: !2, line: 353, type: !272, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 178, type: !247, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !135, retainedNodes: !250)
!247 = !DISubroutineType(types: !248)
!248 = !{!158, !158, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!250 = !{!251, !252, !253, !255, !260, !263, !264, !265, !285, !286, !290, !291, !295, !296, !297, !332, !334, !335, !336, !339}
!251 = !DILocalVariable(name: "argc", arg: 1, scope: !246, file: !2, line: 178, type: !158)
!252 = !DILocalVariable(name: "argv", arg: 2, scope: !246, file: !2, line: 178, type: !249)
!253 = !DILocalVariable(name: "preserve_root", scope: !246, file: !2, line: 180, type: !254)
!254 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!255 = !DILocalVariable(name: "required_uid", scope: !246, file: !2, line: 184, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !257, line: 79, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !259, line: 146, baseType: !139)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!260 = !DILocalVariable(name: "required_gid", scope: !246, file: !2, line: 185, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !257, line: 64, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !259, line: 147, baseType: !139)
!263 = !DILocalVariable(name: "bit_flags", scope: !246, file: !2, line: 188, type: !158)
!264 = !DILocalVariable(name: "dereference", scope: !246, file: !2, line: 192, type: !158)
!265 = !DILocalVariable(name: "chopt", scope: !246, file: !2, line: 194, type: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !144, line: 44, size: 320, elements: !267)
!267 = !{!268, !269, !270, !281, !282, !283, !284}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !266, file: !144, line: 47, baseType: !143, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !266, file: !144, line: 50, baseType: !254, size: 8, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !266, file: !144, line: 54, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !273, line: 30, size: 128, elements: !274)
!273 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!274 = !{!275, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !272, file: !273, line: 32, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !257, line: 47, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !259, line: 148, baseType: !197)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !272, file: !273, line: 33, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !257, line: 59, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !259, line: 145, baseType: !197)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !266, file: !144, line: 57, baseType: !254, size: 8, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !266, file: !144, line: 60, baseType: !254, size: 8, offset: 136)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !266, file: !144, line: 63, baseType: !192, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !266, file: !144, line: 66, baseType: !192, size: 64, offset: 256)
!285 = !DILocalVariable(name: "optc", scope: !246, file: !2, line: 206, type: !158)
!286 = !DILocalVariable(name: "warn", scope: !287, file: !2, line: 247, type: !254)
!287 = distinct !DILexicalBlock(scope: !288, file: !2, line: 246, column: 11)
!288 = distinct !DILexicalBlock(scope: !289, file: !2, line: 211, column: 9)
!289 = distinct !DILexicalBlock(scope: !246, file: !2, line: 209, column: 5)
!290 = !DILocalVariable(name: "e", scope: !287, file: !2, line: 248, type: !198)
!291 = !DILocalVariable(name: "__errstatus", scope: !292, file: !2, line: 252, type: !294)
!292 = distinct !DILexicalBlock(scope: !293, file: !2, line: 252, column: 15)
!293 = distinct !DILexicalBlock(scope: !287, file: !2, line: 251, column: 17)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!295 = !DILocalVariable(name: "uid", scope: !246, file: !2, line: 304, type: !256)
!296 = !DILocalVariable(name: "gid", scope: !246, file: !2, line: 305, type: !261)
!297 = !DILocalVariable(name: "ref_stats", scope: !298, file: !2, line: 309, type: !300)
!298 = distinct !DILexicalBlock(scope: !299, file: !2, line: 308, column: 5)
!299 = distinct !DILexicalBlock(scope: !246, file: !2, line: 307, column: 7)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !301, line: 26, size: 1152, elements: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!302 = !{!303, !304, !305, !307, !309, !310, !311, !312, !313, !316, !318, !320, !328, !329, !330}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !300, file: !301, line: 31, baseType: !280, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !300, file: !301, line: 36, baseType: !277, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !300, file: !301, line: 44, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !259, line: 151, baseType: !197)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !300, file: !301, line: 45, baseType: !308, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !259, line: 150, baseType: !139)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !300, file: !301, line: 47, baseType: !258, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !300, file: !301, line: 48, baseType: !262, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !300, file: !301, line: 50, baseType: !158, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !300, file: !301, line: 52, baseType: !280, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !300, file: !301, line: 57, baseType: !314, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !259, line: 152, baseType: !315)
!315 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !300, file: !301, line: 61, baseType: !317, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !259, line: 175, baseType: !315)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !300, file: !301, line: 63, baseType: !319, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !259, line: 180, baseType: !315)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !300, file: !301, line: 74, baseType: !321, size: 128, offset: 576)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !322, line: 11, size: 128, elements: !323)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!323 = !{!324, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !321, file: !322, line: 16, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !259, line: 160, baseType: !315)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !321, file: !322, line: 21, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !259, line: 197, baseType: !315)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !300, file: !301, line: 75, baseType: !321, size: 128, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !300, file: !301, line: 76, baseType: !321, size: 128, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !300, file: !301, line: 89, baseType: !331, size: 192, offset: 960)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 192, elements: !86)
!332 = !DILocalVariable(name: "ug", scope: !333, file: !2, line: 324, type: !192)
!333 = distinct !DILexicalBlock(scope: !299, file: !2, line: 323, column: 5)
!334 = !DILocalVariable(name: "warn", scope: !333, file: !2, line: 331, type: !254)
!335 = !DILocalVariable(name: "e", scope: !333, file: !2, line: 332, type: !198)
!336 = !DILocalVariable(name: "__errstatus", scope: !337, file: !2, line: 340, type: !294)
!337 = distinct !DILexicalBlock(scope: !338, file: !2, line: 340, column: 9)
!338 = distinct !DILexicalBlock(scope: !333, file: !2, line: 339, column: 11)
!339 = !DILocalVariable(name: "ok", scope: !246, file: !2, line: 361, type: !254)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !241, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "reference_file", scope: !135, file: !2, line: 41, type: !192, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !346, file: !157, line: 575, type: !158, isLocal: true, isDefinition: true)
!346 = distinct !DISubprogram(name: "oputs_", scope: !157, file: !157, line: 573, type: !347, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !135, retainedNodes: !349)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !198, !198}
!349 = !{!350, !351, !352, !355, !356, !357, !358, !362, !363, !364, !365, !367, !417, !418, !419, !421, !422}
!350 = !DILocalVariable(name: "program", arg: 1, scope: !346, file: !157, line: 573, type: !198)
!351 = !DILocalVariable(name: "option", arg: 2, scope: !346, file: !157, line: 573, type: !198)
!352 = !DILocalVariable(name: "term", scope: !353, file: !157, line: 585, type: !198)
!353 = distinct !DILexicalBlock(scope: !354, file: !157, line: 582, column: 5)
!354 = distinct !DILexicalBlock(scope: !346, file: !157, line: 581, column: 7)
!355 = !DILocalVariable(name: "double_space", scope: !346, file: !157, line: 594, type: !254)
!356 = !DILocalVariable(name: "first_word", scope: !346, file: !157, line: 595, type: !198)
!357 = !DILocalVariable(name: "option_text", scope: !346, file: !157, line: 596, type: !198)
!358 = !DILocalVariable(name: "s", scope: !359, file: !157, line: 608, type: !198)
!359 = distinct !DILexicalBlock(scope: !360, file: !157, line: 605, column: 5)
!360 = distinct !DILexicalBlock(scope: !361, file: !157, line: 604, column: 12)
!361 = distinct !DILexicalBlock(scope: !346, file: !157, line: 597, column: 7)
!362 = !DILocalVariable(name: "spaces", scope: !359, file: !157, line: 609, type: !195)
!363 = !DILocalVariable(name: "anchor_len", scope: !346, file: !157, line: 620, type: !195)
!364 = !DILocalVariable(name: "desc_text", scope: !346, file: !157, line: 625, type: !198)
!365 = !DILocalVariable(name: "__ptr", scope: !366, file: !157, line: 644, type: !198)
!366 = distinct !DILexicalBlock(scope: !346, file: !157, line: 644, column: 3)
!367 = !DILocalVariable(name: "__stream", scope: !366, file: !157, line: 644, type: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !370, line: 7, baseType: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !372, line: 49, size: 1728, elements: !373)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !389, !391, !392, !393, !394, !395, !397, !398, !401, !403, !406, !409, !410, !411, !412, !413}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !371, file: !372, line: 51, baseType: !158, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !371, file: !372, line: 54, baseType: !192, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !371, file: !372, line: 55, baseType: !192, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !371, file: !372, line: 56, baseType: !192, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !371, file: !372, line: 57, baseType: !192, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !371, file: !372, line: 58, baseType: !192, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !371, file: !372, line: 59, baseType: !192, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !371, file: !372, line: 60, baseType: !192, size: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !371, file: !372, line: 61, baseType: !192, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !371, file: !372, line: 64, baseType: !192, size: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !371, file: !372, line: 65, baseType: !192, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !371, file: !372, line: 66, baseType: !192, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !371, file: !372, line: 68, baseType: !387, size: 64, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !372, line: 36, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !371, file: !372, line: 70, baseType: !390, size: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !371, file: !372, line: 72, baseType: !158, size: 32, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !371, file: !372, line: 73, baseType: !158, size: 32, offset: 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !371, file: !372, line: 74, baseType: !314, size: 64, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !371, file: !372, line: 77, baseType: !194, size: 16, offset: 1024)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !371, file: !372, line: 78, baseType: !396, size: 8, offset: 1040)
!396 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !371, file: !372, line: 79, baseType: !115, size: 8, offset: 1048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !371, file: !372, line: 81, baseType: !399, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !372, line: 43, baseType: null)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !371, file: !372, line: 89, baseType: !402, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !259, line: 153, baseType: !315)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !371, file: !372, line: 91, baseType: !404, size: 64, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !372, line: 37, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !371, file: !372, line: 92, baseType: !407, size: 64, offset: 1280)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !372, line: 38, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !371, file: !372, line: 93, baseType: !390, size: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !371, file: !372, line: 94, baseType: !193, size: 64, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !371, file: !372, line: 95, baseType: !195, size: 64, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !371, file: !372, line: 96, baseType: !158, size: 32, offset: 1536)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !371, file: !372, line: 98, baseType: !414, size: 160, offset: 1568)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 20)
!417 = !DILocalVariable(name: "__cnt", scope: !366, file: !157, line: 644, type: !195)
!418 = !DILocalVariable(name: "url_program", scope: !346, file: !157, line: 648, type: !198)
!419 = !DILocalVariable(name: "__ptr", scope: !420, file: !157, line: 686, type: !198)
!420 = distinct !DILexicalBlock(scope: !346, file: !157, line: 686, column: 3)
!421 = !DILocalVariable(name: "__stream", scope: !420, file: !157, line: 686, type: !368)
!422 = !DILocalVariable(name: "__cnt", scope: !420, file: !157, line: 686, type: !195)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !157, line: 585, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 5)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !157, line: 586, type: !425, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !157, line: 595, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 4)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !157, line: 620, type: !19, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !241, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !425, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !432, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !85, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !157, line: 650, type: !425, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !19, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !19, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !157, line: 652, type: !204, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !157, line: 653, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 8)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !157, line: 654, type: !120, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !157, line: 655, type: !120, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !157, line: 656, type: !120, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !157, line: 657, type: !120, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !157, line: 663, type: !204, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !157, line: 664, type: !120, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 17)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 40)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 15)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 61)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !157, line: 679, type: !85, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !157, line: 683, type: !425, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !157, line: 688, type: !425, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !157, line: 691, type: !455, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !157, line: 801, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1464, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 183)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !157, line: 808, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 83)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !157, line: 812, type: !48, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !157, line: 816, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 51)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !157, line: 839, type: !214, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !157, line: 840, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 22)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !157, line: 841, type: !482, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !157, line: 862, type: !432, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !157, line: 868, type: !48, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !157, line: 875, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 27)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !512, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 12)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !120, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !455, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !537, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !425, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !482, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !472, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !209, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !19, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !204, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !120, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !455, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !425, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !455, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 3584, elements: !210)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !569, line: 50, size: 256, elements: !570)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!570 = !{!571, !572, !573, !575}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !569, line: 52, baseType: !198, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !568, file: !569, line: 55, baseType: !158, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !569, line: 56, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !568, file: !569, line: 57, baseType: !158, size: 32, offset: 192)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !578, line: 557, type: !214, isLocal: true, isDefinition: true)
!578 = !DIFile(filename: "src/chown-core.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0cc937f337309996c839dc01ee932e6")
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !578, line: 569, type: !472, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !241, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 45)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 58)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !578, line: 297, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 49)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !578, line: 328, type: !472, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !578, line: 335, type: !85, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !578, line: 341, type: !231, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !578, line: 349, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 186)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !578, line: 385, type: !519, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !578, line: 473, type: !231, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !578, line: 473, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 21)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !578, line: 158, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 56)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !578, line: 171, type: !3, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !578, line: 172, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 35)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !578, line: 173, type: !632, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 30)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !578, line: 178, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 48)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !578, line: 179, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 44)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !578, line: 180, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 34)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !578, line: 184, type: !477, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !578, line: 185, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 36)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !578, line: 193, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 32)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !578, line: 194, type: !664, isLocal: true, isDefinition: true)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 28)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !578, line: 195, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 26)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "chown_mode", scope: !674, file: !675, line: 2, type: !137, isLocal: false, isDefinition: true)
!674 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/chown-chown.o -MD -MP -MF src/.deps/chown-chown.Tpo -c src/chown-chown.c -o src/.chown-chown.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !676, globals: !677, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "src/chown-chown.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3a1b210c35e4963aa8514922b01ea0b2")
!676 = !{!137}
!677 = !{!672}
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !680, line: 3, type: !482, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "Version", scope: !683, file: !680, line: 3, type: !198, isLocal: false, isDefinition: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !684, splitDebugInlining: false, nameTableKind: None)
!684 = !{!678, !681}
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "file_name", scope: !687, file: !688, line: 45, type: !198, isLocal: true, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !689, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!689 = !{!690, !692, !694, !696, !685, !698}
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !688, line: 121, type: !204, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !688, line: 121, type: !537, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !688, line: 123, type: !204, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !688, line: 126, type: !85, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !687, file: !688, line: 55, type: !254, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !702, file: !703, line: 66, type: !745, isLocal: false, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !703, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !704, globals: !705, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!704 = !{!193, !200}
!705 = !{!706, !708, !727, !729, !731, !733, !700, !735, !737, !739, !741, !743}
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !703, line: 272, type: !425, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "old_file_name", scope: !710, file: !703, line: 304, type: !198, isLocal: true, isDefinition: true)
!710 = distinct !DISubprogram(name: "verror_at_line", scope: !703, file: !703, line: 298, type: !711, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !702, retainedNodes: !720)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !158, !158, !198, !139, !198, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !715)
!715 = !{!716, !717, !718, !719}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !714, file: !703, baseType: !139, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !714, file: !703, baseType: !139, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !714, file: !703, baseType: !193, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !714, file: !703, baseType: !193, size: 64, offset: 128)
!720 = !{!721, !722, !723, !724, !725, !726}
!721 = !DILocalVariable(name: "status", arg: 1, scope: !710, file: !703, line: 298, type: !158)
!722 = !DILocalVariable(name: "errnum", arg: 2, scope: !710, file: !703, line: 298, type: !158)
!723 = !DILocalVariable(name: "file_name", arg: 3, scope: !710, file: !703, line: 298, type: !198)
!724 = !DILocalVariable(name: "line_number", arg: 4, scope: !710, file: !703, line: 298, type: !139)
!725 = !DILocalVariable(name: "message", arg: 5, scope: !710, file: !703, line: 298, type: !198)
!726 = !DILocalVariable(name: "args", arg: 6, scope: !710, file: !703, line: 298, type: !713)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "old_line_number", scope: !710, file: !703, line: 305, type: !139, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !703, line: 338, type: !432, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !703, line: 346, type: !455, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !703, line: 346, type: !241, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "error_message_count", scope: !702, file: !703, line: 69, type: !139, isLocal: false, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !702, file: !703, line: 295, type: !158, isLocal: false, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !703, line: 208, type: !204, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !703, line: 208, type: !615, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !703, line: 214, type: !425, isLocal: true, isDefinition: true)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null}
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !750, line: 399, type: !241, isLocal: true, isDefinition: true)
!750 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !750, line: 441, type: !115, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !750, line: 1080, type: !85, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !757, line: 226, type: !125, isLocal: true, isDefinition: true)
!757 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !757, line: 227, type: !125, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !757, line: 228, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 33)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !757, line: 231, type: !125, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "default_tuning", scope: !769, file: !757, line: 134, type: !773, isLocal: true, isDefinition: true)
!769 = distinct !DICompileUnit(language: DW_LANG_C11, file: !757, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !770, globals: !772, splitDebugInlining: false, nameTableKind: None)
!770 = !{!197, !193, !771, !195}
!771 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!772 = !{!755, !758, !760, !765, !767}
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !775, line: 52, baseType: !776)
!775 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !775, line: 40, size: 160, elements: !777)
!777 = !{!778, !779, !780, !781, !782}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !776, file: !775, line: 45, baseType: !771, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !776, file: !775, line: 46, baseType: !771, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !776, file: !775, line: 47, baseType: !771, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !776, file: !775, line: 48, baseType: !771, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !776, file: !775, line: 49, baseType: !254, size: 8, offset: 128)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "program_name", scope: !785, file: !786, line: 31, type: !198, isLocal: false, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !787, globals: !788, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!787 = !{!193, !192}
!788 = !{!783, !789, !791}
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !786, line: 46, type: !455, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !786, line: 49, type: !432, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "utf07FF", scope: !795, file: !796, line: 46, type: !823, isLocal: true, isDefinition: true)
!795 = distinct !DISubprogram(name: "proper_name_lite", scope: !796, file: !796, line: 38, type: !797, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !799, retainedNodes: !801)
!796 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!797 = !DISubroutineType(types: !798)
!798 = !{!198, !198, !198}
!799 = distinct !DICompileUnit(language: DW_LANG_C11, file: !796, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !800, splitDebugInlining: false, nameTableKind: None)
!800 = !{!793}
!801 = !{!802, !803, !804, !805, !810}
!802 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !795, file: !796, line: 38, type: !198)
!803 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !795, file: !796, line: 38, type: !198)
!804 = !DILocalVariable(name: "translation", scope: !795, file: !796, line: 40, type: !198)
!805 = !DILocalVariable(name: "w", scope: !795, file: !796, line: 47, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !807, line: 37, baseType: !808)
!807 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !259, line: 57, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !259, line: 42, baseType: !139)
!810 = !DILocalVariable(name: "mbs", scope: !795, file: !796, line: 48, type: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !812, line: 6, baseType: !813)
!812 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !814, line: 21, baseType: !815)
!814 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !814, line: 13, size: 64, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !815, file: !814, line: 15, baseType: !158, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !815, file: !814, line: 20, baseType: !819, size: 32, offset: 32)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !815, file: !814, line: 16, size: 32, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !819, file: !814, line: 18, baseType: !139, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !819, file: !814, line: 19, baseType: !432, size: 32)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 16, elements: !242)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !826, line: 78, type: !455, isLocal: true, isDefinition: true)
!826 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !826, line: 79, type: !19, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !826, line: 80, type: !219, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !826, line: 81, type: !219, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !826, line: 82, type: !414, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !826, line: 83, type: !241, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !826, line: 84, type: !455, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !826, line: 85, type: !204, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !826, line: 86, type: !204, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !826, line: 87, type: !455, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !847, file: !826, line: 76, type: !921, isLocal: false, isDefinition: true)
!847 = distinct !DICompileUnit(language: DW_LANG_C11, file: !826, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !848, retainedTypes: !856, globals: !857, splitDebugInlining: false, nameTableKind: None)
!848 = !{!849, !851, !176}
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !850, line: 42, baseType: !139, size: 32, elements: !164)
!850 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !850, line: 254, baseType: !139, size: 32, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!854 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!855 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!856 = !{!193, !158, !194, !195}
!857 = !{!824, !827, !829, !831, !833, !835, !837, !839, !841, !843, !845, !858, !862, !872, !874, !879, !881, !883, !885, !887, !910, !917, !919}
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !847, file: !826, line: 92, type: !860, isLocal: false, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 320, elements: !121)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !849)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !847, file: !826, line: 1040, type: !864, isLocal: false, isDefinition: true)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !826, line: 56, size: 448, elements: !865)
!865 = !{!866, !867, !868, !870, !871}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !864, file: !826, line: 59, baseType: !849, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !864, file: !826, line: 62, baseType: !158, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !864, file: !826, line: 66, baseType: !869, size: 256, offset: 64)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !456)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !864, file: !826, line: 69, baseType: !198, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !864, file: !826, line: 72, baseType: !198, size: 64, offset: 384)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !847, file: !826, line: 107, type: !864, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "slot0", scope: !847, file: !826, line: 831, type: !876, isLocal: true, isDefinition: true)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 256)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !826, line: 321, type: !241, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !826, line: 357, type: !241, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !826, line: 358, type: !241, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !826, line: 199, type: !204, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "quote", scope: !889, file: !826, line: 228, type: !908, isLocal: true, isDefinition: true)
!889 = distinct !DISubprogram(name: "gettext_quote", scope: !826, file: !826, line: 197, type: !890, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !847, retainedNodes: !892)
!890 = !DISubroutineType(types: !891)
!891 = !{!198, !198, !849}
!892 = !{!893, !894, !895, !896, !897}
!893 = !DILocalVariable(name: "msgid", arg: 1, scope: !889, file: !826, line: 197, type: !198)
!894 = !DILocalVariable(name: "s", arg: 2, scope: !889, file: !826, line: 197, type: !849)
!895 = !DILocalVariable(name: "translation", scope: !889, file: !826, line: 199, type: !198)
!896 = !DILocalVariable(name: "w", scope: !889, file: !826, line: 229, type: !806)
!897 = !DILocalVariable(name: "mbs", scope: !889, file: !826, line: 230, type: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !812, line: 6, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !814, line: 21, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !814, line: 13, size: 64, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !900, file: !814, line: 15, baseType: !158, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !900, file: !814, line: 20, baseType: !904, size: 32, offset: 32)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !900, file: !814, line: 16, size: 32, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !904, file: !814, line: 18, baseType: !139, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !904, file: !814, line: 19, baseType: !432, size: 32)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 64, elements: !909)
!909 = !{!243, !434}
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "slotvec", scope: !847, file: !826, line: 834, type: !912, isLocal: true, isDefinition: true)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !826, line: 823, size: 128, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !913, file: !826, line: 825, baseType: !195, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !913, file: !826, line: 826, baseType: !192, size: 64, offset: 64)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "nslots", scope: !847, file: !826, line: 832, type: !158, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "slotvec0", scope: !847, file: !826, line: 833, type: !913, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 704, elements: !923)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!923 = !{!924}
!924 = !DISubrange(count: 11)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !927, line: 32, type: !241, isLocal: true, isDefinition: true)
!927 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !930, line: 274, type: !530, isLocal: true, isDefinition: true)
!930 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !930, line: 160, type: !219, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !930, line: 165, type: !115, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !930, line: 169, type: !219, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !930, line: 202, type: !209, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !930, line: 229, type: !204, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !943, line: 67, type: !537, isLocal: true, isDefinition: true)
!943 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !943, line: 69, type: !204, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !943, line: 83, type: !204, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !943, line: 83, type: !432, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !943, line: 85, type: !241, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !943, line: 88, type: !954, isLocal: true, isDefinition: true)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 171)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !943, line: 88, type: !647, isLocal: true, isDefinition: true)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !943, line: 105, type: !214, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !943, line: 109, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 23)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !943, line: 113, type: !664, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !943, line: 120, type: !659, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !943, line: 127, type: !654, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !943, line: 134, type: !477, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !943, line: 142, type: !642, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !943, line: 150, type: !637, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !943, line: 159, type: !980, isLocal: true, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 52)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !943, line: 170, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 60)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !943, line: 248, type: !414, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !943, line: 248, type: !519, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !943, line: 254, type: !414, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !943, line: 254, type: !209, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !943, line: 254, type: !477, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !943, line: 259, type: !3, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !943, line: 259, type: !1002, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 29)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1007, file: !1008, line: 26, type: !1010, isLocal: false, isDefinition: true)
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1008, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1009, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1009 = !{!1005}
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 376, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 47)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1015, file: !1016, line: 24, type: !1018, isLocal: false, isDefinition: true)
!1015 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1016, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!1016 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1017 = !{!1013}
!1018 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !1021, line: 34, type: !85, isLocal: true, isDefinition: true)
!1021 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !1021, line: 34, type: !204, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !1021, line: 34, type: !472, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 40, type: !1002, isLocal: true, isDefinition: true)
!1028 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 40, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !923)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 40, type: !1034, isLocal: true, isDefinition: true)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 624, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 78)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 59, type: !125, isLocal: true, isDefinition: true)
!1039 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 59, type: !14, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 59, type: !1044, isLocal: true, isDefinition: true)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 536, elements: !74)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1047, file: !1048, line: 506, type: !158, isLocal: true, isDefinition: true)
!1047 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1048, file: !1048, line: 485, type: !1049, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1051, retainedNodes: !1053)
!1048 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!158, !158, !158}
!1051 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1048, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1052, splitDebugInlining: false, nameTableKind: None)
!1052 = !{!1045}
!1053 = !{!1054, !1055, !1056, !1057, !1060}
!1054 = !DILocalVariable(name: "fd", arg: 1, scope: !1047, file: !1048, line: 485, type: !158)
!1055 = !DILocalVariable(name: "target", arg: 2, scope: !1047, file: !1048, line: 485, type: !158)
!1056 = !DILocalVariable(name: "result", scope: !1047, file: !1048, line: 487, type: !158)
!1057 = !DILocalVariable(name: "flags", scope: !1058, file: !1048, line: 530, type: !158)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !1048, line: 529, column: 5)
!1059 = distinct !DILexicalBlock(scope: !1047, file: !1048, line: 528, column: 7)
!1060 = !DILocalVariable(name: "saved_errno", scope: !1061, file: !1048, line: 533, type: !158)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !1048, line: 532, column: 9)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !1048, line: 531, column: 11)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 108, type: !115, isLocal: true, isDefinition: true)
!1065 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(name: "internal_state", scope: !1068, file: !1065, line: 97, type: !1071, isLocal: true, isDefinition: true)
!1068 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1065, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1069, globals: !1070, splitDebugInlining: false, nameTableKind: None)
!1069 = !{!193, !195, !200}
!1070 = !{!1063, !1066}
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !812, line: 6, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !814, line: 21, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !814, line: 13, size: 64, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1073, file: !814, line: 15, baseType: !158, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1073, file: !814, line: 20, baseType: !1077, size: 32, offset: 32)
!1077 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1073, file: !814, line: 16, size: 32, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1077, file: !814, line: 18, baseType: !139, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1077, file: !814, line: 19, baseType: !432, size: 32)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 35, type: !19, isLocal: true, isDefinition: true)
!1083 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1084 = distinct !DICompileUnit(language: DW_LANG_C11, file: !578, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/chown-core.o -MD -MP -MF src/.deps/chown-core.Tpo -c src/chown-core.c -o src/.chown-core.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1085, retainedTypes: !1099, globals: !1100, splitDebugInlining: false, nameTableKind: None)
!1085 = !{!143, !162, !1086, !1093}
!1086 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !578, line: 38, baseType: !139, size: 32, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092}
!1088 = !DIEnumerator(name: "RC_ok", value: 2)
!1089 = !DIEnumerator(name: "RC_excluded", value: 3)
!1090 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!1091 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!1092 = !DIEnumerator(name: "RC_error", value: 6)
!1093 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !144, line: 24, baseType: !139, size: 32, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098}
!1095 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!1096 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!1097 = !DIEnumerator(name: "CH_FAILED", value: 3)
!1098 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!1099 = !{!256, !261, !193}
!1100 = !{!576, !579, !581, !583, !588, !593, !598, !600, !602, !604, !609, !611, !613, !618, !623, !625, !630, !635, !640, !645, !650, !652, !657, !662, !667, !1101, !1103, !1105, !1110}
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !578, line: 199, type: !241, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !578, line: 199, type: !472, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !578, line: 199, type: !1107, isLocal: true, isDefinition: true)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 888, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 111)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !578, line: 132, type: !241, isLocal: true, isDefinition: true)
!1112 = distinct !DICompileUnit(language: DW_LANG_C11, file: !750, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fts.o -MD -MP -MF lib/.deps/libcoreutils_a-fts.Tpo -c lib/fts.c -o lib/.libcoreutils_a-fts.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1113, retainedTypes: !1261, globals: !1272, splitDebugInlining: false, nameTableKind: None)
!1113 = !{!1114, !1118, !1237, !1240, !1244, !1255, !1258}
!1114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !750, line: 159, baseType: !139, size: 32, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1117 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1118 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1120, file: !1119, line: 54, baseType: !139, size: 32, elements: !1235)
!1119 = !DIFile(filename: "lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1120 = distinct !DISubprogram(name: "setup_dir", scope: !1119, file: !1119, line: 50, type: !1121, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1112, retainedNodes: !1233)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!254, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1125, line: 233, baseType: !1126)
!1125 = !DIFile(filename: "lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1125, line: 115, size: 1024, elements: !1127)
!1127 = !{!1128, !1182, !1183, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1198, !1199, !1202, !1222}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1126, file: !1125, line: 116, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1125, line: 235, size: 2048, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1151, !1152, !1153, !1154, !1155, !1178}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1130, file: !1125, line: 236, baseType: !1129, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1130, file: !1125, line: 237, baseType: !1129, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1130, file: !1125, line: 238, baseType: !1129, size: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1130, file: !1125, line: 239, baseType: !1136, size: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1138, line: 127, baseType: !1139)
!1138 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1138, line: 127, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1130, file: !1125, line: 242, baseType: !315, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1130, file: !1125, line: 243, baseType: !193, size: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1130, file: !1125, line: 244, baseType: !192, size: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1130, file: !1125, line: 245, baseType: !192, size: 64, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1130, file: !1125, line: 246, baseType: !158, size: 32, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1130, file: !1125, line: 247, baseType: !158, size: 32, offset: 544)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1130, file: !1125, line: 248, baseType: !195, size: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1130, file: !1125, line: 250, baseType: !1123, size: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1130, file: !1125, line: 254, baseType: !1149, size: 64, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1150, line: 18, baseType: !315)
!1150 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1130, file: !1125, line: 256, baseType: !195, size: 64, offset: 768)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1130, file: !1125, line: 272, baseType: !194, size: 16, offset: 832)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1130, file: !1125, line: 276, baseType: !194, size: 16, offset: 848)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1130, file: !1125, line: 282, baseType: !194, size: 16, offset: 864)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1130, file: !1125, line: 284, baseType: !1156, size: 1152, offset: 896)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1157, size: 1152, elements: !116)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !301, line: 26, size: 1152, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1175, !1176, !1177}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1157, file: !301, line: 31, baseType: !280, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1157, file: !301, line: 36, baseType: !277, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1157, file: !301, line: 44, baseType: !306, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1157, file: !301, line: 45, baseType: !308, size: 32, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1157, file: !301, line: 47, baseType: !258, size: 32, offset: 224)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1157, file: !301, line: 48, baseType: !262, size: 32, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1157, file: !301, line: 50, baseType: !158, size: 32, offset: 288)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1157, file: !301, line: 52, baseType: !280, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1157, file: !301, line: 57, baseType: !314, size: 64, offset: 384)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1157, file: !301, line: 61, baseType: !317, size: 64, offset: 448)
