; ModuleID = 'src/date.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.calendar_month_name = type { ptr, ptr }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.table = type { ptr, i32, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.calendar_date = type { i32, i32, i32, ptr }
%struct.parser_control = type { ptr, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }

!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!613 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !615, line: 18, baseType: !616)
!615 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!616 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!619 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!620 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !102, !107, !112, !117, !122, !124, !129, !131, !136, !141, !146, !151, !156, !161, !621, !712, !717, !721, !723, !728, !733, !738, !743, !748, !750, !752, !757, !762, !767, !772, !774, !777, !779, !781, !783, !785, !790, !869, !871, !873, !878, !880, !885, !887, !889, !891, !893, !895, !897, !902, !904, !906, !908, !910, !912, !914, !916, !918, !923, !928, !933, !935, !937, !939, !941, !943, !948, !950, !952, !957, !962, !967, !166, !972, !974, !976, !981, !983, !985, !987, !989, !991, !993, !995, !997, !999, !1001, !1003, !1005, !1017, !1021, !1023, !1025, !1027, !1029, !1033, !1038, !1040, !1042, !1044, !1046, !1048, !1053, !1055, !1057, !1059, !1061, !1063}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !623, file: !2, line: 517, type: !709, isLocal: true, isDefinition: true)
!623 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 474, type: !624, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !627)
!624 = !DISubroutineType(types: !625)
!625 = !{!185, !185, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!627 = !{!628, !629, !630, !631, !632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !646, !648, !649, !650, !651, !652, !657, !658, !661, !671, !706}
!628 = !DILocalVariable(name: "argc", arg: 1, scope: !623, file: !2, line: 474, type: !185)
!629 = !DILocalVariable(name: "argv", arg: 2, scope: !623, file: !2, line: 474, type: !626)
!630 = !DILocalVariable(name: "datestr", scope: !623, file: !2, line: 476, type: !617)
!631 = !DILocalVariable(name: "set_datestr", scope: !623, file: !2, line: 477, type: !617)
!632 = !DILocalVariable(name: "set_date", scope: !623, file: !2, line: 478, type: !633)
!633 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!634 = !DILocalVariable(name: "format", scope: !623, file: !2, line: 479, type: !617)
!635 = !DILocalVariable(name: "format_in_c_locale", scope: !623, file: !2, line: 480, type: !633)
!636 = !DILocalVariable(name: "get_resolution", scope: !623, file: !2, line: 481, type: !633)
!637 = !DILocalVariable(name: "batch_file", scope: !623, file: !2, line: 482, type: !611)
!638 = !DILocalVariable(name: "reference", scope: !623, file: !2, line: 483, type: !611)
!639 = !DILocalVariable(name: "discarded_datestr", scope: !623, file: !2, line: 484, type: !633)
!640 = !DILocalVariable(name: "discarded_set_datestr", scope: !623, file: !2, line: 485, type: !633)
!641 = !DILocalVariable(name: "optc", scope: !623, file: !2, line: 495, type: !185)
!642 = !DILocalVariable(name: "i", scope: !643, file: !2, line: 523, type: !176)
!643 = distinct !DILexicalBlock(scope: !644, file: !2, line: 516, column: 11)
!644 = distinct !DILexicalBlock(scope: !645, file: !2, line: 500, column: 9)
!645 = distinct !DILexicalBlock(scope: !623, file: !2, line: 498, column: 5)
!646 = !DILocalVariable(name: "i", scope: !647, file: !2, line: 540, type: !176)
!647 = distinct !DILexicalBlock(scope: !644, file: !2, line: 531, column: 11)
!648 = !DILocalVariable(name: "option_specified_date", scope: !623, file: !2, line: 576, type: !185)
!649 = !DILocalVariable(name: "format_copy", scope: !623, file: !2, line: 644, type: !611)
!650 = !DILocalVariable(name: "format_res", scope: !623, file: !2, line: 645, type: !617)
!651 = !DILocalVariable(name: "tzstring", scope: !623, file: !2, line: 646, type: !617)
!652 = !DILocalVariable(name: "tz", scope: !623, file: !2, line: 647, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !654, line: 1039, baseType: !655)
!654 = !DIFile(filename: "./lib/time.h", directory: "/src")
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !654, line: 1039, flags: DIFlagFwdDecl)
!657 = !DILocalVariable(name: "ok", scope: !623, file: !2, line: 649, type: !633)
!658 = !DILocalVariable(name: "valid_date", scope: !659, file: !2, line: 655, type: !633)
!659 = distinct !DILexicalBlock(scope: !660, file: !2, line: 654, column: 5)
!660 = distinct !DILexicalBlock(scope: !623, file: !2, line: 650, column: 7)
!661 = !DILocalVariable(name: "when", scope: !659, file: !2, line: 656, type: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !663, line: 11, size: 128, elements: !664)
!663 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!664 = !{!665, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !662, file: !663, line: 16, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !667, line: 160, baseType: !668)
!667 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!668 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !662, file: !663, line: 21, baseType: !670, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !667, line: 197, baseType: !668)
!671 = !DILocalVariable(name: "refstats", scope: !672, file: !2, line: 683, type: !676)
!672 = distinct !DILexicalBlock(scope: !673, file: !2, line: 682, column: 13)
!673 = distinct !DILexicalBlock(scope: !674, file: !2, line: 681, column: 15)
!674 = distinct !DILexicalBlock(scope: !675, file: !2, line: 679, column: 9)
!675 = distinct !DILexicalBlock(scope: !659, file: !2, line: 658, column: 11)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !677, line: 26, size: 1152, elements: !678)
!677 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!678 = !{!679, !681, !683, !685, !687, !689, !691, !692, !693, !695, !697, !699, !700, !701, !702}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !676, file: !677, line: 31, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !667, line: 145, baseType: !616)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !676, file: !677, line: 36, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !667, line: 148, baseType: !616)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !676, file: !677, line: 44, baseType: !684, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !667, line: 151, baseType: !616)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !676, file: !677, line: 45, baseType: !686, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !667, line: 150, baseType: !171)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !676, file: !677, line: 47, baseType: !688, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !667, line: 146, baseType: !171)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !676, file: !677, line: 48, baseType: !690, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !667, line: 147, baseType: !171)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !676, file: !677, line: 50, baseType: !185, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !676, file: !677, line: 52, baseType: !680, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !676, file: !677, line: 57, baseType: !694, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !667, line: 152, baseType: !668)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !676, file: !677, line: 61, baseType: !696, size: 64, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !667, line: 175, baseType: !668)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !676, file: !677, line: 63, baseType: !698, size: 64, offset: 512)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !667, line: 180, baseType: !668)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !676, file: !677, line: 74, baseType: !662, size: 128, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !676, file: !677, line: 75, baseType: !662, size: 128, offset: 704)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !676, file: !677, line: 76, baseType: !662, size: 128, offset: 832)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !676, file: !677, line: 89, baseType: !703, size: 192, offset: 960)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 192, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 3)
!706 = !DILocalVariable(name: "res", scope: !707, file: !2, line: 690, type: !668)
!707 = distinct !DILexicalBlock(scope: !708, file: !2, line: 689, column: 13)
!708 = distinct !DILexicalBlock(scope: !673, file: !2, line: 688, column: 20)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 768, elements: !710)
!710 = !{!705, !711}
!711 = !DISubrange(count: 32)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 524, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 11)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !623, file: !2, line: 532, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 1280, elements: !720)
!720 = !{!21, !711}
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 542, type: !714, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 565, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 8)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 14)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 16)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 65)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 63)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !3, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !3, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 603, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 17)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !2, line: 610, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 34)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !2, line: 615, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1160, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 145)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 6)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 640, type: !163, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 646, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !704)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 685, type: !776, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 705, type: !735, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !2, line: 713, type: !735, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !168, file: !2, line: 108, type: !171, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !184, line: 736, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 75)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !792, file: !184, line: 575, type: !185, isLocal: true, isDefinition: true)
!792 = distinct !DISubprogram(name: "oputs_", scope: !184, file: !184, line: 573, type: !793, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !795)
!793 = !DISubroutineType(cc: DW_CC_nocall, types: !794)
!794 = !{null, !617, !617}
!795 = !{!796, !797, !798, !801, !802, !803, !804, !808, !809, !810, !811, !813, !863, !864, !865, !867, !868}
!796 = !DILocalVariable(name: "program", arg: 1, scope: !792, file: !184, line: 573, type: !617)
!797 = !DILocalVariable(name: "option", arg: 2, scope: !792, file: !184, line: 573, type: !617)
!798 = !DILocalVariable(name: "term", scope: !799, file: !184, line: 585, type: !617)
!799 = distinct !DILexicalBlock(scope: !800, file: !184, line: 582, column: 5)
!800 = distinct !DILexicalBlock(scope: !792, file: !184, line: 581, column: 7)
!801 = !DILocalVariable(name: "double_space", scope: !792, file: !184, line: 594, type: !633)
!802 = !DILocalVariable(name: "first_word", scope: !792, file: !184, line: 595, type: !617)
!803 = !DILocalVariable(name: "option_text", scope: !792, file: !184, line: 596, type: !617)
!804 = !DILocalVariable(name: "s", scope: !805, file: !184, line: 608, type: !617)
!805 = distinct !DILexicalBlock(scope: !806, file: !184, line: 605, column: 5)
!806 = distinct !DILexicalBlock(scope: !807, file: !184, line: 604, column: 12)
!807 = distinct !DILexicalBlock(scope: !792, file: !184, line: 597, column: 7)
!808 = !DILocalVariable(name: "spaces", scope: !805, file: !184, line: 609, type: !614)
!809 = !DILocalVariable(name: "anchor_len", scope: !792, file: !184, line: 620, type: !614)
!810 = !DILocalVariable(name: "desc_text", scope: !792, file: !184, line: 625, type: !617)
!811 = !DILocalVariable(name: "__ptr", scope: !812, file: !184, line: 644, type: !617)
!812 = distinct !DILexicalBlock(scope: !792, file: !184, line: 644, column: 3)
!813 = !DILocalVariable(name: "__stream", scope: !812, file: !184, line: 644, type: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !816, line: 7, baseType: !817)
!816 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !818, line: 49, size: 1728, elements: !819)
!818 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !835, !837, !838, !839, !840, !841, !843, !844, !847, !849, !852, !855, !856, !857, !858, !859}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !817, file: !818, line: 51, baseType: !185, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !817, file: !818, line: 54, baseType: !611, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !817, file: !818, line: 55, baseType: !611, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !817, file: !818, line: 56, baseType: !611, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !817, file: !818, line: 57, baseType: !611, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !817, file: !818, line: 58, baseType: !611, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !817, file: !818, line: 59, baseType: !611, size: 64, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !817, file: !818, line: 60, baseType: !611, size: 64, offset: 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !817, file: !818, line: 61, baseType: !611, size: 64, offset: 512)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !817, file: !818, line: 64, baseType: !611, size: 64, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !817, file: !818, line: 65, baseType: !611, size: 64, offset: 640)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !817, file: !818, line: 66, baseType: !611, size: 64, offset: 704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !817, file: !818, line: 68, baseType: !833, size: 64, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !818, line: 36, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !817, file: !818, line: 70, baseType: !836, size: 64, offset: 832)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !817, file: !818, line: 72, baseType: !185, size: 32, offset: 896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !817, file: !818, line: 73, baseType: !185, size: 32, offset: 928)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !817, file: !818, line: 74, baseType: !694, size: 64, offset: 960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !817, file: !818, line: 77, baseType: !613, size: 16, offset: 1024)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !817, file: !818, line: 78, baseType: !842, size: 8, offset: 1040)
!842 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !817, file: !818, line: 79, baseType: !153, size: 8, offset: 1048)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !817, file: !818, line: 81, baseType: !845, size: 64, offset: 1088)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !818, line: 43, baseType: null)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !817, file: !818, line: 89, baseType: !848, size: 64, offset: 1152)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !667, line: 153, baseType: !668)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !817, file: !818, line: 91, baseType: !850, size: 64, offset: 1216)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !818, line: 37, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !817, file: !818, line: 92, baseType: !853, size: 64, offset: 1280)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !818, line: 38, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !817, file: !818, line: 93, baseType: !836, size: 64, offset: 1344)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !817, file: !818, line: 94, baseType: !612, size: 64, offset: 1408)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !817, file: !818, line: 95, baseType: !614, size: 64, offset: 1472)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !817, file: !818, line: 96, baseType: !185, size: 32, offset: 1536)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !817, file: !818, line: 98, baseType: !860, size: 160, offset: 1568)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 20)
!863 = !DILocalVariable(name: "__cnt", scope: !812, file: !184, line: 644, type: !614)
!864 = !DILocalVariable(name: "url_program", scope: !792, file: !184, line: 648, type: !617)
!865 = !DILocalVariable(name: "__ptr", scope: !866, file: !184, line: 686, type: !617)
!866 = distinct !DILexicalBlock(scope: !792, file: !184, line: 686, column: 3)
!867 = !DILocalVariable(name: "__stream", scope: !866, file: !184, line: 686, type: !814)
!868 = !DILocalVariable(name: "__cnt", scope: !866, file: !184, line: 686, type: !614)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !184, line: 585, type: !19, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !184, line: 586, type: !19, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !184, line: 595, type: !875, isLocal: true, isDefinition: true)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 4)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !184, line: 620, type: !769, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !184, line: 648, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 2)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !184, line: 648, type: !19, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !184, line: 649, type: !875, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !184, line: 649, type: !776, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !184, line: 650, type: !19, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !184, line: 651, type: !769, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !184, line: 651, type: !769, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !184, line: 652, type: !899, isLocal: true, isDefinition: true)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 7)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !184, line: 653, type: !725, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !184, line: 654, type: !158, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !184, line: 655, type: !158, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !184, line: 656, type: !158, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !184, line: 657, type: !158, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !184, line: 663, type: !899, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !184, line: 664, type: !158, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !184, line: 669, type: !754, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !184, line: 669, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 40)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !184, line: 676, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 15)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !184, line: 676, type: !930, isLocal: true, isDefinition: true)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 61)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !184, line: 679, type: !776, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !184, line: 683, type: !19, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !184, line: 688, type: !19, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !184, line: 691, type: !725, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !184, line: 839, type: !735, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !184, line: 840, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 22)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !184, line: 841, type: !925, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !184, line: 862, type: !875, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !184, line: 868, type: !954, isLocal: true, isDefinition: true)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 71)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !184, line: 875, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 27)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !184, line: 877, type: !964, isLocal: true, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 51)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !184, line: 877, type: !969, isLocal: true, isDefinition: true)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 12)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !769, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !19, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !2, line: 91, type: !978, isLocal: true, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 9)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !158, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !714, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !158, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !725, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !978, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !978, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !875, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !875, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !2, line: 100, type: !875, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !158, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !19, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !725, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "long_options", scope: !168, file: !2, line: 86, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 4352, elements: !755)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !1010, line: 50, size: 256, elements: !1011)
!1010 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!1011 = !{!1012, !1013, !1014, !1016}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !1010, line: 52, baseType: !617, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1009, file: !1010, line: 55, baseType: !185, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1009, file: !1010, line: 56, baseType: !1015, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1009, file: !1010, line: 57, baseType: !185, size: 32, offset: 192)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "time_spec", scope: !168, file: !2, line: 65, type: !1019, isLocal: true, isDefinition: true)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 160, elements: !20)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !769, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !725, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !725, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !776, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !168, file: !2, line: 58, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 384, elements: !770)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !168, file: !2, line: 73, type: !1035, isLocal: true, isDefinition: true)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 200, elements: !1036)
!1036 = !{!1037}
!1037 = !DISubrange(count: 25)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !2, line: 421, type: !882, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !925, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !2, line: 428, type: !882, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !2, line: 442, type: !925, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !184, line: 952, type: !969, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !1050, isLocal: true, isDefinition: true)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 18)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !2, line: 396, type: !882, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !2, line: 357, type: !899, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !2, line: 363, type: !978, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !725, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !2, line: 365, type: !969, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !2, line: 366, type: !714, isLocal: true, isDefinition: true)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 112, elements: !731)
!1066 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !1069, line: 27, type: !163, isLocal: true, isDefinition: true)
!1069 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(scope: null, file: !1069, line: 35, type: !1050, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(scope: null, file: !1074, line: 3, type: !925, isLocal: true, isDefinition: true)
!1074 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "Version", scope: !1077, file: !1074, line: 3, type: !617, isLocal: false, isDefinition: true)
!1077 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1074, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1078, splitDebugInlining: false, nameTableKind: None)
!1078 = !{!1072, !1075}
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1081, file: !1082, line: 65, type: !1106, isLocal: false, isDefinition: true)
!1081 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1082, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1083, retainedTypes: !1086, globals: !1087, splitDebugInlining: false, nameTableKind: None)
!1082 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1083 = !{!1084}
!1084 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1085, line: 42, baseType: !171, size: 32, elements: !577)
!1085 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1086 = !{!612, !617, !619}
!1087 = !{!1079, !1088, !1090, !1092, !1097, !1102, !1104}
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 141, type: !899, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 141, type: !959, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 142, type: !1094, isLocal: true, isDefinition: true)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1095)
!1095 = !{!1096}
!1096 = !DISubrange(count: 29)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 160, type: !1099, isLocal: true, isDefinition: true)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 21)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 165, type: !725, isLocal: true, isDefinition: true)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 170, type: !19, isLocal: true, isDefinition: true)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1107, line: 69, baseType: !1108)
!1107 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null}
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(name: "file_name", scope: !1113, file: !1114, line: 45, type: !617, isLocal: true, isDefinition: true)
!1113 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1114, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1115, splitDebugInlining: false, nameTableKind: None)
!1114 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1115 = !{!1116, !1118, !1120, !1122, !1111, !1124}
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(scope: null, file: !1114, line: 121, type: !899, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !1114, line: 121, type: !969, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1114, line: 123, type: !899, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !1114, line: 126, type: !776, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1113, file: !1114, line: 55, type: !633, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1128, file: !1129, line: 66, type: !1108, isLocal: false, isDefinition: true)
!1128 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1129, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1130, globals: !1131, splitDebugInlining: false, nameTableKind: None)
!1129 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1130 = !{!612, !619}
!1131 = !{!1132, !1134, !1153, !1155, !1157, !1159, !1126, !1161, !1163, !1165, !1167, !1169}
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 272, type: !19, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1136, file: !1129, line: 304, type: !617, isLocal: true, isDefinition: true)
!1136 = distinct !DISubprogram(name: "verror_at_line", scope: !1129, file: !1129, line: 298, type: !1137, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1128, retainedNodes: !1146)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !185, !185, !617, !171, !617, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1140, file: !1129, baseType: !171, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1140, file: !1129, baseType: !171, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1140, file: !1129, baseType: !612, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1140, file: !1129, baseType: !612, size: 64, offset: 128)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152}
!1147 = !DILocalVariable(name: "status", arg: 1, scope: !1136, file: !1129, line: 298, type: !185)
!1148 = !DILocalVariable(name: "errnum", arg: 2, scope: !1136, file: !1129, line: 298, type: !185)
!1149 = !DILocalVariable(name: "file_name", arg: 3, scope: !1136, file: !1129, line: 298, type: !617)
!1150 = !DILocalVariable(name: "line_number", arg: 4, scope: !1136, file: !1129, line: 298, type: !171)
!1151 = !DILocalVariable(name: "message", arg: 5, scope: !1136, file: !1129, line: 298, type: !617)
!1152 = !DILocalVariable(name: "args", arg: 6, scope: !1136, file: !1129, line: 298, type: !1139)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1136, file: !1129, line: 305, type: !171, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 338, type: !875, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 346, type: !725, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 346, type: !882, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1128, file: !1129, line: 69, type: !171, isLocal: false, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1128, file: !1129, line: 295, type: !185, isLocal: false, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 208, type: !899, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 208, type: !1099, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 214, type: !19, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 1143, type: !769, isLocal: true, isDefinition: true)
!1173 = !DIFile(filename: "lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 1146, type: !725, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 1149, type: !769, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !1180, file: !1209, line: 75, type: !1282, isLocal: true, isDefinition: true)
!1180 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1181, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fprintftime.o -MD -MP -MF lib/.deps/libcoreutils_a-fprintftime.Tpo -c lib/fprintftime.c -o lib/.libcoreutils_a-fprintftime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1182, retainedTypes: !1190, globals: !1202, splitDebugInlining: false, nameTableKind: None)
!1181 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!1182 = !{!1183}
!1183 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !1173, line: 163, baseType: !171, size: 32, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189}
!1185 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!1186 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!1187 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!1188 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!1189 = !DIEnumerator(name: "NO_PAD", value: 4)
!1190 = !{!612, !171, !185, !619, !1191}
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !654, line: 1039, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1194, line: 24, size: 128, elements: !1195)
!1194 = !DIFile(filename: "lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!1195 = !{!1196, !1197, !1198}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1193, file: !1194, line: 28, baseType: !1192, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1193, file: !1194, line: 33, baseType: !4, size: 8, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1193, file: !1194, line: 45, baseType: !1199, offset: 72)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1200)
!1200 = !{!1201}
!1201 = !DISubrange(count: -1)
!1202 = !{!1171, !1174, !1176, !1203, !1205, !1207, !1178, !1210, !1215, !1217, !1222, !1224, !1226, !1228, !1230, !1232, !1234, !1236, !1239, !1241, !1243, !1245, !1247, !1249, !1251, !1253, !1255, !1257, !1262, !1264, !1266, !1268, !1277, !1280, !1299, !1301, !1303, !1305, !1307, !1309, !1314, !1316, !1318, !1320, !1322, !1324, !1326, !1329, !1332, !1334, !1336, !1338, !1340, !1342, !1344, !1346, !1348, !1350, !1352, !1354, !1356, !1358, !1360, !1362, !1364, !1366, !1368, !1370, !1372, !1374, !1376, !1378, !1380, !1383, !1385, !1387, !1389}
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 1151, type: !769, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 1153, type: !769, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 78, type: !978, isLocal: true, isDefinition: true)
!1209 = !DIFile(filename: "lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 26, type: !1212, isLocal: true, isDefinition: true)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !1213)
!1213 = !{!1214}
!1214 = !DISubrange(count: 19)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 26, type: !978, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 27, type: !1219, isLocal: true, isDefinition: true)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1220)
!1220 = !{!1221}
!1221 = !DISubrange(count: 31)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 27, type: !978, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 28, type: !1212, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 28, type: !969, isLocal: true, isDefinition: true)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 29, type: !1212, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 29, type: !969, isLocal: true, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 30, type: !945, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 30, type: !978, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 31, type: !1238, isLocal: true, isDefinition: true)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !1036)
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 31, type: !969, isLocal: true, isDefinition: true)
!1241 = !DIGlobalVariableExpression(var: !1242, expr: !DIExpression())
!1242 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 32, type: !945, isLocal: true, isDefinition: true)
!1243 = !DIGlobalVariableExpression(var: !1244, expr: !DIExpression())
!1244 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 32, type: !978, isLocal: true, isDefinition: true)
!1245 = !DIGlobalVariableExpression(var: !1246, expr: !DIExpression())
!1246 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 33, type: !945, isLocal: true, isDefinition: true)
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 33, type: !978, isLocal: true, isDefinition: true)
!1249 = !DIGlobalVariableExpression(var: !1250, expr: !DIExpression())
!1250 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 34, type: !945, isLocal: true, isDefinition: true)
!1251 = !DIGlobalVariableExpression(var: !1252, expr: !DIExpression())
!1252 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 34, type: !978, isLocal: true, isDefinition: true)
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 35, type: !1212, isLocal: true, isDefinition: true)
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 35, type: !978, isLocal: true, isDefinition: true)
!1257 = !DIGlobalVariableExpression(var: !1258, expr: !DIExpression())
!1258 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 36, type: !1259, isLocal: true, isDefinition: true)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1260)
!1260 = !{!1261}
!1261 = !DISubrange(count: 28)
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 36, type: !978, isLocal: true, isDefinition: true)
!1264 = !DIGlobalVariableExpression(var: !1265, expr: !DIExpression())
!1265 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 37, type: !945, isLocal: true, isDefinition: true)
!1266 = !DIGlobalVariableExpression(var: !1267, expr: !DIExpression())
!1267 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 37, type: !978, isLocal: true, isDefinition: true)
!1268 = !DIGlobalVariableExpression(var: !1269, expr: !DIExpression())
!1269 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !1180, file: !1209, line: 21, type: !1270, isLocal: true, isDefinition: true)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1271, size: 1920, elements: !926)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !1273, line: 19, size: 128, elements: !1274)
!1273 = !DIFile(filename: "lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!1274 = !{!1275, !1276}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1272, file: !1273, line: 21, baseType: !617, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !1272, file: !1273, line: 22, baseType: !617, size: 64, offset: 64)
!1277 = !DIGlobalVariableExpression(var: !1278, expr: !DIExpression())
!1278 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 134, type: !969, isLocal: true, isDefinition: true)
!1279 = !DIFile(filename: "lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!1280 = !DIGlobalVariableExpression(var: !1281, expr: !DIExpression())
!1281 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !1180, file: !1279, line: 131, type: !1282, isLocal: true, isDefinition: true)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !1273, line: 33, size: 192, elements: !1284)
!1284 = !{!1285, !1297, !1298}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !1283, file: !1273, line: 39, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!185, !1289, !185, !185, !185}
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !1273, line: 25, size: 192, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1290, file: !1273, line: 27, baseType: !185, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1290, file: !1273, line: 28, baseType: !185, size: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1290, file: !1273, line: 29, baseType: !185, size: 32, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !1290, file: !1273, line: 30, baseType: !1296, size: 64, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !1283, file: !1273, line: 42, baseType: !617, size: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !1283, file: !1273, line: 44, baseType: !171, size: 32, offset: 128)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 39, type: !925, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 40, type: !754, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
!1304 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 41, type: !714, isLocal: true, isDefinition: true)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 42, type: !899, isLocal: true, isDefinition: true)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 43, type: !714, isLocal: true, isDefinition: true)
!1309 = !DIGlobalVariableExpression(var: !1310, expr: !DIExpression())
!1310 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 44, type: !1311, isLocal: true, isDefinition: true)
!1311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1312)
!1312 = !{!1313}
!1313 = !DISubrange(count: 13)
!1314 = !DIGlobalVariableExpression(var: !1315, expr: !DIExpression())
!1315 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 45, type: !899, isLocal: true, isDefinition: true)
!1316 = !DIGlobalVariableExpression(var: !1317, expr: !DIExpression())
!1317 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 46, type: !978, isLocal: true, isDefinition: true)
!1318 = !DIGlobalVariableExpression(var: !1319, expr: !DIExpression())
!1319 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 47, type: !899, isLocal: true, isDefinition: true)
!1320 = !DIGlobalVariableExpression(var: !1321, expr: !DIExpression())
!1321 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 48, type: !19, isLocal: true, isDefinition: true)
!1322 = !DIGlobalVariableExpression(var: !1323, expr: !DIExpression())
!1323 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 49, type: !978, isLocal: true, isDefinition: true)
!1324 = !DIGlobalVariableExpression(var: !1325, expr: !DIExpression())
!1325 = distinct !DIGlobalVariable(scope: null, file: !1279, line: 50, type: !714, isLocal: true, isDefinition: true)
!1326 = !DIGlobalVariableExpression(var: !1327, expr: !DIExpression())
!1327 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !1180, file: !1279, line: 37, type: !1328, isLocal: true, isDefinition: true)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1271, size: 1536, elements: !970)
!1329 = !DIGlobalVariableExpression(var: !1330, expr: !DIExpression())
!1330 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !1180, file: !1331, line: 76, type: !1282, isLocal: true, isDefinition: true)
!1331 = !DIFile(filename: "lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 23, type: !735, isLocal: true, isDefinition: true)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 23, type: !899, isLocal: true, isDefinition: true)
!1336 = !DIGlobalVariableExpression(var: !1337, expr: !DIExpression())
!1337 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 24, type: !1311, isLocal: true, isDefinition: true)
!1338 = !DIGlobalVariableExpression(var: !1339, expr: !DIExpression())
!1339 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 24, type: !899, isLocal: true, isDefinition: true)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 25, type: !158, isLocal: true, isDefinition: true)
!1342 = !DIGlobalVariableExpression(var: !1343, expr: !DIExpression())
!1343 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 25, type: !899, isLocal: true, isDefinition: true)
!1344 = !DIGlobalVariableExpression(var: !1345, expr: !DIExpression())
!1345 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 26, type: !1311, isLocal: true, isDefinition: true)
!1346 = !DIGlobalVariableExpression(var: !1347, expr: !DIExpression())
!1347 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 26, type: !899, isLocal: true, isDefinition: true)
!1348 = !DIGlobalVariableExpression(var: !1349, expr: !DIExpression())
!1349 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 27, type: !899, isLocal: true, isDefinition: true)
!1350 = !DIGlobalVariableExpression(var: !1351, expr: !DIExpression())
!1351 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 28, type: !1311, isLocal: true, isDefinition: true)
!1352 = !DIGlobalVariableExpression(var: !1353, expr: !DIExpression())
!1353 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 28, type: !899, isLocal: true, isDefinition: true)
!1354 = !DIGlobalVariableExpression(var: !1355, expr: !DIExpression())
!1355 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 29, type: !1311, isLocal: true, isDefinition: true)
!1356 = !DIGlobalVariableExpression(var: !1357, expr: !DIExpression())
!1357 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 29, type: !899, isLocal: true, isDefinition: true)
!1358 = !DIGlobalVariableExpression(var: !1359, expr: !DIExpression())
!1359 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 30, type: !1311, isLocal: true, isDefinition: true)
!1360 = !DIGlobalVariableExpression(var: !1361, expr: !DIExpression())
!1361 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 30, type: !899, isLocal: true, isDefinition: true)
!1362 = !DIGlobalVariableExpression(var: !1363, expr: !DIExpression())
!1363 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 31, type: !1311, isLocal: true, isDefinition: true)
!1364 = !DIGlobalVariableExpression(var: !1365, expr: !DIExpression())
!1365 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 31, type: !899, isLocal: true, isDefinition: true)
!1366 = !DIGlobalVariableExpression(var: !1367, expr: !DIExpression())
!1367 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 32, type: !899, isLocal: true, isDefinition: true)
!1368 = !DIGlobalVariableExpression(var: !1369, expr: !DIExpression())
!1369 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 33, type: !158, isLocal: true, isDefinition: true)
!1370 = !DIGlobalVariableExpression(var: !1371, expr: !DIExpression())
!1371 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 33, type: !899, isLocal: true, isDefinition: true)
!1372 = !DIGlobalVariableExpression(var: !1373, expr: !DIExpression())
!1373 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 34, type: !158, isLocal: true, isDefinition: true)
!1374 = !DIGlobalVariableExpression(var: !1375, expr: !DIExpression())
!1375 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 34, type: !899, isLocal: true, isDefinition: true)
!1376 = !DIGlobalVariableExpression(var: !1377, expr: !DIExpression())
!1377 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 35, type: !1311, isLocal: true, isDefinition: true)
!1378 = !DIGlobalVariableExpression(var: !1379, expr: !DIExpression())
!1379 = distinct !DIGlobalVariable(scope: null, file: !1331, line: 35, type: !899, isLocal: true, isDefinition: true)
!1380 = !DIGlobalVariableExpression(var: !1381, expr: !DIExpression())
!1381 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !1180, file: !1331, line: 21, type: !1382, isLocal: true, isDefinition: true)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1271, size: 1664, elements: !1312)
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 1802, type: !978, isLocal: true, isDefinition: true)
!1385 = !DIGlobalVariableExpression(var: !1386, expr: !DIExpression())
!1386 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 1961, type: !978, isLocal: true, isDefinition: true)
!1387 = !DIGlobalVariableExpression(var: !1388, expr: !DIExpression())
!1388 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 2058, type: !769, isLocal: true, isDefinition: true)
!1389 = !DIGlobalVariableExpression(var: !1390, expr: !DIExpression())
!1390 = distinct !DIGlobalVariable(scope: null, file: !1173, line: 2134, type: !978, isLocal: true, isDefinition: true)
!1391 = !DIGlobalVariableExpression(var: !1392, expr: !DIExpression())
!1392 = distinct !DIGlobalVariable(scope: null, file: !1393, line: 873, type: !153, isLocal: true, isDefinition: true)
!1393 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!1394 = !DIGlobalVariableExpression(var: !1395, expr: !DIExpression())
!1395 = distinct !DIGlobalVariable(scope: null, file: !1393, line: 1032, type: !769, isLocal: true, isDefinition: true)
!1396 = !DIGlobalVariableExpression(var: !1397, expr: !DIExpression())
!1397 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 2855, type: !882, isLocal: true, isDefinition: true)
!1398 = !DIFile(filename: "lib/localename-unsafe.c", directory: "/src", checksumkind: CSK_MD5, checksum: "45a37c67528fdbd78dc60a7c85e31bd5")
!1399 = !DIGlobalVariableExpression(var: !1400, expr: !DIExpression())
!1400 = distinct !DIGlobalVariable(name: "yyval_default", scope: !1401, file: !1402, line: 1600, type: !1727, isLocal: true, isDefinition: true)
!1401 = distinct !DISubprogram(name: "yyparse", scope: !1402, file: !1402, line: 1591, type: !1403, scopeLine: 1592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1477, retainedNodes: !2389)
!1402 = !DIFile(filename: "parse-datetime.c", directory: "/src")
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!185, !1405}
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !1407, line: 252, baseType: !1408)
!1407 = !DIFile(filename: "parse-datetime.y", directory: "/src")
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1407, line: 184, size: 2304, elements: !1409)
!1409 = !{!1410, !1411, !1415, !1416, !1417, !1418, !1419, !1430, !1431, !1432, !1433, !1434, !1439, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !1408, file: !1407, line: 187, baseType: !617, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !1408, file: !1407, line: 190, baseType: !1412, size: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !1413, line: 101, baseType: !1414)
!1413 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !667, line: 72, baseType: !668)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !1408, file: !1407, line: 193, baseType: !185, size: 32, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !1408, file: !1407, line: 196, baseType: !185, size: 32, offset: 160)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !1408, file: !1407, line: 199, baseType: !185, size: 32, offset: 192)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !1408, file: !1407, line: 202, baseType: !185, size: 32, offset: 224)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1408, file: !1407, line: 205, baseType: !1420, size: 192, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !1407, line: 143, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1407, line: 138, size: 192, elements: !1422)
!1422 = !{!1423, !1424, !1425}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !1421, file: !1407, line: 140, baseType: !633, size: 8)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1421, file: !1407, line: 141, baseType: !1412, size: 64, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !1421, file: !1407, line: 142, baseType: !1426, size: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1427, line: 130, baseType: !1428)
!1427 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1429, line: 18, baseType: !668)
!1429 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1408, file: !1407, line: 206, baseType: !1412, size: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1408, file: !1407, line: 207, baseType: !1412, size: 64, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !1408, file: !1407, line: 208, baseType: !1412, size: 64, offset: 576)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1408, file: !1407, line: 209, baseType: !1412, size: 64, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1408, file: !1407, line: 210, baseType: !1435, size: 128, offset: 704)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !663, line: 11, size: 128, elements: !1436)
!1436 = !{!1437, !1438}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1435, file: !663, line: 16, baseType: !666, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1435, file: !663, line: 21, baseType: !670, size: 64, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !1408, file: !1407, line: 213, baseType: !1440, size: 448, offset: 832)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !1407, line: 175, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1407, line: 165, size: 448, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446, !1447, !1448, !1449}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1441, file: !1407, line: 168, baseType: !1412, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1441, file: !1407, line: 169, baseType: !1412, size: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1441, file: !1407, line: 170, baseType: !1412, size: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !1441, file: !1407, line: 171, baseType: !1412, size: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1441, file: !1407, line: 172, baseType: !1412, size: 64, offset: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1441, file: !1407, line: 173, baseType: !1412, size: 64, offset: 320)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1441, file: !1407, line: 174, baseType: !185, size: 32, offset: 384)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !1408, file: !1407, line: 216, baseType: !633, size: 8, offset: 1280)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !1408, file: !1407, line: 217, baseType: !633, size: 8, offset: 1288)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !1408, file: !1407, line: 218, baseType: !1426, size: 64, offset: 1344)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !1408, file: !1407, line: 219, baseType: !1426, size: 64, offset: 1408)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "J_zones_seen", scope: !1408, file: !1407, line: 220, baseType: !1426, size: 64, offset: 1472)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !1408, file: !1407, line: 221, baseType: !1426, size: 64, offset: 1536)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !1408, file: !1407, line: 222, baseType: !1426, size: 64, offset: 1600)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !1408, file: !1407, line: 223, baseType: !1426, size: 64, offset: 1664)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !1408, file: !1407, line: 224, baseType: !1426, size: 64, offset: 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !1408, file: !1407, line: 225, baseType: !633, size: 8, offset: 1792)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "not_decimal", scope: !1408, file: !1407, line: 227, baseType: !633, size: 8, offset: 1800)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !1408, file: !1407, line: 231, baseType: !633, size: 8, offset: 1808)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !1408, file: !1407, line: 235, baseType: !633, size: 8, offset: 1816)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !1408, file: !1407, line: 236, baseType: !633, size: 8, offset: 1824)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !1408, file: !1407, line: 237, baseType: !633, size: 8, offset: 1832)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !1408, file: !1407, line: 238, baseType: !633, size: 8, offset: 1840)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !1408, file: !1407, line: 239, baseType: !633, size: 8, offset: 1848)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !1408, file: !1407, line: 240, baseType: !633, size: 8, offset: 1856)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !1408, file: !1407, line: 243, baseType: !633, size: 8, offset: 1864)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !1408, file: !1407, line: 246, baseType: !1470, size: 384, offset: 1920)
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1471, size: 384, elements: !704)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !1407, line: 151, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1407, line: 146, size: 128, elements: !1473)
!1473 = !{!1474, !1475, !1476}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1472, file: !1407, line: 148, baseType: !617, size: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1472, file: !1407, line: 149, baseType: !185, size: 32, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1472, file: !1407, line: 150, baseType: !185, size: 32, offset: 96)
!1477 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1478, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-parse-datetime.o -MD -MP -MF lib/.deps/libcoreutils_a-parse-datetime.Tpo -c lib/parse-datetime.c -o lib/.libcoreutils_a-parse-datetime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1479, retainedTypes: !1719, globals: !1735, splitDebugInlining: false, nameTableKind: None)
!1478 = !DIFile(filename: "lib/parse-datetime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4ad0112e68fb719bedea01398b4b2919")
!1479 = !{!1480, !1540, !1567, !1572, !1576, !1716}
!1480 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yysymbol_kind_t", file: !1402, line: 734, baseType: !185, size: 32, elements: !1481)
!1481 = !{!1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539}
!1482 = !DIEnumerator(name: "YYSYMBOL_YYEMPTY", value: -2)
!1483 = !DIEnumerator(name: "YYSYMBOL_YYEOF", value: 0)
!1484 = !DIEnumerator(name: "YYSYMBOL_YYerror", value: 1)
!1485 = !DIEnumerator(name: "YYSYMBOL_YYUNDEF", value: 2)
!1486 = !DIEnumerator(name: "YYSYMBOL_tAGO", value: 3)
!1487 = !DIEnumerator(name: "YYSYMBOL_tDST", value: 4)
!1488 = !DIEnumerator(name: "YYSYMBOL_tYEAR_UNIT", value: 5)
!1489 = !DIEnumerator(name: "YYSYMBOL_tMONTH_UNIT", value: 6)
!1490 = !DIEnumerator(name: "YYSYMBOL_tHOUR_UNIT", value: 7)
!1491 = !DIEnumerator(name: "YYSYMBOL_tMINUTE_UNIT", value: 8)
!1492 = !DIEnumerator(name: "YYSYMBOL_tSEC_UNIT", value: 9)
!1493 = !DIEnumerator(name: "YYSYMBOL_tDAY_UNIT", value: 10)
!1494 = !DIEnumerator(name: "YYSYMBOL_tDAY_SHIFT", value: 11)
!1495 = !DIEnumerator(name: "YYSYMBOL_tDAY", value: 12)
!1496 = !DIEnumerator(name: "YYSYMBOL_tDAYZONE", value: 13)
!1497 = !DIEnumerator(name: "YYSYMBOL_tLOCAL_ZONE", value: 14)
!1498 = !DIEnumerator(name: "YYSYMBOL_tMERIDIAN", value: 15)
!1499 = !DIEnumerator(name: "YYSYMBOL_tMONTH", value: 16)
!1500 = !DIEnumerator(name: "YYSYMBOL_tORDINAL", value: 17)
!1501 = !DIEnumerator(name: "YYSYMBOL_tZONE", value: 18)
!1502 = !DIEnumerator(name: "YYSYMBOL_tSNUMBER", value: 19)
!1503 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER", value: 20)
!1504 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER_DOTTED", value: 21)
!1505 = !DIEnumerator(name: "YYSYMBOL_tSDECIMAL_NUMBER", value: 22)
!1506 = !DIEnumerator(name: "YYSYMBOL_tUDECIMAL_NUMBER", value: 23)
!1507 = !DIEnumerator(name: "YYSYMBOL_24_", value: 24)
!1508 = !DIEnumerator(name: "YYSYMBOL_25_J_", value: 25)
!1509 = !DIEnumerator(name: "YYSYMBOL_26_T_", value: 26)
!1510 = !DIEnumerator(name: "YYSYMBOL_27_", value: 27)
!1511 = !DIEnumerator(name: "YYSYMBOL_28_", value: 28)
!1512 = !DIEnumerator(name: "YYSYMBOL_29_", value: 29)
!1513 = !DIEnumerator(name: "YYSYMBOL_30_", value: 30)
!1514 = !DIEnumerator(name: "YYSYMBOL_YYACCEPT", value: 31)
!1515 = !DIEnumerator(name: "YYSYMBOL_spec", value: 32)
!1516 = !DIEnumerator(name: "YYSYMBOL_timespec", value: 33)
!1517 = !DIEnumerator(name: "YYSYMBOL_items", value: 34)
!1518 = !DIEnumerator(name: "YYSYMBOL_item", value: 35)
!1519 = !DIEnumerator(name: "YYSYMBOL_datetime", value: 36)
!1520 = !DIEnumerator(name: "YYSYMBOL_iso_8601_datetime", value: 37)
!1521 = !DIEnumerator(name: "YYSYMBOL_time", value: 38)
!1522 = !DIEnumerator(name: "YYSYMBOL_iso_8601_time", value: 39)
!1523 = !DIEnumerator(name: "YYSYMBOL_o_zone_offset", value: 40)
!1524 = !DIEnumerator(name: "YYSYMBOL_zone_offset", value: 41)
!1525 = !DIEnumerator(name: "YYSYMBOL_local_zone", value: 42)
!1526 = !DIEnumerator(name: "YYSYMBOL_zone", value: 43)
!1527 = !DIEnumerator(name: "YYSYMBOL_day", value: 44)
!1528 = !DIEnumerator(name: "YYSYMBOL_date", value: 45)
!1529 = !DIEnumerator(name: "YYSYMBOL_iso_8601_date", value: 46)
!1530 = !DIEnumerator(name: "YYSYMBOL_rel", value: 47)
!1531 = !DIEnumerator(name: "YYSYMBOL_relunit", value: 48)
!1532 = !DIEnumerator(name: "YYSYMBOL_relunit_snumber", value: 49)
!1533 = !DIEnumerator(name: "YYSYMBOL_dayshift", value: 50)
!1534 = !DIEnumerator(name: "YYSYMBOL_seconds", value: 51)
!1535 = !DIEnumerator(name: "YYSYMBOL_signed_seconds", value: 52)
!1536 = !DIEnumerator(name: "YYSYMBOL_unsigned_seconds", value: 53)
!1537 = !DIEnumerator(name: "YYSYMBOL_number", value: 54)
!1538 = !DIEnumerator(name: "YYSYMBOL_hybrid", value: 55)
!1539 = !DIEnumerator(name: "YYSYMBOL_o_colon_minutes", value: 56)
!1540 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !1402, line: 676, baseType: !185, size: 32, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566}
!1542 = !DIEnumerator(name: "YYEMPTY", value: -2)
!1543 = !DIEnumerator(name: "YYEOF", value: 0)
!1544 = !DIEnumerator(name: "YYerror", value: 256)
!1545 = !DIEnumerator(name: "YYUNDEF", value: 257)
!1546 = !DIEnumerator(name: "tAGO", value: 258)
!1547 = !DIEnumerator(name: "tDST", value: 259)
!1548 = !DIEnumerator(name: "tYEAR_UNIT", value: 260)
!1549 = !DIEnumerator(name: "tMONTH_UNIT", value: 261)
!1550 = !DIEnumerator(name: "tHOUR_UNIT", value: 262)
!1551 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263)
!1552 = !DIEnumerator(name: "tSEC_UNIT", value: 264)
!1553 = !DIEnumerator(name: "tDAY_UNIT", value: 265)
!1554 = !DIEnumerator(name: "tDAY_SHIFT", value: 266)
!1555 = !DIEnumerator(name: "tDAY", value: 267)
!1556 = !DIEnumerator(name: "tDAYZONE", value: 268)
!1557 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269)
!1558 = !DIEnumerator(name: "tMERIDIAN", value: 270)
!1559 = !DIEnumerator(name: "tMONTH", value: 271)
!1560 = !DIEnumerator(name: "tORDINAL", value: 272)
!1561 = !DIEnumerator(name: "tZONE", value: 273)
!1562 = !DIEnumerator(name: "tSNUMBER", value: 274)
!1563 = !DIEnumerator(name: "tUNUMBER", value: 275)
!1564 = !DIEnumerator(name: "tUNUMBER_DOTTED", value: 276)
!1565 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 277)
!1566 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 278)
!1567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1407, line: 154, baseType: !171, size: 32, elements: !1568)
!1568 = !{!1569, !1570, !1571}
!1569 = !DIEnumerator(name: "MERam", value: 0)
!1570 = !DIEnumerator(name: "MERpm", value: 1)
!1571 = !DIEnumerator(name: "MER24", value: 2)
!1572 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1407, line: 162, baseType: !171, size: 32, elements: !1573)
!1573 = !{!1574, !1575}
!1574 = !DIEnumerator(name: "BILLION", value: 1000000000)
!1575 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!1576 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1577, file: !1407, line: 1781, baseType: !171, size: 32, elements: !1714)
!1577 = distinct !DISubprogram(name: "parse_datetime_body", scope: !1407, file: !1407, line: 1767, type: !1578, scopeLine: 1770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1477, retainedNodes: !1583)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!633, !1580, !617, !1581, !171, !653, !617}
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64)
!1582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1435)
!1583 = !{!1584, !1585, !1586, !1587, !1588, !1589, !1590, !1605, !1606, !1607, !1611, !1612, !1613, !1614, !1615, !1616, !1619, !1620, !1621, !1622, !1624, !1627, !1628, !1629, !1635, !1636, !1637, !1638, !1639, !1641, !1644, !1645, !1652, !1655, !1656, !1662, !1663, !1664, !1667, !1668, !1671, !1672, !1673, !1678, !1681, !1682, !1683, !1684, !1687, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1701, !1702, !1705, !1706, !1707, !1708, !1709, !1712, !1713}
!1584 = !DILocalVariable(name: "result", arg: 1, scope: !1577, file: !1407, line: 1767, type: !1580)
!1585 = !DILocalVariable(name: "p", arg: 2, scope: !1577, file: !1407, line: 1767, type: !617)
!1586 = !DILocalVariable(name: "now", arg: 3, scope: !1577, file: !1407, line: 1768, type: !1581)
!1587 = !DILocalVariable(name: "flags", arg: 4, scope: !1577, file: !1407, line: 1768, type: !171)
!1588 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !1577, file: !1407, line: 1769, type: !653)
!1589 = !DILocalVariable(name: "tzstring", arg: 6, scope: !1577, file: !1407, line: 1769, type: !617)
!1590 = !DILocalVariable(name: "tm", scope: !1577, file: !1407, line: 1771, type: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1592, line: 7, size: 448, elements: !1593)
!1592 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!1593 = !{!1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1591, file: !1592, line: 9, baseType: !185, size: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1591, file: !1592, line: 10, baseType: !185, size: 32, offset: 32)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1591, file: !1592, line: 11, baseType: !185, size: 32, offset: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1591, file: !1592, line: 12, baseType: !185, size: 32, offset: 96)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1591, file: !1592, line: 13, baseType: !185, size: 32, offset: 128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1591, file: !1592, line: 14, baseType: !185, size: 32, offset: 160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1591, file: !1592, line: 15, baseType: !185, size: 32, offset: 192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1591, file: !1592, line: 16, baseType: !185, size: 32, offset: 224)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1591, file: !1592, line: 17, baseType: !185, size: 32, offset: 256)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1591, file: !1592, line: 20, baseType: !668, size: 64, offset: 320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1591, file: !1592, line: 21, baseType: !617, size: 64, offset: 384)
!1605 = !DILocalVariable(name: "tm0", scope: !1577, file: !1407, line: 1772, type: !1591)
!1606 = !DILocalVariable(name: "time_zone_buf", scope: !1577, file: !1407, line: 1773, type: !959)
!1607 = !DILocalVariable(name: "dbg_tm", scope: !1577, file: !1407, line: 1774, type: !1608)
!1608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, elements: !1609)
!1609 = !{!1610}
!1610 = !DISubrange(count: 100)
!1611 = !DILocalVariable(name: "ok", scope: !1577, file: !1407, line: 1775, type: !633)
!1612 = !DILocalVariable(name: "input_sentinel", scope: !1577, file: !1407, line: 1776, type: !617)
!1613 = !DILocalVariable(name: "tz1alloc", scope: !1577, file: !1407, line: 1777, type: !611)
!1614 = !DILocalVariable(name: "tz1buf", scope: !1577, file: !1407, line: 1782, type: !1608)
!1615 = !DILocalVariable(name: "gettime_buffer", scope: !1577, file: !1407, line: 1784, type: !1435)
!1616 = !DILocalVariable(name: "Start", scope: !1577, file: !1407, line: 1791, type: !1617)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1618, line: 10, baseType: !666)
!1618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!1619 = !DILocalVariable(name: "Start_ns", scope: !1577, file: !1407, line: 1792, type: !185)
