; ModuleID = 'src/df.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.field_data_t = type { i32, ptr, i32, ptr, i32, i8, i8 }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.devlist = type { i64, ptr, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.fs_type_list = type { ptr, ptr }
%struct.mount_entry = type { ptr, ptr, ptr, ptr, i64, i8, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.field_values_t = type { i64, i64, i64, i64, i8, i64, i64, i8 }
%struct.saved_cwd = type { i32, ptr }
%struct.realpath_bufs = type { %struct.scratch_buffer, %struct.scratch_buffer, %struct.scratch_buffer }
%struct.scratch_buffer = type { ptr, i64, %union.anon.4 }
%union.anon.4 = type { %struct.max_align_t, [992 x i8] }
%struct.max_align_t = type { i64, x86_fp80 }

!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 14)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 18)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !138, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 16)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 12)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1726, type: !289, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1729, type: !277, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1751, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 47)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1774, type: !19, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1803, type: !123, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1804, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 5)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1804, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 42)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1829, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 6)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 2)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1840, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 26)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !143, file: !2, line: 62, type: !337, isLocal: true, isDefinition: true)
!337 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !143, file: !2, line: 65, type: !337, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !143, file: !2, line: 69, type: !337, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "output_block_size", scope: !143, file: !2, line: 75, type: !259, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !143, file: !2, line: 78, type: !337, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "require_sync", scope: !143, file: !2, line: 84, type: !337, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "exit_status", scope: !143, file: !2, line: 87, type: !182, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "fs_select_list", scope: !143, file: !2, line: 108, type: !352, isLocal: true, isDefinition: true)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !2, line: 91, size: 128, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !353, file: !2, line: 93, baseType: !246, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !353, file: !2, line: 94, baseType: !352, size: 64, offset: 64)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !143, file: !2, line: 113, type: !352, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "mount_list", scope: !143, file: !2, line: 116, type: !361, isLocal: true, isDefinition: true)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !363, line: 35, size: 448, elements: !364)
!363 = !DIFile(filename: "./lib/mountlist.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0b721ac4f5b5eea4f8f1c70f7145ac5d")
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !362, file: !363, line: 37, baseType: !246, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !362, file: !363, line: 38, baseType: !246, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !362, file: !363, line: 39, baseType: !246, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !362, file: !363, line: 41, baseType: !246, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !362, file: !363, line: 42, baseType: !255, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !362, file: !363, line: 43, baseType: !147, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !362, file: !363, line: 44, baseType: !147, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !362, file: !363, line: 45, baseType: !147, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !362, file: !363, line: 46, baseType: !361, size: 64, offset: 384)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "print_type", scope: !143, file: !2, line: 119, type: !337, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !143, file: !2, line: 122, type: !337, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !181, line: 736, type: !24, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !382, file: !181, line: 575, type: !182, isLocal: true, isDefinition: true)
!382 = distinct !DISubprogram(name: "oputs_", scope: !181, file: !181, line: 573, type: !383, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !385)
!383 = !DISubroutineType(cc: DW_CC_nocall, types: !384)
!384 = !{null, !252, !252}
!385 = !{!386, !387, !388, !391, !392, !393, !394, !398, !399, !400, !401, !403, !455, !456, !457, !459, !460}
!386 = !DILocalVariable(name: "program", arg: 1, scope: !382, file: !181, line: 573, type: !252)
!387 = !DILocalVariable(name: "option", arg: 2, scope: !382, file: !181, line: 573, type: !252)
!388 = !DILocalVariable(name: "term", scope: !389, file: !181, line: 585, type: !252)
!389 = distinct !DILexicalBlock(scope: !390, file: !181, line: 582, column: 5)
!390 = distinct !DILexicalBlock(scope: !382, file: !181, line: 581, column: 7)
!391 = !DILocalVariable(name: "double_space", scope: !382, file: !181, line: 594, type: !337)
!392 = !DILocalVariable(name: "first_word", scope: !382, file: !181, line: 595, type: !252)
!393 = !DILocalVariable(name: "option_text", scope: !382, file: !181, line: 596, type: !252)
!394 = !DILocalVariable(name: "s", scope: !395, file: !181, line: 608, type: !252)
!395 = distinct !DILexicalBlock(scope: !396, file: !181, line: 605, column: 5)
!396 = distinct !DILexicalBlock(scope: !397, file: !181, line: 604, column: 12)
!397 = distinct !DILexicalBlock(scope: !382, file: !181, line: 597, column: 7)
!398 = !DILocalVariable(name: "spaces", scope: !395, file: !181, line: 609, type: !249)
!399 = !DILocalVariable(name: "anchor_len", scope: !382, file: !181, line: 620, type: !249)
!400 = !DILocalVariable(name: "desc_text", scope: !382, file: !181, line: 625, type: !252)
!401 = !DILocalVariable(name: "__ptr", scope: !402, file: !181, line: 644, type: !252)
!402 = distinct !DILexicalBlock(scope: !382, file: !181, line: 644, column: 3)
!403 = !DILocalVariable(name: "__stream", scope: !402, file: !181, line: 644, type: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !406, line: 7, baseType: !407)
!406 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !408, line: 49, size: 1728, elements: !409)
!408 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !425, !427, !428, !429, !432, !433, !435, !436, !439, !441, !444, !447, !448, !449, !450, !451}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !407, file: !408, line: 51, baseType: !182, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !407, file: !408, line: 54, baseType: !246, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !407, file: !408, line: 55, baseType: !246, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !407, file: !408, line: 56, baseType: !246, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !407, file: !408, line: 57, baseType: !246, size: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !407, file: !408, line: 58, baseType: !246, size: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !407, file: !408, line: 59, baseType: !246, size: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !407, file: !408, line: 60, baseType: !246, size: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !407, file: !408, line: 61, baseType: !246, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !407, file: !408, line: 64, baseType: !246, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !407, file: !408, line: 65, baseType: !246, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !407, file: !408, line: 66, baseType: !246, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !407, file: !408, line: 68, baseType: !423, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !408, line: 36, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !407, file: !408, line: 70, baseType: !426, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !407, file: !408, line: 72, baseType: !182, size: 32, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !407, file: !408, line: 73, baseType: !182, size: 32, offset: 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !407, file: !408, line: 74, baseType: !430, size: 64, offset: 960)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !258, line: 152, baseType: !431)
!431 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !407, file: !408, line: 77, baseType: !248, size: 16, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !407, file: !408, line: 78, baseType: !434, size: 8, offset: 1040)
!434 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !407, file: !408, line: 79, baseType: !118, size: 8, offset: 1048)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !407, file: !408, line: 81, baseType: !437, size: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !408, line: 43, baseType: null)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !407, file: !408, line: 89, baseType: !440, size: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !258, line: 153, baseType: !431)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !407, file: !408, line: 91, baseType: !442, size: 64, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !408, line: 37, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !407, file: !408, line: 92, baseType: !445, size: 64, offset: 1280)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !408, line: 38, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !407, file: !408, line: 93, baseType: !426, size: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !407, file: !408, line: 94, baseType: !247, size: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !407, file: !408, line: 95, baseType: !249, size: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !407, file: !408, line: 96, baseType: !182, size: 32, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !407, file: !408, line: 98, baseType: !452, size: 160, offset: 1568)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 20)
!455 = !DILocalVariable(name: "__cnt", scope: !402, file: !181, line: 644, type: !249)
!456 = !DILocalVariable(name: "url_program", scope: !382, file: !181, line: 648, type: !252)
!457 = !DILocalVariable(name: "__ptr", scope: !458, file: !181, line: 686, type: !252)
!458 = distinct !DILexicalBlock(scope: !382, file: !181, line: 686, column: 3)
!459 = !DILocalVariable(name: "__stream", scope: !458, file: !181, line: 686, type: !404)
!460 = !DILocalVariable(name: "__cnt", scope: !458, file: !181, line: 686, type: !249)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !181, line: 585, type: !312, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !181, line: 586, type: !312, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !181, line: 595, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 4)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !181, line: 620, type: !322, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !327, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !312, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !467, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !19, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !181, line: 650, type: !312, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !322, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !322, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !181, line: 652, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 7)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !181, line: 653, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 8)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !181, line: 654, type: !123, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !181, line: 655, type: !123, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !181, line: 656, type: !123, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !181, line: 657, type: !123, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !181, line: 663, type: !488, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !181, line: 664, type: !123, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 17)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 40)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 15)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !74, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !181, line: 679, type: !19, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !181, line: 683, type: !312, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !181, line: 688, type: !312, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !181, line: 691, type: !493, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !181, line: 754, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1784, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 223)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !181, line: 744, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 216)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !181, line: 839, type: !289, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !181, line: 840, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 22)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !181, line: 841, type: !520, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !181, line: 862, type: !467, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !181, line: 868, type: !44, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !181, line: 875, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 27)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 51)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !294, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !467, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 257, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 11)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !488, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !520, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 260, type: !19, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 261, type: !322, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !488, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !294, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !572, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !312, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !493, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !312, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 13)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !312, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !493, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !143, file: !2, line: 72, type: !182, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "header_mode", scope: !143, file: !2, line: 135, type: !154, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 34)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 461, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 46)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 482, type: !312, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 486, type: !322, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !510, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !268, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 296, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 37)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !452, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 288, elements: !50)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "ncolumns", scope: !143, file: !2, line: 222, type: !638, isLocal: true, isDefinition: true)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !639, line: 130, baseType: !640)
!639 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !641, line: 18, baseType: !431)
!641 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "ncolumns_alloc", scope: !143, file: !2, line: 222, type: !638, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "columns", scope: !143, file: !2, line: 219, type: !646, isLocal: true, isDefinition: true)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !2, line: 164, size: 320, elements: !649)
!649 = !{!650, !652, !653, !655, !656, !657, !658}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !648, file: !2, line: 166, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !2, line: 153, baseType: !200)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !648, file: !2, line: 167, baseType: !252, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !648, file: !2, line: 168, baseType: !654, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !2, line: 161, baseType: !230)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !648, file: !2, line: 169, baseType: !252, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !648, file: !2, line: 170, baseType: !182, size: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "align_right", scope: !648, file: !2, line: 171, baseType: !337, size: 8, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !648, file: !2, line: 172, baseType: !337, size: 8, offset: 296)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !2, line: 178, type: !488, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 178, type: !572, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !488, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !312, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !312, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !488, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !312, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !312, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !322, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !123, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !322, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !312, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !488, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !488, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !322, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !322, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !2, line: 202, type: !488, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 202, type: !322, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !488, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !322, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !488, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !572, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !312, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !312, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "field_data", scope: !143, file: !2, line: 176, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 3840, elements: !295)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 547, type: !268, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !24, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "all_args_string", scope: !143, file: !2, line: 214, type: !252, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !2, line: 616, type: !322, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !2, line: 621, type: !488, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "nrows_alloc", scope: !143, file: !2, line: 242, type: !638, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "tty_out", scope: !724, file: !2, line: 355, type: !182, isLocal: true, isDefinition: true)
!724 = distinct !DISubprogram(name: "replace_problematic_chars", scope: !2, file: !2, line: 353, type: !725, scopeLine: 354, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !246}
!727 = !{!728}
!728 = !DILocalVariable(name: "cell", arg: 1, scope: !724, file: !2, line: 353, type: !246)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "table", scope: !143, file: !2, line: 238, type: !731, isLocal: true, isDefinition: true)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "nrows", scope: !143, file: !2, line: 242, type: !638, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1329, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 49)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1358, type: !312, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "devlist_table", scope: !143, file: !2, line: 58, type: !744, isLocal: true, isDefinition: true)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !746, line: 56, baseType: !747)
!746 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !746, line: 54, flags: DIFlagFwdDecl)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !282, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 1032, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 129)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1197, type: !488, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1220, type: !138, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1223, type: !312, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !2, line: 920, type: !128, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !143, file: !2, line: 125, type: !765, isLocal: true, isDefinition: true)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !766, line: 31, size: 448, elements: !767)
!766 = !DIFile(filename: "./lib/fsusage.h", directory: "/src", checksumkind: CSK_MD5, checksum: "85913791ba5e4e0263095d6c86df621e")
!767 = !{!768, !769, !770, !771, !772, !773, !774}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !765, file: !766, line: 33, baseType: !259, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !765, file: !766, line: 34, baseType: !259, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !765, file: !766, line: 35, baseType: !259, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !765, file: !766, line: 36, baseType: !259, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !765, file: !766, line: 37, baseType: !337, size: 8, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !765, file: !766, line: 38, baseType: !259, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !765, file: !766, line: 39, baseType: !259, size: 64, offset: 384)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 4352, elements: !511)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !778, line: 50, size: 256, elements: !779)
!778 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!779 = !{!780, !781, !782, !784}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !777, file: !778, line: 52, baseType: !252, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !777, file: !778, line: 55, baseType: !182, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !777, file: !778, line: 56, baseType: !783, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !777, file: !778, line: 57, baseType: !182, size: 32, offset: 192)
!785 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!786 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!787 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!789 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!790 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!791 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!792 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !795, line: 38, type: !796, isLocal: true, isDefinition: true)
!795 = !DIFile(filename: "src/find-mount-point.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02c11bacc56618f441de1ed8fb506d8b")
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 29)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !795, line: 48, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 30)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !795, line: 64, type: !327, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !795, line: 66, type: !3, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !795, line: 81, type: !19, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !795, line: 83, type: !520, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !795, line: 105, type: !615, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !816, line: 3, type: !520, isLocal: true, isDefinition: true)
!816 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "Version", scope: !819, file: !816, line: 3, type: !252, isLocal: false, isDefinition: true)
!819 = distinct !DICompileUnit(language: DW_LANG_C11, file: !816, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !820, splitDebugInlining: false, nameTableKind: None)
!820 = !{!814, !817}
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !823, line: 360, type: !327, isLocal: true, isDefinition: true)
!823 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !823, line: 436, type: !327, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "file_name", scope: !828, file: !829, line: 45, type: !252, isLocal: true, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C11, file: !829, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !830, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!830 = !{!831, !833, !835, !837, !826, !839}
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !829, line: 121, type: !488, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !829, line: 121, type: !294, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !829, line: 123, type: !488, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !829, line: 126, type: !19, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !828, file: !829, line: 55, type: !337, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !843, file: !844, line: 66, type: !889, isLocal: false, isDefinition: true)
!843 = distinct !DICompileUnit(language: DW_LANG_C11, file: !844, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !845, globals: !846, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!845 = !{!247, !254}
!846 = !{!847, !849, !868, !870, !872, !874, !841, !876, !878, !880, !882, !887}
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !844, line: 272, type: !312, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "old_file_name", scope: !851, file: !844, line: 304, type: !252, isLocal: true, isDefinition: true)
!851 = distinct !DISubprogram(name: "verror_at_line", scope: !844, file: !844, line: 298, type: !852, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !843, retainedNodes: !861)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !182, !182, !252, !147, !252, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !856)
!856 = !{!857, !858, !859, !860}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !855, file: !844, baseType: !147, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !855, file: !844, baseType: !147, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !855, file: !844, baseType: !247, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !855, file: !844, baseType: !247, size: 64, offset: 128)
!861 = !{!862, !863, !864, !865, !866, !867}
!862 = !DILocalVariable(name: "status", arg: 1, scope: !851, file: !844, line: 298, type: !182)
!863 = !DILocalVariable(name: "errnum", arg: 2, scope: !851, file: !844, line: 298, type: !182)
!864 = !DILocalVariable(name: "file_name", arg: 3, scope: !851, file: !844, line: 298, type: !252)
!865 = !DILocalVariable(name: "line_number", arg: 4, scope: !851, file: !844, line: 298, type: !147)
!866 = !DILocalVariable(name: "message", arg: 5, scope: !851, file: !844, line: 298, type: !252)
!867 = !DILocalVariable(name: "args", arg: 6, scope: !851, file: !844, line: 298, type: !854)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "old_line_number", scope: !851, file: !844, line: 305, type: !147, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !844, line: 338, type: !467, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !844, line: 346, type: !493, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !844, line: 346, type: !327, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "error_message_count", scope: !843, file: !844, line: 69, type: !147, isLocal: false, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !843, file: !844, line: 295, type: !182, isLocal: false, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !844, line: 208, type: !488, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !844, line: 208, type: !884, isLocal: true, isDefinition: true)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 21)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !844, line: 214, type: !312, isLocal: true, isDefinition: true)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{null}
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !894, file: !895, line: 93, type: !182, isLocal: true, isDefinition: true)
!894 = distinct !DISubprogram(name: "statvfs_works", scope: !895, file: !895, line: 91, type: !896, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !898, retainedNodes: !903)
!895 = !DIFile(filename: "lib/fsusage.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fab138654d25fc15b75ea3e349807dd1")
!896 = !DISubroutineType(types: !897)
!897 = !{!182}
!898 = distinct !DICompileUnit(language: DW_LANG_C11, file: !895, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fsusage.o -MD -MP -MF lib/.deps/libcoreutils_a-fsusage.Tpo -c lib/fsusage.c -o lib/.libcoreutils_a-fsusage.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !899, globals: !900, splitDebugInlining: false, nameTableKind: None)
!899 = !{!259}
!900 = !{!892, !901}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !895, line: 98, type: !488, isLocal: true, isDefinition: true)
!903 = !{!904}
!904 = !DILocalVariable(name: "name", scope: !905, file: !895, line: 96, type: !907)
!905 = distinct !DILexicalBlock(scope: !906, file: !895, line: 95, column: 5)
!906 = distinct !DILexicalBlock(scope: !894, file: !895, line: 94, column: 7)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !908, line: 48, size: 3120, elements: !909)
!908 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "", checksumkind: CSK_MD5, checksum: "025e6c1b1c47580289242d1d03561cee")
!909 = !{!910, !914, !915, !916, !917, !918}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !907, file: !908, line: 51, baseType: !911, size: 520)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 65)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !907, file: !908, line: 54, baseType: !911, size: 520, offset: 520)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !907, file: !908, line: 57, baseType: !911, size: 520, offset: 1040)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !907, file: !908, line: 59, baseType: !911, size: 520, offset: 1560)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !907, file: !908, line: 62, baseType: !911, size: 520, offset: 2080)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !907, file: !908, line: 67, baseType: !911, size: 520, offset: 2600)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !921, line: 226, type: !128, isLocal: true, isDefinition: true)
!921 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !921, line: 227, type: !128, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !921, line: 228, type: !9, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !921, line: 231, type: !128, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "default_tuning", scope: !930, file: !921, line: 134, type: !934, isLocal: true, isDefinition: true)
!930 = distinct !DICompileUnit(language: DW_LANG_C11, file: !921, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !931, globals: !933, splitDebugInlining: false, nameTableKind: None)
!931 = !{!251, !247, !932, !249}
!932 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!933 = !{!919, !922, !924, !926, !928}
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !936, line: 52, baseType: !937)
!936 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !936, line: 40, size: 160, elements: !938)
!938 = !{!939, !940, !941, !942, !943}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !937, file: !936, line: 45, baseType: !932, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !937, file: !936, line: 46, baseType: !932, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !937, file: !936, line: 47, baseType: !932, size: 32, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !937, file: !936, line: 48, baseType: !932, size: 32, offset: 96)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !937, file: !936, line: 49, baseType: !337, size: 8, offset: 128)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !946, line: 161, type: !327, isLocal: true, isDefinition: true)
!946 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !946, line: 163, type: !118, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !946, line: 233, type: !322, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !946, line: 251, type: !322, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "power_letter", scope: !955, file: !946, line: 36, type: !983, isLocal: true, isDefinition: true)
!955 = distinct !DICompileUnit(language: DW_LANG_C11, file: !946, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-human.o -MD -MP -MF lib/.deps/libcoreutils_a-human.Tpo -c lib/human.c -o lib/.libcoreutils_a-human.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !956, retainedTypes: !959, globals: !962, splitDebugInlining: false, nameTableKind: None)
!956 = !{!957, !145}
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !958, line: 47, baseType: !147, size: 32, elements: !163)
!958 = !DIFile(filename: "lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!959 = !{!960, !247}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!962 = !{!944, !947, !949, !951, !953, !963, !965, !967, !969, !971, !973, !977, !981}
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !946, line: 417, type: !572, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !946, line: 418, type: !123, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !946, line: 438, type: !282, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !946, line: 398, type: !520, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !946, line: 398, type: !19, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "block_size_args", scope: !955, file: !946, line: 398, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 192, elements: !20)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !955, file: !946, line: 399, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 64, elements: !328)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !946, line: 408, type: !289, isLocal: true, isDefinition: true)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 88, elements: !573)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !986, line: 108, type: !118, isLocal: true, isDefinition: true)
!986 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "internal_state", scope: !989, file: !986, line: 97, type: !992, isLocal: true, isDefinition: true)
!989 = distinct !DICompileUnit(language: DW_LANG_C11, file: !986, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !990, globals: !991, splitDebugInlining: false, nameTableKind: None)
!990 = !{!247, !249, !254}
!991 = !{!984, !987}
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !993, line: 6, baseType: !994)
!993 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !995, line: 21, baseType: !996)
!995 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !995, line: 13, size: 64, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !996, file: !995, line: 15, baseType: !182, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !996, file: !995, line: 20, baseType: !1000, size: 32, offset: 32)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !996, file: !995, line: 16, size: 32, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1000, file: !995, line: 18, baseType: !147, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1000, file: !995, line: 19, baseType: !467, size: 32)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 461, type: !884, isLocal: true, isDefinition: true)
!1006 = !DIFile(filename: "lib/mountlist.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9c45539f6f3902bf91fbce80e7cbadbc")
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 462, type: !19, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 473, type: !510, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 493, type: !467, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !488, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !312, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !322, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !493, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !488, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !493, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !294, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !488, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !572, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !322, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !322, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !488, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 523, type: !312, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 524, type: !488, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 553, type: !123, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 555, type: !327, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1006, line: 562, type: !312, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "program_name", scope: !1049, file: !1050, line: 31, type: !252, isLocal: false, isDefinition: true)
!1049 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1050, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1051, globals: !1052, splitDebugInlining: false, nameTableKind: None)
!1050 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1051 = !{!247, !246}
!1052 = !{!1047, !1053, !1055}
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 46, type: !493, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !1050, line: 49, type: !467, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1059, file: !1060, line: 46, type: !1085, isLocal: true, isDefinition: true)
!1059 = distinct !DISubprogram(name: "proper_name_lite", scope: !1060, file: !1060, line: 38, type: !1061, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1063, retainedNodes: !1065)
!1060 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!252, !252, !252}
!1063 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1060, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1064, splitDebugInlining: false, nameTableKind: None)
!1064 = !{!1057}
!1065 = !{!1066, !1067, !1068, !1069, !1074}
!1066 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1059, file: !1060, line: 38, type: !252)
!1067 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1059, file: !1060, line: 38, type: !252)
!1068 = !DILocalVariable(name: "translation", scope: !1059, file: !1060, line: 40, type: !252)
!1069 = !DILocalVariable(name: "w", scope: !1059, file: !1060, line: 47, type: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1071, line: 37, baseType: !1072)
!1071 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !258, line: 57, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !258, line: 42, baseType: !147)
!1074 = !DILocalVariable(name: "mbs", scope: !1059, file: !1060, line: 48, type: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !993, line: 6, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !995, line: 21, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !995, line: 13, size: 64, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1077, file: !995, line: 15, baseType: !182, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1077, file: !995, line: 20, baseType: !1081, size: 32, offset: 32)
!1081 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1077, file: !995, line: 16, size: 32, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1081, file: !995, line: 18, baseType: !147, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1081, file: !995, line: 19, baseType: !467, size: 32)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 16, elements: !328)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 78, type: !493, isLocal: true, isDefinition: true)
!1088 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 79, type: !322, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 80, type: !597, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 81, type: !597, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 82, type: !452, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 83, type: !327, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 84, type: !493, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 85, type: !488, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 86, type: !488, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 87, type: !493, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1109, file: !1088, line: 76, type: !1183, isLocal: false, isDefinition: true)
!1109 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1088, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1110, retainedTypes: !1118, globals: !1119, splitDebugInlining: false, nameTableKind: None)
!1110 = !{!1111, !1113, !215}
!1111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1112, line: 42, baseType: !147, size: 32, elements: !188)
!1112 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !1112, line: 254, baseType: !147, size: 32, elements: !1114)
!1114 = !{!1115, !1116, !1117}
!1115 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1116 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1117 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1118 = !{!247, !182, !248, !249}
!1119 = !{!1086, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1120, !1124, !1134, !1136, !1141, !1143, !1145, !1147, !1149, !1172, !1179, !1181}
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1109, file: !1088, line: 92, type: !1122, isLocal: false, isDefinition: true)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 320, elements: !124)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1109, file: !1088, line: 1040, type: !1126, isLocal: false, isDefinition: true)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1088, line: 56, size: 448, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1132, !1133}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1126, file: !1088, line: 59, baseType: !1111, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1126, file: !1088, line: 62, baseType: !182, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1126, file: !1088, line: 66, baseType: !1131, size: 256, offset: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 256, elements: !494)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1126, file: !1088, line: 69, baseType: !252, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1126, file: !1088, line: 72, baseType: !252, size: 64, offset: 384)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1109, file: !1088, line: 107, type: !1126, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(name: "slot0", scope: !1109, file: !1088, line: 831, type: !1138, isLocal: true, isDefinition: true)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1139)
!1139 = !{!1140}
!1140 = !DISubrange(count: 256)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 321, type: !327, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 357, type: !327, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 358, type: !327, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1088, line: 199, type: !488, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(name: "quote", scope: !1151, file: !1088, line: 228, type: !1170, isLocal: true, isDefinition: true)
!1151 = distinct !DISubprogram(name: "gettext_quote", scope: !1088, file: !1088, line: 197, type: !1152, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1109, retainedNodes: !1154)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!252, !252, !1111}
!1154 = !{!1155, !1156, !1157, !1158, !1159}
!1155 = !DILocalVariable(name: "msgid", arg: 1, scope: !1151, file: !1088, line: 197, type: !252)
!1156 = !DILocalVariable(name: "s", arg: 2, scope: !1151, file: !1088, line: 197, type: !1111)
!1157 = !DILocalVariable(name: "translation", scope: !1151, file: !1088, line: 199, type: !252)
!1158 = !DILocalVariable(name: "w", scope: !1151, file: !1088, line: 229, type: !1070)
!1159 = !DILocalVariable(name: "mbs", scope: !1151, file: !1088, line: 230, type: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !993, line: 6, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !995, line: 21, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !995, line: 13, size: 64, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1162, file: !995, line: 15, baseType: !182, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1162, file: !995, line: 20, baseType: !1166, size: 32, offset: 32)
!1166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1162, file: !995, line: 16, size: 32, elements: !1167)
!1167 = !{!1168, !1169}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1166, file: !995, line: 18, baseType: !147, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1166, file: !995, line: 19, baseType: !467, size: 32)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 64, elements: !1171)
!1171 = !{!329, !469}
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(name: "slotvec", scope: !1109, file: !1088, line: 834, type: !1174, isLocal: true, isDefinition: true)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1088, line: 823, size: 128, elements: !1176)
!1176 = !{!1177, !1178}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1175, file: !1088, line: 825, baseType: !249, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1175, file: !1088, line: 826, baseType: !246, size: 64, offset: 64)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(name: "nslots", scope: !1109, file: !1088, line: 832, type: !182, isLocal: true, isDefinition: true)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1109, file: !1088, line: 833, type: !1175, isLocal: true, isDefinition: true)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 704, elements: !573)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !1186, line: 62, type: !327, isLocal: true, isDefinition: true)
!1186 = !DIFile(filename: "lib/save-cwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50106651149ed8104fc2255edd6d8bae")
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 67, type: !294, isLocal: true, isDefinition: true)
!1189 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 69, type: !488, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 83, type: !488, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 83, type: !467, isLocal: true, isDefinition: true)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 85, type: !327, isLocal: true, isDefinition: true)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 88, type: !1200, isLocal: true, isDefinition: true)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1201)
!1201 = !{!1202}
!1202 = !DISubrange(count: 171)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 88, type: !610, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 105, type: !289, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 109, type: !1209, isLocal: true, isDefinition: true)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1210)
!1210 = !{!1211}
!1211 = !DISubrange(count: 23)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 113, type: !1214, isLocal: true, isDefinition: true)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1215)
!1215 = !{!1216}
!1216 = !DISubrange(count: 28)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 120, type: !1219, isLocal: true, isDefinition: true)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1220)
!1220 = !{!1221}
!1221 = !DISubrange(count: 32)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 127, type: !49, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 134, type: !515, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 142, type: !1228, isLocal: true, isDefinition: true)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1229)
!1229 = !{!1230}
!1230 = !DISubrange(count: 44)
!1231 = !DIGlobalVariableExpression(var: !1232, expr: !DIExpression())
!1232 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 150, type: !1233, isLocal: true, isDefinition: true)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1234)
!1234 = !{!1235}
!1235 = !DISubrange(count: 48)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 159, type: !86, isLocal: true, isDefinition: true)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 170, type: !54, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 248, type: !452, isLocal: true, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 248, type: !547, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 254, type: !452, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 254, type: !277, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 254, type: !515, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 259, type: !3, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 259, type: !796, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1256, file: !1257, line: 26, type: !1259, isLocal: false, isDefinition: true)
