; ModuleID = 'src/du.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.duinfo = type { i64, i64, %struct.timespec }
%struct.timespec = type { i64, i64 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.pattern_buffer = type { ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.di_ent = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.mount_entry = type { ptr, ptr, ptr, ptr, i64, i8, ptr }
%struct.dulevel = type { %struct.duinfo, %struct.duinfo }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

!441 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !442, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 4)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !344, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1078, type: !152, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1078, type: !152, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1079, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 27)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "temp_argv", scope: !366, file: !2, line: 1113, type: !374, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !430, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 40)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !361, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !469, isLocal: true, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 184, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 23)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1141, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 72)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1158, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 30)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1165, type: !354, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1187, type: !437, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1190, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 6)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "di_files", scope: !172, file: !2, line: 58, type: !493, isLocal: true, isDefinition: true)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !495, line: 35, flags: DIFlagFwdDecl)
!495 = !DIFile(filename: "./lib/di-set.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6799d6331104f29afec5973dd8498fc3")
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "di_mnt", scope: !172, file: !2, line: 61, type: !493, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "hash_all", scope: !172, file: !2, line: 132, type: !376, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !172, file: !2, line: 153, type: !225, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "localtz", scope: !172, file: !2, line: 179, type: !504, isLocal: true, isDefinition: true)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !505, line: 1039, baseType: !506)
!505 = !DIFile(filename: "./lib/time.h", directory: "/src")
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !505, line: 1039, flags: DIFlagFwdDecl)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "output_block_size", scope: !172, file: !2, line: 182, type: !268, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "tot_dui", scope: !172, file: !2, line: 188, type: !512, isLocal: true, isDefinition: true)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "duinfo", file: !2, line: 68, size: 256, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !2, line: 71, baseType: !268, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !512, file: !2, line: 74, baseType: !268, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tmax", scope: !512, file: !2, line: 78, baseType: !517, size: 128, offset: 128)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !518, line: 11, size: 128, elements: !519)
!518 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !517, file: !518, line: 16, baseType: !274, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !517, file: !518, line: 21, baseType: !522, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !271, line: 197, baseType: !275)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !224, line: 736, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 75)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !530, file: !224, line: 575, type: !225, isLocal: true, isDefinition: true)
!530 = distinct !DISubprogram(name: "oputs_", scope: !224, file: !224, line: 573, type: !531, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !533)
!531 = !DISubroutineType(cc: DW_CC_nocall, types: !532)
!532 = !{null, !261, !261}
!533 = !{!534, !535, !536, !539, !540, !541, !542, !546, !547, !548, !549, !551, !602, !603, !604, !606, !607}
!534 = !DILocalVariable(name: "program", arg: 1, scope: !530, file: !224, line: 573, type: !261)
!535 = !DILocalVariable(name: "option", arg: 2, scope: !530, file: !224, line: 573, type: !261)
!536 = !DILocalVariable(name: "term", scope: !537, file: !224, line: 585, type: !261)
!537 = distinct !DILexicalBlock(scope: !538, file: !224, line: 582, column: 5)
!538 = distinct !DILexicalBlock(scope: !530, file: !224, line: 581, column: 7)
!539 = !DILocalVariable(name: "double_space", scope: !530, file: !224, line: 594, type: !376)
!540 = !DILocalVariable(name: "first_word", scope: !530, file: !224, line: 595, type: !261)
!541 = !DILocalVariable(name: "option_text", scope: !530, file: !224, line: 596, type: !261)
!542 = !DILocalVariable(name: "s", scope: !543, file: !224, line: 608, type: !261)
!543 = distinct !DILexicalBlock(scope: !544, file: !224, line: 605, column: 5)
!544 = distinct !DILexicalBlock(scope: !545, file: !224, line: 604, column: 12)
!545 = distinct !DILexicalBlock(scope: !530, file: !224, line: 597, column: 7)
!546 = !DILocalVariable(name: "spaces", scope: !543, file: !224, line: 609, type: !264)
!547 = !DILocalVariable(name: "anchor_len", scope: !530, file: !224, line: 620, type: !264)
!548 = !DILocalVariable(name: "desc_text", scope: !530, file: !224, line: 625, type: !261)
!549 = !DILocalVariable(name: "__ptr", scope: !550, file: !224, line: 644, type: !261)
!550 = distinct !DILexicalBlock(scope: !530, file: !224, line: 644, column: 3)
!551 = !DILocalVariable(name: "__stream", scope: !550, file: !224, line: 644, type: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !554, line: 7, baseType: !555)
!554 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !556, line: 49, size: 1728, elements: !557)
!556 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !573, !575, !576, !577, !579, !580, !582, !583, !586, !588, !591, !594, !595, !596, !597, !598}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !555, file: !556, line: 51, baseType: !225, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !555, file: !556, line: 54, baseType: !259, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !555, file: !556, line: 55, baseType: !259, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !555, file: !556, line: 56, baseType: !259, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !555, file: !556, line: 57, baseType: !259, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !555, file: !556, line: 58, baseType: !259, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !555, file: !556, line: 59, baseType: !259, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !555, file: !556, line: 60, baseType: !259, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !555, file: !556, line: 61, baseType: !259, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !555, file: !556, line: 64, baseType: !259, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !555, file: !556, line: 65, baseType: !259, size: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !555, file: !556, line: 66, baseType: !259, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !555, file: !556, line: 68, baseType: !571, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !556, line: 36, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !555, file: !556, line: 70, baseType: !574, size: 64, offset: 832)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !555, file: !556, line: 72, baseType: !225, size: 32, offset: 896)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !555, file: !556, line: 73, baseType: !225, size: 32, offset: 928)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !555, file: !556, line: 74, baseType: !578, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !271, line: 152, baseType: !275)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !555, file: !556, line: 77, baseType: !263, size: 16, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !555, file: !556, line: 78, baseType: !581, size: 8, offset: 1040)
!581 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !555, file: !556, line: 79, baseType: !157, size: 8, offset: 1048)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !555, file: !556, line: 81, baseType: !584, size: 64, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !556, line: 43, baseType: null)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !555, file: !556, line: 89, baseType: !587, size: 64, offset: 1152)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !271, line: 153, baseType: !275)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !555, file: !556, line: 91, baseType: !589, size: 64, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !556, line: 37, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !555, file: !556, line: 92, baseType: !592, size: 64, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !556, line: 38, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !555, file: !556, line: 93, baseType: !574, size: 64, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !555, file: !556, line: 94, baseType: !260, size: 64, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !555, file: !556, line: 95, baseType: !264, size: 64, offset: 1472)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !555, file: !556, line: 96, baseType: !225, size: 32, offset: 1536)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !555, file: !556, line: 98, baseType: !599, size: 160, offset: 1568)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 20)
!602 = !DILocalVariable(name: "__cnt", scope: !550, file: !224, line: 644, type: !264)
!603 = !DILocalVariable(name: "url_program", scope: !530, file: !224, line: 648, type: !261)
!604 = !DILocalVariable(name: "__ptr", scope: !605, file: !224, line: 686, type: !261)
!605 = distinct !DILexicalBlock(scope: !530, file: !224, line: 686, column: 3)
!606 = !DILocalVariable(name: "__stream", scope: !605, file: !224, line: 686, type: !552)
!607 = !DILocalVariable(name: "__cnt", scope: !605, file: !224, line: 686, type: !264)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !224, line: 585, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 5)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !224, line: 586, type: !610, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !224, line: 595, type: !442, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !224, line: 620, type: !488, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !224, line: 648, type: !152, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !224, line: 648, type: !610, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !224, line: 649, type: !442, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !224, line: 649, type: !19, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !224, line: 650, type: !610, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !224, line: 651, type: !488, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !224, line: 651, type: !488, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !224, line: 652, type: !300, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !224, line: 653, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 8)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !224, line: 654, type: !162, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !224, line: 655, type: !162, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !224, line: 656, type: !162, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !224, line: 657, type: !162, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !224, line: 663, type: !300, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !224, line: 664, type: !162, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !224, line: 669, type: !437, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !224, line: 669, type: !462, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !224, line: 676, type: !430, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !224, line: 676, type: !80, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !224, line: 679, type: !19, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !224, line: 683, type: !610, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !224, line: 688, type: !610, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !224, line: 691, type: !637, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !224, line: 754, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1784, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 223)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !224, line: 744, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 216)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !224, line: 839, type: !319, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !224, line: 840, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 22)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !224, line: 841, type: !430, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !224, line: 862, type: !442, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !224, line: 868, type: !9, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !224, line: 875, type: !453, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !224, line: 877, type: !695, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 51)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !224, line: 877, type: !324, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !442, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !279, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !354, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !2, line: 214, type: !488, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !324, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 219, type: !324, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 220, type: !437, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !2, line: 221, type: !637, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !329, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !324, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !2, line: 224, type: !430, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !2, line: 225, type: !300, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !19, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !162, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !610, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !430, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !319, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !279, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !162, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !162, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !610, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !354, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !610, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !637, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "long_options", scope: !172, file: !2, line: 209, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 6656, elements: !760)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !753, line: 50, size: 256, elements: !754)
!753 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!754 = !{!755, !756, !757, !759}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !753, line: 52, baseType: !261, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !752, file: !753, line: 55, baseType: !225, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !753, line: 56, baseType: !758, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !752, file: !753, line: 57, baseType: !225, size: 32, offset: 192)
!760 = !{!761}
!761 = !DISubrange(count: 26)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "opt_nul_terminate_output", scope: !172, file: !2, line: 135, type: !376, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "opt_all", scope: !172, file: !2, line: 122, type: !376, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "apparent_size", scope: !172, file: !2, line: 126, type: !376, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !172, file: !2, line: 138, type: !376, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "max_depth", scope: !172, file: !2, line: 146, type: !417, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "opt_count_all", scope: !172, file: !2, line: 129, type: !376, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "opt_threshold", scope: !172, file: !2, line: 150, type: !388, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "opt_separate_dirs", scope: !172, file: !2, line: 141, type: !376, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "opt_inodes", scope: !172, file: !2, line: 156, type: !376, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "opt_time", scope: !172, file: !2, line: 159, type: !376, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "time_types", scope: !172, file: !2, line: 246, type: !784, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 160, elements: !611)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !488, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !300, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !442, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !488, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !300, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "time_args", scope: !172, file: !2, line: 242, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 384, elements: !489)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "time_type", scope: !172, file: !2, line: 170, type: !218, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "time_style", scope: !172, file: !2, line: 173, type: !261, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "time_format", scope: !172, file: !2, line: 176, type: !261, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1015, type: !354, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1022, type: !682, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1024, type: !361, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1026, type: !162, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1027, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 54)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !361, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !442, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "time_style_args", scope: !172, file: !2, line: 262, type: !825, isLocal: true, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 256, elements: !443)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "time_style_types", scope: !172, file: !2, line: 266, type: !828, isLocal: true, isDefinition: true)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 96, elements: !20)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !2, line: 742, type: !599, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !2, line: 764, type: !437, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "prev_level", scope: !172, file: !2, line: 65, type: !417, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "n_alloc", scope: !838, file: !2, line: 543, type: !417, isLocal: true, isDefinition: true)
!838 = distinct !DISubprogram(name: "process_file", scope: !2, file: !2, line: 538, type: !839, scopeLine: 539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !946)
!839 = !DISubroutineType(types: !840)
!840 = !{!376, !841, !944}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !843, line: 233, baseType: !844)
!843 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !843, line: 115, size: 1024, elements: !845)
!845 = !{!846, !904, !905, !907, !910, !911, !912, !913, !914, !915, !922, !923, !926, !933}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !844, file: !843, line: 116, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !843, line: 235, size: 2048, elements: !849)
!849 = !{!850, !851, !852, !853, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !900}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !848, file: !843, line: 236, baseType: !847, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !848, file: !843, line: 237, baseType: !847, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !848, file: !843, line: 238, baseType: !847, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !848, file: !843, line: 239, baseType: !854, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !856, line: 127, baseType: !857)
!856 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !856, line: 127, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !848, file: !843, line: 242, baseType: !275, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !848, file: !843, line: 243, baseType: !260, size: 64, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !848, file: !843, line: 244, baseType: !259, size: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !848, file: !843, line: 245, baseType: !259, size: 64, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !848, file: !843, line: 246, baseType: !225, size: 32, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !848, file: !843, line: 247, baseType: !225, size: 32, offset: 544)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !848, file: !843, line: 248, baseType: !264, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !848, file: !843, line: 250, baseType: !841, size: 64, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !848, file: !843, line: 254, baseType: !419, size: 64, offset: 704)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !848, file: !843, line: 256, baseType: !264, size: 64, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !848, file: !843, line: 272, baseType: !263, size: 16, offset: 832)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !848, file: !843, line: 276, baseType: !263, size: 16, offset: 848)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !848, file: !843, line: 282, baseType: !263, size: 16, offset: 864)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !848, file: !843, line: 284, baseType: !872, size: 1152, offset: 896)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 1152, elements: !158)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !874, line: 26, size: 1152, elements: !875)
!874 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!875 = !{!876, !878, !880, !882, !884, !886, !888, !889, !890, !891, !893, !895, !896, !897, !898}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !873, file: !874, line: 31, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !271, line: 145, baseType: !266)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !873, file: !874, line: 36, baseType: !879, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !271, line: 148, baseType: !266)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !873, file: !874, line: 44, baseType: !881, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !271, line: 151, baseType: !266)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !873, file: !874, line: 45, baseType: !883, size: 32, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !271, line: 150, baseType: !176)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !873, file: !874, line: 47, baseType: !885, size: 32, offset: 224)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !271, line: 146, baseType: !176)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !873, file: !874, line: 48, baseType: !887, size: 32, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !271, line: 147, baseType: !176)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !873, file: !874, line: 50, baseType: !225, size: 32, offset: 288)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !873, file: !874, line: 52, baseType: !877, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !873, file: !874, line: 57, baseType: !578, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !873, file: !874, line: 61, baseType: !892, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !271, line: 175, baseType: !275)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !873, file: !874, line: 63, baseType: !894, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !271, line: 180, baseType: !275)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !873, file: !874, line: 74, baseType: !517, size: 128, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !873, file: !874, line: 75, baseType: !517, size: 128, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !873, file: !874, line: 76, baseType: !517, size: 128, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !873, file: !874, line: 89, baseType: !899, size: 192, offset: 960)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 192, elements: !20)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !848, file: !843, line: 285, baseType: !901, offset: 2048)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: -1)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !844, file: !843, line: 117, baseType: !847, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !844, file: !843, line: 118, baseType: !906, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !844, file: !843, line: 119, baseType: !908, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !909, line: 59, baseType: !877)
!909 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !844, file: !843, line: 120, baseType: !259, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !844, file: !843, line: 121, baseType: !225, size: 32, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !844, file: !843, line: 122, baseType: !225, size: 32, offset: 352)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !844, file: !843, line: 124, baseType: !264, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !844, file: !843, line: 125, baseType: !264, size: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !844, file: !843, line: 126, baseType: !916, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!225, !919, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !844, file: !843, line: 196, baseType: !225, size: 32, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !844, file: !843, line: 205, baseType: !924, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !843, line: 205, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !844, file: !843, line: 227, baseType: !927, size: 64, offset: 704)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !844, file: !843, line: 207, size: 64, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !927, file: !843, line: 220, baseType: !924, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !927, file: !843, line: 226, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !843, line: 226, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !844, file: !843, line: 232, baseType: !934, size: 256, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !935, line: 47, baseType: !936)
!935 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !935, line: 39, size: 256, elements: !937)
!937 = !{!938, !940, !941, !942, !943}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !936, file: !935, line: 41, baseType: !939, size: 128)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !443)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !936, file: !935, line: 42, baseType: !225, size: 32, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !936, file: !935, line: 43, baseType: !176, size: 32, offset: 160)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !936, file: !935, line: 44, baseType: !176, size: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !936, file: !935, line: 45, baseType: !376, size: 8, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !843, line: 286, baseType: !848)
!946 = !{!947, !948, !949, !950, !951, !952, !953, !956, !957, !961, !968, !973, !974, !981}
!947 = !DILocalVariable(name: "fts", arg: 1, scope: !838, file: !2, line: 538, type: !841)
!948 = !DILocalVariable(name: "ent", arg: 2, scope: !838, file: !2, line: 538, type: !944)
!949 = !DILocalVariable(name: "ok", scope: !838, file: !2, line: 540, type: !376)
!950 = !DILocalVariable(name: "dui", scope: !838, file: !2, line: 541, type: !512)
!951 = !DILocalVariable(name: "dui_to_print", scope: !838, file: !2, line: 542, type: !512)
!952 = !DILocalVariable(name: "file", scope: !838, file: !2, line: 554, type: !261)
!953 = !DILocalVariable(name: "sb", scope: !838, file: !2, line: 555, type: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!956 = !DILocalVariable(name: "info", scope: !838, file: !2, line: 556, type: !225)
!957 = !DILocalVariable(name: "excluded", scope: !958, file: !2, line: 566, type: !376)
!958 = distinct !DILexicalBlock(scope: !959, file: !2, line: 565, column: 5)
!959 = distinct !DILexicalBlock(scope: !960, file: !2, line: 564, column: 12)
!960 = distinct !DILexicalBlock(scope: !838, file: !2, line: 558, column: 7)
!961 = !DILocalVariable(name: "e", scope: !962, file: !2, line: 574, type: !966)
!962 = distinct !DILexicalBlock(scope: !963, file: !2, line: 572, column: 13)
!963 = distinct !DILexicalBlock(scope: !964, file: !2, line: 571, column: 15)
!964 = distinct !DILexicalBlock(scope: !965, file: !2, line: 568, column: 9)
!965 = distinct !DILexicalBlock(scope: !958, file: !2, line: 567, column: 11)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!968 = !DILocalVariable(name: "e", scope: !969, file: !2, line: 607, type: !966)
!969 = distinct !DILexicalBlock(scope: !970, file: !2, line: 605, column: 13)
!970 = distinct !DILexicalBlock(scope: !971, file: !2, line: 604, column: 15)
!971 = distinct !DILexicalBlock(scope: !972, file: !2, line: 600, column: 9)
!972 = distinct !DILexicalBlock(scope: !958, file: !2, line: 596, column: 11)
!973 = !DILocalVariable(name: "level", scope: !838, file: !2, line: 645, type: !417)
!974 = !DILocalVariable(name: "i", scope: !975, file: !2, line: 670, type: !417)
!975 = distinct !DILexicalBlock(scope: !976, file: !2, line: 670, column: 11)
!976 = distinct !DILexicalBlock(scope: !977, file: !2, line: 660, column: 9)
!977 = distinct !DILexicalBlock(scope: !978, file: !2, line: 659, column: 16)
!978 = distinct !DILexicalBlock(scope: !979, file: !2, line: 655, column: 11)
!979 = distinct !DILexicalBlock(scope: !980, file: !2, line: 654, column: 5)
!980 = distinct !DILexicalBlock(scope: !838, file: !2, line: 648, column: 7)
!981 = !DILocalVariable(name: "v", scope: !982, file: !2, line: 709, type: !268)
!982 = distinct !DILexicalBlock(scope: !983, file: !2, line: 707, column: 5)
!983 = distinct !DILexicalBlock(scope: !838, file: !2, line: 704, column: 7)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "dulvl", scope: !838, file: !2, line: 552, type: !986, isLocal: true, isDefinition: true)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dulevel", file: !2, line: 112, size: 512, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !987, file: !2, line: 115, baseType: !512, size: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "subdir", scope: !987, file: !2, line: 118, baseType: !512, size: 256, offset: 256)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !284, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !2, line: 575, type: !361, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !2, line: 575, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 288, elements: !76)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !437, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 630, type: !1002, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 186)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !2, line: 684, type: !167, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !361, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !224, line: 952, type: !324, isLocal: true, isDefinition: true)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !1013, line: 57, flags: DIFlagFwdDecl)
!1013 = !DIFile(filename: "./lib/exclude.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9923a67d64662c8e3bb6144e4abd8844")
!1014 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1015 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1016 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1017 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1018 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1019 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1020 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1021 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !1024, line: 27, type: !167, isLocal: true, isDefinition: true)
!1024 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1024, line: 35, type: !309, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 3, type: !430, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "Version", scope: !1032, file: !1029, line: 3, type: !261, isLocal: false, isDefinition: true)
!1032 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1033, splitDebugInlining: false, nameTableKind: None)
!1033 = !{!1027, !1030}
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1036, file: !1037, line: 65, type: !1061, isLocal: false, isDefinition: true)
!1036 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1037, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1038, retainedTypes: !1041, globals: !1042, splitDebugInlining: false, nameTableKind: None)
!1037 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1038 = !{!1039}
!1039 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1040, line: 42, baseType: !176, size: 32, elements: !206)
!1040 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1041 = !{!260, !261, !267}
!1042 = !{!1034, !1043, !1045, !1047, !1052, !1057, !1059}
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 141, type: !300, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 141, type: !453, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 142, type: !1049, isLocal: true, isDefinition: true)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 29)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 160, type: !1054, isLocal: true, isDefinition: true)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 21)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 165, type: !637, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 170, type: !610, isLocal: true, isDefinition: true)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1062, line: 69, baseType: !1063)
!1062 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null}
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(name: "file_name", scope: !1068, file: !1069, line: 45, type: !261, isLocal: true, isDefinition: true)
!1068 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1069, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1070, splitDebugInlining: false, nameTableKind: None)
!1069 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1070 = !{!1071, !1073, !1075, !1077, !1066, !1079}
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1069, line: 121, type: !300, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !1069, line: 121, type: !324, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !1069, line: 123, type: !300, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(scope: null, file: !1069, line: 126, type: !19, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1068, file: !1069, line: 55, type: !376, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1083, file: !1084, line: 66, type: !1063, isLocal: false, isDefinition: true)
!1083 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1084, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1085, globals: !1086, splitDebugInlining: false, nameTableKind: None)
!1084 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1085 = !{!260, !267}
!1086 = !{!1087, !1089, !1108, !1110, !1112, !1114, !1081, !1116, !1118, !1120, !1122, !1124}
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 272, type: !610, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1091, file: !1084, line: 304, type: !261, isLocal: true, isDefinition: true)
!1091 = distinct !DISubprogram(name: "verror_at_line", scope: !1084, file: !1084, line: 298, type: !1092, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1083, retainedNodes: !1101)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{null, !225, !225, !261, !176, !261, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1095, file: !1084, baseType: !176, size: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1095, file: !1084, baseType: !176, size: 32, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1095, file: !1084, baseType: !260, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1095, file: !1084, baseType: !260, size: 64, offset: 128)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107}
!1102 = !DILocalVariable(name: "status", arg: 1, scope: !1091, file: !1084, line: 298, type: !225)
!1103 = !DILocalVariable(name: "errnum", arg: 2, scope: !1091, file: !1084, line: 298, type: !225)
!1104 = !DILocalVariable(name: "file_name", arg: 3, scope: !1091, file: !1084, line: 298, type: !261)
!1105 = !DILocalVariable(name: "line_number", arg: 4, scope: !1091, file: !1084, line: 298, type: !176)
!1106 = !DILocalVariable(name: "message", arg: 5, scope: !1091, file: !1084, line: 298, type: !261)
!1107 = !DILocalVariable(name: "args", arg: 6, scope: !1091, file: !1084, line: 298, type: !1094)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1091, file: !1084, line: 305, type: !176, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 338, type: !442, isLocal: true, isDefinition: true)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 346, type: !637, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 346, type: !152, isLocal: true, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1083, file: !1084, line: 69, type: !176, isLocal: false, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1083, file: !1084, line: 295, type: !225, isLocal: false, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 208, type: !300, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 208, type: !1054, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 214, type: !610, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(name: "patsuffix", scope: !1128, file: !1129, line: 543, type: !422, isLocal: true, isDefinition: true)
!1128 = distinct !DISubprogram(name: "add_exclude", scope: !1129, file: !1129, line: 508, type: !1130, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1200, retainedNodes: !1218)
!1129 = !DIFile(filename: "lib/exclude.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa512123465487c1fb7947405d851ab7")
!1130 = !DISubroutineType(types: !1131)
!1131 = !{null, !1132, !261, !225}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !1129, line: 123, size: 128, elements: !1134)
!1134 = !{!1135, !1194}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1133, file: !1129, line: 125, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_segment", file: !1129, line: 103, size: 320, elements: !1138)
!1138 = !{!1139, !1140, !1145, !1146}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1137, file: !1129, line: 105, baseType: !1136, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1137, file: !1129, line: 106, baseType: !1141, size: 32, offset: 64)
!1141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exclude_type", file: !1129, line: 97, baseType: !176, size: 32, elements: !1142)
!1142 = !{!1143, !1144}
!1143 = !DIEnumerator(name: "exclude_hash", value: 0)
!1144 = !DIEnumerator(name: "exclude_pattern", value: 1)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1137, file: !1129, line: 107, baseType: !225, size: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1137, file: !1129, line: 112, baseType: !1147, size: 192, offset: 128)
!1147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1137, file: !1129, line: 108, size: 192, elements: !1148)
!1148 = !{!1149, !1154}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1147, file: !1129, line: 110, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1152, line: 56, baseType: !1153)
!1152 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1152, line: 54, flags: DIFlagFwdDecl)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pat", scope: !1147, file: !1129, line: 111, baseType: !1155, size: 192)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_pattern", file: !1129, line: 90, size: 192, elements: !1156)
!1156 = !{!1157, !1190, !1193}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "exclude", scope: !1155, file: !1129, line: 92, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "patopts", file: !1129, line: 78, size: 576, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1159, file: !1129, line: 80, baseType: !225, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1159, file: !1129, line: 85, baseType: !1163, size: 512, offset: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1159, file: !1129, line: 81, size: 512, elements: !1164)
!1164 = !{!1165, !1166}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !1163, file: !1129, line: 83, baseType: !261, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1163, file: !1129, line: 84, baseType: !1167, size: 512)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !1168, line: 478, baseType: !1169)
!1168 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !1168, line: 413, size: 512, elements: !1170)
!1170 = !{!1171, !1174, !1176, !1177, !1179, !1180, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1169, file: !1168, line: 417, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !1168, line: 417, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1169, file: !1168, line: 420, baseType: !1175, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !1168, line: 56, baseType: !266)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1169, file: !1168, line: 423, baseType: !1175, size: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !1169, file: !1168, line: 426, baseType: !1178, size: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !1168, line: 71, baseType: !266)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !1169, file: !1168, line: 431, baseType: !259, size: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !1169, file: !1168, line: 437, baseType: !1181, size: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !1169, file: !1168, line: 440, baseType: !264, size: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !1169, file: !1168, line: 446, baseType: !176, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !1169, file: !1168, line: 457, baseType: !176, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !1169, file: !1168, line: 461, baseType: !176, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !1169, file: !1168, line: 465, baseType: !176, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !1169, file: !1168, line: 469, baseType: !176, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !1169, file: !1168, line: 472, baseType: !176, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !1169, file: !1168, line: 475, baseType: !176, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_alloc", scope: !1155, file: !1129, line: 93, baseType: !1191, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1192, line: 130, baseType: !419)
!1192 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_count", scope: !1155, file: !1129, line: 94, baseType: !1191, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "patbuf", scope: !1133, file: !1129, line: 126, baseType: !1195, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pattern_buffer", file: !1129, line: 115, size: 128, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1196, file: !1129, line: 117, baseType: !1195, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1196, file: !1129, line: 118, baseType: !259, size: 64, offset: 64)
!1200 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1129, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exclude.o -MD -MP -MF lib/.deps/libcoreutils_a-exclude.Tpo -c lib/exclude.c -o lib/.libcoreutils_a-exclude.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1201, retainedTypes: !1212, globals: !1213, splitDebugInlining: false, nameTableKind: None)
!1201 = !{!1141, !241, !1202, !1206, !1209}
!1202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1203, line: 127, baseType: !176, size: 32, elements: !1204)
!1203 = !DIFile(filename: "lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!1204 = !{!1205}
!1205 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!1206 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1203, line: 131, baseType: !176, size: 32, elements: !1207)
!1207 = !{!1208}
!1208 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!1209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1203, line: 130, baseType: !176, size: 32, elements: !1210)
!1210 = !{!1211}
!1211 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!1212 = !{!225, !267, !263, !264, !1181}
!1213 = !{!1126, !1214, !1216}
!1214 = !DIGlobalVariableExpression(var: !1215, expr: !DIExpression())
!1215 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 662, type: !152, isLocal: true, isDefinition: true)
!1216 = !DIGlobalVariableExpression(var: !1217, expr: !DIExpression())
!1217 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 665, type: !19, isLocal: true, isDefinition: true)
!1218 = !{!1219, !1220, !1221, !1222, !1226, !1227, !1230, !1231, !1234, !1239, !1243, !1245}
!1219 = !DILocalVariable(name: "ex", arg: 1, scope: !1128, file: !1129, line: 508, type: !1132)
!1220 = !DILocalVariable(name: "pattern", arg: 2, scope: !1128, file: !1129, line: 508, type: !261)
!1221 = !DILocalVariable(name: "options", arg: 3, scope: !1128, file: !1129, line: 508, type: !225)
!1222 = !DILocalVariable(name: "pat", scope: !1223, file: !1129, line: 518, type: !1225)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !1129, line: 512, column: 5)
!1224 = distinct !DILexicalBlock(scope: !1128, file: !1129, line: 510, column: 7)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1226 = !DILocalVariable(name: "patopts", scope: !1223, file: !1129, line: 522, type: !1158)
!1227 = !DILocalVariable(name: "cflags", scope: !1228, file: !1129, line: 527, type: !225)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !1129, line: 526, column: 9)
!1229 = distinct !DILexicalBlock(scope: !1223, file: !1129, line: 525, column: 11)
!1230 = !DILocalVariable(name: "rc", scope: !1228, file: !1129, line: 530, type: !225)
!1231 = !DILocalVariable(name: "len", scope: !1232, file: !1129, line: 534, type: !1191)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !1129, line: 534, column: 13)
!1233 = distinct !DILexicalBlock(scope: !1228, file: !1129, line: 531, column: 15)
!1234 = !DILocalVariable(name: "tmp", scope: !1235, file: !1129, line: 544, type: !259)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !1129, line: 542, column: 19)
!1236 = distinct !DILexicalBlock(scope: !1237, file: !1129, line: 541, column: 21)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !1129, line: 535, column: 15)
!1238 = distinct !DILexicalBlock(scope: !1232, file: !1129, line: 534, column: 13)
!1239 = !DILocalVariable(name: "dup", scope: !1240, file: !1129, line: 563, type: !259)
!1240 = distinct !DILexicalBlock(scope: !1241, file: !1129, line: 562, column: 13)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !1129, line: 561, column: 15)
!1242 = distinct !DILexicalBlock(scope: !1229, file: !1129, line: 560, column: 9)
!1243 = !DILocalVariable(name: "exclude_hash_flags", scope: !1244, file: !1129, line: 572, type: !225)
!1244 = distinct !DILexicalBlock(scope: !1224, file: !1129, line: 571, column: 5)
!1245 = !DILocalVariable(name: "str", scope: !1244, file: !1129, line: 579, type: !259)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1248, line: 1143, type: !488, isLocal: true, isDefinition: true)
!1248 = !DIFile(filename: "lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!1249 = !DIGlobalVariableExpression(var: !1250, expr: !DIExpression())
!1250 = distinct !DIGlobalVariable(scope: null, file: !1248, line: 1146, type: !637, isLocal: true, isDefinition: true)
!1251 = !DIGlobalVariableExpression(var: !1252, expr: !DIExpression())
!1252 = distinct !DIGlobalVariable(scope: null, file: !1248, line: 1149, type: !488, isLocal: true, isDefinition: true)
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !1255, file: !1281, line: 75, type: !1350, isLocal: true, isDefinition: true)
!1255 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1256, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fprintftime.o -MD -MP -MF lib/.deps/libcoreutils_a-fprintftime.Tpo -c lib/fprintftime.c -o lib/.libcoreutils_a-fprintftime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1257, retainedTypes: !1265, globals: !1274, splitDebugInlining: false, nameTableKind: None)
!1256 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!1257 = !{!1258}
!1258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !1248, line: 163, baseType: !176, size: 32, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264}
!1260 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!1261 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!1262 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!1263 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!1264 = !DIEnumerator(name: "NO_PAD", value: 4)
!1265 = !{!260, !176, !225, !267, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !505, line: 1039, baseType: !1267)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1269, line: 24, size: 128, elements: !1270)
!1269 = !DIFile(filename: "lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!1270 = !{!1271, !1272, !1273}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1268, file: !1269, line: 28, baseType: !1267, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1268, file: !1269, line: 33, baseType: !4, size: 8, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1268, file: !1269, line: 45, baseType: !901, offset: 72)
!1274 = !{!1246, !1249, !1251, !1275, !1277, !1279, !1253, !1282, !1284, !1286, !1291, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1315, !1317, !1319, !1321, !1323, !1325, !1330, !1332, !1334, !1336, !1345, !1348, !1367, !1369, !1371, !1373, !1375, !1377, !1379, !1381, !1383, !1385, !1387, !1389, !1391, !1394, !1397, !1399, !1401, !1403, !1405, !1407, !1409, !1411, !1413, !1415, !1417, !1419, !1421, !1423, !1425, !1427, !1429, !1431, !1433, !1435, !1437, !1439, !1441, !1443, !1445, !1448, !1450, !1452, !1454}
!1275 = !DIGlobalVariableExpression(var: !1276, expr: !DIExpression())
!1276 = distinct !DIGlobalVariable(scope: null, file: !1248, line: 1151, type: !488, isLocal: true, isDefinition: true)
!1277 = !DIGlobalVariableExpression(var: !1278, expr: !DIExpression())
!1278 = distinct !DIGlobalVariable(scope: null, file: !1248, line: 1153, type: !488, isLocal: true, isDefinition: true)
!1279 = !DIGlobalVariableExpression(var: !1280, expr: !DIExpression())
!1280 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 78, type: !361, isLocal: true, isDefinition: true)
!1281 = !DIFile(filename: "lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!1282 = !DIGlobalVariableExpression(var: !1283, expr: !DIExpression())
!1283 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 26, type: !314, isLocal: true, isDefinition: true)
!1284 = !DIGlobalVariableExpression(var: !1285, expr: !DIExpression())
!1285 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 26, type: !361, isLocal: true, isDefinition: true)
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 27, type: !1288, isLocal: true, isDefinition: true)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1289)
!1289 = !{!1290}
!1290 = !DISubrange(count: 31)
!1291 = !DIGlobalVariableExpression(var: !1292, expr: !DIExpression())
!1292 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 27, type: !361, isLocal: true, isDefinition: true)
!1293 = !DIGlobalVariableExpression(var: !1294, expr: !DIExpression())
!1294 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 28, type: !314, isLocal: true, isDefinition: true)
!1295 = !DIGlobalVariableExpression(var: !1296, expr: !DIExpression())
!1296 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 28, type: !324, isLocal: true, isDefinition: true)
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 29, type: !314, isLocal: true, isDefinition: true)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 29, type: !324, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 30, type: !682, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
!1304 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 30, type: !361, isLocal: true, isDefinition: true)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 31, type: !284, isLocal: true, isDefinition: true)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 31, type: !324, isLocal: true, isDefinition: true)
!1309 = !DIGlobalVariableExpression(var: !1310, expr: !DIExpression())
!1310 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 32, type: !682, isLocal: true, isDefinition: true)
!1311 = !DIGlobalVariableExpression(var: !1312, expr: !DIExpression())
!1312 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 32, type: !361, isLocal: true, isDefinition: true)
!1313 = !DIGlobalVariableExpression(var: !1314, expr: !DIExpression())
!1314 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 33, type: !682, isLocal: true, isDefinition: true)
!1315 = !DIGlobalVariableExpression(var: !1316, expr: !DIExpression())
!1316 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 33, type: !361, isLocal: true, isDefinition: true)
!1317 = !DIGlobalVariableExpression(var: !1318, expr: !DIExpression())
!1318 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 34, type: !682, isLocal: true, isDefinition: true)
!1319 = !DIGlobalVariableExpression(var: !1320, expr: !DIExpression())
!1320 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 34, type: !361, isLocal: true, isDefinition: true)
!1321 = !DIGlobalVariableExpression(var: !1322, expr: !DIExpression())
!1322 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 35, type: !314, isLocal: true, isDefinition: true)
!1323 = !DIGlobalVariableExpression(var: !1324, expr: !DIExpression())
!1324 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 35, type: !361, isLocal: true, isDefinition: true)
!1325 = !DIGlobalVariableExpression(var: !1326, expr: !DIExpression())
!1326 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 36, type: !1327, isLocal: true, isDefinition: true)
!1327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1328)
!1328 = !{!1329}
!1329 = !DISubrange(count: 28)
!1330 = !DIGlobalVariableExpression(var: !1331, expr: !DIExpression())
!1331 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 36, type: !361, isLocal: true, isDefinition: true)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 37, type: !682, isLocal: true, isDefinition: true)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(scope: null, file: !1281, line: 37, type: !361, isLocal: true, isDefinition: true)
!1336 = !DIGlobalVariableExpression(var: !1337, expr: !DIExpression())
!1337 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !1255, file: !1281, line: 21, type: !1338, isLocal: true, isDefinition: true)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 1920, elements: !431)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !1341, line: 19, size: 128, elements: !1342)
!1341 = !DIFile(filename: "lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!1342 = !{!1343, !1344}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1340, file: !1341, line: 21, baseType: !261, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !1340, file: !1341, line: 22, baseType: !261, size: 64, offset: 64)
!1345 = !DIGlobalVariableExpression(var: !1346, expr: !DIExpression())
!1346 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 134, type: !324, isLocal: true, isDefinition: true)
!1347 = !DIFile(filename: "lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!1348 = !DIGlobalVariableExpression(var: !1349, expr: !DIExpression())
!1349 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !1255, file: !1347, line: 131, type: !1350, isLocal: true, isDefinition: true)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !1341, line: 33, size: 192, elements: !1352)
!1352 = !{!1353, !1365, !1366}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !1351, file: !1341, line: 39, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!225, !1357, !225, !225, !225}
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !1341, line: 25, size: 192, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1358, file: !1341, line: 27, baseType: !225, size: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1358, file: !1341, line: 28, baseType: !225, size: 32, offset: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1358, file: !1341, line: 29, baseType: !225, size: 32, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !1358, file: !1341, line: 30, baseType: !1364, size: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !1351, file: !1341, line: 42, baseType: !261, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !1351, file: !1341, line: 44, baseType: !176, size: 32, offset: 128)
!1367 = !DIGlobalVariableExpression(var: !1368, expr: !DIExpression())
!1368 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 39, type: !430, isLocal: true, isDefinition: true)
!1369 = !DIGlobalVariableExpression(var: !1370, expr: !DIExpression())
!1370 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 40, type: !437, isLocal: true, isDefinition: true)
!1371 = !DIGlobalVariableExpression(var: !1372, expr: !DIExpression())
!1372 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 41, type: !354, isLocal: true, isDefinition: true)
!1373 = !DIGlobalVariableExpression(var: !1374, expr: !DIExpression())
!1374 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 42, type: !300, isLocal: true, isDefinition: true)
!1375 = !DIGlobalVariableExpression(var: !1376, expr: !DIExpression())
!1376 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 43, type: !354, isLocal: true, isDefinition: true)
!1377 = !DIGlobalVariableExpression(var: !1378, expr: !DIExpression())
!1378 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 44, type: !329, isLocal: true, isDefinition: true)
!1379 = !DIGlobalVariableExpression(var: !1380, expr: !DIExpression())
!1380 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 45, type: !300, isLocal: true, isDefinition: true)
!1381 = !DIGlobalVariableExpression(var: !1382, expr: !DIExpression())
!1382 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 46, type: !361, isLocal: true, isDefinition: true)
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 47, type: !300, isLocal: true, isDefinition: true)
!1385 = !DIGlobalVariableExpression(var: !1386, expr: !DIExpression())
!1386 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 48, type: !610, isLocal: true, isDefinition: true)
!1387 = !DIGlobalVariableExpression(var: !1388, expr: !DIExpression())
!1388 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 49, type: !361, isLocal: true, isDefinition: true)
!1389 = !DIGlobalVariableExpression(var: !1390, expr: !DIExpression())
!1390 = distinct !DIGlobalVariable(scope: null, file: !1347, line: 50, type: !354, isLocal: true, isDefinition: true)
!1391 = !DIGlobalVariableExpression(var: !1392, expr: !DIExpression())
!1392 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !1255, file: !1347, line: 37, type: !1393, isLocal: true, isDefinition: true)
!1393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 1536, elements: !325)
!1394 = !DIGlobalVariableExpression(var: !1395, expr: !DIExpression())
!1395 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !1255, file: !1396, line: 76, type: !1350, isLocal: true, isDefinition: true)
!1396 = !DIFile(filename: "lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!1397 = !DIGlobalVariableExpression(var: !1398, expr: !DIExpression())
!1398 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 23, type: !319, isLocal: true, isDefinition: true)
!1399 = !DIGlobalVariableExpression(var: !1400, expr: !DIExpression())
!1400 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 23, type: !300, isLocal: true, isDefinition: true)
!1401 = !DIGlobalVariableExpression(var: !1402, expr: !DIExpression())
!1402 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 24, type: !329, isLocal: true, isDefinition: true)
!1403 = !DIGlobalVariableExpression(var: !1404, expr: !DIExpression())
!1404 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 24, type: !300, isLocal: true, isDefinition: true)
!1405 = !DIGlobalVariableExpression(var: !1406, expr: !DIExpression())
!1406 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 25, type: !162, isLocal: true, isDefinition: true)
!1407 = !DIGlobalVariableExpression(var: !1408, expr: !DIExpression())
!1408 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 25, type: !300, isLocal: true, isDefinition: true)
!1409 = !DIGlobalVariableExpression(var: !1410, expr: !DIExpression())
!1410 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 26, type: !329, isLocal: true, isDefinition: true)
!1411 = !DIGlobalVariableExpression(var: !1412, expr: !DIExpression())
!1412 = distinct !DIGlobalVariable(scope: null, file: !1396, line: 26, type: !300, isLocal: true, isDefinition: true)
!1413 = !DIGlobalVariableExpression(var: !1414, expr: !DIExpression())
