; ModuleID = 'src/false.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating failure.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"false\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!163 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !3, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !72, line: 679, type: !128, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !72, line: 683, type: !9, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !72, line: 688, type: !9, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !72, line: 691, type: !141, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !72, line: 839, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 16)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !72, line: 840, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 22)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !72, line: 841, type: !164, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !72, line: 862, type: !112, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !72, line: 868, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 71)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !72, line: 875, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 27)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 51)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 12)
!211 = !{!212, !213, !214, !217, !219, !220, !221, !225, !226, !227, !228, !230, !283, !284, !285, !287, !288}
!212 = !DILocalVariable(name: "program", arg: 1, scope: !71, file: !72, line: 573, type: !75)
!213 = !DILocalVariable(name: "option", arg: 2, scope: !71, file: !72, line: 573, type: !75)
!214 = !DILocalVariable(name: "term", scope: !215, file: !72, line: 585, type: !75)
!215 = distinct !DILexicalBlock(scope: !216, file: !72, line: 582, column: 5)
!216 = distinct !DILexicalBlock(scope: !71, file: !72, line: 581, column: 7)
!217 = !DILocalVariable(name: "double_space", scope: !71, file: !72, line: 594, type: !218)
!218 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!219 = !DILocalVariable(name: "first_word", scope: !71, file: !72, line: 595, type: !75)
!220 = !DILocalVariable(name: "option_text", scope: !71, file: !72, line: 596, type: !75)
!221 = !DILocalVariable(name: "s", scope: !222, file: !72, line: 608, type: !75)
!222 = distinct !DILexicalBlock(scope: !223, file: !72, line: 605, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !72, line: 604, column: 12)
!224 = distinct !DILexicalBlock(scope: !71, file: !72, line: 597, column: 7)
!225 = !DILocalVariable(name: "spaces", scope: !222, file: !72, line: 609, type: !101)
!226 = !DILocalVariable(name: "anchor_len", scope: !71, file: !72, line: 620, type: !101)
!227 = !DILocalVariable(name: "desc_text", scope: !71, file: !72, line: 625, type: !75)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !72, line: 644, type: !75)
!229 = distinct !DILexicalBlock(scope: !71, file: !72, line: 644, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !72, line: 644, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !252, !254, !255, !256, !260, !261, !263, !264, !267, !269, !272, !275, !276, !277, !278, !279}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 51, baseType: !99, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 36, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 70, baseType: !253, size: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !258, line: 152, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!259 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 43, baseType: null)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !258, line: 153, baseType: !259)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !235, line: 37, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !235, line: 38, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !235, line: 93, baseType: !253, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 20)
!283 = !DILocalVariable(name: "__cnt", scope: !229, file: !72, line: 644, type: !101)
!284 = !DILocalVariable(name: "url_program", scope: !71, file: !72, line: 648, type: !75)
!285 = !DILocalVariable(name: "__ptr", scope: !286, file: !72, line: 686, type: !75)
!286 = distinct !DILexicalBlock(scope: !71, file: !72, line: 686, column: 3)
!287 = !DILocalVariable(name: "__stream", scope: !286, file: !72, line: 686, type: !231)
!288 = !DILocalVariable(name: "__cnt", scope: !286, file: !72, line: 686, type: !101)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !291, line: 3, type: !164, isLocal: true, isDefinition: true)
!291 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "Version", scope: !294, file: !291, line: 3, type: !75, isLocal: false, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C11, file: !291, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !295, splitDebugInlining: false, nameTableKind: None)
!295 = !{!289, !292}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "file_name", scope: !298, file: !299, line: 45, type: !75, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C11, file: !299, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !300, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!300 = !{!301, !303, !305, !307, !296, !309}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !54, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !208, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !299, line: 123, type: !54, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !299, line: 126, type: !128, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !298, file: !299, line: 55, type: !218, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !313, file: !314, line: 66, type: !359, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C11, file: !314, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !315, globals: !316, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!315 = !{!98, !104}
!316 = !{!317, !319, !338, !340, !342, !344, !311, !346, !348, !350, !352, !357}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !314, line: 272, type: !9, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "old_file_name", scope: !321, file: !314, line: 304, type: !75, isLocal: true, isDefinition: true)
!321 = distinct !DISubprogram(name: "verror_at_line", scope: !314, file: !314, line: 298, type: !322, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !331)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !99, !99, !75, !82, !75, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !325, file: !314, baseType: !82, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !325, file: !314, baseType: !82, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !325, file: !314, baseType: !98, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !325, file: !314, baseType: !98, size: 64, offset: 128)
!331 = !{!332, !333, !334, !335, !336, !337}
!332 = !DILocalVariable(name: "status", arg: 1, scope: !321, file: !314, line: 298, type: !99)
!333 = !DILocalVariable(name: "errnum", arg: 2, scope: !321, file: !314, line: 298, type: !99)
!334 = !DILocalVariable(name: "file_name", arg: 3, scope: !321, file: !314, line: 298, type: !75)
!335 = !DILocalVariable(name: "line_number", arg: 4, scope: !321, file: !314, line: 298, type: !82)
!336 = !DILocalVariable(name: "message", arg: 5, scope: !321, file: !314, line: 298, type: !75)
!337 = !DILocalVariable(name: "args", arg: 6, scope: !321, file: !314, line: 298, type: !324)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "old_line_number", scope: !321, file: !314, line: 305, type: !82, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !314, line: 338, type: !112, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !141, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !119, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "error_message_count", scope: !313, file: !314, line: 69, type: !82, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !313, file: !314, line: 295, type: !99, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !54, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 21)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !314, line: 214, type: !9, isLocal: true, isDefinition: true)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "program_name", scope: !364, file: !365, line: 31, type: !75, isLocal: false, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C11, file: !365, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, globals: !367, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!366 = !{!98, !97}
!367 = !{!362, !368, !370}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !365, line: 46, type: !141, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !365, line: 49, type: !112, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "utf07FF", scope: !374, file: !375, line: 46, type: !402, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "proper_name_lite", scope: !375, file: !375, line: 38, type: !376, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !380)
!375 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!376 = !DISubroutineType(types: !377)
!377 = !{!75, !75, !75}
!378 = distinct !DICompileUnit(language: DW_LANG_C11, file: !375, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !379, splitDebugInlining: false, nameTableKind: None)
!379 = !{!372}
!380 = !{!381, !382, !383, !384, !389}
!381 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !374, file: !375, line: 38, type: !75)
!382 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !374, file: !375, line: 38, type: !75)
!383 = !DILocalVariable(name: "translation", scope: !374, file: !375, line: 40, type: !75)
!384 = !DILocalVariable(name: "w", scope: !374, file: !375, line: 47, type: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !386, line: 37, baseType: !387)
!386 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !258, line: 57, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !258, line: 42, baseType: !82)
!389 = !DILocalVariable(name: "mbs", scope: !374, file: !375, line: 48, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !391, line: 6, baseType: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !393, line: 21, baseType: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 13, size: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !394, file: !393, line: 15, baseType: !99, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !394, file: !393, line: 20, baseType: !398, size: 32, offset: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !393, line: 16, size: 32, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !398, file: !393, line: 18, baseType: !82, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !398, file: !393, line: 19, baseType: !112, size: 32)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, elements: !120)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !405, line: 78, type: !141, isLocal: true, isDefinition: true)
!405 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !405, line: 79, type: !19, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !405, line: 80, type: !66, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !405, line: 81, type: !66, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !405, line: 82, type: !280, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !405, line: 83, type: !119, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !405, line: 84, type: !141, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !405, line: 85, type: !54, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !405, line: 86, type: !54, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !405, line: 87, type: !141, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !426, file: !405, line: 76, type: !512, isLocal: false, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C11, file: !405, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !447, globals: !448, splitDebugInlining: false, nameTableKind: None)
!427 = !{!428, !442, !80}
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !429, line: 42, baseType: !82, size: 32, elements: !430)
!429 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!431 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!432 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!433 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!434 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!435 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!436 = !DIEnumerator(name: "c_quoting_style", value: 5)
!437 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!438 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!439 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!440 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!441 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !429, line: 254, baseType: !82, size: 32, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!445 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!446 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!447 = !{!98, !99, !100, !101}
!448 = !{!403, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !449, !453, !463, !465, !470, !472, !474, !476, !478, !501, !508, !510}
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !426, file: !405, line: 92, type: !451, isLocal: false, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 320, elements: !45)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !426, file: !405, line: 1040, type: !455, isLocal: false, isDefinition: true)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !405, line: 56, size: 448, elements: !456)
!456 = !{!457, !458, !459, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !455, file: !405, line: 59, baseType: !428, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !405, line: 62, baseType: !99, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !455, file: !405, line: 66, baseType: !460, size: 256, offset: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, elements: !142)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !455, file: !405, line: 69, baseType: !75, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !455, file: !405, line: 72, baseType: !75, size: 64, offset: 384)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !426, file: !405, line: 107, type: !455, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "slot0", scope: !426, file: !405, line: 831, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 256)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !405, line: 321, type: !119, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !405, line: 357, type: !119, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !405, line: 358, type: !119, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !405, line: 199, type: !54, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "quote", scope: !480, file: !405, line: 228, type: !499, isLocal: true, isDefinition: true)
!480 = distinct !DISubprogram(name: "gettext_quote", scope: !405, file: !405, line: 197, type: !481, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !426, retainedNodes: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!75, !75, !428}
!483 = !{!484, !485, !486, !487, !488}
!484 = !DILocalVariable(name: "msgid", arg: 1, scope: !480, file: !405, line: 197, type: !75)
!485 = !DILocalVariable(name: "s", arg: 2, scope: !480, file: !405, line: 197, type: !428)
!486 = !DILocalVariable(name: "translation", scope: !480, file: !405, line: 199, type: !75)
!487 = !DILocalVariable(name: "w", scope: !480, file: !405, line: 229, type: !385)
!488 = !DILocalVariable(name: "mbs", scope: !480, file: !405, line: 230, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !391, line: 6, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !393, line: 21, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 13, size: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !491, file: !393, line: 15, baseType: !99, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !491, file: !393, line: 20, baseType: !495, size: 32, offset: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !491, file: !393, line: 16, size: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !495, file: !393, line: 18, baseType: !82, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !495, file: !393, line: 19, baseType: !112, size: 32)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !500)
!500 = !{!121, !114}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "slotvec", scope: !426, file: !405, line: 834, type: !503, isLocal: true, isDefinition: true)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !405, line: 823, size: 128, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !504, file: !405, line: 825, baseType: !101, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !504, file: !405, line: 826, baseType: !97, size: 64, offset: 64)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "nslots", scope: !426, file: !405, line: 832, type: !99, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "slotvec0", scope: !426, file: !405, line: 833, type: !504, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 704, elements: !514)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!514 = !{!515}
!515 = !DISubrange(count: 11)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !518, line: 67, type: !208, isLocal: true, isDefinition: true)
!518 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !518, line: 69, type: !54, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !518, line: 83, type: !54, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !518, line: 83, type: !112, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !518, line: 85, type: !119, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !518, line: 88, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 171)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !518, line: 88, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 34)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !518, line: 105, type: !179, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !518, line: 109, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 23)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !518, line: 113, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 28)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !518, line: 120, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 32)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !518, line: 127, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 36)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !518, line: 134, type: !159, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !518, line: 142, type: !14, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !518, line: 150, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 48)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !518, line: 159, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 52)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !518, line: 170, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 60)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !518, line: 248, type: !280, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !518, line: 248, type: !184, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !518, line: 254, type: !280, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !518, line: 254, type: !61, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !518, line: 254, type: !159, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !518, line: 259, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 39)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !518, line: 259, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 29)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !600, file: !601, line: 26, type: !603, isLocal: false, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C11, file: !601, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !602, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!602 = !{!598}
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 376, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 47)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "exit_failure", scope: !608, file: !609, line: 24, type: !611, isLocal: false, isDefinition: true)
!608 = distinct !DICompileUnit(language: DW_LANG_C11, file: !609, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !610, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!610 = !{!606}
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !614, line: 34, type: !128, isLocal: true, isDefinition: true)
!614 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !614, line: 34, type: !54, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !614, line: 34, type: !154, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !621, line: 108, type: !39, isLocal: true, isDefinition: true)
!621 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "internal_state", scope: !624, file: !621, line: 97, type: !627, isLocal: true, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C11, file: !621, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !625, globals: !626, splitDebugInlining: false, nameTableKind: None)
!625 = !{!98, !101, !104}
!626 = !{!619, !622}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !391, line: 6, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !393, line: 21, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 13, size: 64, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !629, file: !393, line: 15, baseType: !99, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !629, file: !393, line: 20, baseType: !633, size: 32, offset: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !629, file: !393, line: 16, size: 32, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !633, file: !393, line: 18, baseType: !82, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !633, file: !393, line: 19, baseType: !112, size: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !639, line: 35, type: !19, isLocal: true, isDefinition: true)
!639 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!640 = distinct !DICompileUnit(language: DW_LANG_C11, file: !641, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!642 = distinct !DICompileUnit(language: DW_LANG_C11, file: !518, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !643, retainedTypes: !647, globals: !648, splitDebugInlining: false, nameTableKind: None)
!643 = !{!644}
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !518, line: 40, baseType: !82, size: 32, elements: !645)
!645 = !{!646}
!646 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!647 = !{!98}
!648 = !{!516, !519, !521, !523, !525, !527, !532, !537, !539, !544, !549, !554, !559, !561, !563, !568, !573, !578, !580, !582, !584, !586, !588, !593}
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !650, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !651, retainedTypes: !683, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!651 = !{!652, !664}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !653, file: !650, line: 188, baseType: !82, size: 32, elements: !662)
!653 = distinct !DISubprogram(name: "x2nrealloc", scope: !650, file: !650, line: 176, type: !654, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !657)
!654 = !DISubroutineType(types: !655)
!655 = !{!98, !98, !656, !101}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!657 = !{!658, !659, !660, !661}
!658 = !DILocalVariable(name: "p", arg: 1, scope: !653, file: !650, line: 176, type: !98)
!659 = !DILocalVariable(name: "pn", arg: 2, scope: !653, file: !650, line: 176, type: !656)
!660 = !DILocalVariable(name: "s", arg: 3, scope: !653, file: !650, line: 176, type: !101)
!661 = !DILocalVariable(name: "n", scope: !653, file: !650, line: 178, type: !101)
!662 = !{!663}
!663 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !665, file: !650, line: 228, baseType: !82, size: 32, elements: !662)
!665 = distinct !DISubprogram(name: "xpalloc", scope: !650, file: !650, line: 223, type: !666, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !673)
!666 = !DISubroutineType(types: !667)
!667 = !{!98, !98, !668, !669, !671, !669}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !670, line: 130, baseType: !671)
!670 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !672, line: 18, baseType: !259)
!672 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682}
!674 = !DILocalVariable(name: "pa", arg: 1, scope: !665, file: !650, line: 223, type: !98)
!675 = !DILocalVariable(name: "pn", arg: 2, scope: !665, file: !650, line: 223, type: !668)
!676 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !665, file: !650, line: 223, type: !669)
!677 = !DILocalVariable(name: "n_max", arg: 4, scope: !665, file: !650, line: 223, type: !671)
!678 = !DILocalVariable(name: "s", arg: 5, scope: !665, file: !650, line: 223, type: !669)
!679 = !DILocalVariable(name: "n0", scope: !665, file: !650, line: 230, type: !669)
!680 = !DILocalVariable(name: "n", scope: !665, file: !650, line: 237, type: !669)
!681 = !DILocalVariable(name: "nbytes", scope: !665, file: !650, line: 248, type: !669)
!682 = !DILocalVariable(name: "adjusted_nbytes", scope: !665, file: !650, line: 252, type: !669)
!683 = !{!97, !98}
!684 = distinct !DICompileUnit(language: DW_LANG_C11, file: !614, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !685, splitDebugInlining: false, nameTableKind: None)
!685 = !{!612, !615, !617}
!686 = distinct !DICompileUnit(language: DW_LANG_C11, file: !687, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!688 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!692 = distinct !DICompileUnit(language: DW_LANG_C11, file: !693, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!694 = distinct !DICompileUnit(language: DW_LANG_C11, file: !695, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !697, splitDebugInlining: false, nameTableKind: None)
!697 = !{!698, !637}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !639, line: 35, type: !119, isLocal: true, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !703, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!704 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!705 = !{i32 7, !"Dwarf Version", i32 5}
!706 = !{i32 2, !"Debug Info Version", i32 3}
!707 = !{i32 1, !"wchar_size", i32 4}
!708 = !{i32 8, !"PIC Level", i32 2}
!709 = !{i32 7, !"PIE Level", i32 2}
!710 = !{i32 7, !"uwtable", i32 2}
!711 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!712 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !713, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !715)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !99}
!715 = !{!716}
!716 = !DILocalVariable(name: "status", arg: 1, scope: !712, file: !2, line: 36, type: !99)
!717 = !DILocation(line: 0, scope: !712)
!718 = !DILocation(line: 38, column: 3, scope: !712)
!719 = !{!720, !720, i64 0}
!720 = !{!"any pointer", !721, i64 0}
!721 = !{!"omnipotent char", !722, i64 0}
!722 = !{!"Simple C/C++ TBAA"}
!723 = !DILocation(line: 43, column: 3, scope: !712)
!724 = !DILocation(line: 47, column: 3, scope: !712)
!725 = !DILocation(line: 48, column: 3, scope: !712)
!726 = !DILocation(line: 49, column: 3, scope: !712)
!727 = !DILocation(line: 50, column: 3, scope: !712)
!728 = !DILocation(line: 51, column: 3, scope: !712)
!729 = !DISubprogram(name: "dcgettext", scope: !730, file: !730, line: 51, type: !731, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!730 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!731 = !DISubroutineType(types: !732)
!732 = !{!97, !75, !75, !99}
!733 = !DISubprogram(name: "__printf_chk", scope: !734, file: !734, line: 95, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!734 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!735 = !DISubroutineType(types: !736)
!736 = !{!99, !99, !737, null}
!737 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!738 = !DILocation(line: 0, scope: !71)
!739 = !DILocation(line: 581, column: 7, scope: !216)
!740 = !{!741, !741, i64 0}
!741 = !{!"int", !721, i64 0}
!742 = !DILocation(line: 581, column: 19, scope: !216)
!743 = !DILocation(line: 581, column: 7, scope: !71)
!744 = !DILocation(line: 585, column: 26, scope: !215)
!745 = !DILocation(line: 0, scope: !215)
!746 = !DILocation(line: 586, column: 23, scope: !215)
!747 = !DILocation(line: 586, column: 28, scope: !215)
!748 = !DILocation(line: 586, column: 32, scope: !215)
!749 = !{!721, !721, i64 0}
!750 = !DILocation(line: 586, column: 38, scope: !215)
!751 = !DILocalVariable(name: "__s1", arg: 1, scope: !752, file: !753, line: 1359, type: !75)
!752 = distinct !DISubprogram(name: "streq", scope: !753, file: !753, line: 1359, type: !754, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !756)
!753 = !DIFile(filename: "./lib/string.h", directory: "/src")
!754 = !DISubroutineType(types: !755)
!755 = !{!218, !75, !75}
!756 = !{!751, !757}
!757 = !DILocalVariable(name: "__s2", arg: 2, scope: !752, file: !753, line: 1359, type: !75)
!758 = !DILocation(line: 0, scope: !752, inlinedAt: !759)
!759 = distinct !DILocation(line: 586, column: 41, scope: !215)
!760 = !DILocation(line: 1361, column: 11, scope: !752, inlinedAt: !759)
!761 = !DILocation(line: 1361, column: 10, scope: !752, inlinedAt: !759)
!762 = !DILocation(line: 586, column: 19, scope: !215)
!763 = !DILocation(line: 587, column: 5, scope: !215)
!764 = !DILocation(line: 588, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !71, file: !72, line: 588, column: 7)
!766 = !DILocation(line: 588, column: 7, scope: !71)
!767 = !DILocation(line: 590, column: 7, scope: !768)
!768 = distinct !DILexicalBlock(scope: !765, file: !72, line: 589, column: 5)
!769 = !DILocation(line: 591, column: 7, scope: !768)
!770 = !DILocation(line: 595, column: 37, scope: !71)
!771 = !DILocation(line: 595, column: 35, scope: !71)
!772 = !DILocation(line: 596, column: 29, scope: !71)
!773 = !DILocation(line: 597, column: 8, scope: !224)
!774 = !DILocation(line: 597, column: 7, scope: !71)
!775 = !DILocation(line: 604, column: 24, scope: !223)
!776 = !DILocation(line: 604, column: 12, scope: !224)
!777 = !DILocation(line: 0, scope: !222)
!778 = !DILocation(line: 610, column: 16, scope: !222)
!779 = !DILocation(line: 610, column: 7, scope: !222)
!780 = !DILocation(line: 611, column: 21, scope: !222)
!781 = !{!782, !782, i64 0}
!782 = !{!"short", !721, i64 0}
!783 = !DILocation(line: 611, column: 19, scope: !222)
!784 = !DILocation(line: 611, column: 16, scope: !222)
!785 = !DILocation(line: 610, column: 30, scope: !222)
!786 = distinct !{!786, !779, !780, !787}
!787 = !{!"llvm.loop.mustprogress"}
!788 = !DILocation(line: 612, column: 18, scope: !789)
!789 = distinct !DILexicalBlock(scope: !222, file: !72, line: 612, column: 11)
!790 = !DILocation(line: 612, column: 11, scope: !222)
!791 = !DILocation(line: 620, column: 23, scope: !71)
!792 = !DILocation(line: 625, column: 39, scope: !71)
!793 = !DILocation(line: 626, column: 3, scope: !71)
!794 = !DILocation(line: 626, column: 10, scope: !71)
!795 = !DILocation(line: 626, column: 21, scope: !71)
!796 = !DILocation(line: 628, column: 44, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !72, line: 628, column: 11)
!798 = distinct !DILexicalBlock(scope: !71, file: !72, line: 627, column: 5)
!799 = !DILocation(line: 628, column: 32, scope: !797)
!800 = !DILocation(line: 628, column: 49, scope: !797)
!801 = !DILocation(line: 628, column: 11, scope: !798)
!802 = !DILocation(line: 630, column: 11, scope: !803)
!803 = distinct !DILexicalBlock(scope: !798, file: !72, line: 630, column: 11)
!804 = !DILocation(line: 630, column: 11, scope: !798)
!805 = !DILocation(line: 632, column: 26, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !72, line: 632, column: 15)
!807 = distinct !DILexicalBlock(scope: !803, file: !72, line: 631, column: 9)
!808 = !DILocation(line: 632, column: 34, scope: !806)
!809 = !DILocation(line: 632, column: 37, scope: !806)
!810 = !DILocation(line: 632, column: 15, scope: !807)
!811 = !DILocation(line: 636, column: 16, scope: !812)
!812 = distinct !DILexicalBlock(scope: !807, file: !72, line: 636, column: 15)
!813 = !DILocation(line: 636, column: 29, scope: !812)
!814 = !DILocation(line: 640, column: 16, scope: !798)
!815 = distinct !{!815, !793, !816, !787}
!816 = !DILocation(line: 641, column: 5, scope: !71)
!817 = !DILocation(line: 644, column: 3, scope: !71)
!818 = !DILocation(line: 0, scope: !752, inlinedAt: !819)
!819 = distinct !DILocation(line: 648, column: 31, scope: !71)
!820 = !{}
!821 = !DILocation(line: 0, scope: !752, inlinedAt: !822)
!822 = distinct !DILocation(line: 649, column: 31, scope: !71)
!823 = !DILocation(line: 0, scope: !752, inlinedAt: !824)
!824 = distinct !DILocation(line: 650, column: 31, scope: !71)
!825 = !DILocation(line: 0, scope: !752, inlinedAt: !826)
!826 = distinct !DILocation(line: 651, column: 31, scope: !71)
!827 = !DILocation(line: 0, scope: !752, inlinedAt: !828)
!828 = distinct !DILocation(line: 652, column: 31, scope: !71)
!829 = !DILocation(line: 0, scope: !752, inlinedAt: !830)
!830 = distinct !DILocation(line: 653, column: 31, scope: !71)
!831 = !DILocation(line: 0, scope: !752, inlinedAt: !832)
!832 = distinct !DILocation(line: 654, column: 31, scope: !71)
!833 = !DILocation(line: 0, scope: !752, inlinedAt: !834)
!834 = distinct !DILocation(line: 655, column: 31, scope: !71)
!835 = !DILocation(line: 0, scope: !752, inlinedAt: !836)
!836 = distinct !DILocation(line: 656, column: 31, scope: !71)
!837 = !DILocation(line: 0, scope: !752, inlinedAt: !838)
!838 = distinct !DILocation(line: 657, column: 31, scope: !71)
!839 = !DILocation(line: 663, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !71, file: !72, line: 663, column: 7)
!841 = !DILocation(line: 664, column: 7, scope: !840)
!842 = !DILocation(line: 664, column: 10, scope: !840)
!843 = !DILocation(line: 663, column: 7, scope: !71)
!844 = !DILocation(line: 669, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !840, file: !72, line: 665, column: 5)
!846 = !DILocation(line: 671, column: 5, scope: !845)
!847 = !DILocation(line: 676, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !840, file: !72, line: 673, column: 5)
!849 = !DILocation(line: 679, column: 3, scope: !71)
!850 = !DILocation(line: 683, column: 3, scope: !71)
!851 = !DILocation(line: 686, column: 3, scope: !71)
!852 = !DILocation(line: 688, column: 3, scope: !71)
!853 = !DILocation(line: 691, column: 3, scope: !71)
!854 = !DILocation(line: 695, column: 3, scope: !71)
!855 = !DILocation(line: 696, column: 1, scope: !71)
!856 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !72, file: !72, line: 836, type: !857, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !859)
!857 = !DISubroutineType(cc: DW_CC_nocall, types: !858)
!858 = !{null, !75}
!859 = !{!860, !861, !868, !869, !871, !872}
!860 = !DILocalVariable(name: "program", arg: 1, scope: !856, file: !72, line: 836, type: !75)
!861 = !DILocalVariable(name: "infomap", scope: !856, file: !72, line: 838, type: !862)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 896, elements: !55)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !856, file: !72, line: 838, size: 128, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !864, file: !72, line: 838, baseType: !75, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !864, file: !72, line: 838, baseType: !75, size: 64, offset: 64)
!868 = !DILocalVariable(name: "node", scope: !856, file: !72, line: 848, type: !75)
!869 = !DILocalVariable(name: "map_prog", scope: !856, file: !72, line: 849, type: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!871 = !DILocalVariable(name: "lc_messages", scope: !856, file: !72, line: 861, type: !75)
!872 = !DILocalVariable(name: "url_program", scope: !856, file: !72, line: 874, type: !75)
!873 = !DILocation(line: 0, scope: !856)
!874 = !DILocation(line: 857, column: 3, scope: !856)
!875 = !DILocation(line: 861, column: 29, scope: !856)
!876 = !DILocation(line: 862, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !856, file: !72, line: 862, column: 7)
!878 = !DILocation(line: 862, column: 19, scope: !877)
!879 = !DILocation(line: 862, column: 22, scope: !877)
!880 = !DILocation(line: 862, column: 7, scope: !856)
!881 = !DILocation(line: 868, column: 7, scope: !882)
!882 = distinct !DILexicalBlock(scope: !877, file: !72, line: 863, column: 5)
!883 = !DILocation(line: 870, column: 5, scope: !882)
!884 = !DILocation(line: 875, column: 3, scope: !856)
!885 = !DILocation(line: 877, column: 3, scope: !856)
!886 = !DILocation(line: 879, column: 1, scope: !856)
!887 = !DISubprogram(name: "exit", scope: !888, file: !888, line: 624, type: !713, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!888 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!889 = !DISubprogram(name: "setlocale", scope: !890, file: !890, line: 122, type: !891, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!890 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!891 = !DISubroutineType(types: !892)
!892 = !{!97, !99, !75}
!893 = !DISubprogram(name: "strncmp", scope: !894, file: !894, line: 159, type: !895, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!894 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!895 = !DISubroutineType(types: !896)
!896 = !{!99, !75, !75, !101}
!897 = !DISubprogram(name: "fputs_unlocked", scope: !898, file: !898, line: 691, type: !899, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!898 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!899 = !DISubroutineType(types: !900)
!900 = !{!99, !737, !901}
!901 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!902 = !DISubprogram(name: "getenv", scope: !888, file: !888, line: 641, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!903 = !DISubroutineType(types: !904)
!904 = !{!97, !75}
!905 = !DISubprogram(name: "strcmp", scope: !894, file: !894, line: 156, type: !906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!906 = !DISubroutineType(types: !907)
!907 = !{!99, !75, !75}
!908 = !DISubprogram(name: "strspn", scope: !894, file: !894, line: 297, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!909 = !DISubroutineType(types: !910)
!910 = !{!103, !75, !75}
!911 = !DISubprogram(name: "strchr", scope: !894, file: !894, line: 246, type: !912, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!912 = !DISubroutineType(types: !913)
!913 = !{!97, !75, !99}
!914 = !DISubprogram(name: "__ctype_b_loc", scope: !81, file: !81, line: 79, type: !915, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!915 = !DISubroutineType(types: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!920 = !DISubprogram(name: "strcspn", scope: !894, file: !894, line: 293, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!921 = !DISubprogram(name: "fwrite_unlocked", scope: !898, file: !898, line: 704, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!922 = !DISubroutineType(types: !923)
!923 = !{!101, !924, !101, !101, !901}
!924 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!927 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !928, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !931)
!928 = !DISubroutineType(types: !929)
!929 = !{!99, !99, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!931 = !{!932, !933}
!932 = !DILocalVariable(name: "argc", arg: 1, scope: !927, file: !2, line: 55, type: !99)
!933 = !DILocalVariable(name: "argv", arg: 2, scope: !927, file: !2, line: 55, type: !930)
!934 = !DILocation(line: 0, scope: !927)
!935 = !DILocation(line: 59, column: 12, scope: !936)
!936 = distinct !DILexicalBlock(scope: !927, file: !2, line: 59, column: 7)
!937 = !DILocation(line: 59, column: 7, scope: !927)
!938 = !DILocation(line: 62, column: 25, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !2, line: 60, column: 5)
!940 = !DILocation(line: 62, column: 7, scope: !939)
!941 = !DILocation(line: 63, column: 7, scope: !939)
!942 = !DILocation(line: 64, column: 7, scope: !939)
!943 = !DILocation(line: 65, column: 7, scope: !939)
!944 = !DILocation(line: 69, column: 7, scope: !939)
!945 = !DILocation(line: 71, column: 18, scope: !946)
!946 = distinct !DILexicalBlock(scope: !939, file: !2, line: 71, column: 11)
!947 = !DILocation(line: 0, scope: !752, inlinedAt: !948)
!948 = distinct !DILocation(line: 71, column: 11, scope: !946)
!949 = !DILocation(line: 1361, column: 11, scope: !752, inlinedAt: !948)
!950 = !DILocation(line: 1361, column: 10, scope: !752, inlinedAt: !948)
!951 = !DILocation(line: 71, column: 11, scope: !939)
!952 = !DILocation(line: 72, column: 9, scope: !946)
!953 = !DILocation(line: 0, scope: !752, inlinedAt: !954)
!954 = distinct !DILocation(line: 74, column: 11, scope: !955)
!955 = distinct !DILexicalBlock(scope: !939, file: !2, line: 74, column: 11)
!956 = !DILocation(line: 1361, column: 11, scope: !752, inlinedAt: !954)
!957 = !DILocation(line: 1361, column: 10, scope: !752, inlinedAt: !954)
!958 = !DILocation(line: 74, column: 11, scope: !939)
!959 = !DILocation(line: 75, column: 22, scope: !955)
!960 = !DILocation(line: 75, column: 58, scope: !955)
!961 = !DILocation(line: 75, column: 67, scope: !955)
!962 = !DILocation(line: 75, column: 9, scope: !955)
!963 = !DILocation(line: 79, column: 3, scope: !927)
!964 = !DISubprogram(name: "bindtextdomain", scope: !730, file: !730, line: 86, type: !965, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!965 = !DISubroutineType(types: !966)
!966 = !{!97, !75, !75}
!967 = !DISubprogram(name: "textdomain", scope: !730, file: !730, line: 82, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!968 = !DISubprogram(name: "atexit", scope: !888, file: !888, line: 602, type: !969, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!969 = !DISubroutineType(types: !970)
!970 = !{!99, !359}
!971 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !299, file: !299, line: 50, type: !972, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !973)
!972 = !DISubroutineType(types: !858)
!973 = !{!974}
!974 = !DILocalVariable(name: "file", arg: 1, scope: !971, file: !299, line: 50, type: !75)
!975 = !DILocation(line: 0, scope: !971)
!976 = !DILocation(line: 52, column: 13, scope: !971)
!977 = !DILocation(line: 53, column: 1, scope: !971)
!978 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !299, file: !299, line: 87, type: !979, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !981)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !218}
!981 = !{!982}
!982 = !DILocalVariable(name: "ignore", arg: 1, scope: !978, file: !299, line: 87, type: !218)
!983 = !DILocation(line: 0, scope: !978)
!984 = !DILocation(line: 89, column: 16, scope: !978)
!985 = !{!986, !986, i64 0}
!986 = !{!"_Bool", !721, i64 0}
!987 = !DILocation(line: 90, column: 1, scope: !978)
!988 = distinct !DISubprogram(name: "close_stdout", scope: !299, file: !299, line: 116, type: !360, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !989)
!989 = !{!990}
!990 = !DILocalVariable(name: "write_error", scope: !991, file: !299, line: 121, type: !75)
!991 = distinct !DILexicalBlock(scope: !992, file: !299, line: 120, column: 5)
!992 = distinct !DILexicalBlock(scope: !988, file: !299, line: 118, column: 7)
!993 = !DILocation(line: 118, column: 21, scope: !992)
!994 = !DILocation(line: 118, column: 7, scope: !992)
!995 = !DILocation(line: 118, column: 29, scope: !992)
!996 = !DILocation(line: 119, column: 7, scope: !992)
!997 = !DILocation(line: 119, column: 12, scope: !992)
!998 = !{i8 0, i8 2}
!999 = !DILocation(line: 119, column: 25, scope: !992)
!1000 = !DILocation(line: 119, column: 28, scope: !992)
!1001 = !DILocation(line: 119, column: 34, scope: !992)
!1002 = !DILocation(line: 118, column: 7, scope: !988)
!1003 = !DILocation(line: 121, column: 33, scope: !991)
!1004 = !DILocation(line: 0, scope: !991)
!1005 = !DILocation(line: 122, column: 11, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !991, file: !299, line: 122, column: 11)
!1007 = !DILocation(line: 0, scope: !1006)
!1008 = !DILocation(line: 122, column: 11, scope: !991)
!1009 = !DILocation(line: 123, column: 9, scope: !1006)
!1010 = !DILocation(line: 126, column: 9, scope: !1006)
!1011 = !DILocation(line: 128, column: 14, scope: !991)
!1012 = !DILocation(line: 128, column: 7, scope: !991)
!1013 = !DILocation(line: 133, column: 42, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !988, file: !299, line: 133, column: 7)
!1015 = !DILocation(line: 133, column: 28, scope: !1014)
!1016 = !DILocation(line: 133, column: 50, scope: !1014)
!1017 = !DILocation(line: 133, column: 7, scope: !988)
!1018 = !DILocation(line: 134, column: 12, scope: !1014)
!1019 = !DILocation(line: 134, column: 5, scope: !1014)
!1020 = !DILocation(line: 135, column: 1, scope: !988)
!1021 = !DISubprogram(name: "__errno_location", scope: !1022, file: !1022, line: 37, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1022 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!1026 = !DISubprogram(name: "_exit", scope: !1027, file: !1027, line: 624, type: !713, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1027 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1028 = distinct !DISubprogram(name: "verror", scope: !314, file: !314, line: 251, type: !1029, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !99, !99, !75, !324}
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DILocalVariable(name: "status", arg: 1, scope: !1028, file: !314, line: 251, type: !99)
!1033 = !DILocalVariable(name: "errnum", arg: 2, scope: !1028, file: !314, line: 251, type: !99)
!1034 = !DILocalVariable(name: "message", arg: 3, scope: !1028, file: !314, line: 251, type: !75)
!1035 = !DILocalVariable(name: "args", arg: 4, scope: !1028, file: !314, line: 251, type: !324)
!1036 = !DILocation(line: 0, scope: !1028)
!1037 = !DILocation(line: 261, column: 3, scope: !1028)
!1038 = !DILocation(line: 265, column: 7, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1028, file: !314, line: 265, column: 7)
!1040 = !DILocation(line: 265, column: 7, scope: !1028)
!1041 = !DILocation(line: 266, column: 5, scope: !1039)
!1042 = !DILocation(line: 272, column: 7, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !314, line: 268, column: 5)
!1044 = !DILocation(line: 276, column: 3, scope: !1028)
!1045 = !DILocation(line: 282, column: 1, scope: !1028)
!1046 = distinct !DISubprogram(name: "flush_stdout", scope: !314, file: !314, line: 163, type: !360, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1047)
!1047 = !{!1048}
!1048 = !DILocalVariable(name: "stdout_fd", scope: !1046, file: !314, line: 166, type: !99)
!1049 = !DILocation(line: 0, scope: !1046)
!1050 = !DILocalVariable(name: "fd", arg: 1, scope: !1051, file: !314, line: 145, type: !99)
!1051 = distinct !DISubprogram(name: "is_open", scope: !314, file: !314, line: 145, type: !1052, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1054)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!99, !99}
!1054 = !{!1050}
!1055 = !DILocation(line: 0, scope: !1051, inlinedAt: !1056)
!1056 = distinct !DILocation(line: 182, column: 25, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1046, file: !314, line: 182, column: 7)
!1058 = !DILocation(line: 157, column: 15, scope: !1051, inlinedAt: !1056)
!1059 = !DILocation(line: 157, column: 12, scope: !1051, inlinedAt: !1056)
!1060 = !DILocation(line: 182, column: 7, scope: !1046)
!1061 = !DILocation(line: 184, column: 5, scope: !1057)
!1062 = !DILocation(line: 185, column: 1, scope: !1046)
!1063 = !DISubprogram(name: "__fprintf_chk", scope: !734, file: !734, line: 93, type: !1064, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!99, !1066, !99, !737, null}
!1066 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1069, file: !235, line: 51, baseType: !99, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1069, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1069, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1069, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1069, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1069, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1069, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1069, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1069, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1069, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1069, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1069, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1069, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1069, file: !235, line: 70, baseType: !1085, size: 64, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1069, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1069, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1069, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1069, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1069, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1069, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1069, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1069, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1069, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1069, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1069, file: !235, line: 93, baseType: !1085, size: 64, offset: 1344)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1069, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1069, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1069, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1069, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!1101 = distinct !DISubprogram(name: "error_tail", scope: !314, file: !314, line: 219, type: !1029, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1102)
!1102 = !{!1103, !1104, !1105, !1106}
!1103 = !DILocalVariable(name: "status", arg: 1, scope: !1101, file: !314, line: 219, type: !99)
!1104 = !DILocalVariable(name: "errnum", arg: 2, scope: !1101, file: !314, line: 219, type: !99)
!1105 = !DILocalVariable(name: "message", arg: 3, scope: !1101, file: !314, line: 219, type: !75)
!1106 = !DILocalVariable(name: "args", arg: 4, scope: !1101, file: !314, line: 219, type: !324)
!1107 = distinct !DIAssignID()
!1108 = !DILocation(line: 0, scope: !1101)
!1109 = !DILocation(line: 229, column: 13, scope: !1101)
!1110 = !DILocalVariable(name: "__stream", arg: 1, scope: !1111, file: !734, line: 132, type: !1066)
!1111 = distinct !DISubprogram(name: "vfprintf", scope: !734, file: !734, line: 132, type: !1112, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1114)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!99, !1066, !737, !324}
!1114 = !{!1110, !1115, !1116}
!1115 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1111, file: !734, line: 133, type: !737)
!1116 = !DILocalVariable(name: "__ap", arg: 3, scope: !1111, file: !734, line: 133, type: !324)
!1117 = !DILocation(line: 0, scope: !1111, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 229, column: 3, scope: !1101)
!1119 = !DILocation(line: 135, column: 10, scope: !1111, inlinedAt: !1118)
!1120 = !DILocation(line: 232, column: 3, scope: !1101)
!1121 = !DILocation(line: 233, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1101, file: !314, line: 233, column: 7)
!1123 = !DILocation(line: 233, column: 7, scope: !1101)
!1124 = !DILocalVariable(name: "errbuf", scope: !1125, file: !314, line: 193, type: !1129)
!1125 = distinct !DISubprogram(name: "print_errno_message", scope: !314, file: !314, line: 188, type: !713, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1126)
!1126 = !{!1127, !1128, !1124}
!1127 = !DILocalVariable(name: "errnum", arg: 1, scope: !1125, file: !314, line: 188, type: !99)
!1128 = !DILocalVariable(name: "s", scope: !1125, file: !314, line: 190, type: !75)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1130)
!1130 = !{!1131}
!1131 = !DISubrange(count: 1024)
!1132 = !DILocation(line: 0, scope: !1125, inlinedAt: !1133)
!1133 = distinct !DILocation(line: 234, column: 5, scope: !1122)
!1134 = !DILocation(line: 193, column: 3, scope: !1125, inlinedAt: !1133)
!1135 = !DILocation(line: 195, column: 7, scope: !1125, inlinedAt: !1133)
!1136 = !DILocation(line: 207, column: 9, scope: !1137, inlinedAt: !1133)
!1137 = distinct !DILexicalBlock(scope: !1125, file: !314, line: 207, column: 7)
!1138 = !DILocation(line: 207, column: 7, scope: !1125, inlinedAt: !1133)
!1139 = !DILocation(line: 208, column: 9, scope: !1137, inlinedAt: !1133)
!1140 = !DILocation(line: 208, column: 5, scope: !1137, inlinedAt: !1133)
!1141 = !DILocation(line: 214, column: 3, scope: !1125, inlinedAt: !1133)
!1142 = !DILocation(line: 216, column: 1, scope: !1125, inlinedAt: !1133)
!1143 = !DILocation(line: 234, column: 5, scope: !1122)
!1144 = !DILocation(line: 238, column: 3, scope: !1101)
!1145 = !DILocalVariable(name: "__c", arg: 1, scope: !1146, file: !1147, line: 101, type: !99)
!1146 = distinct !DISubprogram(name: "putc_unlocked", scope: !1147, file: !1147, line: 101, type: !1148, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1150)
!1147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!99, !99, !1067}
!1150 = !{!1145, !1151}
!1151 = !DILocalVariable(name: "__stream", arg: 2, scope: !1146, file: !1147, line: 101, type: !1067)
!1152 = !DILocation(line: 0, scope: !1146, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 238, column: 3, scope: !1101)
!1154 = !DILocation(line: 103, column: 10, scope: !1146, inlinedAt: !1153)
!1155 = !{!1156, !720, i64 40}
!1156 = !{!"_IO_FILE", !741, i64 0, !720, i64 8, !720, i64 16, !720, i64 24, !720, i64 32, !720, i64 40, !720, i64 48, !720, i64 56, !720, i64 64, !720, i64 72, !720, i64 80, !720, i64 88, !720, i64 96, !720, i64 104, !741, i64 112, !741, i64 116, !1157, i64 120, !782, i64 128, !721, i64 130, !721, i64 131, !720, i64 136, !1157, i64 144, !720, i64 152, !720, i64 160, !720, i64 168, !720, i64 176, !1157, i64 184, !741, i64 192, !721, i64 196}
!1157 = !{!"long", !721, i64 0}
!1158 = !{!1156, !720, i64 48}
!1159 = !{!"branch_weights", i32 2000, i32 1}
!1160 = !DILocation(line: 240, column: 3, scope: !1101)
!1161 = !DILocation(line: 241, column: 7, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1101, file: !314, line: 241, column: 7)
!1163 = !DILocation(line: 241, column: 7, scope: !1101)
!1164 = !DILocation(line: 242, column: 5, scope: !1162)
!1165 = !DILocation(line: 243, column: 1, scope: !1101)
!1166 = !DISubprogram(name: "__vfprintf_chk", scope: !734, file: !734, line: 96, type: !1167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
