; ModuleID = 'src/ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.copy_debug = type { i32, i32, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.savewd = type { i32, %struct.sched_param }
%struct.sched_param = type { i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, i8, i32, i32, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct.group = type { ptr, ptr, i32, ptr }
%struct.posix_spawnattr_t = type { i16, i32, %struct.__sigset_t, %struct.__sigset_t, %struct.sched_param, i32, [16 x i32] }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.dir_list = type { ptr, i64, i64 }

!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 21)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "long_options", scope: !148, file: !2, line: 114, type: !773, isLocal: true, isDefinition: true)
!148 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/install.o -MD -MP -MF src/.deps/install.Tpo -c src/install.c -o src/.install.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !266, globals: !343, splitDebugInlining: false, nameTableKind: None)
!149 = !{!150, !158, !165, !171, !177, !183, !188, !193, !199, !213, !235, !250, !258, !263}
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !151, line: 38, baseType: !152, size: 32, elements: !153)
!151 = !DIFile(filename: "./lib/backupfile.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5fb672ff14309605c773cb90d9256701")
!152 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!153 = !{!154, !155, !156, !157}
!154 = !DIEnumerator(name: "no_backups", value: 0)
!155 = !DIEnumerator(name: "simple_backups", value: 1)
!156 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!157 = !DIEnumerator(name: "numbered_backups", value: 3)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !159, line: 86, baseType: !152, size: 32, elements: !160)
!159 = !DIFile(filename: "src/copy.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4854856c8f3aacad20824070737d83b1")
!160 = !{!161, !162, !163, !164}
!161 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!162 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!163 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!164 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !159, line: 77, baseType: !152, size: 32, elements: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DIEnumerator(name: "I_UNSPECIFIED", value: 0)
!168 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!169 = !DIEnumerator(name: "I_ALWAYS_SKIP", value: 2)
!170 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !159, line: 27, baseType: !152, size: 32, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!174 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!175 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!176 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Update_type", file: !159, line: 61, baseType: !152, size: 32, elements: !178)
!178 = !{!179, !180, !181, !182}
!179 = !DIEnumerator(name: "UPDATE_ALL", value: 0)
!180 = !DIEnumerator(name: "UPDATE_OLDER", value: 1)
!181 = !DIEnumerator(name: "UPDATE_NONE", value: 2)
!182 = !DIEnumerator(name: "UPDATE_NONE_FAIL", value: 3)
!183 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !159, line: 48, baseType: !152, size: 32, elements: !184)
!184 = !{!185, !186, !187}
!185 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!186 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!187 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 107, baseType: !152, size: 32, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIEnumerator(name: "DEBUG_OPTION", value: 128)
!191 = !DIEnumerator(name: "PRESERVE_CONTEXT_OPTION", value: 129)
!192 = !DIEnumerator(name: "STRIP_PROGRAM_OPTION", value: 130)
!193 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !194, line: 337, baseType: !195, size: 32, elements: !196)
!194 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!195 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!196 = !{!197, !198}
!197 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!198 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !200, line: 42, baseType: !152, size: 32, elements: !201)
!200 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!202 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!203 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!204 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!205 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!206 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!207 = !DIEnumerator(name: "c_quoting_style", value: 5)
!208 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!209 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!210 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!211 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!212 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !215, file: !214, line: 45, baseType: !152, size: 32, elements: !228)
!214 = !DIFile(filename: "./lib/savewd.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ad4dd1c19e06c974b5c544edb9d47f86")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !214, line: 42, size: 64, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !215, file: !214, line: 73, baseType: !213, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !215, file: !214, line: 81, baseType: !219, size: 32, offset: 32)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !215, file: !214, line: 76, size: 32, elements: !220)
!220 = !{!221, !222, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !219, file: !214, line: 78, baseType: !195, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !219, file: !214, line: 79, baseType: !195, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !219, file: !214, line: 80, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !225, line: 97, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !227, line: 154, baseType: !195)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!228 = !{!229, !230, !231, !232, !233, !234}
!229 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!230 = !DIEnumerator(name: "FD_STATE", value: 1)
!231 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!232 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!233 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!234 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !236, line: 46, baseType: !152, size: 32, elements: !237)
!236 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!238 = !DIEnumerator(name: "_ISupper", value: 256)
!239 = !DIEnumerator(name: "_ISlower", value: 512)
!240 = !DIEnumerator(name: "_ISalpha", value: 1024)
!241 = !DIEnumerator(name: "_ISdigit", value: 2048)
!242 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!243 = !DIEnumerator(name: "_ISspace", value: 8192)
!244 = !DIEnumerator(name: "_ISprint", value: 16384)
!245 = !DIEnumerator(name: "_ISgraph", value: 32768)
!246 = !DIEnumerator(name: "_ISblank", value: 1)
!247 = !DIEnumerator(name: "_IScntrl", value: 2)
!248 = !DIEnumerator(name: "_ISpunct", value: 4)
!249 = !DIEnumerator(name: "_ISalnum", value: 8)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !251, line: 30, baseType: !152, size: 32, elements: !252)
!251 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!254 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!255 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!256 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!257 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_status", file: !2, line: 409, baseType: !152, size: 32, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "COPY_FAILED", value: 0)
!261 = !DIEnumerator(name: "COPY_OK", value: 1)
!262 = !DIEnumerator(name: "COPY_SKIPPED", value: 2)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !194, line: 110, baseType: !152, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIEnumerator(name: "O_PATHSEARCH", value: 2097152)
!266 = !{!267, !272, !273, !195, !274, !275, !278, !280, !281, !284, !286, !288, !341}
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !268, line: 72, baseType: !269)
!268 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !195}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!274 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !276, line: 18, baseType: !277)
!276 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!277 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!280 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !283, line: 53, flags: DIFlagFwdDecl)
!283 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !225, line: 79, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !227, line: 146, baseType: !152)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !225, line: 64, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !227, line: 147, baseType: !152)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !159, line: 115, size: 768, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !340}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !289, file: !159, line: 117, baseType: !150, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !289, file: !159, line: 120, baseType: !158, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !289, file: !159, line: 125, baseType: !165, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !289, file: !159, line: 128, baseType: !171, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !289, file: !159, line: 132, baseType: !296, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !225, line: 69, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !227, line: 150, baseType: !152)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !289, file: !159, line: 136, baseType: !299, size: 8, offset: 160)
!299 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !289, file: !159, line: 140, baseType: !299, size: 8, offset: 168)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !289, file: !159, line: 147, baseType: !299, size: 8, offset: 176)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !289, file: !159, line: 151, baseType: !299, size: 8, offset: 184)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !289, file: !159, line: 155, baseType: !299, size: 8, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "no_copy", scope: !289, file: !159, line: 155, baseType: !299, size: 8, offset: 200)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "exchange", scope: !289, file: !159, line: 159, baseType: !299, size: 8, offset: 208)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !289, file: !159, line: 162, baseType: !299, size: 8, offset: 216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !289, file: !159, line: 166, baseType: !299, size: 8, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !289, file: !159, line: 173, baseType: !299, size: 8, offset: 232)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !289, file: !159, line: 177, baseType: !299, size: 8, offset: 240)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !289, file: !159, line: 181, baseType: !299, size: 8, offset: 248)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !289, file: !159, line: 182, baseType: !299, size: 8, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !289, file: !159, line: 183, baseType: !299, size: 8, offset: 264)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !289, file: !159, line: 184, baseType: !299, size: 8, offset: 272)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !289, file: !159, line: 187, baseType: !281, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !289, file: !159, line: 199, baseType: !299, size: 8, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !289, file: !159, line: 203, baseType: !299, size: 8, offset: 392)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !289, file: !159, line: 209, baseType: !299, size: 8, offset: 400)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !289, file: !159, line: 213, baseType: !299, size: 8, offset: 408)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !289, file: !159, line: 222, baseType: !299, size: 8, offset: 416)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !289, file: !159, line: 226, baseType: !299, size: 8, offset: 424)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !289, file: !159, line: 235, baseType: !299, size: 8, offset: 432)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !289, file: !159, line: 244, baseType: !299, size: 8, offset: 440)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !289, file: !159, line: 248, baseType: !299, size: 8, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !289, file: !159, line: 252, baseType: !299, size: 8, offset: 456)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !289, file: !159, line: 256, baseType: !299, size: 8, offset: 464)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !289, file: !159, line: 259, baseType: !177, size: 32, offset: 480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !289, file: !159, line: 262, baseType: !299, size: 8, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "keep_directory_symlink", scope: !289, file: !159, line: 265, baseType: !299, size: 8, offset: 520)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !289, file: !159, line: 268, baseType: !299, size: 8, offset: 528)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !289, file: !159, line: 271, baseType: !299, size: 8, offset: 536)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !289, file: !159, line: 276, baseType: !299, size: 8, offset: 544)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !289, file: !159, line: 280, baseType: !299, size: 8, offset: 552)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !289, file: !159, line: 285, baseType: !195, size: 32, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !289, file: !159, line: 288, baseType: !183, size: 32, offset: 608)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !289, file: !159, line: 299, baseType: !336, size: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !338, line: 56, baseType: !339)
!338 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !338, line: 54, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !289, file: !159, line: 302, baseType: !336, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!343 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !99, !104, !109, !114, !119, !124, !126, !131, !136, !141, !344, !349, !354, !359, !364, !369, !371, !376, !381, !386, !388, !390, !392, !397, !402, !407, !409, !411, !416, !421, !423, !425, !427, !429, !431, !433, !435, !513, !518, !520, !525, !530, !535, !537, !539, !544, !546, !548, !550, !555, !557, !559, !561, !563, !565, !567, !569, !571, !576, !581, !583, !585, !587, !589, !591, !596, !601, !603, !608, !610, !612, !614, !619, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646, !648, !650, !652, !654, !656, !658, !660, !662, !146, !664, !666, !668, !673, !675, !680, !682, !684, !686, !688, !690, !692, !694, !699, !704, !706, !708, !710, !712, !728, !730, !732, !734, !739, !744, !749, !754, !759, !764, !769, !771}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 924, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 38)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 935, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 73)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 960, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 67)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !2, line: 966, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 14)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !2, line: 966, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 16)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !2, line: 974, type: !29, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !2, line: 977, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 57)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !2, line: 981, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 12)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 987, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 42)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 991, type: !121, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1001, type: !143, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1003, type: !383, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1013, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 70)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1018, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 17)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1027, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 20)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1041, type: !133, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1048, type: !366, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1055, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 72)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1060, type: !418, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 58)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1066, type: !94, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "owner_name", scope: !148, file: !2, line: 66, type: !272, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "group_name", scope: !148, file: !2, line: 73, type: !272, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !148, file: !2, line: 94, type: !299, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "strip_files", scope: !148, file: !2, line: 97, type: !299, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "dir_arg", scope: !148, file: !2, line: 100, type: !299, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !194, line: 736, type: !101, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !437, file: !194, line: 575, type: !195, isLocal: true, isDefinition: true)
!437 = distinct !DISubprogram(name: "oputs_", scope: !194, file: !194, line: 573, type: !438, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !148, retainedNodes: !440)
!438 = !DISubroutineType(cc: DW_CC_nocall, types: !439)
!439 = !{null, !278, !278}
!440 = !{!441, !442, !443, !446, !447, !448, !449, !453, !454, !455, !456, !458, !507, !508, !509, !511, !512}
!441 = !DILocalVariable(name: "program", arg: 1, scope: !437, file: !194, line: 573, type: !278)
!442 = !DILocalVariable(name: "option", arg: 2, scope: !437, file: !194, line: 573, type: !278)
!443 = !DILocalVariable(name: "term", scope: !444, file: !194, line: 585, type: !278)
!444 = distinct !DILexicalBlock(scope: !445, file: !194, line: 582, column: 5)
!445 = distinct !DILexicalBlock(scope: !437, file: !194, line: 581, column: 7)
!446 = !DILocalVariable(name: "double_space", scope: !437, file: !194, line: 594, type: !299)
!447 = !DILocalVariable(name: "first_word", scope: !437, file: !194, line: 595, type: !278)
!448 = !DILocalVariable(name: "option_text", scope: !437, file: !194, line: 596, type: !278)
!449 = !DILocalVariable(name: "s", scope: !450, file: !194, line: 608, type: !278)
!450 = distinct !DILexicalBlock(scope: !451, file: !194, line: 605, column: 5)
!451 = distinct !DILexicalBlock(scope: !452, file: !194, line: 604, column: 12)
!452 = distinct !DILexicalBlock(scope: !437, file: !194, line: 597, column: 7)
!453 = !DILocalVariable(name: "spaces", scope: !450, file: !194, line: 609, type: !275)
!454 = !DILocalVariable(name: "anchor_len", scope: !437, file: !194, line: 620, type: !275)
!455 = !DILocalVariable(name: "desc_text", scope: !437, file: !194, line: 625, type: !278)
!456 = !DILocalVariable(name: "__ptr", scope: !457, file: !194, line: 644, type: !278)
!457 = distinct !DILexicalBlock(scope: !437, file: !194, line: 644, column: 3)
!458 = !DILocalVariable(name: "__stream", scope: !457, file: !194, line: 644, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 7, baseType: !462)
!461 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !463, line: 49, size: 1728, elements: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !480, !482, !483, !484, !487, !488, !490, !491, !494, !496, !499, !502, !503, !504, !505, !506}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !462, file: !463, line: 51, baseType: !195, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !462, file: !463, line: 54, baseType: !272, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !462, file: !463, line: 55, baseType: !272, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !462, file: !463, line: 56, baseType: !272, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !462, file: !463, line: 57, baseType: !272, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !462, file: !463, line: 58, baseType: !272, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !462, file: !463, line: 59, baseType: !272, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !462, file: !463, line: 60, baseType: !272, size: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !462, file: !463, line: 61, baseType: !272, size: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !462, file: !463, line: 64, baseType: !272, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !462, file: !463, line: 65, baseType: !272, size: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !462, file: !463, line: 66, baseType: !272, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !462, file: !463, line: 68, baseType: !478, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !463, line: 36, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !462, file: !463, line: 70, baseType: !481, size: 64, offset: 832)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !462, file: !463, line: 72, baseType: !195, size: 32, offset: 896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !462, file: !463, line: 73, baseType: !195, size: 32, offset: 928)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !462, file: !463, line: 74, baseType: !485, size: 64, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !227, line: 152, baseType: !486)
!486 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !462, file: !463, line: 77, baseType: !274, size: 16, offset: 1024)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !462, file: !463, line: 78, baseType: !489, size: 8, offset: 1040)
!489 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !462, file: !463, line: 79, baseType: !128, size: 8, offset: 1048)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !462, file: !463, line: 81, baseType: !492, size: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !463, line: 43, baseType: null)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !462, file: !463, line: 89, baseType: !495, size: 64, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !227, line: 153, baseType: !486)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !462, file: !463, line: 91, baseType: !497, size: 64, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !463, line: 37, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !462, file: !463, line: 92, baseType: !500, size: 64, offset: 1280)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !463, line: 38, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !462, file: !463, line: 93, baseType: !481, size: 64, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !462, file: !463, line: 94, baseType: !273, size: 64, offset: 1408)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !462, file: !463, line: 95, baseType: !275, size: 64, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !462, file: !463, line: 96, baseType: !195, size: 32, offset: 1536)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !462, file: !463, line: 98, baseType: !404, size: 160, offset: 1568)
!507 = !DILocalVariable(name: "__cnt", scope: !457, file: !194, line: 644, type: !275)
!508 = !DILocalVariable(name: "url_program", scope: !437, file: !194, line: 648, type: !278)
!509 = !DILocalVariable(name: "__ptr", scope: !510, file: !194, line: 686, type: !278)
!510 = distinct !DILexicalBlock(scope: !437, file: !194, line: 686, column: 3)
!511 = !DILocalVariable(name: "__stream", scope: !510, file: !194, line: 686, type: !459)
!512 = !DILocalVariable(name: "__cnt", scope: !510, file: !194, line: 686, type: !275)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !194, line: 585, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 5)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !194, line: 586, type: !515, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !194, line: 595, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 4)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !194, line: 620, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 6)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !194, line: 648, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 2)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !194, line: 648, type: !515, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !194, line: 649, type: !522, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !194, line: 649, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 3)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !194, line: 650, type: !515, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !194, line: 651, type: !527, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !194, line: 651, type: !527, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !194, line: 652, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 7)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !194, line: 653, type: !19, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !194, line: 654, type: !133, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !194, line: 655, type: !133, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !194, line: 656, type: !133, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !194, line: 657, type: !133, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !194, line: 663, type: !552, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !194, line: 664, type: !133, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !194, line: 669, type: !399, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !194, line: 669, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 40)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !194, line: 676, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 15)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !194, line: 676, type: !29, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !194, line: 679, type: !541, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !194, line: 683, type: !515, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !194, line: 688, type: !515, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !194, line: 691, type: !19, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !194, line: 781, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1768, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 221)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !194, line: 788, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1776, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 222)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !194, line: 839, type: !366, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !194, line: 840, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 22)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !194, line: 841, type: !578, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !194, line: 862, type: !522, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !194, line: 868, type: !84, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !194, line: 875, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 27)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !194, line: 877, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 51)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !194, line: 877, type: !378, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!627 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !148, file: !2, line: 53, type: !195, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !552, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !19, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !19, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !527, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !2, line: 120, type: !133, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !527, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !515, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 123, type: !404, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !527, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 125, type: !404, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !399, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !2, line: 127, type: !527, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !361, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !2, line: 129, type: !552, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !399, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !19, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !515, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !19, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "strip_program", scope: !148, file: !2, line: 103, type: !278, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!667 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !148, file: !2, line: 54, type: !299, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!669 = distinct !DIGlobalVariable(name: "initialized", scope: !670, file: !2, line: 303, type: !299, isLocal: true, isDefinition: true)
!670 = distinct !DISubprogram(name: "get_labeling_handle", scope: !2, file: !2, line: 301, type: !671, scopeLine: 302, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !148)
!671 = !DISubroutineType(types: !672)
!672 = !{!281}
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!674 = distinct !DIGlobalVariable(name: "hnd", scope: !670, file: !2, line: 304, type: !281, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 41)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "mode", scope: !148, file: !2, line: 82, type: !296, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !148, file: !2, line: 91, type: !296, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "dir_mode", scope: !148, file: !2, line: 85, type: !296, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 558, type: !366, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !2, line: 576, type: !399, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "owner_id", scope: !148, file: !2, line: 69, type: !284, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "group_id", scope: !148, file: !2, line: 76, type: !286, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 33)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 372, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 46)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !605, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !2, line: 763, type: !616, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !2, line: 724, type: !578, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 733, type: !399, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "a_buff", scope: !714, file: !2, line: 143, type: !725, isLocal: true, isDefinition: true)
!714 = distinct !DISubprogram(name: "have_same_content", scope: !2, file: !2, line: 140, type: !715, scopeLine: 141, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !148, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!299, !195, !195}
!717 = !{!718, !719, !720}
!718 = !DILocalVariable(name: "a_fd", arg: 1, scope: !714, file: !2, line: 140, type: !195)
!719 = !DILocalVariable(name: "b_fd", arg: 2, scope: !714, file: !2, line: 140, type: !195)
!720 = !DILocalVariable(name: "size", scope: !714, file: !2, line: 146, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !722, line: 130, baseType: !723)
!722 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !724, line: 18, baseType: !486)
!724 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 4096)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "b_buff", scope: !714, file: !2, line: 144, type: !725, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !532, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !2, line: 520, type: !361, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 520, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 28)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 531, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 18)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 533, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 36)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !2, line: 478, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 29)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 30)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 32)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 35)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !2, line: 346, type: !79, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !578, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 4864, elements: !783)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !776, line: 50, size: 256, elements: !777)
!776 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!777 = !{!778, !779, !780, !782}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !776, line: 52, baseType: !278, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !775, file: !776, line: 55, baseType: !195, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !775, file: !776, line: 56, baseType: !781, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !775, file: !776, line: 57, baseType: !195, size: 32, offset: 192)
!783 = !{!784}
!784 = !DISubrange(count: 19)
!785 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!786 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!787 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !790, line: 32, type: !541, isLocal: true, isDefinition: true)
!790 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !793, line: 606, type: !794, isLocal: true, isDefinition: true)
!793 = !DIFile(filename: "src/copy.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2468b988b487bb70a5564b296b3014eb")
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 37)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !793, line: 648, type: !677, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !801, file: !793, line: 128, type: !278, isLocal: true, isDefinition: true)
!801 = distinct !DICompileUnit(language: DW_LANG_C11, file: !793, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/copy.o -MD -MP -MF src/.deps/copy.Tpo -c src/copy.c -o src/.copy.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !802, retainedTypes: !823, globals: !824, splitDebugInlining: false, nameTableKind: None)
!802 = !{!150, !158, !165, !171, !177, !183, !199, !803, !807, !814}
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 32, baseType: !152, size: 32, elements: !805)
!804 = !DIFile(filename: "./lib/utimecmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f602805edcb41bf216811616bd42cad2")
!805 = !{!806}
!806 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !808, line: 37, baseType: !152, size: 32, elements: !809)
!808 = !DIFile(filename: "./lib/savedir.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2bb9be9f16e0215620cf0d56009bad4")
!809 = !{!810, !811, !812, !813}
!810 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!811 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!812 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!813 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_debug_val", file: !159, line: 305, baseType: !152, size: 32, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822}
!816 = !DIEnumerator(name: "COPY_DEBUG_UNKNOWN", value: 0)
!817 = !DIEnumerator(name: "COPY_DEBUG_NO", value: 1)
!818 = !DIEnumerator(name: "COPY_DEBUG_YES", value: 2)
!819 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL", value: 3)
!820 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL_INTERNAL", value: 4)
!821 = !DIEnumerator(name: "COPY_DEBUG_AVOIDED", value: 5)
!822 = !DIEnumerator(name: "COPY_DEBUG_UNSUPPORTED", value: 6)
!823 = !{!152, !273, !277, !280}
!824 = !{!825, !791, !827, !797, !829, !834, !799, !836, !838, !843, !848, !851, !856, !861, !863, !865, !867, !869, !871, !873, !878, !880, !882, !884, !889, !891, !896, !898, !900, !902, !904, !906, !908, !913, !918, !923, !925, !927, !929, !934, !939, !941, !943, !948, !950, !952, !954, !956, !958, !963, !965, !967, !969, !971, !976, !978, !980, !982, !984, !986, !988, !990, !995, !1000, !1002, !1004, !1007, !1009, !1011, !1013, !1015, !1020, !1022, !1024, !1026, !1033, !1035, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058}
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !793, line: 591, type: !121, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !793, line: 621, type: !621, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "mask", scope: !831, file: !793, line: 2890, type: !296, isLocal: true, isDefinition: true)
!831 = distinct !DISubprogram(name: "cached_umask", scope: !793, file: !793, line: 2888, type: !832, scopeLine: 2889, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !801)
!832 = !DISubroutineType(types: !833)
!833 = !{!296}
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "cached", scope: !831, file: !793, line: 2891, type: !299, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !801, file: !793, line: 129, type: !278, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2779, type: !840, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 55)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2779, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 11)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2779, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 368, elements: !702)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2780, type: !853, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 880, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 110)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2781, type: !858, isLocal: true, isDefinition: true)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 928, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 116)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2782, type: !346, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2783, type: !351, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1643, type: !532, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1673, type: !578, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1681, type: !573, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1681, type: !605, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1706, type: !875, isLocal: true, isDefinition: true)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 49)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1780, type: !736, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1870, type: !399, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1872, type: !378, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1885, type: !886, isLocal: true, isDefinition: true)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 52)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1885, type: !886, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1906, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 43)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1934, type: !121, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1935, type: !621, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1961, type: !399, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1978, type: !399, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1983, type: !378, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2008, type: !875, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2020, type: !910, isLocal: true, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 9)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2091, type: !915, isLocal: true, isDefinition: true)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 45)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2100, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 54)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2128, type: !915, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2157, type: !404, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2158, type: !399, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2195, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 47)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2239, type: !936, isLocal: true, isDefinition: true)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 26)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2252, type: !404, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2257, type: !143, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2276, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 60)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2284, type: !366, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2319, type: !746, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2340, type: !616, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2363, type: !616, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2382, type: !605, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2445, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 63)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2456, type: !794, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2514, type: !605, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2523, type: !756, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2534, type: !751, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2561, type: !973, isLocal: true, isDefinition: true)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 31)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2579, type: !746, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2595, type: !34, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2651, type: !138, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2737, type: !756, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2765, type: !404, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !793, line: 2769, type: !143, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1562, type: !696, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1492, type: !992, isLocal: true, isDefinition: true)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 13)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1492, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 800, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 100)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1422, type: !915, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1422, type: !875, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1433, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !783)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1512, type: !361, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !793, line: 397, type: !399, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !793, line: 754, type: !616, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !793, line: 760, type: !366, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !793, line: 769, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 56)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !793, line: 978, type: !573, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !793, line: 999, type: !756, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1135, type: !1006, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "copy_debug", scope: !801, file: !793, line: 132, type: !1028, isLocal: true, isDefinition: true)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "copy_debug", file: !159, line: 317, size: 96, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "offload", scope: !1028, file: !159, line: 319, baseType: !814, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "reflink", scope: !1028, file: !159, line: 320, baseType: !814, size: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_detection", scope: !1028, file: !159, line: 321, baseType: !814, size: 32, offset: 64)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !793, line: 692, type: !616, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !793, line: 173, type: !1037, isLocal: true, isDefinition: true)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 53)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !793, line: 139, type: !541, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !793, line: 140, type: !522, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !793, line: 141, type: !19, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !793, line: 142, type: !378, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !793, line: 143, type: !19, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !793, line: 157, type: !527, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !793, line: 158, type: !133, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !793, line: 159, type: !741, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !793, line: 1521, type: !886, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !793, line: 510, type: !736, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 554, type: !366, isLocal: true, isDefinition: true)
!1063 = !DIFile(filename: "src/copy-file-data.c", directory: "/src", checksumkind: CSK_MD5, checksum: "10bf938861a2599d1da9956990f9d55d")
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 633, type: !404, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 639, type: !605, isLocal: true, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 409, type: !399, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 177, type: !1072, isLocal: true, isDefinition: true)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 23)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 203, type: !399, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 247, type: !399, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(scope: null, file: !1063, line: 258, type: !404, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !1083, file: !1084, line: 45, type: !336, isLocal: true, isDefinition: true)
!1083 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1084, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/cp-hash.o -MD -MP -MF src/.deps/cp-hash.Tpo -c src/cp-hash.c -o src/.cp-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1085, globals: !1089, splitDebugInlining: false, nameTableKind: None)
!1084 = !DIFile(filename: "src/cp-hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e1cbaa8dd82131aad9d092a28cc0016")
!1085 = !{!273, !272, !1086}
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1087, line: 102, baseType: !1088)
!1087 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !227, line: 73, baseType: !277)
!1089 = !{!1081}
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !1092, file: !1093, line: 38, type: !1102, isLocal: true, isDefinition: true)
!1092 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1093, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/force-link.o -MD -MP -MF src/.deps/force-link.Tpo -c src/force-link.c -o src/.force-link.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1094, globals: !1101, splitDebugInlining: false, nameTableKind: None)
!1093 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!1094 = !{!1095, !1098}
!1095 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1093, line: 39, baseType: !152, size: 32, elements: !1096)
!1096 = !{!1097}
!1097 = !DIEnumerator(name: "x_suffix_len", value: 6)
!1098 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1093, line: 44, baseType: !152, size: 32, elements: !1099)
!1099 = !{!1100}
!1100 = !DIEnumerator(name: "smallsize", value: 256)
!1101 = !{!1090}
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 72, elements: !911)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1105, line: 3, type: !578, isLocal: true, isDefinition: true)
!1105 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "Version", scope: !1108, file: !1105, line: 3, type: !278, isLocal: false, isDefinition: true)
!1108 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1105, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1109, splitDebugInlining: false, nameTableKind: None)
!1109 = !{!1103, !1106}
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !1112, line: 51, type: !541, isLocal: true, isDefinition: true)
!1112 = !DIFile(filename: "lib/copy-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d19480c78a0966338b5bf17d8ed286c6")
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !1112, line: 55, type: !552, isLocal: true, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !1112, line: 55, type: !756, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !1119, line: 46, type: !552, isLocal: true, isDefinition: true)
!1119 = !DIFile(filename: "lib/set-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "722ad1ac2f97374f03af732c9ad7cf42")
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1119, line: 46, type: !616, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !1124, file: !1125, line: 77, type: !278, isLocal: false, isDefinition: true)
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1125, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-backupfile.o -MD -MP -MF lib/.deps/libcoreutils_a-backupfile.Tpo -c lib/backupfile.c -o lib/.libcoreutils_a-backupfile.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1126, retainedTypes: !1190, globals: !1191, splitDebugInlining: false, nameTableKind: None)
!1125 = !DIFile(filename: "lib/backupfile.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d80c7bac43057afe2488869169d2a407")
!1126 = !{!1127, !1129, !1160, !1166}
!1127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !1128, line: 38, baseType: !152, size: 32, elements: !153)
!1128 = !DIFile(filename: "lib/backupfile.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5fb672ff14309605c773cb90d9256701")
!1129 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1130, file: !1125, line: 325, baseType: !152, size: 32, elements: !1158)
!1130 = distinct !DISubprogram(name: "backupfile_internal", scope: !1125, file: !1125, line: 312, type: !1131, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1124, retainedNodes: !1133)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!272, !195, !278, !1127, !299}
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1141, !1142, !1143, !1144, !1145, !1146, !1151, !1152, !1153, !1155, !1156, !1157}
!1134 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !1130, file: !1125, line: 312, type: !195)
!1135 = !DILocalVariable(name: "file", arg: 2, scope: !1130, file: !1125, line: 312, type: !278)
!1136 = !DILocalVariable(name: "backup_type", arg: 3, scope: !1130, file: !1125, line: 313, type: !1127)
!1137 = !DILocalVariable(name: "rename", arg: 4, scope: !1130, file: !1125, line: 313, type: !299)
!1138 = !DILocalVariable(name: "base_offset", scope: !1130, file: !1125, line: 315, type: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1140, line: 130, baseType: !723)
!1140 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1141 = !DILocalVariable(name: "filelen", scope: !1130, file: !1125, line: 316, type: !1139)
!1142 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !1130, file: !1125, line: 323, type: !1139)
!1143 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !1130, file: !1125, line: 324, type: !1139)
!1144 = !DILocalVariable(name: "ssize", scope: !1130, file: !1125, line: 329, type: !1139)
!1145 = !DILocalVariable(name: "s", scope: !1130, file: !1125, line: 330, type: !272)
!1146 = !DILocalVariable(name: "dirp", scope: !1130, file: !1125, line: 334, type: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1149, line: 127, baseType: !1150)
!1149 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1149, line: 127, flags: DIFlagFwdDecl)
!1151 = !DILocalVariable(name: "sdir", scope: !1130, file: !1125, line: 335, type: !195)
!1152 = !DILocalVariable(name: "base_max", scope: !1130, file: !1125, line: 336, type: !1139)
!1153 = !DILocalVariable(name: "extended", scope: !1154, file: !1125, line: 339, type: !299)
!1154 = distinct !DILexicalBlock(scope: !1130, file: !1125, line: 338, column: 5)
!1155 = !DILocalVariable(name: "offset", scope: !1154, file: !1125, line: 375, type: !1139)
!1156 = !DILocalVariable(name: "flags", scope: !1154, file: !1125, line: 376, type: !152)
!1157 = !DILocalVariable(name: "saved_errno", scope: !1154, file: !1125, line: 379, type: !195)
!1158 = !{!1159}
!1159 = !DIEnumerator(name: "GUESS", value: 9)
!1160 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !1125, line: 171, baseType: !152, size: 32, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165}
!1162 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!1163 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!1164 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!1165 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3)
!1166 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 24, baseType: !152, size: 32, elements: !1168)
!1167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!1169 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!1170 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!1171 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!1172 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!1173 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!1174 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!1175 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!1176 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!1177 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!1178 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!1179 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!1180 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!1181 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!1182 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!1183 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!1184 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!1185 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!1186 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!1187 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!1188 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!1189 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!1190 = !{!273, !152}
!1191 = !{!1122, !1192, !1194, !1196, !1198}
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 86, type: !143, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 87, type: !532, isLocal: true, isDefinition: true)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 225, type: !532, isLocal: true, isDefinition: true)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 230, type: !515, isLocal: true, isDefinition: true)
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(name: "backup_types", scope: !1202, file: !1203, line: 53, type: !1233, isLocal: true, isDefinition: true)
!1202 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1203, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-backup-find.o -MD -MP -MF lib/.deps/libcoreutils_a-backup-find.Tpo -c lib/backup-find.c -o lib/.libcoreutils_a-backup-find.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1204, retainedTypes: !1205, globals: !1208, splitDebugInlining: false, nameTableKind: None)
!1203 = !DIFile(filename: "lib/backup-find.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3f359c23ab3cfe916b3fbf76e026681")
!1204 = !{!1127}
!1205 = !{!273, !1206}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1208 = !{!1209, !1211, !1200, !1213, !1215, !1217, !1219, !1221, !1223, !1225, !1227, !1229}
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(scope: null, file: !1203, line: 92, type: !399, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !1203, line: 92, type: !366, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1203, line: 46, type: !515, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1203, line: 46, type: !522, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !1203, line: 47, type: !552, isLocal: true, isDefinition: true)
!1219 = !DIGlobalVariableExpression(var: !1220, expr: !DIExpression())
!1220 = distinct !DIGlobalVariable(scope: null, file: !1203, line: 47, type: !527, isLocal: true, isDefinition: true)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
