; ModuleID = 'src/hostid.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [89 x i8] c"Usage: %s [OPTION]\0APrint the numeric identifier (in hexadecimal) for the current host.\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [7 x i8] c"hostid\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !27
@.str.6 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !32

!161 = !DISubrange(count: 15)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !65, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 61)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !65, line: 679, type: !122, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !65, line: 683, type: !99, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !65, line: 688, type: !99, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !65, line: 691, type: !135, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !65, line: 839, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 16)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !65, line: 840, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 22)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !65, line: 841, type: !159, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !65, line: 862, type: !106, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !65, line: 868, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 71)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !65, line: 875, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 27)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !65, line: 877, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 51)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !65, line: 877, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 12)
!209 = !{!210, !211, !212, !215, !217, !218, !219, !223, !224, !225, !226, !228, !282, !283, !284, !286, !287}
!210 = !DILocalVariable(name: "program", arg: 1, scope: !64, file: !65, line: 573, type: !68)
!211 = !DILocalVariable(name: "option", arg: 2, scope: !64, file: !65, line: 573, type: !68)
!212 = !DILocalVariable(name: "term", scope: !213, file: !65, line: 585, type: !68)
!213 = distinct !DILexicalBlock(scope: !214, file: !65, line: 582, column: 5)
!214 = distinct !DILexicalBlock(scope: !64, file: !65, line: 581, column: 7)
!215 = !DILocalVariable(name: "double_space", scope: !64, file: !65, line: 594, type: !216)
!216 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!217 = !DILocalVariable(name: "first_word", scope: !64, file: !65, line: 595, type: !68)
!218 = !DILocalVariable(name: "option_text", scope: !64, file: !65, line: 596, type: !68)
!219 = !DILocalVariable(name: "s", scope: !220, file: !65, line: 608, type: !68)
!220 = distinct !DILexicalBlock(scope: !221, file: !65, line: 605, column: 5)
!221 = distinct !DILexicalBlock(scope: !222, file: !65, line: 604, column: 12)
!222 = distinct !DILexicalBlock(scope: !64, file: !65, line: 597, column: 7)
!223 = !DILocalVariable(name: "spaces", scope: !220, file: !65, line: 609, type: !92)
!224 = !DILocalVariable(name: "anchor_len", scope: !64, file: !65, line: 620, type: !92)
!225 = !DILocalVariable(name: "desc_text", scope: !64, file: !65, line: 625, type: !68)
!226 = !DILocalVariable(name: "__ptr", scope: !227, file: !65, line: 644, type: !68)
!227 = distinct !DILexicalBlock(scope: !64, file: !65, line: 644, column: 3)
!228 = !DILocalVariable(name: "__stream", scope: !227, file: !65, line: 644, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !232)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !233, line: 49, size: 1728, elements: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!234 = !{!235, !236, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !251, !253, !254, !255, !259, !260, !262, !263, !266, !268, !271, !274, !275, !276, !277, !278}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !232, file: !233, line: 51, baseType: !90, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !232, file: !233, line: 54, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !232, file: !233, line: 55, baseType: !237, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !232, file: !233, line: 56, baseType: !237, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !232, file: !233, line: 57, baseType: !237, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !232, file: !233, line: 58, baseType: !237, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !232, file: !233, line: 59, baseType: !237, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !232, file: !233, line: 60, baseType: !237, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !232, file: !233, line: 61, baseType: !237, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !232, file: !233, line: 64, baseType: !237, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !232, file: !233, line: 65, baseType: !237, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !232, file: !233, line: 66, baseType: !237, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !232, file: !233, line: 68, baseType: !249, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !233, line: 36, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !232, file: !233, line: 70, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !232, file: !233, line: 72, baseType: !90, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !232, file: !233, line: 73, baseType: !90, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !232, file: !233, line: 74, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 152, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!258 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !232, file: !233, line: 77, baseType: !91, size: 16, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !232, file: !233, line: 78, baseType: !261, size: 8, offset: 1040)
!261 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !232, file: !233, line: 79, baseType: !29, size: 8, offset: 1048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !232, file: !233, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !233, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !232, file: !233, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 153, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !232, file: !233, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !233, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !232, file: !233, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !233, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !232, file: !233, line: 93, baseType: !252, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !232, file: !233, line: 94, baseType: !89, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !232, file: !233, line: 95, baseType: !92, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !232, file: !233, line: 96, baseType: !90, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !232, file: !233, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocalVariable(name: "__cnt", scope: !227, file: !65, line: 644, type: !92)
!283 = !DILocalVariable(name: "url_program", scope: !64, file: !65, line: 648, type: !68)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !65, line: 686, type: !68)
!285 = distinct !DILexicalBlock(scope: !64, file: !65, line: 686, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !65, line: 686, type: !229)
!287 = !DILocalVariable(name: "__cnt", scope: !285, file: !65, line: 686, type: !92)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !290, line: 3, type: !159, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !290, line: 3, type: !68, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !290, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !294, splitDebugInlining: false, nameTableKind: None)
!294 = !{!288, !291}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 45, type: !68, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!299 = !{!300, !302, !304, !306, !295, !308}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !14, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !206, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !298, line: 123, type: !14, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !298, line: 126, type: !122, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 55, type: !216, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !312, file: !313, line: 66, type: !358, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !315, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!314 = !{!89, !95}
!315 = !{!316, !318, !337, !339, !341, !343, !310, !345, !347, !349, !351, !356}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !313, line: 272, type: !99, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "old_file_name", scope: !320, file: !313, line: 304, type: !68, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "verror_at_line", scope: !313, file: !313, line: 298, type: !321, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !330)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !90, !90, !68, !74, !68, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !324, file: !313, baseType: !74, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !324, file: !313, baseType: !74, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !324, file: !313, baseType: !89, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !324, file: !313, baseType: !89, size: 64, offset: 128)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DILocalVariable(name: "status", arg: 1, scope: !320, file: !313, line: 298, type: !90)
!332 = !DILocalVariable(name: "errnum", arg: 2, scope: !320, file: !313, line: 298, type: !90)
!333 = !DILocalVariable(name: "file_name", arg: 3, scope: !320, file: !313, line: 298, type: !68)
!334 = !DILocalVariable(name: "line_number", arg: 4, scope: !320, file: !313, line: 298, type: !74)
!335 = !DILocalVariable(name: "message", arg: 5, scope: !320, file: !313, line: 298, type: !68)
!336 = !DILocalVariable(name: "args", arg: 6, scope: !320, file: !313, line: 298, type: !323)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "old_line_number", scope: !320, file: !313, line: 305, type: !74, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !313, line: 338, type: !106, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !135, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !113, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "error_message_count", scope: !312, file: !313, line: 69, type: !74, isLocal: false, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !312, file: !313, line: 295, type: !90, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !14, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 21)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !313, line: 214, type: !99, isLocal: true, isDefinition: true)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !363, line: 60, type: !113, isLocal: true, isDefinition: true)
!363 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "long_options", scope: !366, file: !363, line: 34, type: !375, isLocal: true, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C11, file: !363, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, globals: !368, splitDebugInlining: false, nameTableKind: None)
!367 = !{!89}
!368 = !{!361, !369, !371, !373, !364}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !363, line: 112, type: !29, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !363, line: 36, type: !99, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !363, line: 37, type: !135, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 768, elements: !123)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !378, line: 50, size: 256, elements: !379)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!379 = !{!380, !381, !382, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !378, line: 52, baseType: !68, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !377, file: !378, line: 55, baseType: !90, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !377, file: !378, line: 56, baseType: !383, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !377, file: !378, line: 57, baseType: !90, size: 32, offset: 192)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "program_name", scope: !387, file: !388, line: 31, type: !68, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C11, file: !388, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, globals: !390, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!389 = !{!89, !237}
!390 = !{!385, !391, !393}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !388, line: 46, type: !135, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !388, line: 49, type: !106, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "utf07FF", scope: !397, file: !398, line: 46, type: !425, isLocal: true, isDefinition: true)
!397 = distinct !DISubprogram(name: "proper_name_lite", scope: !398, file: !398, line: 38, type: !399, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !403)
!398 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!399 = !DISubroutineType(types: !400)
!400 = !{!68, !68, !68}
!401 = distinct !DICompileUnit(language: DW_LANG_C11, file: !398, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !402, splitDebugInlining: false, nameTableKind: None)
!402 = !{!395}
!403 = !{!404, !405, !406, !407, !412}
!404 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !397, file: !398, line: 38, type: !68)
!405 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !397, file: !398, line: 38, type: !68)
!406 = !DILocalVariable(name: "translation", scope: !397, file: !398, line: 40, type: !68)
!407 = !DILocalVariable(name: "w", scope: !397, file: !398, line: 47, type: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !409, line: 37, baseType: !410)
!409 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !257, line: 57, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !257, line: 42, baseType: !74)
!412 = !DILocalVariable(name: "mbs", scope: !397, file: !398, line: 48, type: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !414, line: 6, baseType: !415)
!414 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !416, line: 21, baseType: !417)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 13, size: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !417, file: !416, line: 15, baseType: !90, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !417, file: !416, line: 20, baseType: !421, size: 32, offset: 32)
!421 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !417, file: !416, line: 16, size: 32, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !421, file: !416, line: 18, baseType: !74, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !421, file: !416, line: 19, baseType: !106, size: 32)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !114)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !428, line: 78, type: !135, isLocal: true, isDefinition: true)
!428 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !428, line: 79, type: !59, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !428, line: 80, type: !49, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !428, line: 81, type: !49, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !428, line: 82, type: !279, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !428, line: 83, type: !113, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !428, line: 84, type: !135, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !428, line: 85, type: !14, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !428, line: 86, type: !14, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !428, line: 87, type: !135, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !449, file: !428, line: 76, type: !535, isLocal: false, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C11, file: !428, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !450, retainedTypes: !470, globals: !471, splitDebugInlining: false, nameTableKind: None)
!450 = !{!451, !465, !72}
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !452, line: 42, baseType: !74, size: 32, elements: !453)
!452 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!454 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!455 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!456 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!457 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!458 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!459 = !DIEnumerator(name: "c_quoting_style", value: 5)
!460 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!461 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!462 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!463 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!464 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !452, line: 254, baseType: !74, size: 32, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!468 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!469 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!470 = !{!89, !90, !91, !92}
!471 = !{!426, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !472, !476, !486, !488, !493, !495, !497, !499, !501, !524, !531, !533}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !449, file: !428, line: 92, type: !474, isLocal: false, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 320, elements: !35)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !449, file: !428, line: 1040, type: !478, isLocal: false, isDefinition: true)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !428, line: 56, size: 448, elements: !479)
!479 = !{!480, !481, !482, !484, !485}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !478, file: !428, line: 59, baseType: !451, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !428, line: 62, baseType: !90, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !478, file: !428, line: 66, baseType: !483, size: 256, offset: 64)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !136)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !478, file: !428, line: 69, baseType: !68, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !478, file: !428, line: 72, baseType: !68, size: 64, offset: 384)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !449, file: !428, line: 107, type: !478, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "slot0", scope: !449, file: !428, line: 831, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 256)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !428, line: 321, type: !113, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !428, line: 357, type: !113, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !428, line: 358, type: !113, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !428, line: 199, type: !14, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "quote", scope: !503, file: !428, line: 228, type: !522, isLocal: true, isDefinition: true)
!503 = distinct !DISubprogram(name: "gettext_quote", scope: !428, file: !428, line: 197, type: !504, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !449, retainedNodes: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{!68, !68, !451}
!506 = !{!507, !508, !509, !510, !511}
!507 = !DILocalVariable(name: "msgid", arg: 1, scope: !503, file: !428, line: 197, type: !68)
!508 = !DILocalVariable(name: "s", arg: 2, scope: !503, file: !428, line: 197, type: !451)
!509 = !DILocalVariable(name: "translation", scope: !503, file: !428, line: 199, type: !68)
!510 = !DILocalVariable(name: "w", scope: !503, file: !428, line: 229, type: !408)
!511 = !DILocalVariable(name: "mbs", scope: !503, file: !428, line: 230, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !414, line: 6, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !416, line: 21, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 13, size: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !514, file: !416, line: 15, baseType: !90, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !514, file: !416, line: 20, baseType: !518, size: 32, offset: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !416, line: 16, size: 32, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !518, file: !416, line: 18, baseType: !74, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !518, file: !416, line: 19, baseType: !106, size: 32)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !523)
!523 = !{!115, !108}
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "slotvec", scope: !449, file: !428, line: 834, type: !526, isLocal: true, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !428, line: 823, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !527, file: !428, line: 825, baseType: !92, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !527, file: !428, line: 826, baseType: !237, size: 64, offset: 64)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "nslots", scope: !449, file: !428, line: 832, type: !90, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "slotvec0", scope: !449, file: !428, line: 833, type: !527, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 704, elements: !537)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!537 = !{!538}
!538 = !DISubrange(count: 11)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !541, line: 67, type: !206, isLocal: true, isDefinition: true)
!541 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !541, line: 69, type: !14, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !541, line: 83, type: !14, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !541, line: 83, type: !106, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !541, line: 85, type: !113, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !541, line: 88, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 171)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !541, line: 88, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 34)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !541, line: 105, type: !177, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !541, line: 109, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 23)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !541, line: 113, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 28)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !541, line: 120, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 32)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !541, line: 127, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 36)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !541, line: 134, type: !154, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !541, line: 142, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 44)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !541, line: 150, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 48)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !541, line: 159, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 52)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !541, line: 170, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 60)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !541, line: 248, type: !279, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !541, line: 248, type: !182, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !541, line: 254, type: !279, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !541, line: 254, type: !44, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !541, line: 254, type: !154, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !541, line: 259, type: !3, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !541, line: 259, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 29)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !623, file: !624, line: 26, type: !626, isLocal: false, isDefinition: true)
!623 = distinct !DICompileUnit(language: DW_LANG_C11, file: !624, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !625, splitDebugInlining: false, nameTableKind: None)
!624 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!625 = !{!621}
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 376, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 47)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "exit_failure", scope: !631, file: !632, line: 24, type: !634, isLocal: false, isDefinition: true)
!631 = distinct !DICompileUnit(language: DW_LANG_C11, file: !632, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !633, splitDebugInlining: false, nameTableKind: None)
!632 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!633 = !{!629}
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !90)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !637, line: 34, type: !122, isLocal: true, isDefinition: true)
!637 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !637, line: 34, type: !14, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !637, line: 34, type: !54, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 108, type: !29, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "internal_state", scope: !647, file: !644, line: 97, type: !650, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !648, globals: !649, splitDebugInlining: false, nameTableKind: None)
!648 = !{!89, !92, !95}
!649 = !{!642, !645}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !414, line: 6, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !416, line: 21, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 13, size: 64, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !652, file: !416, line: 15, baseType: !90, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !652, file: !416, line: 20, baseType: !656, size: 32, offset: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !652, file: !416, line: 16, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !656, file: !416, line: 18, baseType: !74, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !656, file: !416, line: 19, baseType: !106, size: 32)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !662, line: 35, type: !59, isLocal: true, isDefinition: true)
!662 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!663 = distinct !DICompileUnit(language: DW_LANG_C11, file: !664, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!665 = distinct !DICompileUnit(language: DW_LANG_C11, file: !541, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !666, retainedTypes: !367, globals: !670, splitDebugInlining: false, nameTableKind: None)
!666 = !{!667}
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !541, line: 40, baseType: !74, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!670 = !{!539, !542, !544, !546, !548, !550, !555, !560, !562, !567, !572, !577, !582, !584, !589, !594, !599, !604, !606, !608, !610, !612, !614, !616}
!671 = distinct !DICompileUnit(language: DW_LANG_C11, file: !672, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !705, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!673 = !{!674, !686}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !675, file: !672, line: 188, baseType: !74, size: 32, elements: !684)
!675 = distinct !DISubprogram(name: "x2nrealloc", scope: !672, file: !672, line: 176, type: !676, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !671, retainedNodes: !679)
!676 = !DISubroutineType(types: !677)
!677 = !{!89, !89, !678, !92}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!679 = !{!680, !681, !682, !683}
!680 = !DILocalVariable(name: "p", arg: 1, scope: !675, file: !672, line: 176, type: !89)
!681 = !DILocalVariable(name: "pn", arg: 2, scope: !675, file: !672, line: 176, type: !678)
!682 = !DILocalVariable(name: "s", arg: 3, scope: !675, file: !672, line: 176, type: !92)
!683 = !DILocalVariable(name: "n", scope: !675, file: !672, line: 178, type: !92)
!684 = !{!685}
!685 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !687, file: !672, line: 228, baseType: !74, size: 32, elements: !684)
!687 = distinct !DISubprogram(name: "xpalloc", scope: !672, file: !672, line: 223, type: !688, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !671, retainedNodes: !695)
!688 = !DISubroutineType(types: !689)
!689 = !{!89, !89, !690, !691, !693, !691}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !692, line: 130, baseType: !693)
!692 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !694, line: 18, baseType: !258)
!694 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704}
!696 = !DILocalVariable(name: "pa", arg: 1, scope: !687, file: !672, line: 223, type: !89)
!697 = !DILocalVariable(name: "pn", arg: 2, scope: !687, file: !672, line: 223, type: !690)
!698 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !687, file: !672, line: 223, type: !691)
!699 = !DILocalVariable(name: "n_max", arg: 4, scope: !687, file: !672, line: 223, type: !693)
!700 = !DILocalVariable(name: "s", arg: 5, scope: !687, file: !672, line: 223, type: !691)
!701 = !DILocalVariable(name: "n0", scope: !687, file: !672, line: 230, type: !691)
!702 = !DILocalVariable(name: "n", scope: !687, file: !672, line: 237, type: !691)
!703 = !DILocalVariable(name: "nbytes", scope: !687, file: !672, line: 248, type: !691)
!704 = !DILocalVariable(name: "adjusted_nbytes", scope: !687, file: !672, line: 252, type: !691)
!705 = !{!237, !89}
!706 = distinct !DICompileUnit(language: DW_LANG_C11, file: !637, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !707, splitDebugInlining: false, nameTableKind: None)
!707 = !{!635, !638, !640}
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!718 = distinct !DICompileUnit(language: DW_LANG_C11, file: !662, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !719, splitDebugInlining: false, nameTableKind: None)
!719 = !{!720, !660}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !662, line: 35, type: !113, isLocal: true, isDefinition: true)
!722 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!726 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!727 = !{i32 7, !"Dwarf Version", i32 5}
!728 = !{i32 2, !"Debug Info Version", i32 3}
!729 = !{i32 1, !"wchar_size", i32 4}
!730 = !{i32 8, !"PIC Level", i32 2}
!731 = !{i32 7, !"PIE Level", i32 2}
!732 = !{i32 7, !"uwtable", i32 2}
!733 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!734 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 34, type: !735, scopeLine: 35, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !90}
!737 = !{!738}
!738 = !DILocalVariable(name: "status", arg: 1, scope: !734, file: !2, line: 34, type: !90)
!739 = !DILocation(line: 0, scope: !734)
!740 = !DILocation(line: 36, column: 14, scope: !741)
!741 = distinct !DILexicalBlock(scope: !734, file: !2, line: 36, column: 7)
!742 = !DILocation(line: 36, column: 7, scope: !734)
!743 = !DILocation(line: 37, column: 5, scope: !744)
!744 = distinct !DILexicalBlock(scope: !741, file: !2, line: 37, column: 5)
!745 = !{!746, !746, i64 0}
!746 = !{!"any pointer", !747, i64 0}
!747 = !{!"omnipotent char", !748, i64 0}
!748 = !{!"Simple C/C++ TBAA"}
!749 = !DILocation(line: 40, column: 7, scope: !750)
!750 = distinct !DILexicalBlock(scope: !741, file: !2, line: 39, column: 5)
!751 = !DILocation(line: 45, column: 7, scope: !750)
!752 = !DILocation(line: 46, column: 7, scope: !750)
!753 = !DILocalVariable(name: "program", arg: 1, scope: !754, file: !65, line: 836, type: !68)
!754 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !65, file: !65, line: 836, type: !755, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !68}
!757 = !{!753, !758, !765, !766, !768, !769}
!758 = !DILocalVariable(name: "infomap", scope: !754, file: !65, line: 838, type: !759)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 896, elements: !15)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !754, file: !65, line: 838, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !761, file: !65, line: 838, baseType: !68, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !761, file: !65, line: 838, baseType: !68, size: 64, offset: 64)
!765 = !DILocalVariable(name: "node", scope: !754, file: !65, line: 848, type: !68)
!766 = !DILocalVariable(name: "map_prog", scope: !754, file: !65, line: 849, type: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!768 = !DILocalVariable(name: "lc_messages", scope: !754, file: !65, line: 861, type: !68)
!769 = !DILocalVariable(name: "url_program", scope: !754, file: !65, line: 874, type: !68)
!770 = !DILocation(line: 0, scope: !754, inlinedAt: !771)
!771 = distinct !DILocation(line: 47, column: 7, scope: !750)
!772 = !{}
!773 = !DILocation(line: 857, column: 3, scope: !754, inlinedAt: !771)
!774 = !DILocation(line: 861, column: 29, scope: !754, inlinedAt: !771)
!775 = !DILocation(line: 862, column: 7, scope: !776, inlinedAt: !771)
!776 = distinct !DILexicalBlock(scope: !754, file: !65, line: 862, column: 7)
!777 = !DILocation(line: 862, column: 19, scope: !776, inlinedAt: !771)
!778 = !DILocation(line: 862, column: 22, scope: !776, inlinedAt: !771)
!779 = !DILocation(line: 862, column: 7, scope: !754, inlinedAt: !771)
!780 = !DILocation(line: 868, column: 7, scope: !781, inlinedAt: !771)
!781 = distinct !DILexicalBlock(scope: !776, file: !65, line: 863, column: 5)
!782 = !DILocation(line: 870, column: 5, scope: !781, inlinedAt: !771)
!783 = !DILocation(line: 875, column: 3, scope: !754, inlinedAt: !771)
!784 = !DILocation(line: 877, column: 3, scope: !754, inlinedAt: !771)
!785 = !DILocation(line: 49, column: 3, scope: !734)
!786 = !DISubprogram(name: "dcgettext", scope: !787, file: !787, line: 51, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!787 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!788 = !DISubroutineType(types: !789)
!789 = !{!237, !68, !68, !90}
!790 = !DISubprogram(name: "__fprintf_chk", scope: !791, file: !791, line: 93, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!791 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!792 = !DISubroutineType(types: !793)
!793 = !{!90, !794, !90, !795, null}
!794 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !229)
!795 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!796 = !DISubprogram(name: "__printf_chk", scope: !791, file: !791, line: 95, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DISubroutineType(types: !798)
!798 = !{!90, !90, !795, null}
!799 = !DILocation(line: 0, scope: !64)
!800 = !DILocation(line: 581, column: 7, scope: !214)
!801 = !{!802, !802, i64 0}
!802 = !{!"int", !747, i64 0}
!803 = !DILocation(line: 581, column: 19, scope: !214)
!804 = !DILocation(line: 581, column: 7, scope: !64)
!805 = !DILocation(line: 585, column: 26, scope: !213)
!806 = !DILocation(line: 0, scope: !213)
!807 = !DILocation(line: 586, column: 23, scope: !213)
!808 = !DILocation(line: 586, column: 28, scope: !213)
!809 = !DILocation(line: 586, column: 32, scope: !213)
!810 = !{!747, !747, i64 0}
!811 = !DILocation(line: 586, column: 38, scope: !213)
!812 = !DILocalVariable(name: "__s1", arg: 1, scope: !813, file: !814, line: 1359, type: !68)
!813 = distinct !DISubprogram(name: "streq", scope: !814, file: !814, line: 1359, type: !815, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !817)
!814 = !DIFile(filename: "./lib/string.h", directory: "/src")
!815 = !DISubroutineType(types: !816)
!816 = !{!216, !68, !68}
!817 = !{!812, !818}
!818 = !DILocalVariable(name: "__s2", arg: 2, scope: !813, file: !814, line: 1359, type: !68)
!819 = !DILocation(line: 0, scope: !813, inlinedAt: !820)
!820 = distinct !DILocation(line: 586, column: 41, scope: !213)
!821 = !DILocation(line: 1361, column: 11, scope: !813, inlinedAt: !820)
!822 = !DILocation(line: 1361, column: 10, scope: !813, inlinedAt: !820)
!823 = !DILocation(line: 586, column: 19, scope: !213)
!824 = !DILocation(line: 587, column: 5, scope: !213)
!825 = !DILocation(line: 588, column: 7, scope: !826)
!826 = distinct !DILexicalBlock(scope: !64, file: !65, line: 588, column: 7)
!827 = !DILocation(line: 588, column: 7, scope: !64)
!828 = !DILocation(line: 590, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !826, file: !65, line: 589, column: 5)
!830 = !DILocation(line: 591, column: 7, scope: !829)
!831 = !DILocation(line: 595, column: 37, scope: !64)
!832 = !DILocation(line: 595, column: 35, scope: !64)
!833 = !DILocation(line: 596, column: 29, scope: !64)
!834 = !DILocation(line: 597, column: 8, scope: !222)
!835 = !DILocation(line: 597, column: 7, scope: !64)
!836 = !DILocation(line: 604, column: 24, scope: !221)
!837 = !DILocation(line: 604, column: 12, scope: !222)
!838 = !DILocation(line: 0, scope: !220)
!839 = !DILocation(line: 610, column: 16, scope: !220)
!840 = !DILocation(line: 610, column: 7, scope: !220)
!841 = !DILocation(line: 611, column: 21, scope: !220)
!842 = !{!843, !843, i64 0}
!843 = !{!"short", !747, i64 0}
!844 = !DILocation(line: 611, column: 19, scope: !220)
!845 = !DILocation(line: 611, column: 16, scope: !220)
!846 = !DILocation(line: 610, column: 30, scope: !220)
!847 = distinct !{!847, !840, !841, !848}
!848 = !{!"llvm.loop.mustprogress"}
!849 = !DILocation(line: 612, column: 18, scope: !850)
!850 = distinct !DILexicalBlock(scope: !220, file: !65, line: 612, column: 11)
!851 = !DILocation(line: 612, column: 11, scope: !220)
!852 = !DILocation(line: 620, column: 23, scope: !64)
!853 = !DILocation(line: 625, column: 39, scope: !64)
!854 = !DILocation(line: 626, column: 3, scope: !64)
!855 = !DILocation(line: 626, column: 10, scope: !64)
!856 = !DILocation(line: 626, column: 21, scope: !64)
!857 = !DILocation(line: 628, column: 44, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !65, line: 628, column: 11)
!859 = distinct !DILexicalBlock(scope: !64, file: !65, line: 627, column: 5)
!860 = !DILocation(line: 628, column: 32, scope: !858)
!861 = !DILocation(line: 628, column: 49, scope: !858)
!862 = !DILocation(line: 628, column: 11, scope: !859)
!863 = !DILocation(line: 630, column: 11, scope: !864)
!864 = distinct !DILexicalBlock(scope: !859, file: !65, line: 630, column: 11)
!865 = !DILocation(line: 630, column: 11, scope: !859)
!866 = !DILocation(line: 632, column: 26, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !65, line: 632, column: 15)
!868 = distinct !DILexicalBlock(scope: !864, file: !65, line: 631, column: 9)
!869 = !DILocation(line: 632, column: 34, scope: !867)
!870 = !DILocation(line: 632, column: 37, scope: !867)
!871 = !DILocation(line: 632, column: 15, scope: !868)
!872 = !DILocation(line: 636, column: 16, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !65, line: 636, column: 15)
!874 = !DILocation(line: 636, column: 29, scope: !873)
!875 = !DILocation(line: 640, column: 16, scope: !859)
!876 = distinct !{!876, !854, !877, !848}
!877 = !DILocation(line: 641, column: 5, scope: !64)
!878 = !DILocation(line: 644, column: 3, scope: !64)
!879 = !DILocation(line: 0, scope: !813, inlinedAt: !880)
!880 = distinct !DILocation(line: 648, column: 31, scope: !64)
!881 = !DILocation(line: 0, scope: !813, inlinedAt: !882)
!882 = distinct !DILocation(line: 649, column: 31, scope: !64)
!883 = !DILocation(line: 0, scope: !813, inlinedAt: !884)
!884 = distinct !DILocation(line: 650, column: 31, scope: !64)
!885 = !DILocation(line: 0, scope: !813, inlinedAt: !886)
!886 = distinct !DILocation(line: 651, column: 31, scope: !64)
!887 = !DILocation(line: 0, scope: !813, inlinedAt: !888)
!888 = distinct !DILocation(line: 652, column: 31, scope: !64)
!889 = !DILocation(line: 0, scope: !813, inlinedAt: !890)
!890 = distinct !DILocation(line: 653, column: 31, scope: !64)
!891 = !DILocation(line: 0, scope: !813, inlinedAt: !892)
!892 = distinct !DILocation(line: 654, column: 31, scope: !64)
!893 = !DILocation(line: 0, scope: !813, inlinedAt: !894)
!894 = distinct !DILocation(line: 655, column: 31, scope: !64)
!895 = !DILocation(line: 0, scope: !813, inlinedAt: !896)
!896 = distinct !DILocation(line: 656, column: 31, scope: !64)
!897 = !DILocation(line: 0, scope: !813, inlinedAt: !898)
!898 = distinct !DILocation(line: 657, column: 31, scope: !64)
!899 = !DILocation(line: 663, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !64, file: !65, line: 663, column: 7)
!901 = !DILocation(line: 664, column: 7, scope: !900)
!902 = !DILocation(line: 664, column: 10, scope: !900)
!903 = !DILocation(line: 663, column: 7, scope: !64)
!904 = !DILocation(line: 669, column: 7, scope: !905)
!905 = distinct !DILexicalBlock(scope: !900, file: !65, line: 665, column: 5)
!906 = !DILocation(line: 671, column: 5, scope: !905)
!907 = !DILocation(line: 676, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !900, file: !65, line: 673, column: 5)
!909 = !DILocation(line: 679, column: 3, scope: !64)
!910 = !DILocation(line: 683, column: 3, scope: !64)
!911 = !DILocation(line: 686, column: 3, scope: !64)
!912 = !DILocation(line: 688, column: 3, scope: !64)
!913 = !DILocation(line: 691, column: 3, scope: !64)
!914 = !DILocation(line: 695, column: 3, scope: !64)
!915 = !DILocation(line: 696, column: 1, scope: !64)
!916 = !DISubprogram(name: "setlocale", scope: !917, file: !917, line: 122, type: !918, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!917 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!918 = !DISubroutineType(types: !919)
!919 = !{!237, !90, !68}
!920 = !DISubprogram(name: "strncmp", scope: !921, file: !921, line: 159, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!921 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!922 = !DISubroutineType(types: !923)
!923 = !{!90, !68, !68, !92}
!924 = !DISubprogram(name: "fputs_unlocked", scope: !925, file: !925, line: 691, type: !926, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!925 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!926 = !DISubroutineType(types: !927)
!927 = !{!90, !795, !794}
!928 = !DISubprogram(name: "exit", scope: !929, file: !929, line: 624, type: !735, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!929 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!930 = !DISubprogram(name: "getenv", scope: !929, file: !929, line: 641, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!931 = !DISubroutineType(types: !932)
!932 = !{!237, !68}
!933 = !DISubprogram(name: "strcmp", scope: !921, file: !921, line: 156, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!934 = !DISubroutineType(types: !935)
!935 = !{!90, !68, !68}
!936 = !DISubprogram(name: "strspn", scope: !921, file: !921, line: 297, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!937 = !DISubroutineType(types: !938)
!938 = !{!94, !68, !68}
!939 = !DISubprogram(name: "strchr", scope: !921, file: !921, line: 246, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!940 = !DISubroutineType(types: !941)
!941 = !{!237, !68, !90}
!942 = !DISubprogram(name: "__ctype_b_loc", scope: !73, file: !73, line: 79, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!943 = !DISubroutineType(types: !944)
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!948 = !DISubprogram(name: "strcspn", scope: !921, file: !921, line: 293, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!949 = !DISubprogram(name: "fwrite_unlocked", scope: !925, file: !925, line: 704, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!950 = !DISubroutineType(types: !951)
!951 = !{!92, !952, !92, !92, !794}
!952 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!955 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 53, type: !956, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !959)
!956 = !DISubroutineType(types: !957)
!957 = !{!90, !90, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!959 = !{!960, !961, !962}
!960 = !DILocalVariable(name: "argc", arg: 1, scope: !955, file: !2, line: 53, type: !90)
!961 = !DILocalVariable(name: "argv", arg: 2, scope: !955, file: !2, line: 53, type: !958)
!962 = !DILocalVariable(name: "id", scope: !955, file: !2, line: 76, type: !74)
!963 = !DILocation(line: 0, scope: !955)
!964 = !DILocation(line: 56, column: 21, scope: !955)
!965 = !DILocation(line: 56, column: 3, scope: !955)
!966 = !DILocation(line: 57, column: 3, scope: !955)
!967 = !DILocation(line: 58, column: 3, scope: !955)
!968 = !DILocation(line: 59, column: 3, scope: !955)
!969 = !DILocation(line: 61, column: 3, scope: !955)
!970 = !DILocation(line: 64, column: 36, scope: !955)
!971 = !DILocation(line: 64, column: 58, scope: !955)
!972 = !DILocation(line: 63, column: 3, scope: !955)
!973 = !DILocation(line: 67, column: 7, scope: !974)
!974 = distinct !DILexicalBlock(scope: !955, file: !2, line: 67, column: 7)
!975 = !DILocation(line: 67, column: 14, scope: !974)
!976 = !DILocation(line: 67, column: 7, scope: !955)
!977 = !DILocation(line: 69, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !974, file: !2, line: 68, column: 5)
!979 = !DILocation(line: 70, column: 7, scope: !978)
!980 = !DILocation(line: 76, column: 21, scope: !955)
!981 = !DILocation(line: 78, column: 3, scope: !955)
!982 = !DILocation(line: 80, column: 3, scope: !955)
!983 = !DISubprogram(name: "bindtextdomain", scope: !787, file: !787, line: 86, type: !984, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!984 = !DISubroutineType(types: !985)
!985 = !{!237, !68, !68}
!986 = !DISubprogram(name: "textdomain", scope: !787, file: !787, line: 82, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!987 = !DISubprogram(name: "atexit", scope: !929, file: !929, line: 602, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!988 = !DISubroutineType(types: !989)
!989 = !{!90, !358}
!990 = !DISubprogram(name: "gethostid", scope: !991, file: !991, line: 1002, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!991 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!992 = !DISubroutineType(types: !993)
!993 = !{!258}
!994 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !298, file: !298, line: 50, type: !755, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !995)
!995 = !{!996}
!996 = !DILocalVariable(name: "file", arg: 1, scope: !994, file: !298, line: 50, type: !68)
!997 = !DILocation(line: 0, scope: !994)
!998 = !DILocation(line: 52, column: 13, scope: !994)
!999 = !DILocation(line: 53, column: 1, scope: !994)
!1000 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !298, file: !298, line: 87, type: !1001, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !216}
!1003 = !{!1004}
!1004 = !DILocalVariable(name: "ignore", arg: 1, scope: !1000, file: !298, line: 87, type: !216)
!1005 = !DILocation(line: 0, scope: !1000)
!1006 = !DILocation(line: 89, column: 16, scope: !1000)
!1007 = !{!1008, !1008, i64 0}
!1008 = !{!"_Bool", !747, i64 0}
!1009 = !DILocation(line: 90, column: 1, scope: !1000)
!1010 = distinct !DISubprogram(name: "close_stdout", scope: !298, file: !298, line: 116, type: !359, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !1011)
!1011 = !{!1012}
!1012 = !DILocalVariable(name: "write_error", scope: !1013, file: !298, line: 121, type: !68)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !298, line: 120, column: 5)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !298, line: 118, column: 7)
!1015 = !DILocation(line: 118, column: 21, scope: !1014)
!1016 = !DILocation(line: 118, column: 7, scope: !1014)
!1017 = !DILocation(line: 118, column: 29, scope: !1014)
!1018 = !DILocation(line: 119, column: 7, scope: !1014)
!1019 = !DILocation(line: 119, column: 12, scope: !1014)
!1020 = !{i8 0, i8 2}
!1021 = !DILocation(line: 119, column: 25, scope: !1014)
!1022 = !DILocation(line: 119, column: 28, scope: !1014)
!1023 = !DILocation(line: 119, column: 34, scope: !1014)
!1024 = !DILocation(line: 118, column: 7, scope: !1010)
!1025 = !DILocation(line: 121, column: 33, scope: !1013)
!1026 = !DILocation(line: 0, scope: !1013)
!1027 = !DILocation(line: 122, column: 11, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1013, file: !298, line: 122, column: 11)
!1029 = !DILocation(line: 0, scope: !1028)
!1030 = !DILocation(line: 122, column: 11, scope: !1013)
!1031 = !DILocation(line: 123, column: 9, scope: !1028)
!1032 = !DILocation(line: 126, column: 9, scope: !1028)
!1033 = !DILocation(line: 128, column: 14, scope: !1013)
!1034 = !DILocation(line: 128, column: 7, scope: !1013)
!1035 = !DILocation(line: 133, column: 42, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1010, file: !298, line: 133, column: 7)
!1037 = !DILocation(line: 133, column: 28, scope: !1036)
!1038 = !DILocation(line: 133, column: 50, scope: !1036)
!1039 = !DILocation(line: 133, column: 7, scope: !1010)
!1040 = !DILocation(line: 134, column: 12, scope: !1036)
!1041 = !DILocation(line: 134, column: 5, scope: !1036)
!1042 = !DILocation(line: 135, column: 1, scope: !1010)
!1043 = !DISubprogram(name: "__errno_location", scope: !1044, file: !1044, line: 37, type: !1045, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1044 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!383}
!1047 = !DISubprogram(name: "_exit", scope: !991, file: !991, line: 624, type: !735, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1048 = distinct !DISubprogram(name: "verror", scope: !313, file: !313, line: 251, type: !1049, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1051)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !90, !90, !68, !323}
!1051 = !{!1052, !1053, !1054, !1055}
!1052 = !DILocalVariable(name: "status", arg: 1, scope: !1048, file: !313, line: 251, type: !90)
!1053 = !DILocalVariable(name: "errnum", arg: 2, scope: !1048, file: !313, line: 251, type: !90)
!1054 = !DILocalVariable(name: "message", arg: 3, scope: !1048, file: !313, line: 251, type: !68)
!1055 = !DILocalVariable(name: "args", arg: 4, scope: !1048, file: !313, line: 251, type: !323)
!1056 = !DILocation(line: 0, scope: !1048)
!1057 = !DILocation(line: 261, column: 3, scope: !1048)
!1058 = !DILocation(line: 265, column: 7, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1048, file: !313, line: 265, column: 7)
!1060 = !DILocation(line: 265, column: 7, scope: !1048)
!1061 = !DILocation(line: 266, column: 5, scope: !1059)
!1062 = !DILocation(line: 272, column: 7, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !313, line: 268, column: 5)
!1064 = !DILocation(line: 276, column: 3, scope: !1048)
!1065 = !DILocation(line: 282, column: 1, scope: !1048)
!1066 = distinct !DISubprogram(name: "flush_stdout", scope: !313, file: !313, line: 163, type: !359, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1067)
!1067 = !{!1068}
!1068 = !DILocalVariable(name: "stdout_fd", scope: !1066, file: !313, line: 166, type: !90)
!1069 = !DILocation(line: 0, scope: !1066)
!1070 = !DILocalVariable(name: "fd", arg: 1, scope: !1071, file: !313, line: 145, type: !90)
!1071 = distinct !DISubprogram(name: "is_open", scope: !313, file: !313, line: 145, type: !1072, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!90, !90}
!1074 = !{!1070}
!1075 = !DILocation(line: 0, scope: !1071, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 182, column: 25, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1066, file: !313, line: 182, column: 7)
!1078 = !DILocation(line: 157, column: 15, scope: !1071, inlinedAt: !1076)
!1079 = !DILocation(line: 157, column: 12, scope: !1071, inlinedAt: !1076)
!1080 = !DILocation(line: 182, column: 7, scope: !1066)
!1081 = !DILocation(line: 184, column: 5, scope: !1077)
!1082 = !DILocation(line: 185, column: 1, scope: !1066)
!1083 = distinct !DISubprogram(name: "error_tail", scope: !313, file: !313, line: 219, type: !1049, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1084)
!1084 = !{!1085, !1086, !1087, !1088}
!1085 = !DILocalVariable(name: "status", arg: 1, scope: !1083, file: !313, line: 219, type: !90)
!1086 = !DILocalVariable(name: "errnum", arg: 2, scope: !1083, file: !313, line: 219, type: !90)
!1087 = !DILocalVariable(name: "message", arg: 3, scope: !1083, file: !313, line: 219, type: !68)
!1088 = !DILocalVariable(name: "args", arg: 4, scope: !1083, file: !313, line: 219, type: !323)
!1089 = distinct !DIAssignID()
!1090 = !DILocation(line: 0, scope: !1083)
!1091 = !DILocation(line: 229, column: 13, scope: !1083)
!1092 = !DILocalVariable(name: "__stream", arg: 1, scope: !1093, file: !791, line: 132, type: !1096)
!1093 = distinct !DISubprogram(name: "vfprintf", scope: !791, file: !791, line: 132, type: !1094, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1131)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!90, !1096, !795, !323}
!1096 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !233, line: 49, size: 1728, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1099, file: !233, line: 51, baseType: !90, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1099, file: !233, line: 54, baseType: !237, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1099, file: !233, line: 55, baseType: !237, size: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1099, file: !233, line: 56, baseType: !237, size: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1099, file: !233, line: 57, baseType: !237, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1099, file: !233, line: 58, baseType: !237, size: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1099, file: !233, line: 59, baseType: !237, size: 64, offset: 384)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1099, file: !233, line: 60, baseType: !237, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1099, file: !233, line: 61, baseType: !237, size: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1099, file: !233, line: 64, baseType: !237, size: 64, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1099, file: !233, line: 65, baseType: !237, size: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1099, file: !233, line: 66, baseType: !237, size: 64, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1099, file: !233, line: 68, baseType: !249, size: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1099, file: !233, line: 70, baseType: !1115, size: 64, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1099, file: !233, line: 72, baseType: !90, size: 32, offset: 896)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1099, file: !233, line: 73, baseType: !90, size: 32, offset: 928)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1099, file: !233, line: 74, baseType: !256, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1099, file: !233, line: 77, baseType: !91, size: 16, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1099, file: !233, line: 78, baseType: !261, size: 8, offset: 1040)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1099, file: !233, line: 79, baseType: !29, size: 8, offset: 1048)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1099, file: !233, line: 81, baseType: !264, size: 64, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1099, file: !233, line: 89, baseType: !267, size: 64, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1099, file: !233, line: 91, baseType: !269, size: 64, offset: 1216)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1099, file: !233, line: 92, baseType: !272, size: 64, offset: 1280)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1099, file: !233, line: 93, baseType: !1115, size: 64, offset: 1344)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1099, file: !233, line: 94, baseType: !89, size: 64, offset: 1408)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1099, file: !233, line: 95, baseType: !92, size: 64, offset: 1472)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1099, file: !233, line: 96, baseType: !90, size: 32, offset: 1536)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1099, file: !233, line: 98, baseType: !279, size: 160, offset: 1568)
!1131 = !{!1092, !1132, !1133}
!1132 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1093, file: !791, line: 133, type: !795)
!1133 = !DILocalVariable(name: "__ap", arg: 3, scope: !1093, file: !791, line: 133, type: !323)
!1134 = !DILocation(line: 0, scope: !1093, inlinedAt: !1135)
!1135 = distinct !DILocation(line: 229, column: 3, scope: !1083)
!1136 = !DILocation(line: 135, column: 10, scope: !1093, inlinedAt: !1135)
!1137 = !DILocation(line: 232, column: 3, scope: !1083)
!1138 = !DILocation(line: 233, column: 7, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1083, file: !313, line: 233, column: 7)
!1140 = !DILocation(line: 233, column: 7, scope: !1083)
!1141 = !DILocalVariable(name: "errbuf", scope: !1142, file: !313, line: 193, type: !1146)
!1142 = distinct !DISubprogram(name: "print_errno_message", scope: !313, file: !313, line: 188, type: !735, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1143)
!1143 = !{!1144, !1145, !1141}
