; ModuleID = 'src/link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s FILE1 FILE2\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [76 x i8] c"Call the link function to create a link named FILE2 to an existing FILE1.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"link\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 15)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !77, line: 676, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 61)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !77, line: 679, type: !148, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !77, line: 683, type: !19, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !77, line: 688, type: !19, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !77, line: 691, type: !164, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !77, line: 839, type: !56, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !77, line: 840, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 22)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !77, line: 841, type: !185, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !77, line: 862, type: !129, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !77, line: 868, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 71)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !77, line: 875, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 27)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 51)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 12)
!232 = !{!233, !234, !235, !238, !240, !241, !242, !246, !247, !248, !249, !251, !305, !306, !307, !309, !310}
!233 = !DILocalVariable(name: "program", arg: 1, scope: !76, file: !77, line: 573, type: !80)
!234 = !DILocalVariable(name: "option", arg: 2, scope: !76, file: !77, line: 573, type: !80)
!235 = !DILocalVariable(name: "term", scope: !236, file: !77, line: 585, type: !80)
!236 = distinct !DILexicalBlock(scope: !237, file: !77, line: 582, column: 5)
!237 = distinct !DILexicalBlock(scope: !76, file: !77, line: 581, column: 7)
!238 = !DILocalVariable(name: "double_space", scope: !76, file: !77, line: 594, type: !239)
!239 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!240 = !DILocalVariable(name: "first_word", scope: !76, file: !77, line: 595, type: !80)
!241 = !DILocalVariable(name: "option_text", scope: !76, file: !77, line: 596, type: !80)
!242 = !DILocalVariable(name: "s", scope: !243, file: !77, line: 608, type: !80)
!243 = distinct !DILexicalBlock(scope: !244, file: !77, line: 605, column: 5)
!244 = distinct !DILexicalBlock(scope: !245, file: !77, line: 604, column: 12)
!245 = distinct !DILexicalBlock(scope: !76, file: !77, line: 597, column: 7)
!246 = !DILocalVariable(name: "spaces", scope: !243, file: !77, line: 609, type: !118)
!247 = !DILocalVariable(name: "anchor_len", scope: !76, file: !77, line: 620, type: !118)
!248 = !DILocalVariable(name: "desc_text", scope: !76, file: !77, line: 625, type: !80)
!249 = !DILocalVariable(name: "__ptr", scope: !250, file: !77, line: 644, type: !80)
!250 = distinct !DILexicalBlock(scope: !76, file: !77, line: 644, column: 3)
!251 = !DILocalVariable(name: "__stream", scope: !250, file: !77, line: 644, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !255)
!254 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !257)
!256 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!257 = !{!258, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !274, !276, !277, !278, !282, !283, !285, !286, !289, !291, !294, !297, !298, !299, !300, !301}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !255, file: !256, line: 51, baseType: !116, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !255, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !255, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !255, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !255, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !255, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !255, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !255, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !255, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !255, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !255, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !255, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !255, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !256, line: 36, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !255, file: !256, line: 70, baseType: !275, size: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !255, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !255, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !255, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !280, line: 152, baseType: !281)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!281 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !255, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !255, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!284 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !255, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !255, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !256, line: 43, baseType: null)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !255, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !280, line: 153, baseType: !281)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !255, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !256, line: 37, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !255, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !256, line: 38, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !255, file: !256, line: 93, baseType: !275, size: 64, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !255, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !255, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !255, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !255, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 20)
!305 = !DILocalVariable(name: "__cnt", scope: !250, file: !77, line: 644, type: !118)
!306 = !DILocalVariable(name: "url_program", scope: !76, file: !77, line: 648, type: !80)
!307 = !DILocalVariable(name: "__ptr", scope: !308, file: !77, line: 686, type: !80)
!308 = distinct !DILexicalBlock(scope: !76, file: !77, line: 686, column: 3)
!309 = !DILocalVariable(name: "__stream", scope: !308, file: !77, line: 686, type: !252)
!310 = !DILocalVariable(name: "__cnt", scope: !308, file: !77, line: 686, type: !118)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !313, line: 3, type: !185, isLocal: true, isDefinition: true)
!313 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "Version", scope: !316, file: !313, line: 3, type: !80, isLocal: false, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!317 = !{!311, !314}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "file_name", scope: !320, file: !321, line: 45, type: !80, isLocal: true, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C11, file: !321, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !322, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!322 = !{!323, !325, !327, !329, !318, !331}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !159, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !229, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !321, line: 123, type: !159, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !321, line: 126, type: !148, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !320, file: !321, line: 55, type: !239, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !335, file: !336, line: 66, type: !381, isLocal: false, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C11, file: !336, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !337, globals: !338, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!337 = !{!115, !121}
!338 = !{!339, !341, !360, !362, !364, !366, !333, !368, !370, !372, !374, !379}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !336, line: 272, type: !19, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "old_file_name", scope: !343, file: !336, line: 304, type: !80, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "verror_at_line", scope: !336, file: !336, line: 298, type: !344, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !353)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !116, !116, !80, !86, !80, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !347, file: !336, baseType: !86, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !347, file: !336, baseType: !86, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !347, file: !336, baseType: !115, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !347, file: !336, baseType: !115, size: 64, offset: 128)
!353 = !{!354, !355, !356, !357, !358, !359}
!354 = !DILocalVariable(name: "status", arg: 1, scope: !343, file: !336, line: 298, type: !116)
!355 = !DILocalVariable(name: "errnum", arg: 2, scope: !343, file: !336, line: 298, type: !116)
!356 = !DILocalVariable(name: "file_name", arg: 3, scope: !343, file: !336, line: 298, type: !80)
!357 = !DILocalVariable(name: "line_number", arg: 4, scope: !343, file: !336, line: 298, type: !86)
!358 = !DILocalVariable(name: "message", arg: 5, scope: !343, file: !336, line: 298, type: !80)
!359 = !DILocalVariable(name: "args", arg: 6, scope: !343, file: !336, line: 298, type: !346)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "old_line_number", scope: !343, file: !336, line: 305, type: !86, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !336, line: 338, type: !129, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !164, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !139, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "error_message_count", scope: !335, file: !336, line: 69, type: !86, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !335, file: !336, line: 295, type: !116, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !159, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 21)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !336, line: 214, type: !19, isLocal: true, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !386, line: 60, type: !139, isLocal: true, isDefinition: true)
!386 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "long_options", scope: !389, file: !386, line: 34, type: !398, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !386, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !{!115}
!391 = !{!384, !392, !394, !396, !387}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !386, line: 112, type: !34, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !386, line: 36, type: !19, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !386, line: 37, type: !164, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 768, elements: !149)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !401, line: 50, size: 256, elements: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!402 = !{!403, !404, !405, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !401, line: 52, baseType: !80, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !400, file: !401, line: 55, baseType: !116, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !401, line: 56, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !400, file: !401, line: 57, baseType: !116, size: 32, offset: 192)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "program_name", scope: !410, file: !411, line: 31, type: !80, isLocal: false, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, globals: !413, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!412 = !{!115, !260}
!413 = !{!408, !414, !416}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !411, line: 46, type: !164, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !411, line: 49, type: !129, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "utf07FF", scope: !420, file: !421, line: 46, type: !448, isLocal: true, isDefinition: true)
!420 = distinct !DISubprogram(name: "proper_name_lite", scope: !421, file: !421, line: 38, type: !422, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !424, retainedNodes: !426)
!421 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!422 = !DISubroutineType(types: !423)
!423 = !{!80, !80, !80}
!424 = distinct !DICompileUnit(language: DW_LANG_C11, file: !421, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !425, splitDebugInlining: false, nameTableKind: None)
!425 = !{!418}
!426 = !{!427, !428, !429, !430, !435}
!427 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !420, file: !421, line: 38, type: !80)
!428 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !420, file: !421, line: 38, type: !80)
!429 = !DILocalVariable(name: "translation", scope: !420, file: !421, line: 40, type: !80)
!430 = !DILocalVariable(name: "w", scope: !420, file: !421, line: 47, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !432, line: 37, baseType: !433)
!432 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !280, line: 57, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !280, line: 42, baseType: !86)
!435 = !DILocalVariable(name: "mbs", scope: !420, file: !421, line: 48, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !438)
!437 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !440)
!439 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !440, file: !439, line: 15, baseType: !116, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !440, file: !439, line: 20, baseType: !444, size: 32, offset: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !439, line: 16, size: 32, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !444, file: !439, line: 18, baseType: !86, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !444, file: !439, line: 19, baseType: !129, size: 32)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !140)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !451, line: 78, type: !164, isLocal: true, isDefinition: true)
!451 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !451, line: 79, type: !134, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !451, line: 80, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 13)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !451, line: 81, type: !456, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !451, line: 82, type: !302, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !451, line: 83, type: !139, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !451, line: 84, type: !164, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !451, line: 85, type: !159, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !451, line: 86, type: !159, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !451, line: 87, type: !164, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !475, file: !451, line: 76, type: !549, isLocal: false, isDefinition: true)
!475 = distinct !DICompileUnit(language: DW_LANG_C11, file: !451, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !476, retainedTypes: !484, globals: !485, splitDebugInlining: false, nameTableKind: None)
!476 = !{!477, !479, !99}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !478, line: 42, baseType: !86, size: 32, elements: !87)
!478 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !478, line: 254, baseType: !86, size: 32, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!482 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!483 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!484 = !{!115, !116, !117, !118}
!485 = !{!449, !452, !454, !459, !461, !463, !465, !467, !469, !471, !473, !486, !490, !500, !502, !507, !509, !511, !513, !515, !538, !545, !547}
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !475, file: !451, line: 92, type: !488, isLocal: false, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 320, elements: !40)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !475, file: !451, line: 1040, type: !492, isLocal: false, isDefinition: true)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !451, line: 56, size: 448, elements: !493)
!493 = !{!494, !495, !496, !498, !499}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !492, file: !451, line: 59, baseType: !477, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !451, line: 62, baseType: !116, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !492, file: !451, line: 66, baseType: !497, size: 256, offset: 64)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 256, elements: !165)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !492, file: !451, line: 69, baseType: !80, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !492, file: !451, line: 72, baseType: !80, size: 64, offset: 384)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !475, file: !451, line: 107, type: !492, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "slot0", scope: !475, file: !451, line: 831, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 256)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !451, line: 321, type: !139, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !451, line: 357, type: !139, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !451, line: 358, type: !139, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !451, line: 199, type: !159, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "quote", scope: !517, file: !451, line: 228, type: !536, isLocal: true, isDefinition: true)
!517 = distinct !DISubprogram(name: "gettext_quote", scope: !451, file: !451, line: 197, type: !518, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !475, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!80, !80, !477}
!520 = !{!521, !522, !523, !524, !525}
!521 = !DILocalVariable(name: "msgid", arg: 1, scope: !517, file: !451, line: 197, type: !80)
!522 = !DILocalVariable(name: "s", arg: 2, scope: !517, file: !451, line: 197, type: !477)
!523 = !DILocalVariable(name: "translation", scope: !517, file: !451, line: 199, type: !80)
!524 = !DILocalVariable(name: "w", scope: !517, file: !451, line: 229, type: !431)
!525 = !DILocalVariable(name: "mbs", scope: !517, file: !451, line: 230, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !528, file: !439, line: 15, baseType: !116, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !528, file: !439, line: 20, baseType: !532, size: 32, offset: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !439, line: 16, size: 32, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !532, file: !439, line: 18, baseType: !86, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !532, file: !439, line: 19, baseType: !129, size: 32)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !537)
!537 = !{!141, !131}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "slotvec", scope: !475, file: !451, line: 834, type: !540, isLocal: true, isDefinition: true)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !451, line: 823, size: 128, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !451, line: 825, baseType: !118, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !541, file: !451, line: 826, baseType: !260, size: 64, offset: 64)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "nslots", scope: !475, file: !451, line: 832, type: !116, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "slotvec0", scope: !475, file: !451, line: 833, type: !541, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 704, elements: !551)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!551 = !{!552}
!552 = !DISubrange(count: 11)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !555, line: 67, type: !229, isLocal: true, isDefinition: true)
!555 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !555, line: 69, type: !159, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !555, line: 83, type: !159, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !555, line: 83, type: !129, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !555, line: 85, type: !139, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !555, line: 88, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 171)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !555, line: 88, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 34)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !555, line: 105, type: !56, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !555, line: 109, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 23)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !555, line: 113, type: !71, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !555, line: 120, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 32)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !555, line: 127, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 36)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !555, line: 134, type: !9, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !555, line: 142, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 44)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !555, line: 150, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 48)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !555, line: 159, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 52)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !555, line: 170, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 60)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !555, line: 248, type: !302, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !555, line: 248, type: !205, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !555, line: 254, type: !302, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !555, line: 254, type: !49, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !555, line: 254, type: !9, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !555, line: 259, type: !3, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !555, line: 259, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 29)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !634, file: !635, line: 26, type: !637, isLocal: false, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C11, file: !635, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !636, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!636 = !{!632}
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 376, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 47)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "exit_failure", scope: !642, file: !643, line: 24, type: !645, isLocal: false, isDefinition: true)
!642 = distinct !DICompileUnit(language: DW_LANG_C11, file: !643, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !644, splitDebugInlining: false, nameTableKind: None)
!643 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!644 = !{!640}
!645 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !648, line: 34, type: !148, isLocal: true, isDefinition: true)
!648 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !648, line: 34, type: !159, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !648, line: 34, type: !66, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !655, line: 108, type: !34, isLocal: true, isDefinition: true)
!655 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "internal_state", scope: !658, file: !655, line: 97, type: !661, isLocal: true, isDefinition: true)
!658 = distinct !DICompileUnit(language: DW_LANG_C11, file: !655, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !659, globals: !660, splitDebugInlining: false, nameTableKind: None)
!659 = !{!115, !118, !121}
!660 = !{!653, !656}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !663, file: !439, line: 15, baseType: !116, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !663, file: !439, line: 20, baseType: !667, size: 32, offset: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !439, line: 16, size: 32, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !667, file: !439, line: 18, baseType: !86, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !667, file: !439, line: 19, baseType: !129, size: 32)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !673, line: 35, type: !134, isLocal: true, isDefinition: true)
!673 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!674 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!676 = distinct !DICompileUnit(language: DW_LANG_C11, file: !555, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !677, retainedTypes: !390, globals: !681, splitDebugInlining: false, nameTableKind: None)
!677 = !{!678}
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 40, baseType: !86, size: 32, elements: !679)
!679 = !{!680}
!680 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!681 = !{!553, !556, !558, !560, !562, !564, !569, !574, !576, !581, !583, !588, !593, !595, !600, !605, !610, !615, !617, !619, !621, !623, !625, !627}
!682 = distinct !DICompileUnit(language: DW_LANG_C11, file: !683, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !684, retainedTypes: !716, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!684 = !{!685, !697}
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !686, file: !683, line: 188, baseType: !86, size: 32, elements: !695)
!686 = distinct !DISubprogram(name: "x2nrealloc", scope: !683, file: !683, line: 176, type: !687, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !682, retainedNodes: !690)
!687 = !DISubroutineType(types: !688)
!688 = !{!115, !115, !689, !118}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!690 = !{!691, !692, !693, !694}
!691 = !DILocalVariable(name: "p", arg: 1, scope: !686, file: !683, line: 176, type: !115)
!692 = !DILocalVariable(name: "pn", arg: 2, scope: !686, file: !683, line: 176, type: !689)
!693 = !DILocalVariable(name: "s", arg: 3, scope: !686, file: !683, line: 176, type: !118)
!694 = !DILocalVariable(name: "n", scope: !686, file: !683, line: 178, type: !118)
!695 = !{!696}
!696 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !698, file: !683, line: 228, baseType: !86, size: 32, elements: !695)
!698 = distinct !DISubprogram(name: "xpalloc", scope: !683, file: !683, line: 223, type: !699, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !682, retainedNodes: !706)
!699 = !DISubroutineType(types: !700)
!700 = !{!115, !115, !701, !702, !704, !702}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !703, line: 130, baseType: !704)
!703 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !705, line: 18, baseType: !281)
!705 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715}
!707 = !DILocalVariable(name: "pa", arg: 1, scope: !698, file: !683, line: 223, type: !115)
!708 = !DILocalVariable(name: "pn", arg: 2, scope: !698, file: !683, line: 223, type: !701)
!709 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !698, file: !683, line: 223, type: !702)
!710 = !DILocalVariable(name: "n_max", arg: 4, scope: !698, file: !683, line: 223, type: !704)
!711 = !DILocalVariable(name: "s", arg: 5, scope: !698, file: !683, line: 223, type: !702)
!712 = !DILocalVariable(name: "n0", scope: !698, file: !683, line: 230, type: !702)
!713 = !DILocalVariable(name: "n", scope: !698, file: !683, line: 237, type: !702)
!714 = !DILocalVariable(name: "nbytes", scope: !698, file: !683, line: 248, type: !702)
!715 = !DILocalVariable(name: "adjusted_nbytes", scope: !698, file: !683, line: 252, type: !702)
!716 = !{!260, !115}
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !648, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !718, splitDebugInlining: false, nameTableKind: None)
!718 = !{!646, !649, !651}
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !722, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !673, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !730, splitDebugInlining: false, nameTableKind: None)
!730 = !{!731, !671}
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !673, line: 35, type: !139, isLocal: true, isDefinition: true)
!733 = distinct !DICompileUnit(language: DW_LANG_C11, file: !734, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!735 = distinct !DICompileUnit(language: DW_LANG_C11, file: !736, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!736 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!737 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!738 = !{i32 7, !"Dwarf Version", i32 5}
!739 = !{i32 2, !"Debug Info Version", i32 3}
!740 = !{i32 1, !"wchar_size", i32 4}
!741 = !{i32 8, !"PIC Level", i32 2}
!742 = !{i32 7, !"PIE Level", i32 2}
!743 = !{i32 7, !"uwtable", i32 2}
!744 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!745 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !746, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !116}
!748 = !{!749}
!749 = !DILocalVariable(name: "status", arg: 1, scope: !745, file: !2, line: 37, type: !116)
!750 = !DILocation(line: 0, scope: !745)
!751 = !DILocation(line: 39, column: 14, scope: !752)
!752 = distinct !DILexicalBlock(scope: !745, file: !2, line: 39, column: 7)
!753 = !DILocation(line: 39, column: 7, scope: !745)
!754 = !DILocation(line: 40, column: 5, scope: !755)
!755 = distinct !DILexicalBlock(scope: !752, file: !2, line: 40, column: 5)
!756 = !{!757, !757, i64 0}
!757 = !{!"any pointer", !758, i64 0}
!758 = !{!"omnipotent char", !759, i64 0}
!759 = !{!"Simple C/C++ TBAA"}
!760 = !DILocation(line: 43, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !752, file: !2, line: 42, column: 5)
!762 = !DILocation(line: 46, column: 7, scope: !761)
!763 = !DILocation(line: 49, column: 7, scope: !761)
!764 = !DILocation(line: 50, column: 7, scope: !761)
!765 = !DILocalVariable(name: "program", arg: 1, scope: !766, file: !77, line: 836, type: !80)
!766 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !77, file: !77, line: 836, type: !767, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !80}
!769 = !{!765, !770, !777, !778, !780, !781}
!770 = !DILocalVariable(name: "infomap", scope: !766, file: !77, line: 838, type: !771)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 896, elements: !160)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !766, file: !77, line: 838, size: 128, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !773, file: !77, line: 838, baseType: !80, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !773, file: !77, line: 838, baseType: !80, size: 64, offset: 64)
!777 = !DILocalVariable(name: "node", scope: !766, file: !77, line: 848, type: !80)
!778 = !DILocalVariable(name: "map_prog", scope: !766, file: !77, line: 849, type: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!780 = !DILocalVariable(name: "lc_messages", scope: !766, file: !77, line: 861, type: !80)
!781 = !DILocalVariable(name: "url_program", scope: !766, file: !77, line: 874, type: !80)
!782 = !DILocation(line: 0, scope: !766, inlinedAt: !783)
!783 = distinct !DILocation(line: 51, column: 7, scope: !761)
!784 = !{}
!785 = !DILocation(line: 857, column: 3, scope: !766, inlinedAt: !783)
!786 = !DILocation(line: 861, column: 29, scope: !766, inlinedAt: !783)
!787 = !DILocation(line: 862, column: 7, scope: !788, inlinedAt: !783)
!788 = distinct !DILexicalBlock(scope: !766, file: !77, line: 862, column: 7)
!789 = !DILocation(line: 862, column: 19, scope: !788, inlinedAt: !783)
!790 = !DILocation(line: 862, column: 22, scope: !788, inlinedAt: !783)
!791 = !DILocation(line: 862, column: 7, scope: !766, inlinedAt: !783)
!792 = !DILocation(line: 868, column: 7, scope: !793, inlinedAt: !783)
!793 = distinct !DILexicalBlock(scope: !788, file: !77, line: 863, column: 5)
!794 = !DILocation(line: 870, column: 5, scope: !793, inlinedAt: !783)
!795 = !DILocation(line: 875, column: 3, scope: !766, inlinedAt: !783)
!796 = !DILocation(line: 877, column: 3, scope: !766, inlinedAt: !783)
!797 = !DILocation(line: 53, column: 3, scope: !745)
!798 = !DISubprogram(name: "dcgettext", scope: !799, file: !799, line: 51, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!799 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!800 = !DISubroutineType(types: !801)
!801 = !{!260, !80, !80, !116}
!802 = !DISubprogram(name: "__fprintf_chk", scope: !803, file: !803, line: 93, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!804 = !DISubroutineType(types: !805)
!805 = !{!116, !806, !116, !807, null}
!806 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !252)
!807 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!808 = !DISubprogram(name: "__printf_chk", scope: !803, file: !803, line: 95, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!809 = !DISubroutineType(types: !810)
!810 = !{!116, !116, !807, null}
!811 = !DISubprogram(name: "fputs_unlocked", scope: !812, file: !812, line: 691, type: !813, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!812 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!813 = !DISubroutineType(types: !814)
!814 = !{!116, !807, !806}
!815 = !DILocation(line: 0, scope: !76)
!816 = !DILocation(line: 581, column: 7, scope: !237)
!817 = !{!818, !818, i64 0}
!818 = !{!"int", !758, i64 0}
!819 = !DILocation(line: 581, column: 19, scope: !237)
!820 = !DILocation(line: 581, column: 7, scope: !76)
!821 = !DILocation(line: 585, column: 26, scope: !236)
!822 = !DILocation(line: 0, scope: !236)
!823 = !DILocation(line: 586, column: 23, scope: !236)
!824 = !DILocation(line: 586, column: 28, scope: !236)
!825 = !DILocation(line: 586, column: 32, scope: !236)
!826 = !{!758, !758, i64 0}
!827 = !DILocation(line: 586, column: 38, scope: !236)
!828 = !DILocalVariable(name: "__s1", arg: 1, scope: !829, file: !830, line: 1359, type: !80)
!829 = distinct !DISubprogram(name: "streq", scope: !830, file: !830, line: 1359, type: !831, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !833)
!830 = !DIFile(filename: "./lib/string.h", directory: "/src")
!831 = !DISubroutineType(types: !832)
!832 = !{!239, !80, !80}
!833 = !{!828, !834}
!834 = !DILocalVariable(name: "__s2", arg: 2, scope: !829, file: !830, line: 1359, type: !80)
!835 = !DILocation(line: 0, scope: !829, inlinedAt: !836)
!836 = distinct !DILocation(line: 586, column: 41, scope: !236)
!837 = !DILocation(line: 1361, column: 11, scope: !829, inlinedAt: !836)
!838 = !DILocation(line: 1361, column: 10, scope: !829, inlinedAt: !836)
!839 = !DILocation(line: 586, column: 19, scope: !236)
!840 = !DILocation(line: 587, column: 5, scope: !236)
!841 = !DILocation(line: 588, column: 7, scope: !842)
!842 = distinct !DILexicalBlock(scope: !76, file: !77, line: 588, column: 7)
!843 = !DILocation(line: 588, column: 7, scope: !76)
!844 = !DILocation(line: 590, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !842, file: !77, line: 589, column: 5)
!846 = !DILocation(line: 591, column: 7, scope: !845)
!847 = !DILocation(line: 595, column: 37, scope: !76)
!848 = !DILocation(line: 595, column: 35, scope: !76)
!849 = !DILocation(line: 596, column: 29, scope: !76)
!850 = !DILocation(line: 597, column: 8, scope: !245)
!851 = !DILocation(line: 597, column: 7, scope: !76)
!852 = !DILocation(line: 604, column: 24, scope: !244)
!853 = !DILocation(line: 604, column: 12, scope: !245)
!854 = !DILocation(line: 0, scope: !243)
!855 = !DILocation(line: 610, column: 16, scope: !243)
!856 = !DILocation(line: 610, column: 7, scope: !243)
!857 = !DILocation(line: 611, column: 21, scope: !243)
!858 = !{!859, !859, i64 0}
!859 = !{!"short", !758, i64 0}
!860 = !DILocation(line: 611, column: 19, scope: !243)
!861 = !DILocation(line: 611, column: 16, scope: !243)
!862 = !DILocation(line: 610, column: 30, scope: !243)
!863 = distinct !{!863, !856, !857, !864}
!864 = !{!"llvm.loop.mustprogress"}
!865 = !DILocation(line: 612, column: 18, scope: !866)
!866 = distinct !DILexicalBlock(scope: !243, file: !77, line: 612, column: 11)
!867 = !DILocation(line: 612, column: 11, scope: !243)
!868 = !DILocation(line: 620, column: 23, scope: !76)
!869 = !DILocation(line: 625, column: 39, scope: !76)
!870 = !DILocation(line: 626, column: 3, scope: !76)
!871 = !DILocation(line: 626, column: 10, scope: !76)
!872 = !DILocation(line: 626, column: 21, scope: !76)
!873 = !DILocation(line: 628, column: 44, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !77, line: 628, column: 11)
!875 = distinct !DILexicalBlock(scope: !76, file: !77, line: 627, column: 5)
!876 = !DILocation(line: 628, column: 32, scope: !874)
!877 = !DILocation(line: 628, column: 49, scope: !874)
!878 = !DILocation(line: 628, column: 11, scope: !875)
!879 = !DILocation(line: 630, column: 11, scope: !880)
!880 = distinct !DILexicalBlock(scope: !875, file: !77, line: 630, column: 11)
!881 = !DILocation(line: 630, column: 11, scope: !875)
!882 = !DILocation(line: 632, column: 26, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !77, line: 632, column: 15)
!884 = distinct !DILexicalBlock(scope: !880, file: !77, line: 631, column: 9)
!885 = !DILocation(line: 632, column: 34, scope: !883)
!886 = !DILocation(line: 632, column: 37, scope: !883)
!887 = !DILocation(line: 632, column: 15, scope: !884)
!888 = !DILocation(line: 636, column: 16, scope: !889)
!889 = distinct !DILexicalBlock(scope: !884, file: !77, line: 636, column: 15)
!890 = !DILocation(line: 636, column: 29, scope: !889)
!891 = !DILocation(line: 640, column: 16, scope: !875)
!892 = distinct !{!892, !870, !893, !864}
!893 = !DILocation(line: 641, column: 5, scope: !76)
!894 = !DILocation(line: 644, column: 3, scope: !76)
!895 = !DILocation(line: 0, scope: !829, inlinedAt: !896)
!896 = distinct !DILocation(line: 648, column: 31, scope: !76)
!897 = !DILocation(line: 0, scope: !829, inlinedAt: !898)
!898 = distinct !DILocation(line: 649, column: 31, scope: !76)
!899 = !DILocation(line: 0, scope: !829, inlinedAt: !900)
!900 = distinct !DILocation(line: 650, column: 31, scope: !76)
!901 = !DILocation(line: 0, scope: !829, inlinedAt: !902)
!902 = distinct !DILocation(line: 651, column: 31, scope: !76)
!903 = !DILocation(line: 0, scope: !829, inlinedAt: !904)
!904 = distinct !DILocation(line: 652, column: 31, scope: !76)
!905 = !DILocation(line: 0, scope: !829, inlinedAt: !906)
!906 = distinct !DILocation(line: 653, column: 31, scope: !76)
!907 = !DILocation(line: 0, scope: !829, inlinedAt: !908)
!908 = distinct !DILocation(line: 654, column: 31, scope: !76)
!909 = !DILocation(line: 0, scope: !829, inlinedAt: !910)
!910 = distinct !DILocation(line: 655, column: 31, scope: !76)
!911 = !DILocation(line: 0, scope: !829, inlinedAt: !912)
!912 = distinct !DILocation(line: 656, column: 31, scope: !76)
!913 = !DILocation(line: 0, scope: !829, inlinedAt: !914)
!914 = distinct !DILocation(line: 657, column: 31, scope: !76)
!915 = !DILocation(line: 663, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !76, file: !77, line: 663, column: 7)
!917 = !DILocation(line: 664, column: 7, scope: !916)
!918 = !DILocation(line: 664, column: 10, scope: !916)
!919 = !DILocation(line: 663, column: 7, scope: !76)
!920 = !DILocation(line: 669, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !77, line: 665, column: 5)
!922 = !DILocation(line: 671, column: 5, scope: !921)
!923 = !DILocation(line: 676, column: 7, scope: !924)
!924 = distinct !DILexicalBlock(scope: !916, file: !77, line: 673, column: 5)
!925 = !DILocation(line: 679, column: 3, scope: !76)
!926 = !DILocation(line: 683, column: 3, scope: !76)
!927 = !DILocation(line: 686, column: 3, scope: !76)
!928 = !DILocation(line: 688, column: 3, scope: !76)
!929 = !DILocation(line: 691, column: 3, scope: !76)
!930 = !DILocation(line: 695, column: 3, scope: !76)
!931 = !DILocation(line: 696, column: 1, scope: !76)
!932 = !DISubprogram(name: "setlocale", scope: !933, file: !933, line: 122, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!933 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!934 = !DISubroutineType(types: !935)
!935 = !{!260, !116, !80}
!936 = !DISubprogram(name: "strncmp", scope: !937, file: !937, line: 159, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!937 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!938 = !DISubroutineType(types: !939)
!939 = !{!116, !80, !80, !118}
!940 = !DISubprogram(name: "exit", scope: !941, file: !941, line: 624, type: !746, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!941 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!942 = !DISubprogram(name: "getenv", scope: !941, file: !941, line: 641, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!943 = !DISubroutineType(types: !944)
!944 = !{!260, !80}
!945 = !DISubprogram(name: "strcmp", scope: !937, file: !937, line: 156, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!946 = !DISubroutineType(types: !947)
!947 = !{!116, !80, !80}
!948 = !DISubprogram(name: "strspn", scope: !937, file: !937, line: 297, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!949 = !DISubroutineType(types: !950)
!950 = !{!120, !80, !80}
!951 = !DISubprogram(name: "strchr", scope: !937, file: !937, line: 246, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!952 = !DISubroutineType(types: !953)
!953 = !{!260, !80, !116}
!954 = !DISubprogram(name: "__ctype_b_loc", scope: !100, file: !100, line: 79, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!955 = !DISubroutineType(types: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!960 = !DISubprogram(name: "strcspn", scope: !937, file: !937, line: 293, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!961 = !DISubprogram(name: "fwrite_unlocked", scope: !812, file: !812, line: 704, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!962 = !DISubroutineType(types: !963)
!963 = !{!118, !964, !118, !118, !806}
!964 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!967 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 57, type: !968, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !971)
!968 = !DISubroutineType(types: !969)
!969 = !{!116, !116, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!971 = !{!972, !973}
!972 = !DILocalVariable(name: "argc", arg: 1, scope: !967, file: !2, line: 57, type: !116)
!973 = !DILocalVariable(name: "argv", arg: 2, scope: !967, file: !2, line: 57, type: !970)
!974 = !DILocation(line: 0, scope: !967)
!975 = !DILocation(line: 60, column: 21, scope: !967)
!976 = !DILocation(line: 60, column: 3, scope: !967)
!977 = !DILocation(line: 61, column: 3, scope: !967)
!978 = !DILocation(line: 62, column: 3, scope: !967)
!979 = !DILocation(line: 63, column: 3, scope: !967)
!980 = !DILocation(line: 65, column: 3, scope: !967)
!981 = !DILocation(line: 68, column: 36, scope: !967)
!982 = !DILocation(line: 68, column: 58, scope: !967)
!983 = !DILocation(line: 67, column: 3, scope: !967)
!984 = !DILocation(line: 71, column: 14, scope: !985)
!985 = distinct !DILexicalBlock(scope: !967, file: !2, line: 71, column: 7)
!986 = !DILocation(line: 71, column: 21, scope: !985)
!987 = !DILocation(line: 71, column: 12, scope: !985)
!988 = !DILocation(line: 71, column: 7, scope: !967)
!989 = !DILocation(line: 73, column: 16, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !2, line: 73, column: 11)
!991 = distinct !DILexicalBlock(scope: !985, file: !2, line: 72, column: 5)
!992 = !DILocation(line: 73, column: 11, scope: !991)
!993 = !DILocation(line: 74, column: 9, scope: !990)
!994 = !DILocation(line: 76, column: 9, scope: !990)
!995 = !DILocation(line: 77, column: 7, scope: !991)
!996 = !DILocation(line: 80, column: 18, scope: !997)
!997 = distinct !DILexicalBlock(scope: !967, file: !2, line: 80, column: 7)
!998 = !DILocation(line: 80, column: 7, scope: !967)
!999 = !DILocation(line: 82, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !997, file: !2, line: 81, column: 5)
!1001 = !DILocation(line: 83, column: 7, scope: !1000)
!1002 = !DILocation(line: 86, column: 13, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !967, file: !2, line: 86, column: 7)
!1004 = !DILocation(line: 86, column: 27, scope: !1003)
!1005 = !DILocation(line: 86, column: 7, scope: !1003)
!1006 = !DILocation(line: 86, column: 45, scope: !1003)
!1007 = !DILocation(line: 86, column: 7, scope: !967)
!1008 = !DILocation(line: 87, column: 5, scope: !1003)
!1009 = !DILocation(line: 90, column: 3, scope: !967)
!1010 = !DISubprogram(name: "bindtextdomain", scope: !799, file: !799, line: 86, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!260, !80, !80}
!1013 = !DISubprogram(name: "textdomain", scope: !799, file: !799, line: 82, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1014 = !DISubprogram(name: "atexit", scope: !941, file: !941, line: 602, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!116, !381}
!1017 = !DISubprogram(name: "link", scope: !1018, file: !1018, line: 819, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1018 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1019 = !DISubprogram(name: "__errno_location", scope: !1020, file: !1020, line: 37, type: !1021, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1020 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!406}
!1023 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !321, file: !321, line: 50, type: !767, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1024)
!1024 = !{!1025}
!1025 = !DILocalVariable(name: "file", arg: 1, scope: !1023, file: !321, line: 50, type: !80)
!1026 = !DILocation(line: 0, scope: !1023)
!1027 = !DILocation(line: 52, column: 13, scope: !1023)
!1028 = !DILocation(line: 53, column: 1, scope: !1023)
!1029 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !321, file: !321, line: 87, type: !1030, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1032)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !239}
!1032 = !{!1033}
!1033 = !DILocalVariable(name: "ignore", arg: 1, scope: !1029, file: !321, line: 87, type: !239)
!1034 = !DILocation(line: 0, scope: !1029)
!1035 = !DILocation(line: 89, column: 16, scope: !1029)
!1036 = !{!1037, !1037, i64 0}
!1037 = !{!"_Bool", !758, i64 0}
!1038 = !DILocation(line: 90, column: 1, scope: !1029)
!1039 = distinct !DISubprogram(name: "close_stdout", scope: !321, file: !321, line: 116, type: !382, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1040)
!1040 = !{!1041}
!1041 = !DILocalVariable(name: "write_error", scope: !1042, file: !321, line: 121, type: !80)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !321, line: 120, column: 5)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !321, line: 118, column: 7)
!1044 = !DILocation(line: 118, column: 21, scope: !1043)
!1045 = !DILocation(line: 118, column: 7, scope: !1043)
!1046 = !DILocation(line: 118, column: 29, scope: !1043)
!1047 = !DILocation(line: 119, column: 7, scope: !1043)
!1048 = !DILocation(line: 119, column: 12, scope: !1043)
!1049 = !{i8 0, i8 2}
!1050 = !DILocation(line: 119, column: 25, scope: !1043)
!1051 = !DILocation(line: 119, column: 28, scope: !1043)
!1052 = !DILocation(line: 119, column: 34, scope: !1043)
!1053 = !DILocation(line: 118, column: 7, scope: !1039)
!1054 = !DILocation(line: 121, column: 33, scope: !1042)
!1055 = !DILocation(line: 0, scope: !1042)
!1056 = !DILocation(line: 122, column: 11, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1042, file: !321, line: 122, column: 11)
!1058 = !DILocation(line: 0, scope: !1057)
!1059 = !DILocation(line: 122, column: 11, scope: !1042)
!1060 = !DILocation(line: 123, column: 9, scope: !1057)
!1061 = !DILocation(line: 126, column: 9, scope: !1057)
!1062 = !DILocation(line: 128, column: 14, scope: !1042)
!1063 = !DILocation(line: 128, column: 7, scope: !1042)
!1064 = !DILocation(line: 133, column: 42, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1039, file: !321, line: 133, column: 7)
!1066 = !DILocation(line: 133, column: 28, scope: !1065)
!1067 = !DILocation(line: 133, column: 50, scope: !1065)
!1068 = !DILocation(line: 133, column: 7, scope: !1039)
!1069 = !DILocation(line: 134, column: 12, scope: !1065)
!1070 = !DILocation(line: 134, column: 5, scope: !1065)
!1071 = !DILocation(line: 135, column: 1, scope: !1039)
!1072 = !DISubprogram(name: "_exit", scope: !1018, file: !1018, line: 624, type: !746, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1073 = distinct !DISubprogram(name: "verror", scope: !336, file: !336, line: 251, type: !1074, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1076)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !116, !116, !80, !346}
!1076 = !{!1077, !1078, !1079, !1080}
!1077 = !DILocalVariable(name: "status", arg: 1, scope: !1073, file: !336, line: 251, type: !116)
!1078 = !DILocalVariable(name: "errnum", arg: 2, scope: !1073, file: !336, line: 251, type: !116)
!1079 = !DILocalVariable(name: "message", arg: 3, scope: !1073, file: !336, line: 251, type: !80)
!1080 = !DILocalVariable(name: "args", arg: 4, scope: !1073, file: !336, line: 251, type: !346)
!1081 = !DILocation(line: 0, scope: !1073)
!1082 = !DILocation(line: 261, column: 3, scope: !1073)
!1083 = !DILocation(line: 265, column: 7, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1073, file: !336, line: 265, column: 7)
!1085 = !DILocation(line: 265, column: 7, scope: !1073)
!1086 = !DILocation(line: 266, column: 5, scope: !1084)
!1087 = !DILocation(line: 272, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1084, file: !336, line: 268, column: 5)
!1089 = !DILocation(line: 276, column: 3, scope: !1073)
!1090 = !DILocation(line: 282, column: 1, scope: !1073)
!1091 = distinct !DISubprogram(name: "flush_stdout", scope: !336, file: !336, line: 163, type: !382, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1092)
!1092 = !{!1093}
!1093 = !DILocalVariable(name: "stdout_fd", scope: !1091, file: !336, line: 166, type: !116)
!1094 = !DILocation(line: 0, scope: !1091)
!1095 = !DILocalVariable(name: "fd", arg: 1, scope: !1096, file: !336, line: 145, type: !116)
!1096 = distinct !DISubprogram(name: "is_open", scope: !336, file: !336, line: 145, type: !1097, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1099)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!116, !116}
!1099 = !{!1095}
!1100 = !DILocation(line: 0, scope: !1096, inlinedAt: !1101)
!1101 = distinct !DILocation(line: 182, column: 25, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1091, file: !336, line: 182, column: 7)
!1103 = !DILocation(line: 157, column: 15, scope: !1096, inlinedAt: !1101)
!1104 = !DILocation(line: 157, column: 12, scope: !1096, inlinedAt: !1101)
!1105 = !DILocation(line: 182, column: 7, scope: !1091)
!1106 = !DILocation(line: 184, column: 5, scope: !1102)
!1107 = !DILocation(line: 185, column: 1, scope: !1091)
!1108 = distinct !DISubprogram(name: "error_tail", scope: !336, file: !336, line: 219, type: !1074, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1109)
!1109 = !{!1110, !1111, !1112, !1113}
!1110 = !DILocalVariable(name: "status", arg: 1, scope: !1108, file: !336, line: 219, type: !116)
!1111 = !DILocalVariable(name: "errnum", arg: 2, scope: !1108, file: !336, line: 219, type: !116)
!1112 = !DILocalVariable(name: "message", arg: 3, scope: !1108, file: !336, line: 219, type: !80)
!1113 = !DILocalVariable(name: "args", arg: 4, scope: !1108, file: !336, line: 219, type: !346)
!1114 = distinct !DIAssignID()
!1115 = !DILocation(line: 0, scope: !1108)
!1116 = !DILocation(line: 229, column: 13, scope: !1108)
!1117 = !DILocalVariable(name: "__stream", arg: 1, scope: !1118, file: !803, line: 132, type: !1121)
!1118 = distinct !DISubprogram(name: "vfprintf", scope: !803, file: !803, line: 132, type: !1119, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1156)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!116, !1121, !807, !346}
!1121 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1124, file: !256, line: 51, baseType: !116, size: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1124, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1124, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1124, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1124, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1124, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1124, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1124, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1124, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1124, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1124, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1124, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1124, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1124, file: !256, line: 70, baseType: !1140, size: 64, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1124, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1124, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1124, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1124, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1124, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1124, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1124, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1124, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1124, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1124, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1124, file: !256, line: 93, baseType: !1140, size: 64, offset: 1344)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1124, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1124, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1124, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1124, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!1156 = !{!1117, !1157, !1158}
!1157 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1118, file: !803, line: 133, type: !807)
!1158 = !DILocalVariable(name: "__ap", arg: 3, scope: !1118, file: !803, line: 133, type: !346)
!1159 = !DILocation(line: 0, scope: !1118, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 229, column: 3, scope: !1108)
!1161 = !DILocation(line: 135, column: 10, scope: !1118, inlinedAt: !1160)
!1162 = !DILocation(line: 232, column: 3, scope: !1108)
!1163 = !DILocation(line: 233, column: 7, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1108, file: !336, line: 233, column: 7)
!1165 = !DILocation(line: 233, column: 7, scope: !1108)
!1166 = !DILocalVariable(name: "errbuf", scope: !1167, file: !336, line: 193, type: !1171)
