; ModuleID = 'src/logname.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [20 x i8] c"Usage: %s [OPTION]\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [31 x i8] c"Print the user's login name.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"logname\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32
@.str.7 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !37

!163 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 61)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !67, line: 679, type: !127, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !67, line: 683, type: !101, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !67, line: 688, type: !101, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !67, line: 691, type: !19, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !67, line: 839, type: !54, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !67, line: 840, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 22)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !67, line: 841, type: !164, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !67, line: 862, type: !108, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !67, line: 868, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 71)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !67, line: 875, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 27)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 51)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 12)
!211 = !{!212, !213, !214, !217, !219, !220, !221, !225, !226, !227, !228, !230, !281, !282, !283, !285, !286}
!212 = !DILocalVariable(name: "program", arg: 1, scope: !66, file: !67, line: 573, type: !70)
!213 = !DILocalVariable(name: "option", arg: 2, scope: !66, file: !67, line: 573, type: !70)
!214 = !DILocalVariable(name: "term", scope: !215, file: !67, line: 585, type: !70)
!215 = distinct !DILexicalBlock(scope: !216, file: !67, line: 582, column: 5)
!216 = distinct !DILexicalBlock(scope: !66, file: !67, line: 581, column: 7)
!217 = !DILocalVariable(name: "double_space", scope: !66, file: !67, line: 594, type: !218)
!218 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!219 = !DILocalVariable(name: "first_word", scope: !66, file: !67, line: 595, type: !70)
!220 = !DILocalVariable(name: "option_text", scope: !66, file: !67, line: 596, type: !70)
!221 = !DILocalVariable(name: "s", scope: !222, file: !67, line: 608, type: !70)
!222 = distinct !DILexicalBlock(scope: !223, file: !67, line: 605, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !67, line: 604, column: 12)
!224 = distinct !DILexicalBlock(scope: !66, file: !67, line: 597, column: 7)
!225 = !DILocalVariable(name: "spaces", scope: !222, file: !67, line: 609, type: !94)
!226 = !DILocalVariable(name: "anchor_len", scope: !66, file: !67, line: 620, type: !94)
!227 = !DILocalVariable(name: "desc_text", scope: !66, file: !67, line: 625, type: !70)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !67, line: 644, type: !70)
!229 = distinct !DILexicalBlock(scope: !66, file: !67, line: 644, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !67, line: 644, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!236 = !{!237, !238, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !253, !255, !256, !257, !261, !262, !264, !265, !268, !270, !273, !276, !277, !278, !279, !280}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 51, baseType: !92, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 54, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 55, baseType: !239, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 56, baseType: !239, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 57, baseType: !239, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 58, baseType: !239, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 59, baseType: !239, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 60, baseType: !239, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 61, baseType: !239, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 64, baseType: !239, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 65, baseType: !239, size: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 66, baseType: !239, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 68, baseType: !251, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 36, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 70, baseType: !254, size: 64, offset: 832)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 72, baseType: !92, size: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 73, baseType: !92, size: 32, offset: 928)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 74, baseType: !258, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !259, line: 152, baseType: !260)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!260 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 77, baseType: !93, size: 16, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 78, baseType: !263, size: 8, offset: 1040)
!263 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 79, baseType: !34, size: 8, offset: 1048)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 81, baseType: !266, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 43, baseType: null)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 89, baseType: !269, size: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !259, line: 153, baseType: !260)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !235, line: 91, baseType: !271, size: 64, offset: 1216)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !235, line: 37, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !235, line: 92, baseType: !274, size: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !235, line: 38, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !235, line: 93, baseType: !254, size: 64, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !235, line: 94, baseType: !91, size: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 95, baseType: !94, size: 64, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 96, baseType: !92, size: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 98, baseType: !9, size: 160, offset: 1568)
!281 = !DILocalVariable(name: "__cnt", scope: !229, file: !67, line: 644, type: !94)
!282 = !DILocalVariable(name: "url_program", scope: !66, file: !67, line: 648, type: !70)
!283 = !DILocalVariable(name: "__ptr", scope: !284, file: !67, line: 686, type: !70)
!284 = distinct !DILexicalBlock(scope: !66, file: !67, line: 686, column: 3)
!285 = !DILocalVariable(name: "__stream", scope: !284, file: !67, line: 686, type: !231)
!286 = !DILocalVariable(name: "__cnt", scope: !284, file: !67, line: 686, type: !94)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !289, line: 3, type: !164, isLocal: true, isDefinition: true)
!289 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "Version", scope: !292, file: !289, line: 3, type: !70, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C11, file: !289, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !293, splitDebugInlining: false, nameTableKind: None)
!293 = !{!287, !290}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "file_name", scope: !296, file: !297, line: 45, type: !70, isLocal: true, isDefinition: true)
!296 = distinct !DICompileUnit(language: DW_LANG_C11, file: !297, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !298, splitDebugInlining: false, nameTableKind: None)
!297 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!298 = !{!299, !301, !303, !305, !294, !307}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !297, line: 121, type: !138, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !297, line: 121, type: !208, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !297, line: 123, type: !138, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !297, line: 126, type: !127, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !296, file: !297, line: 55, type: !218, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !311, file: !312, line: 66, type: !357, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C11, file: !312, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !313, globals: !314, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!313 = !{!91, !97}
!314 = !{!315, !317, !336, !338, !340, !342, !309, !344, !346, !348, !350, !355}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !312, line: 272, type: !101, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "old_file_name", scope: !319, file: !312, line: 304, type: !70, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "verror_at_line", scope: !312, file: !312, line: 298, type: !320, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !329)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !92, !92, !70, !76, !70, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !324)
!324 = !{!325, !326, !327, !328}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !323, file: !312, baseType: !76, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !323, file: !312, baseType: !76, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !323, file: !312, baseType: !91, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !323, file: !312, baseType: !91, size: 64, offset: 128)
!329 = !{!330, !331, !332, !333, !334, !335}
!330 = !DILocalVariable(name: "status", arg: 1, scope: !319, file: !312, line: 298, type: !92)
!331 = !DILocalVariable(name: "errnum", arg: 2, scope: !319, file: !312, line: 298, type: !92)
!332 = !DILocalVariable(name: "file_name", arg: 3, scope: !319, file: !312, line: 298, type: !70)
!333 = !DILocalVariable(name: "line_number", arg: 4, scope: !319, file: !312, line: 298, type: !76)
!334 = !DILocalVariable(name: "message", arg: 5, scope: !319, file: !312, line: 298, type: !70)
!335 = !DILocalVariable(name: "args", arg: 6, scope: !319, file: !312, line: 298, type: !322)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "old_line_number", scope: !319, file: !312, line: 305, type: !76, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !312, line: 338, type: !108, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !312, line: 346, type: !19, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !312, line: 346, type: !118, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "error_message_count", scope: !311, file: !312, line: 69, type: !76, isLocal: false, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !311, file: !312, line: 295, type: !92, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !312, line: 208, type: !138, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !312, line: 208, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 21)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !312, line: 214, type: !101, isLocal: true, isDefinition: true)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !362, line: 60, type: !118, isLocal: true, isDefinition: true)
!362 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "long_options", scope: !365, file: !362, line: 34, type: !374, isLocal: true, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C11, file: !362, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, globals: !367, splitDebugInlining: false, nameTableKind: None)
!366 = !{!91}
!367 = !{!360, !368, !370, !372, !363}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !362, line: 112, type: !34, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !362, line: 36, type: !101, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !362, line: 37, type: !19, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 768, elements: !128)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !377, line: 50, size: 256, elements: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!378 = !{!379, !380, !381, !383}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !377, line: 52, baseType: !70, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !376, file: !377, line: 55, baseType: !92, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !377, line: 56, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !376, file: !377, line: 57, baseType: !92, size: 32, offset: 192)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "program_name", scope: !386, file: !387, line: 31, type: !70, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C11, file: !387, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !388, globals: !389, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!388 = !{!91, !239}
!389 = !{!384, !390, !392}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !387, line: 46, type: !19, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !387, line: 49, type: !108, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "utf07FF", scope: !396, file: !397, line: 46, type: !424, isLocal: true, isDefinition: true)
!396 = distinct !DISubprogram(name: "proper_name_lite", scope: !397, file: !397, line: 38, type: !398, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !400, retainedNodes: !402)
!397 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!398 = !DISubroutineType(types: !399)
!399 = !{!70, !70, !70}
!400 = distinct !DICompileUnit(language: DW_LANG_C11, file: !397, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !401, splitDebugInlining: false, nameTableKind: None)
!401 = !{!394}
!402 = !{!403, !404, !405, !406, !411}
!403 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !396, file: !397, line: 38, type: !70)
!404 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !396, file: !397, line: 38, type: !70)
!405 = !DILocalVariable(name: "translation", scope: !396, file: !397, line: 40, type: !70)
!406 = !DILocalVariable(name: "w", scope: !396, file: !397, line: 47, type: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !408, line: 37, baseType: !409)
!408 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !259, line: 57, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !259, line: 42, baseType: !76)
!411 = !DILocalVariable(name: "mbs", scope: !396, file: !397, line: 48, type: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !413, line: 6, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !415, line: 21, baseType: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 13, size: 64, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !416, file: !415, line: 15, baseType: !92, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !416, file: !415, line: 20, baseType: !420, size: 32, offset: 32)
!420 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !415, line: 16, size: 32, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !420, file: !415, line: 18, baseType: !76, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !420, file: !415, line: 19, baseType: !108, size: 32)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16, elements: !119)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !427, line: 78, type: !19, isLocal: true, isDefinition: true)
!427 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !427, line: 79, type: !113, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !427, line: 80, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 13)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !427, line: 81, type: !432, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !427, line: 82, type: !9, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !427, line: 83, type: !118, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !427, line: 84, type: !19, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !427, line: 85, type: !138, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !427, line: 86, type: !138, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !427, line: 87, type: !19, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !451, file: !427, line: 76, type: !537, isLocal: false, isDefinition: true)
!451 = distinct !DICompileUnit(language: DW_LANG_C11, file: !427, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !452, retainedTypes: !472, globals: !473, splitDebugInlining: false, nameTableKind: None)
!452 = !{!453, !467, !74}
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !454, line: 42, baseType: !76, size: 32, elements: !455)
!454 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!456 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!457 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!458 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!459 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!460 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!461 = !DIEnumerator(name: "c_quoting_style", value: 5)
!462 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!463 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!464 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!465 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!466 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !454, line: 254, baseType: !76, size: 32, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!470 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!471 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!472 = !{!91, !92, !93, !94}
!473 = !{!425, !428, !430, !435, !437, !439, !441, !443, !445, !447, !449, !474, !478, !488, !490, !495, !497, !499, !501, !503, !526, !533, !535}
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !451, file: !427, line: 92, type: !476, isLocal: false, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !40)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !451, file: !427, line: 1040, type: !480, isLocal: false, isDefinition: true)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !427, line: 56, size: 448, elements: !481)
!481 = !{!482, !483, !484, !486, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !480, file: !427, line: 59, baseType: !453, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !480, file: !427, line: 62, baseType: !92, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !480, file: !427, line: 66, baseType: !485, size: 256, offset: 64)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !20)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !480, file: !427, line: 69, baseType: !70, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !480, file: !427, line: 72, baseType: !70, size: 64, offset: 384)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !451, file: !427, line: 107, type: !480, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "slot0", scope: !451, file: !427, line: 831, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 256)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !427, line: 321, type: !118, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !427, line: 357, type: !118, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !427, line: 358, type: !118, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !427, line: 199, type: !138, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "quote", scope: !505, file: !427, line: 228, type: !524, isLocal: true, isDefinition: true)
!505 = distinct !DISubprogram(name: "gettext_quote", scope: !427, file: !427, line: 197, type: !506, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !451, retainedNodes: !508)
!506 = !DISubroutineType(types: !507)
!507 = !{!70, !70, !453}
!508 = !{!509, !510, !511, !512, !513}
!509 = !DILocalVariable(name: "msgid", arg: 1, scope: !505, file: !427, line: 197, type: !70)
!510 = !DILocalVariable(name: "s", arg: 2, scope: !505, file: !427, line: 197, type: !453)
!511 = !DILocalVariable(name: "translation", scope: !505, file: !427, line: 199, type: !70)
!512 = !DILocalVariable(name: "w", scope: !505, file: !427, line: 229, type: !407)
!513 = !DILocalVariable(name: "mbs", scope: !505, file: !427, line: 230, type: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !413, line: 6, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !415, line: 21, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 13, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !516, file: !415, line: 15, baseType: !92, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !516, file: !415, line: 20, baseType: !520, size: 32, offset: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !516, file: !415, line: 16, size: 32, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !520, file: !415, line: 18, baseType: !76, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !520, file: !415, line: 19, baseType: !108, size: 32)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !525)
!525 = !{!120, !110}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "slotvec", scope: !451, file: !427, line: 834, type: !528, isLocal: true, isDefinition: true)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !427, line: 823, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !427, line: 825, baseType: !94, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !529, file: !427, line: 826, baseType: !239, size: 64, offset: 64)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "nslots", scope: !451, file: !427, line: 832, type: !92, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "slotvec0", scope: !451, file: !427, line: 833, type: !529, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 704, elements: !539)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!539 = !{!540}
!540 = !DISubrange(count: 11)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !543, line: 67, type: !208, isLocal: true, isDefinition: true)
!543 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !543, line: 69, type: !138, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !543, line: 83, type: !138, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !543, line: 83, type: !108, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !543, line: 85, type: !118, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !543, line: 88, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 171)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !543, line: 88, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 34)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !543, line: 105, type: !54, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !543, line: 109, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 23)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !543, line: 113, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 28)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !543, line: 120, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !543, line: 127, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 36)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !543, line: 134, type: !159, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !543, line: 142, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 44)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !543, line: 150, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 48)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !543, line: 159, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 52)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !543, line: 170, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 60)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !543, line: 248, type: !9, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !543, line: 248, type: !184, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !543, line: 254, type: !9, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !543, line: 254, type: !49, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !543, line: 254, type: !159, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !543, line: 259, type: !3, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !543, line: 259, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 29)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !625, file: !626, line: 26, type: !628, isLocal: false, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C11, file: !626, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !627, splitDebugInlining: false, nameTableKind: None)
!626 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!627 = !{!623}
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 376, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 47)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "exit_failure", scope: !633, file: !634, line: 24, type: !636, isLocal: false, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C11, file: !634, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !635, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!635 = !{!631}
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !639, line: 34, type: !127, isLocal: true, isDefinition: true)
!639 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !639, line: 34, type: !138, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !639, line: 34, type: !59, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !646, line: 108, type: !34, isLocal: true, isDefinition: true)
!646 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "internal_state", scope: !649, file: !646, line: 97, type: !652, isLocal: true, isDefinition: true)
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !646, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !650, globals: !651, splitDebugInlining: false, nameTableKind: None)
!650 = !{!91, !94, !97}
!651 = !{!644, !647}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !413, line: 6, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !415, line: 21, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 13, size: 64, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !654, file: !415, line: 15, baseType: !92, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !654, file: !415, line: 20, baseType: !658, size: 32, offset: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !654, file: !415, line: 16, size: 32, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !658, file: !415, line: 18, baseType: !76, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !658, file: !415, line: 19, baseType: !108, size: 32)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !664, line: 35, type: !113, isLocal: true, isDefinition: true)
!664 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!665 = distinct !DICompileUnit(language: DW_LANG_C11, file: !666, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!667 = distinct !DICompileUnit(language: DW_LANG_C11, file: !543, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !668, retainedTypes: !366, globals: !672, splitDebugInlining: false, nameTableKind: None)
!668 = !{!669}
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !543, line: 40, baseType: !76, size: 32, elements: !670)
!670 = !{!671}
!671 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!672 = !{!541, !544, !546, !548, !550, !552, !557, !562, !564, !569, !574, !579, !584, !586, !591, !596, !601, !606, !608, !610, !612, !614, !616, !618}
!673 = distinct !DICompileUnit(language: DW_LANG_C11, file: !674, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !675, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!675 = !{!676, !688}
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !677, file: !674, line: 188, baseType: !76, size: 32, elements: !686)
!677 = distinct !DISubprogram(name: "x2nrealloc", scope: !674, file: !674, line: 176, type: !678, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !673, retainedNodes: !681)
!678 = !DISubroutineType(types: !679)
!679 = !{!91, !91, !680, !94}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!681 = !{!682, !683, !684, !685}
!682 = !DILocalVariable(name: "p", arg: 1, scope: !677, file: !674, line: 176, type: !91)
!683 = !DILocalVariable(name: "pn", arg: 2, scope: !677, file: !674, line: 176, type: !680)
!684 = !DILocalVariable(name: "s", arg: 3, scope: !677, file: !674, line: 176, type: !94)
!685 = !DILocalVariable(name: "n", scope: !677, file: !674, line: 178, type: !94)
!686 = !{!687}
!687 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !689, file: !674, line: 228, baseType: !76, size: 32, elements: !686)
!689 = distinct !DISubprogram(name: "xpalloc", scope: !674, file: !674, line: 223, type: !690, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !673, retainedNodes: !697)
!690 = !DISubroutineType(types: !691)
!691 = !{!91, !91, !692, !693, !695, !693}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !694, line: 130, baseType: !695)
!694 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !696, line: 18, baseType: !260)
!696 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706}
!698 = !DILocalVariable(name: "pa", arg: 1, scope: !689, file: !674, line: 223, type: !91)
!699 = !DILocalVariable(name: "pn", arg: 2, scope: !689, file: !674, line: 223, type: !692)
!700 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !689, file: !674, line: 223, type: !693)
!701 = !DILocalVariable(name: "n_max", arg: 4, scope: !689, file: !674, line: 223, type: !695)
!702 = !DILocalVariable(name: "s", arg: 5, scope: !689, file: !674, line: 223, type: !693)
!703 = !DILocalVariable(name: "n0", scope: !689, file: !674, line: 230, type: !693)
!704 = !DILocalVariable(name: "n", scope: !689, file: !674, line: 237, type: !693)
!705 = !DILocalVariable(name: "nbytes", scope: !689, file: !674, line: 248, type: !693)
!706 = !DILocalVariable(name: "adjusted_nbytes", scope: !689, file: !674, line: 252, type: !693)
!707 = !{!239, !91}
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !709, splitDebugInlining: false, nameTableKind: None)
!709 = !{!637, !640, !642}
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!718 = distinct !DICompileUnit(language: DW_LANG_C11, file: !719, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!720 = distinct !DICompileUnit(language: DW_LANG_C11, file: !664, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !721, splitDebugInlining: false, nameTableKind: None)
!721 = !{!722, !662}
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !664, line: 35, type: !118, isLocal: true, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!728 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!729 = !{i32 7, !"Dwarf Version", i32 5}
!730 = !{i32 2, !"Debug Info Version", i32 3}
!731 = !{i32 1, !"wchar_size", i32 4}
!732 = !{i32 8, !"PIC Level", i32 2}
!733 = !{i32 7, !"PIE Level", i32 2}
!734 = !{i32 7, !"uwtable", i32 2}
!735 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!736 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 31, type: !737, scopeLine: 32, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !92}
!739 = !{!740}
!740 = !DILocalVariable(name: "status", arg: 1, scope: !736, file: !2, line: 31, type: !92)
!741 = !DILocation(line: 0, scope: !736)
!742 = !DILocation(line: 33, column: 14, scope: !743)
!743 = distinct !DILexicalBlock(scope: !736, file: !2, line: 33, column: 7)
!744 = !DILocation(line: 33, column: 7, scope: !736)
!745 = !DILocation(line: 34, column: 5, scope: !746)
!746 = distinct !DILexicalBlock(scope: !743, file: !2, line: 34, column: 5)
!747 = !{!748, !748, i64 0}
!748 = !{!"any pointer", !749, i64 0}
!749 = !{!"omnipotent char", !750, i64 0}
!750 = !{!"Simple C/C++ TBAA"}
!751 = !DILocation(line: 37, column: 7, scope: !752)
!752 = distinct !DILexicalBlock(scope: !743, file: !2, line: 36, column: 5)
!753 = !DILocation(line: 38, column: 7, scope: !752)
!754 = !DILocation(line: 42, column: 7, scope: !752)
!755 = !DILocation(line: 43, column: 7, scope: !752)
!756 = !DILocalVariable(name: "program", arg: 1, scope: !757, file: !67, line: 836, type: !70)
!757 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !67, file: !67, line: 836, type: !758, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !70}
!760 = !{!756, !761, !768, !769, !771, !772}
!761 = !DILocalVariable(name: "infomap", scope: !757, file: !67, line: 838, type: !762)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 896, elements: !139)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !757, file: !67, line: 838, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !764, file: !67, line: 838, baseType: !70, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !764, file: !67, line: 838, baseType: !70, size: 64, offset: 64)
!768 = !DILocalVariable(name: "node", scope: !757, file: !67, line: 848, type: !70)
!769 = !DILocalVariable(name: "map_prog", scope: !757, file: !67, line: 849, type: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!771 = !DILocalVariable(name: "lc_messages", scope: !757, file: !67, line: 861, type: !70)
!772 = !DILocalVariable(name: "url_program", scope: !757, file: !67, line: 874, type: !70)
!773 = !DILocation(line: 0, scope: !757, inlinedAt: !774)
!774 = distinct !DILocation(line: 44, column: 7, scope: !752)
!775 = !{}
!776 = !DILocation(line: 857, column: 3, scope: !757, inlinedAt: !774)
!777 = !DILocation(line: 861, column: 29, scope: !757, inlinedAt: !774)
!778 = !DILocation(line: 862, column: 7, scope: !779, inlinedAt: !774)
!779 = distinct !DILexicalBlock(scope: !757, file: !67, line: 862, column: 7)
!780 = !DILocation(line: 862, column: 19, scope: !779, inlinedAt: !774)
!781 = !DILocation(line: 862, column: 22, scope: !779, inlinedAt: !774)
!782 = !DILocation(line: 862, column: 7, scope: !757, inlinedAt: !774)
!783 = !DILocation(line: 868, column: 7, scope: !784, inlinedAt: !774)
!784 = distinct !DILexicalBlock(scope: !779, file: !67, line: 863, column: 5)
!785 = !DILocation(line: 870, column: 5, scope: !784, inlinedAt: !774)
!786 = !DILocation(line: 875, column: 3, scope: !757, inlinedAt: !774)
!787 = !DILocation(line: 877, column: 3, scope: !757, inlinedAt: !774)
!788 = !DILocation(line: 46, column: 3, scope: !736)
!789 = !DISubprogram(name: "dcgettext", scope: !790, file: !790, line: 51, type: !791, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!790 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!791 = !DISubroutineType(types: !792)
!792 = !{!239, !70, !70, !92}
!793 = !DISubprogram(name: "__fprintf_chk", scope: !794, file: !794, line: 93, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!794 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!795 = !DISubroutineType(types: !796)
!796 = !{!92, !797, !92, !798, null}
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!798 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!799 = !DISubprogram(name: "__printf_chk", scope: !794, file: !794, line: 95, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!800 = !DISubroutineType(types: !801)
!801 = !{!92, !92, !798, null}
!802 = !DISubprogram(name: "fputs_unlocked", scope: !803, file: !803, line: 691, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!804 = !DISubroutineType(types: !805)
!805 = !{!92, !798, !797}
!806 = !DILocation(line: 0, scope: !66)
!807 = !DILocation(line: 581, column: 7, scope: !216)
!808 = !{!809, !809, i64 0}
!809 = !{!"int", !749, i64 0}
!810 = !DILocation(line: 581, column: 19, scope: !216)
!811 = !DILocation(line: 581, column: 7, scope: !66)
!812 = !DILocation(line: 585, column: 26, scope: !215)
!813 = !DILocation(line: 0, scope: !215)
!814 = !DILocation(line: 586, column: 23, scope: !215)
!815 = !DILocation(line: 586, column: 28, scope: !215)
!816 = !DILocation(line: 586, column: 32, scope: !215)
!817 = !{!749, !749, i64 0}
!818 = !DILocation(line: 586, column: 38, scope: !215)
!819 = !DILocalVariable(name: "__s1", arg: 1, scope: !820, file: !821, line: 1359, type: !70)
!820 = distinct !DISubprogram(name: "streq", scope: !821, file: !821, line: 1359, type: !822, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !824)
!821 = !DIFile(filename: "./lib/string.h", directory: "/src")
!822 = !DISubroutineType(types: !823)
!823 = !{!218, !70, !70}
!824 = !{!819, !825}
!825 = !DILocalVariable(name: "__s2", arg: 2, scope: !820, file: !821, line: 1359, type: !70)
!826 = !DILocation(line: 0, scope: !820, inlinedAt: !827)
!827 = distinct !DILocation(line: 586, column: 41, scope: !215)
!828 = !DILocation(line: 1361, column: 11, scope: !820, inlinedAt: !827)
!829 = !DILocation(line: 1361, column: 10, scope: !820, inlinedAt: !827)
!830 = !DILocation(line: 586, column: 19, scope: !215)
!831 = !DILocation(line: 587, column: 5, scope: !215)
!832 = !DILocation(line: 588, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !66, file: !67, line: 588, column: 7)
!834 = !DILocation(line: 588, column: 7, scope: !66)
!835 = !DILocation(line: 590, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !833, file: !67, line: 589, column: 5)
!837 = !DILocation(line: 591, column: 7, scope: !836)
!838 = !DILocation(line: 595, column: 37, scope: !66)
!839 = !DILocation(line: 595, column: 35, scope: !66)
!840 = !DILocation(line: 596, column: 29, scope: !66)
!841 = !DILocation(line: 597, column: 8, scope: !224)
!842 = !DILocation(line: 597, column: 7, scope: !66)
!843 = !DILocation(line: 604, column: 24, scope: !223)
!844 = !DILocation(line: 604, column: 12, scope: !224)
!845 = !DILocation(line: 0, scope: !222)
!846 = !DILocation(line: 610, column: 16, scope: !222)
!847 = !DILocation(line: 610, column: 7, scope: !222)
!848 = !DILocation(line: 611, column: 21, scope: !222)
!849 = !{!850, !850, i64 0}
!850 = !{!"short", !749, i64 0}
!851 = !DILocation(line: 611, column: 19, scope: !222)
!852 = !DILocation(line: 611, column: 16, scope: !222)
!853 = !DILocation(line: 610, column: 30, scope: !222)
!854 = distinct !{!854, !847, !848, !855}
!855 = !{!"llvm.loop.mustprogress"}
!856 = !DILocation(line: 612, column: 18, scope: !857)
!857 = distinct !DILexicalBlock(scope: !222, file: !67, line: 612, column: 11)
!858 = !DILocation(line: 612, column: 11, scope: !222)
!859 = !DILocation(line: 620, column: 23, scope: !66)
!860 = !DILocation(line: 625, column: 39, scope: !66)
!861 = !DILocation(line: 626, column: 3, scope: !66)
!862 = !DILocation(line: 626, column: 10, scope: !66)
!863 = !DILocation(line: 626, column: 21, scope: !66)
!864 = !DILocation(line: 628, column: 44, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !67, line: 628, column: 11)
!866 = distinct !DILexicalBlock(scope: !66, file: !67, line: 627, column: 5)
!867 = !DILocation(line: 628, column: 32, scope: !865)
!868 = !DILocation(line: 628, column: 49, scope: !865)
!869 = !DILocation(line: 628, column: 11, scope: !866)
!870 = !DILocation(line: 630, column: 11, scope: !871)
!871 = distinct !DILexicalBlock(scope: !866, file: !67, line: 630, column: 11)
!872 = !DILocation(line: 630, column: 11, scope: !866)
!873 = !DILocation(line: 632, column: 26, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !67, line: 632, column: 15)
!875 = distinct !DILexicalBlock(scope: !871, file: !67, line: 631, column: 9)
!876 = !DILocation(line: 632, column: 34, scope: !874)
!877 = !DILocation(line: 632, column: 37, scope: !874)
!878 = !DILocation(line: 632, column: 15, scope: !875)
!879 = !DILocation(line: 636, column: 16, scope: !880)
!880 = distinct !DILexicalBlock(scope: !875, file: !67, line: 636, column: 15)
!881 = !DILocation(line: 636, column: 29, scope: !880)
!882 = !DILocation(line: 640, column: 16, scope: !866)
!883 = distinct !{!883, !861, !884, !855}
!884 = !DILocation(line: 641, column: 5, scope: !66)
!885 = !DILocation(line: 644, column: 3, scope: !66)
!886 = !DILocation(line: 0, scope: !820, inlinedAt: !887)
!887 = distinct !DILocation(line: 648, column: 31, scope: !66)
!888 = !DILocation(line: 0, scope: !820, inlinedAt: !889)
!889 = distinct !DILocation(line: 649, column: 31, scope: !66)
!890 = !DILocation(line: 0, scope: !820, inlinedAt: !891)
!891 = distinct !DILocation(line: 650, column: 31, scope: !66)
!892 = !DILocation(line: 0, scope: !820, inlinedAt: !893)
!893 = distinct !DILocation(line: 651, column: 31, scope: !66)
!894 = !DILocation(line: 0, scope: !820, inlinedAt: !895)
!895 = distinct !DILocation(line: 652, column: 31, scope: !66)
!896 = !DILocation(line: 0, scope: !820, inlinedAt: !897)
!897 = distinct !DILocation(line: 653, column: 31, scope: !66)
!898 = !DILocation(line: 0, scope: !820, inlinedAt: !899)
!899 = distinct !DILocation(line: 654, column: 31, scope: !66)
!900 = !DILocation(line: 0, scope: !820, inlinedAt: !901)
!901 = distinct !DILocation(line: 655, column: 31, scope: !66)
!902 = !DILocation(line: 0, scope: !820, inlinedAt: !903)
!903 = distinct !DILocation(line: 656, column: 31, scope: !66)
!904 = !DILocation(line: 0, scope: !820, inlinedAt: !905)
!905 = distinct !DILocation(line: 657, column: 31, scope: !66)
!906 = !DILocation(line: 663, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !66, file: !67, line: 663, column: 7)
!908 = !DILocation(line: 664, column: 7, scope: !907)
!909 = !DILocation(line: 664, column: 10, scope: !907)
!910 = !DILocation(line: 663, column: 7, scope: !66)
!911 = !DILocation(line: 669, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !907, file: !67, line: 665, column: 5)
!913 = !DILocation(line: 671, column: 5, scope: !912)
!914 = !DILocation(line: 676, column: 7, scope: !915)
!915 = distinct !DILexicalBlock(scope: !907, file: !67, line: 673, column: 5)
!916 = !DILocation(line: 679, column: 3, scope: !66)
!917 = !DILocation(line: 683, column: 3, scope: !66)
!918 = !DILocation(line: 686, column: 3, scope: !66)
!919 = !DILocation(line: 688, column: 3, scope: !66)
!920 = !DILocation(line: 691, column: 3, scope: !66)
!921 = !DILocation(line: 695, column: 3, scope: !66)
!922 = !DILocation(line: 696, column: 1, scope: !66)
!923 = !DISubprogram(name: "setlocale", scope: !924, file: !924, line: 122, type: !925, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!924 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!925 = !DISubroutineType(types: !926)
!926 = !{!239, !92, !70}
!927 = !DISubprogram(name: "strncmp", scope: !928, file: !928, line: 159, type: !929, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!928 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!929 = !DISubroutineType(types: !930)
!930 = !{!92, !70, !70, !94}
!931 = !DISubprogram(name: "exit", scope: !932, file: !932, line: 624, type: !737, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!932 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!933 = !DISubprogram(name: "getenv", scope: !932, file: !932, line: 641, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!934 = !DISubroutineType(types: !935)
!935 = !{!239, !70}
!936 = !DISubprogram(name: "strcmp", scope: !928, file: !928, line: 156, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!937 = !DISubroutineType(types: !938)
!938 = !{!92, !70, !70}
!939 = !DISubprogram(name: "strspn", scope: !928, file: !928, line: 297, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!940 = !DISubroutineType(types: !941)
!941 = !{!96, !70, !70}
!942 = !DISubprogram(name: "strchr", scope: !928, file: !928, line: 246, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!943 = !DISubroutineType(types: !944)
!944 = !{!239, !70, !92}
!945 = !DISubprogram(name: "__ctype_b_loc", scope: !75, file: !75, line: 79, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!946 = !DISubroutineType(types: !947)
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!951 = !DISubprogram(name: "strcspn", scope: !928, file: !928, line: 293, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!952 = !DISubprogram(name: "fwrite_unlocked", scope: !803, file: !803, line: 704, type: !953, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!953 = !DISubroutineType(types: !954)
!954 = !{!94, !955, !94, !94, !797}
!955 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!958 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 50, type: !959, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !962)
!959 = !DISubroutineType(types: !960)
!960 = !{!92, !92, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!962 = !{!963, !964, !965}
!963 = !DILocalVariable(name: "argc", arg: 1, scope: !958, file: !2, line: 50, type: !92)
!964 = !DILocalVariable(name: "argv", arg: 2, scope: !958, file: !2, line: 50, type: !961)
!965 = !DILocalVariable(name: "cp", scope: !958, file: !2, line: 72, type: !70)
!966 = !DILocation(line: 0, scope: !958)
!967 = !DILocation(line: 53, column: 21, scope: !958)
!968 = !DILocation(line: 53, column: 3, scope: !958)
!969 = !DILocation(line: 54, column: 3, scope: !958)
!970 = !DILocation(line: 55, column: 3, scope: !958)
!971 = !DILocation(line: 56, column: 3, scope: !958)
!972 = !DILocation(line: 58, column: 3, scope: !958)
!973 = !DILocation(line: 61, column: 36, scope: !958)
!974 = !DILocation(line: 61, column: 58, scope: !958)
!975 = !DILocation(line: 60, column: 3, scope: !958)
!976 = !DILocation(line: 64, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !958, file: !2, line: 64, column: 7)
!978 = !DILocation(line: 64, column: 14, scope: !977)
!979 = !DILocation(line: 64, column: 7, scope: !958)
!980 = !DILocation(line: 66, column: 7, scope: !981)
!981 = distinct !DILexicalBlock(scope: !977, file: !2, line: 65, column: 5)
!982 = !DILocation(line: 67, column: 7, scope: !981)
!983 = !DILocation(line: 72, column: 20, scope: !958)
!984 = !DILocation(line: 73, column: 9, scope: !985)
!985 = distinct !DILexicalBlock(scope: !958, file: !2, line: 73, column: 7)
!986 = !DILocation(line: 73, column: 7, scope: !958)
!987 = !DILocation(line: 74, column: 5, scope: !985)
!988 = !DILocation(line: 76, column: 3, scope: !958)
!989 = !DILocation(line: 77, column: 3, scope: !958)
!990 = !DISubprogram(name: "bindtextdomain", scope: !790, file: !790, line: 86, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!991 = !DISubroutineType(types: !992)
!992 = !{!239, !70, !70}
!993 = !DISubprogram(name: "textdomain", scope: !790, file: !790, line: 82, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!994 = !DISubprogram(name: "atexit", scope: !932, file: !932, line: 602, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!995 = !DISubroutineType(types: !996)
!996 = !{!92, !357}
!997 = !DISubprogram(name: "getlogin", scope: !998, file: !998, line: 881, type: !999, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!998 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!999 = !DISubroutineType(types: !1000)
!1000 = !{!239}
!1001 = !DISubprogram(name: "puts", scope: !803, file: !803, line: 661, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!92, !70}
!1004 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !297, file: !297, line: 50, type: !758, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !296, retainedNodes: !1005)
!1005 = !{!1006}
!1006 = !DILocalVariable(name: "file", arg: 1, scope: !1004, file: !297, line: 50, type: !70)
!1007 = !DILocation(line: 0, scope: !1004)
!1008 = !DILocation(line: 52, column: 13, scope: !1004)
!1009 = !DILocation(line: 53, column: 1, scope: !1004)
!1010 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !297, file: !297, line: 87, type: !1011, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !296, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !218}
!1013 = !{!1014}
!1014 = !DILocalVariable(name: "ignore", arg: 1, scope: !1010, file: !297, line: 87, type: !218)
!1015 = !DILocation(line: 0, scope: !1010)
!1016 = !DILocation(line: 89, column: 16, scope: !1010)
!1017 = !{!1018, !1018, i64 0}
!1018 = !{!"_Bool", !749, i64 0}
!1019 = !DILocation(line: 90, column: 1, scope: !1010)
!1020 = distinct !DISubprogram(name: "close_stdout", scope: !297, file: !297, line: 116, type: !358, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !296, retainedNodes: !1021)
!1021 = !{!1022}
!1022 = !DILocalVariable(name: "write_error", scope: !1023, file: !297, line: 121, type: !70)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !297, line: 120, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1020, file: !297, line: 118, column: 7)
!1025 = !DILocation(line: 118, column: 21, scope: !1024)
!1026 = !DILocation(line: 118, column: 7, scope: !1024)
!1027 = !DILocation(line: 118, column: 29, scope: !1024)
!1028 = !DILocation(line: 119, column: 7, scope: !1024)
!1029 = !DILocation(line: 119, column: 12, scope: !1024)
!1030 = !{i8 0, i8 2}
!1031 = !DILocation(line: 119, column: 25, scope: !1024)
!1032 = !DILocation(line: 119, column: 28, scope: !1024)
!1033 = !DILocation(line: 119, column: 34, scope: !1024)
!1034 = !DILocation(line: 118, column: 7, scope: !1020)
!1035 = !DILocation(line: 121, column: 33, scope: !1023)
!1036 = !DILocation(line: 0, scope: !1023)
!1037 = !DILocation(line: 122, column: 11, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1023, file: !297, line: 122, column: 11)
!1039 = !DILocation(line: 0, scope: !1038)
!1040 = !DILocation(line: 122, column: 11, scope: !1023)
!1041 = !DILocation(line: 123, column: 9, scope: !1038)
!1042 = !DILocation(line: 126, column: 9, scope: !1038)
!1043 = !DILocation(line: 128, column: 14, scope: !1023)
!1044 = !DILocation(line: 128, column: 7, scope: !1023)
!1045 = !DILocation(line: 133, column: 42, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1020, file: !297, line: 133, column: 7)
!1047 = !DILocation(line: 133, column: 28, scope: !1046)
!1048 = !DILocation(line: 133, column: 50, scope: !1046)
!1049 = !DILocation(line: 133, column: 7, scope: !1020)
!1050 = !DILocation(line: 134, column: 12, scope: !1046)
!1051 = !DILocation(line: 134, column: 5, scope: !1046)
!1052 = !DILocation(line: 135, column: 1, scope: !1020)
!1053 = !DISubprogram(name: "__errno_location", scope: !1054, file: !1054, line: 37, type: !1055, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1054 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!382}
!1057 = !DISubprogram(name: "_exit", scope: !998, file: !998, line: 624, type: !737, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1058 = distinct !DISubprogram(name: "verror", scope: !312, file: !312, line: 251, type: !1059, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1061)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{null, !92, !92, !70, !322}
!1061 = !{!1062, !1063, !1064, !1065}
!1062 = !DILocalVariable(name: "status", arg: 1, scope: !1058, file: !312, line: 251, type: !92)
!1063 = !DILocalVariable(name: "errnum", arg: 2, scope: !1058, file: !312, line: 251, type: !92)
!1064 = !DILocalVariable(name: "message", arg: 3, scope: !1058, file: !312, line: 251, type: !70)
!1065 = !DILocalVariable(name: "args", arg: 4, scope: !1058, file: !312, line: 251, type: !322)
!1066 = !DILocation(line: 0, scope: !1058)
!1067 = !DILocation(line: 261, column: 3, scope: !1058)
!1068 = !DILocation(line: 265, column: 7, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1058, file: !312, line: 265, column: 7)
!1070 = !DILocation(line: 265, column: 7, scope: !1058)
!1071 = !DILocation(line: 266, column: 5, scope: !1069)
!1072 = !DILocation(line: 272, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !312, line: 268, column: 5)
!1074 = !DILocation(line: 276, column: 3, scope: !1058)
!1075 = !DILocation(line: 282, column: 1, scope: !1058)
!1076 = distinct !DISubprogram(name: "flush_stdout", scope: !312, file: !312, line: 163, type: !358, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1077)
!1077 = !{!1078}
!1078 = !DILocalVariable(name: "stdout_fd", scope: !1076, file: !312, line: 166, type: !92)
!1079 = !DILocation(line: 0, scope: !1076)
!1080 = !DILocalVariable(name: "fd", arg: 1, scope: !1081, file: !312, line: 145, type: !92)
!1081 = distinct !DISubprogram(name: "is_open", scope: !312, file: !312, line: 145, type: !1082, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1084)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!92, !92}
!1084 = !{!1080}
!1085 = !DILocation(line: 0, scope: !1081, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 182, column: 25, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1076, file: !312, line: 182, column: 7)
!1088 = !DILocation(line: 157, column: 15, scope: !1081, inlinedAt: !1086)
!1089 = !DILocation(line: 157, column: 12, scope: !1081, inlinedAt: !1086)
!1090 = !DILocation(line: 182, column: 7, scope: !1076)
!1091 = !DILocation(line: 184, column: 5, scope: !1087)
!1092 = !DILocation(line: 185, column: 1, scope: !1076)
!1093 = distinct !DISubprogram(name: "error_tail", scope: !312, file: !312, line: 219, type: !1059, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1094)
!1094 = !{!1095, !1096, !1097, !1098}
!1095 = !DILocalVariable(name: "status", arg: 1, scope: !1093, file: !312, line: 219, type: !92)
!1096 = !DILocalVariable(name: "errnum", arg: 2, scope: !1093, file: !312, line: 219, type: !92)
!1097 = !DILocalVariable(name: "message", arg: 3, scope: !1093, file: !312, line: 219, type: !70)
!1098 = !DILocalVariable(name: "args", arg: 4, scope: !1093, file: !312, line: 219, type: !322)
!1099 = distinct !DIAssignID()
!1100 = !DILocation(line: 0, scope: !1093)
!1101 = !DILocation(line: 229, column: 13, scope: !1093)
!1102 = !DILocalVariable(name: "__stream", arg: 1, scope: !1103, file: !794, line: 132, type: !1106)
!1103 = distinct !DISubprogram(name: "vfprintf", scope: !794, file: !794, line: 132, type: !1104, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !1141)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!92, !1106, !798, !322}
!1106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1109, file: !235, line: 51, baseType: !92, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1109, file: !235, line: 54, baseType: !239, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1109, file: !235, line: 55, baseType: !239, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1109, file: !235, line: 56, baseType: !239, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1109, file: !235, line: 57, baseType: !239, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1109, file: !235, line: 58, baseType: !239, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1109, file: !235, line: 59, baseType: !239, size: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1109, file: !235, line: 60, baseType: !239, size: 64, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1109, file: !235, line: 61, baseType: !239, size: 64, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1109, file: !235, line: 64, baseType: !239, size: 64, offset: 576)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1109, file: !235, line: 65, baseType: !239, size: 64, offset: 640)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1109, file: !235, line: 66, baseType: !239, size: 64, offset: 704)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1109, file: !235, line: 68, baseType: !251, size: 64, offset: 768)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1109, file: !235, line: 70, baseType: !1125, size: 64, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1109, file: !235, line: 72, baseType: !92, size: 32, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1109, file: !235, line: 73, baseType: !92, size: 32, offset: 928)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1109, file: !235, line: 74, baseType: !258, size: 64, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1109, file: !235, line: 77, baseType: !93, size: 16, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1109, file: !235, line: 78, baseType: !263, size: 8, offset: 1040)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1109, file: !235, line: 79, baseType: !34, size: 8, offset: 1048)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1109, file: !235, line: 81, baseType: !266, size: 64, offset: 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1109, file: !235, line: 89, baseType: !269, size: 64, offset: 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1109, file: !235, line: 91, baseType: !271, size: 64, offset: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1109, file: !235, line: 92, baseType: !274, size: 64, offset: 1280)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1109, file: !235, line: 93, baseType: !1125, size: 64, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1109, file: !235, line: 94, baseType: !91, size: 64, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1109, file: !235, line: 95, baseType: !94, size: 64, offset: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1109, file: !235, line: 96, baseType: !92, size: 32, offset: 1536)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1109, file: !235, line: 98, baseType: !9, size: 160, offset: 1568)
!1141 = !{!1102, !1142, !1143}
!1142 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1103, file: !794, line: 133, type: !798)
!1143 = !DILocalVariable(name: "__ap", arg: 3, scope: !1103, file: !794, line: 133, type: !322)
!1144 = !DILocation(line: 0, scope: !1103, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 229, column: 3, scope: !1093)
!1146 = !DILocation(line: 135, column: 10, scope: !1103, inlinedAt: !1145)
!1147 = !DILocation(line: 232, column: 3, scope: !1093)
!1148 = !DILocation(line: 233, column: 7, scope: !1149)
