; ModuleID = 'src/mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.copy_debug = type { i32, i32, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.27 }
%union.anon.27 = type { i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, i8, i32, i32, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rm_options = type { i8, i32, i8, i8, i8, ptr, i8, i8, i8, i8 }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.dir_list = type { ptr, i64, i64 }

!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !2, line: 433, type: !128, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 445, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 21)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 447, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 42)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 70)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 17)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !2, line: 471, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 20)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !2, line: 507, type: !118, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 67)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !2, line: 536, type: !265, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !180, line: 736, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 75)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !316, file: !180, line: 575, type: !181, isLocal: true, isDefinition: true)
!316 = distinct !DISubprogram(name: "oputs_", scope: !180, file: !180, line: 573, type: !317, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !319)
!317 = !DISubroutineType(cc: DW_CC_nocall, types: !318)
!318 = !{null, !236, !236}
!319 = !{!320, !321, !322, !325, !327, !328, !329, !333, !334, !335, !336, !338, !388, !389, !390, !392, !393}
!320 = !DILocalVariable(name: "program", arg: 1, scope: !316, file: !180, line: 573, type: !236)
!321 = !DILocalVariable(name: "option", arg: 2, scope: !316, file: !180, line: 573, type: !236)
!322 = !DILocalVariable(name: "term", scope: !323, file: !180, line: 585, type: !236)
!323 = distinct !DILexicalBlock(scope: !324, file: !180, line: 582, column: 5)
!324 = distinct !DILexicalBlock(scope: !316, file: !180, line: 581, column: 7)
!325 = !DILocalVariable(name: "double_space", scope: !316, file: !180, line: 594, type: !326)
!326 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!327 = !DILocalVariable(name: "first_word", scope: !316, file: !180, line: 595, type: !236)
!328 = !DILocalVariable(name: "option_text", scope: !316, file: !180, line: 596, type: !236)
!329 = !DILocalVariable(name: "s", scope: !330, file: !180, line: 608, type: !236)
!330 = distinct !DILexicalBlock(scope: !331, file: !180, line: 605, column: 5)
!331 = distinct !DILexicalBlock(scope: !332, file: !180, line: 604, column: 12)
!332 = distinct !DILexicalBlock(scope: !316, file: !180, line: 597, column: 7)
!333 = !DILocalVariable(name: "spaces", scope: !330, file: !180, line: 609, type: !233)
!334 = !DILocalVariable(name: "anchor_len", scope: !316, file: !180, line: 620, type: !233)
!335 = !DILocalVariable(name: "desc_text", scope: !316, file: !180, line: 625, type: !236)
!336 = !DILocalVariable(name: "__ptr", scope: !337, file: !180, line: 644, type: !236)
!337 = distinct !DILexicalBlock(scope: !316, file: !180, line: 644, column: 3)
!338 = !DILocalVariable(name: "__stream", scope: !337, file: !180, line: 644, type: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !341, line: 7, baseType: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !343, line: 49, size: 1728, elements: !344)
!343 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !360, !362, !363, !364, !368, !369, !371, !372, !375, !377, !380, !383, !384, !385, !386, !387}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !342, file: !343, line: 51, baseType: !181, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !342, file: !343, line: 54, baseType: !230, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !342, file: !343, line: 55, baseType: !230, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !342, file: !343, line: 56, baseType: !230, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !342, file: !343, line: 57, baseType: !230, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !342, file: !343, line: 58, baseType: !230, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !342, file: !343, line: 59, baseType: !230, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !342, file: !343, line: 60, baseType: !230, size: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !342, file: !343, line: 61, baseType: !230, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !342, file: !343, line: 64, baseType: !230, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !342, file: !343, line: 65, baseType: !230, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !342, file: !343, line: 66, baseType: !230, size: 64, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !342, file: !343, line: 68, baseType: !358, size: 64, offset: 768)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !343, line: 36, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !342, file: !343, line: 70, baseType: !361, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !342, file: !343, line: 72, baseType: !181, size: 32, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !342, file: !343, line: 73, baseType: !181, size: 32, offset: 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !342, file: !343, line: 74, baseType: !365, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !366, line: 152, baseType: !367)
!366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!367 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !342, file: !343, line: 77, baseType: !232, size: 16, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !342, file: !343, line: 78, baseType: !370, size: 8, offset: 1040)
!370 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !342, file: !343, line: 79, baseType: !113, size: 8, offset: 1048)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !342, file: !343, line: 81, baseType: !373, size: 64, offset: 1088)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !343, line: 43, baseType: null)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !342, file: !343, line: 89, baseType: !376, size: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !366, line: 153, baseType: !367)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !342, file: !343, line: 91, baseType: !378, size: 64, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !343, line: 37, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !342, file: !343, line: 92, baseType: !381, size: 64, offset: 1280)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !343, line: 38, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !342, file: !343, line: 93, baseType: !361, size: 64, offset: 1344)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !342, file: !343, line: 94, baseType: !231, size: 64, offset: 1408)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !342, file: !343, line: 95, baseType: !233, size: 64, offset: 1472)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !342, file: !343, line: 96, baseType: !181, size: 32, offset: 1536)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !342, file: !343, line: 98, baseType: !297, size: 160, offset: 1568)
!388 = !DILocalVariable(name: "__cnt", scope: !337, file: !180, line: 644, type: !233)
!389 = !DILocalVariable(name: "url_program", scope: !316, file: !180, line: 648, type: !236)
!390 = !DILocalVariable(name: "__ptr", scope: !391, file: !180, line: 686, type: !236)
!391 = distinct !DILexicalBlock(scope: !316, file: !180, line: 686, column: 3)
!392 = !DILocalVariable(name: "__stream", scope: !391, file: !180, line: 686, type: !339)
!393 = !DILocalVariable(name: "__cnt", scope: !391, file: !180, line: 686, type: !233)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !180, line: 585, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 5)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !180, line: 586, type: !396, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !180, line: 595, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 4)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !180, line: 620, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 6)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !180, line: 648, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !180, line: 648, type: !396, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !180, line: 649, type: !403, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !180, line: 649, type: !19, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !180, line: 650, type: !396, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !180, line: 651, type: !408, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !180, line: 651, type: !408, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !180, line: 652, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 7)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !180, line: 653, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 8)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !180, line: 654, type: !118, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !180, line: 655, type: !118, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !180, line: 656, type: !118, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !180, line: 657, type: !118, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !180, line: 663, type: !430, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !180, line: 664, type: !118, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !180, line: 669, type: !292, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !180, line: 669, type: !454, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 40)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !180, line: 676, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 15)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !180, line: 676, type: !29, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !180, line: 679, type: !19, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !180, line: 683, type: !396, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !180, line: 688, type: !396, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !180, line: 691, type: !435, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !180, line: 764, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4976, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 622)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !180, line: 781, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1768, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 221)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !180, line: 788, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1776, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 222)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !180, line: 839, type: !270, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !180, line: 840, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 22)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !180, line: 841, type: !459, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !180, line: 862, type: !403, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !180, line: 868, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 71)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !180, line: 875, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 27)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !180, line: 877, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 51)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !180, line: 877, type: !265, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !430, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !435, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !408, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !250, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !408, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !265, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 11)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !435, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !297, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 23)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !430, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !292, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !430, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !435, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !396, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 84, type: !435, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "update_type", scope: !133, file: !2, line: 60, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 128, elements: !404)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !403, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !396, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !118, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !408, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "update_type_string", scope: !133, file: !2, line: 56, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 320, elements: !397)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 108)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !250, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 704, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 88)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !583, file: !2, line: 110, type: !596, isLocal: true, isDefinition: true)
!583 = distinct !DISubprogram(name: "rm_option_init", scope: !2, file: !2, line: 89, type: !584, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !610)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !215, line: 32, size: 256, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !606, !607, !608, !609}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !587, file: !215, line: 35, baseType: !326, size: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !587, file: !215, line: 38, baseType: !214, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !587, file: !215, line: 47, baseType: !326, size: 8, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !587, file: !215, line: 50, baseType: !326, size: 8, offset: 72)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !587, file: !215, line: 53, baseType: !326, size: 8, offset: 80)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !587, file: !215, line: 57, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !597, line: 30, size: 128, elements: !598)
!597 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!598 = !{!599, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !596, file: !597, line: 32, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !601, line: 47, baseType: !602)
!601 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !366, line: 148, baseType: !235)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !596, file: !597, line: 33, baseType: !604, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !601, line: 59, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !366, line: 145, baseType: !235)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !587, file: !215, line: 61, baseType: !326, size: 8, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !587, file: !215, line: 64, baseType: !326, size: 8, offset: 200)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !587, file: !215, line: 67, baseType: !326, size: 8, offset: 208)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !587, file: !215, line: 75, baseType: !326, size: 8, offset: 216)
!610 = !{!611}
!611 = !DILocalVariable(name: "x", arg: 1, scope: !583, file: !2, line: 89, type: !586)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 31)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !413, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 4352, elements: !293)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !622, line: 50, size: 256, elements: !623)
!622 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!623 = !{!624, !625, !626, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !622, line: 52, baseType: !236, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !621, file: !622, line: 55, baseType: !181, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !621, file: !622, line: 56, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !621, file: !622, line: 57, baseType: !181, size: 32, offset: 192)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !631, line: 625, type: !270, isLocal: true, isDefinition: true)
!631 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !631, line: 639, type: !292, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !631, line: 456, type: !292, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !631, line: 469, type: !510, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !631, line: 469, type: !413, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !631, line: 469, type: !19, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !413, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 45)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !88, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 49)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !631, line: 498, type: !614, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !631, line: 511, type: !660, isLocal: true, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 46)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !631, line: 514, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 37)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !631, line: 576, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 186)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !631, line: 583, type: !277, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !631, line: 589, type: !14, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !631, line: 589, type: !491, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !631, line: 276, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 48)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !631, line: 276, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 32)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !631, line: 297, type: !510, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !631, line: 309, type: !693, isLocal: true, isDefinition: true)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 35)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !631, line: 309, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 19)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !631, line: 398, type: !491, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !631, line: 398, type: !265, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !707, line: 606, type: !665, isLocal: true, isDefinition: true)
!707 = !DIFile(filename: "src/copy.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2468b988b487bb70a5564b296b3014eb")
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !707, line: 648, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 41)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !715, file: !707, line: 128, type: !236, isLocal: true, isDefinition: true)
!715 = distinct !DICompileUnit(language: DW_LANG_C11, file: !707, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/copy.o -MD -MP -MF src/.deps/copy.Tpo -c src/copy.c -o src/.copy.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !716, retainedTypes: !737, globals: !738, splitDebugInlining: false, nameTableKind: None)
!716 = !{!135, !143, !150, !156, !162, !168, !185, !717, !721, !728}
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !718, line: 32, baseType: !137, size: 32, elements: !719)
!718 = !DIFile(filename: "./lib/utimecmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f602805edcb41bf216811616bd42cad2")
!719 = !{!720}
!720 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!721 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !722, line: 37, baseType: !137, size: 32, elements: !723)
!722 = !DIFile(filename: "./lib/savedir.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2bb9be9f16e0215620cf0d56009bad4")
!723 = !{!724, !725, !726, !727}
!724 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!725 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!726 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!727 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_debug_val", file: !144, line: 305, baseType: !137, size: 32, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736}
!730 = !DIEnumerator(name: "COPY_DEBUG_UNKNOWN", value: 0)
!731 = !DIEnumerator(name: "COPY_DEBUG_NO", value: 1)
!732 = !DIEnumerator(name: "COPY_DEBUG_YES", value: 2)
!733 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL", value: 3)
!734 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL_INTERNAL", value: 4)
!735 = !DIEnumerator(name: "COPY_DEBUG_AVOIDED", value: 5)
!736 = !DIEnumerator(name: "COPY_DEBUG_UNSUPPORTED", value: 6)
!737 = !{!137, !231, !235, !238}
!738 = !{!739, !705, !741, !708, !743, !750, !713, !752, !754, !759, !761, !764, !769, !774, !776, !781, !783, !785, !787, !789, !791, !793, !795, !797, !802, !804, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !838, !843, !845, !847, !852, !854, !859, !861, !863, !865, !867, !869, !871, !876, !881, !883, !885, !890, !892, !894, !896, !898, !903, !905, !910, !912, !914, !916, !918, !920, !922, !924, !926, !928, !930, !932, !939, !941, !943, !945, !947, !949, !951, !953, !955, !957, !962, !964}
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !707, line: 591, type: !103, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !707, line: 621, type: !510, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "mask", scope: !745, file: !707, line: 2890, type: !748, isLocal: true, isDefinition: true)
!745 = distinct !DISubprogram(name: "cached_umask", scope: !707, file: !707, line: 2888, type: !746, scopeLine: 2889, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !715)
!746 = !DISubroutineType(types: !747)
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !601, line: 69, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !366, line: 150, baseType: !137)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "cached", scope: !745, file: !707, line: 2891, type: !326, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !715, file: !707, line: 129, type: !236, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2779, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 55)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2779, type: !529, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2779, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 368, elements: !661)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2780, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 880, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 110)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2781, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 928, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 116)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2782, type: !245, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2783, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 73)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1643, type: !413, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1673, type: !459, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1681, type: !454, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1681, type: !491, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1706, type: !653, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1780, type: !255, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1870, type: !292, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1872, type: !265, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1885, type: !799, isLocal: true, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 52)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1885, type: !799, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1906, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 43)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1934, type: !103, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1935, type: !510, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1961, type: !292, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1978, type: !292, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1983, type: !265, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2008, type: !653, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2020, type: !250, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2091, type: !646, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2100, type: !49, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2128, type: !646, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2157, type: !297, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2158, type: !292, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2195, type: !835, isLocal: true, isDefinition: true)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 47)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2239, type: !840, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 26)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2252, type: !297, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2257, type: !277, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2276, type: !849, isLocal: true, isDefinition: true)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 60)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2284, type: !270, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2319, type: !856, isLocal: true, isDefinition: true)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 36)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2340, type: !505, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2363, type: !505, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2382, type: !491, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2445, type: !54, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2456, type: !665, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2514, type: !491, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2523, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 30)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2534, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 29)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2561, type: !614, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2579, type: !856, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2595, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 25)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2651, type: !123, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2737, type: !873, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2765, type: !297, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !707, line: 2769, type: !277, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1562, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 33)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1492, type: !128, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1492, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 800, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 100)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1422, type: !646, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1422, type: !653, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1433, type: !698, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1512, type: !260, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !707, line: 397, type: !292, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !707, line: 754, type: !505, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !707, line: 760, type: !270, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !707, line: 769, type: !14, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !707, line: 978, type: !454, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !707, line: 999, type: !873, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1135, type: !698, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "copy_debug", scope: !715, file: !707, line: 132, type: !934, isLocal: true, isDefinition: true)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "copy_debug", file: !144, line: 317, size: 96, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "offload", scope: !934, file: !144, line: 319, baseType: !728, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "reflink", scope: !934, file: !144, line: 320, baseType: !728, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_detection", scope: !934, file: !144, line: 321, baseType: !728, size: 32, offset: 64)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !707, line: 692, type: !505, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !707, line: 173, type: !93, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !707, line: 139, type: !19, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !707, line: 140, type: !403, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !707, line: 141, type: !435, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !707, line: 142, type: !265, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !707, line: 143, type: !435, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !707, line: 157, type: !408, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !707, line: 158, type: !118, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !707, line: 159, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 18)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !707, line: 1521, type: !799, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !707, line: 510, type: !255, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !969, line: 554, type: !270, isLocal: true, isDefinition: true)
!969 = !DIFile(filename: "src/copy-file-data.c", directory: "/src", checksumkind: CSK_MD5, checksum: "10bf938861a2599d1da9956990f9d55d")
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !969, line: 633, type: !297, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !969, line: 639, type: !491, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !969, line: 409, type: !292, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !969, line: 177, type: !538, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !969, line: 203, type: !292, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !969, line: 247, type: !292, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !969, line: 258, type: !297, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !986, file: !987, line: 45, type: !993, isLocal: true, isDefinition: true)
!986 = distinct !DICompileUnit(language: DW_LANG_C11, file: !987, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/cp-hash.o -MD -MP -MF src/.deps/cp-hash.Tpo -c src/cp-hash.c -o src/.cp-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !988, globals: !992, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "src/cp-hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e1cbaa8dd82131aad9d092a28cc0016")
!988 = !{!231, !230, !989}
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !990, line: 102, baseType: !991)
!990 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !366, line: 73, baseType: !235)
!992 = !{!984}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !995, line: 56, baseType: !996)
!995 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !995, line: 54, flags: DIFlagFwdDecl)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !999, file: !1000, line: 38, type: !1009, isLocal: true, isDefinition: true)
!999 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1000, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/force-link.o -MD -MP -MF src/.deps/force-link.Tpo -c src/force-link.c -o src/.force-link.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1001, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!1001 = !{!1002, !1005}
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1000, line: 39, baseType: !137, size: 32, elements: !1003)
!1003 = !{!1004}
!1004 = !DIEnumerator(name: "x_suffix_len", value: 6)
!1005 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1000, line: 44, baseType: !137, size: 32, elements: !1006)
!1006 = !{!1007}
!1007 = !DIEnumerator(name: "smallsize", value: 256)
!1008 = !{!997}
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 72, elements: !251)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !1012, line: 3, type: !459, isLocal: true, isDefinition: true)
!1012 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "Version", scope: !1015, file: !1012, line: 3, type: !236, isLocal: false, isDefinition: true)
!1015 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1012, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1016, splitDebugInlining: false, nameTableKind: None)
!1016 = !{!1010, !1013}
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !1019, line: 51, type: !19, isLocal: true, isDefinition: true)
!1019 = !DIFile(filename: "lib/copy-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d19480c78a0966338b5bf17d8ed286c6")
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !1019, line: 55, type: !430, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !1019, line: 55, type: !873, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !1026, line: 46, type: !430, isLocal: true, isDefinition: true)
!1026 = !DIFile(filename: "lib/set-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "722ad1ac2f97374f03af732c9ad7cf42")
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1026, line: 46, type: !505, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 141, type: !430, isLocal: true, isDefinition: true)
!1031 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 141, type: !505, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 142, type: !878, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 160, type: !277, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 165, type: !435, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 170, type: !396, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !1044, file: !1045, line: 77, type: !236, isLocal: false, isDefinition: true)
!1044 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1045, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-backupfile.o -MD -MP -MF lib/.deps/libcoreutils_a-backupfile.Tpo -c lib/backupfile.c -o lib/.libcoreutils_a-backupfile.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1046, retainedTypes: !1112, globals: !1113, splitDebugInlining: false, nameTableKind: None)
!1045 = !DIFile(filename: "lib/backupfile.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d80c7bac43057afe2488869169d2a407")
!1046 = !{!1047, !1049, !1082, !1088}
!1047 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !1048, line: 38, baseType: !137, size: 32, elements: !138)
!1048 = !DIFile(filename: "lib/backupfile.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5fb672ff14309605c773cb90d9256701")
!1049 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1050, file: !1045, line: 325, baseType: !137, size: 32, elements: !1080)
!1050 = distinct !DISubprogram(name: "backupfile_internal", scope: !1045, file: !1045, line: 312, type: !1051, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1044, retainedNodes: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!230, !181, !236, !1047, !326}
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1063, !1064, !1065, !1066, !1067, !1068, !1073, !1074, !1075, !1077, !1078, !1079}
!1054 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !1050, file: !1045, line: 312, type: !181)
!1055 = !DILocalVariable(name: "file", arg: 2, scope: !1050, file: !1045, line: 312, type: !236)
!1056 = !DILocalVariable(name: "backup_type", arg: 3, scope: !1050, file: !1045, line: 313, type: !1047)
!1057 = !DILocalVariable(name: "rename", arg: 4, scope: !1050, file: !1045, line: 313, type: !326)
!1058 = !DILocalVariable(name: "base_offset", scope: !1050, file: !1045, line: 315, type: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1060, line: 130, baseType: !1061)
!1060 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1062, line: 18, baseType: !367)
!1062 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1063 = !DILocalVariable(name: "filelen", scope: !1050, file: !1045, line: 316, type: !1059)
!1064 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !1050, file: !1045, line: 323, type: !1059)
!1065 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !1050, file: !1045, line: 324, type: !1059)
!1066 = !DILocalVariable(name: "ssize", scope: !1050, file: !1045, line: 329, type: !1059)
!1067 = !DILocalVariable(name: "s", scope: !1050, file: !1045, line: 330, type: !230)
!1068 = !DILocalVariable(name: "dirp", scope: !1050, file: !1045, line: 334, type: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1071, line: 127, baseType: !1072)
!1071 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1071, line: 127, flags: DIFlagFwdDecl)
!1073 = !DILocalVariable(name: "sdir", scope: !1050, file: !1045, line: 335, type: !181)
!1074 = !DILocalVariable(name: "base_max", scope: !1050, file: !1045, line: 336, type: !1059)
!1075 = !DILocalVariable(name: "extended", scope: !1076, file: !1045, line: 339, type: !326)
!1076 = distinct !DILexicalBlock(scope: !1050, file: !1045, line: 338, column: 5)
!1077 = !DILocalVariable(name: "offset", scope: !1076, file: !1045, line: 375, type: !1059)
!1078 = !DILocalVariable(name: "flags", scope: !1076, file: !1045, line: 376, type: !137)
!1079 = !DILocalVariable(name: "saved_errno", scope: !1076, file: !1045, line: 379, type: !181)
!1080 = !{!1081}
!1081 = !DIEnumerator(name: "GUESS", value: 9)
!1082 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !1045, line: 171, baseType: !137, size: 32, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087}
!1084 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!1085 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!1086 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!1087 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3)
!1088 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1089, line: 24, baseType: !137, size: 32, elements: !1090)
!1089 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111}
!1091 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!1092 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!1093 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!1094 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!1095 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!1096 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!1097 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!1098 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!1099 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!1100 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!1101 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!1102 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!1103 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!1104 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!1105 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!1106 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!1107 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!1108 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!1109 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!1110 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!1111 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!1112 = !{!231, !137}
!1113 = !{!1042, !1114, !1116, !1118, !1120}
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(scope: null, file: !1045, line: 86, type: !277, isLocal: true, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(scope: null, file: !1045, line: 87, type: !413, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !1045, line: 225, type: !413, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1045, line: 230, type: !396, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "backup_types", scope: !1124, file: !1125, line: 53, type: !1152, isLocal: true, isDefinition: true)
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1125, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-backup-find.o -MD -MP -MF lib/.deps/libcoreutils_a-backup-find.Tpo -c lib/backup-find.c -o lib/.libcoreutils_a-backup-find.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1126, retainedTypes: !1127, globals: !1128, splitDebugInlining: false, nameTableKind: None)
!1125 = !DIFile(filename: "lib/backup-find.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3f359c23ab3cfe916b3fbf76e026681")
!1126 = !{!1047}
!1127 = !{!231, !228}
!1128 = !{!1129, !1131, !1122, !1133, !1135, !1137, !1139, !1141, !1143, !1145, !1147, !1149}
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 92, type: !292, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 92, type: !270, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 46, type: !396, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 46, type: !403, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 47, type: !430, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 47, type: !408, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 48, type: !250, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 48, type: !403, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 49, type: !250, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 49, type: !413, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(name: "backup_args", scope: !1124, file: !1125, line: 42, type: !1151, isLocal: true, isDefinition: true)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 576, elements: !251)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 256, elements: !436)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1156, file: !1031, line: 65, type: !1162, isLocal: false, isDefinition: true)
!1156 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1031, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1157, retainedTypes: !1160, globals: !1161, splitDebugInlining: false, nameTableKind: None)
!1157 = !{!1158}
!1158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1159, line: 42, baseType: !137, size: 32, elements: !187)
!1159 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1160 = !{!231, !236, !238}
!1161 = !{!1154, !1029, !1032, !1034, !1036, !1038, !1040}
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1163, line: 69, baseType: !1164)
!1163 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{null}
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(name: "file_name", scope: !1169, file: !1170, line: 36, type: !236, isLocal: true, isDefinition: true)
!1169 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1170, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closein.o -MD -MP -MF lib/.deps/libcoreutils_a-closein.Tpo -c lib/closein.c -o lib/.libcoreutils_a-closein.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1171, splitDebugInlining: false, nameTableKind: None)
!1170 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!1171 = !{!1172, !1174, !1176, !1178, !1167}
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !1170, line: 99, type: !430, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1170, line: 99, type: !698, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1170, line: 101, type: !430, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !1170, line: 104, type: !19, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(name: "file_name", scope: !1182, file: !1183, line: 45, type: !236, isLocal: true, isDefinition: true)
!1182 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1183, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1184, splitDebugInlining: false, nameTableKind: None)
!1183 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1184 = !{!1185, !1187, !1189, !1191, !1180, !1193}
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(scope: null, file: !1183, line: 121, type: !430, isLocal: true, isDefinition: true)
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(scope: null, file: !1183, line: 121, type: !265, isLocal: true, isDefinition: true)
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(scope: null, file: !1183, line: 123, type: !430, isLocal: true, isDefinition: true)
!1191 = !DIGlobalVariableExpression(var: !1192, expr: !DIExpression())
!1192 = distinct !DIGlobalVariable(scope: null, file: !1183, line: 126, type: !19, isLocal: true, isDefinition: true)
!1193 = !DIGlobalVariableExpression(var: !1194, expr: !DIExpression())
!1194 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1182, file: !1183, line: 55, type: !326, isLocal: true, isDefinition: true)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1197, file: !1198, line: 66, type: !1164, isLocal: false, isDefinition: true)
!1197 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1198, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1199, globals: !1200, splitDebugInlining: false, nameTableKind: None)
!1198 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1199 = !{!231, !238}
!1200 = !{!1201, !1203, !1222, !1224, !1226, !1228, !1195, !1230, !1232, !1234, !1236, !1238}
!1201 = !DIGlobalVariableExpression(var: !1202, expr: !DIExpression())
!1202 = distinct !DIGlobalVariable(scope: null, file: !1198, line: 272, type: !396, isLocal: true, isDefinition: true)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1205, file: !1198, line: 304, type: !236, isLocal: true, isDefinition: true)
!1205 = distinct !DISubprogram(name: "verror_at_line", scope: !1198, file: !1198, line: 298, type: !1206, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1197, retainedNodes: !1215)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !181, !181, !236, !137, !236, !1208}
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1209, file: !1198, baseType: !137, size: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1209, file: !1198, baseType: !137, size: 32, offset: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1209, file: !1198, baseType: !231, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1209, file: !1198, baseType: !231, size: 64, offset: 128)
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1221}
!1216 = !DILocalVariable(name: "status", arg: 1, scope: !1205, file: !1198, line: 298, type: !181)
!1217 = !DILocalVariable(name: "errnum", arg: 2, scope: !1205, file: !1198, line: 298, type: !181)
!1218 = !DILocalVariable(name: "file_name", arg: 3, scope: !1205, file: !1198, line: 298, type: !236)
!1219 = !DILocalVariable(name: "line_number", arg: 4, scope: !1205, file: !1198, line: 298, type: !137)
!1220 = !DILocalVariable(name: "message", arg: 5, scope: !1205, file: !1198, line: 298, type: !236)
!1221 = !DILocalVariable(name: "args", arg: 6, scope: !1205, file: !1198, line: 298, type: !1208)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1205, file: !1198, line: 305, type: !137, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !1198, line: 338, type: !403, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !1198, line: 346, type: !435, isLocal: true, isDefinition: true)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !1198, line: 346, type: !413, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1197, file: !1198, line: 69, type: !137, isLocal: false, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1197, file: !1198, line: 295, type: !181, isLocal: false, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !1198, line: 208, type: !430, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !1198, line: 208, type: !277, isLocal: true, isDefinition: true)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(scope: null, file: !1198, line: 214, type: !396, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(scope: null, file: !1242, line: 30, type: !430, isLocal: true, isDefinition: true)
!1242 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!1243 = !DIGlobalVariableExpression(var: !1244, expr: !DIExpression())
!1244 = distinct !DIGlobalVariable(scope: null, file: !1245, line: 399, type: !413, isLocal: true, isDefinition: true)
!1245 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1245, line: 441, type: !113, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1245, line: 1080, type: !19, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1252, line: 226, type: !123, isLocal: true, isDefinition: true)
!1252 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1252, line: 227, type: !123, isLocal: true, isDefinition: true)
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(scope: null, file: !1252, line: 228, type: !900, isLocal: true, isDefinition: true)
!1257 = !DIGlobalVariableExpression(var: !1258, expr: !DIExpression())
!1258 = distinct !DIGlobalVariable(scope: null, file: !1252, line: 231, type: !123, isLocal: true, isDefinition: true)
!1259 = !DIGlobalVariableExpression(var: !1260, expr: !DIExpression())
!1260 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1261, file: !1252, line: 134, type: !1265, isLocal: true, isDefinition: true)
!1261 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1252, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1262, globals: !1264, splitDebugInlining: false, nameTableKind: None)
!1262 = !{!235, !231, !1263, !233}
!1263 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1264 = !{!1250, !1253, !1255, !1257, !1259}
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !1267, line: 52, baseType: !1268)
!1267 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !1267, line: 40, size: 160, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1274}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1268, file: !1267, line: 45, baseType: !1263, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1268, file: !1267, line: 46, baseType: !1263, size: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1268, file: !1267, line: 47, baseType: !1263, size: 32, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1268, file: !1267, line: 48, baseType: !1263, size: 32, offset: 96)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1268, file: !1267, line: 49, baseType: !326, size: 8, offset: 128)
!1275 = !DIGlobalVariableExpression(var: !1276, expr: !DIExpression())
!1276 = distinct !DIGlobalVariable(name: "program_name", scope: !1277, file: !1278, line: 31, type: !236, isLocal: false, isDefinition: true)
!1277 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1278, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1279, globals: !1280, splitDebugInlining: false, nameTableKind: None)
!1278 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1279 = !{!231, !230}
!1280 = !{!1275, !1281, !1283}
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(scope: null, file: !1278, line: 46, type: !435, isLocal: true, isDefinition: true)
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(scope: null, file: !1278, line: 49, type: !403, isLocal: true, isDefinition: true)
!1285 = !DIGlobalVariableExpression(var: !1286, expr: !DIExpression())
!1286 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1287, file: !1288, line: 46, type: !1315, isLocal: true, isDefinition: true)
!1287 = distinct !DISubprogram(name: "proper_name_lite", scope: !1288, file: !1288, line: 38, type: !1289, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1291, retainedNodes: !1293)
!1288 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!236, !236, !236}
