; ModuleID = 'src/od.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tspec = type { i32, i32, ptr, [18 x i8], i8, i32, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { x86_fp80 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1829, type: !24, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !24, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1832, type: !24, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1833, type: !24, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1835, type: !24, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 14)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 13)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1875, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 46)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1949, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 17)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !24, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 45)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1970, type: !100, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1973, type: !24, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2012, type: !340, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2031, type: !333, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2061, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 15)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "string_min", scope: !161, file: !2, line: 193, type: !256, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !161, file: !2, line: 196, type: !360, isLocal: true, isDefinition: true)
!360 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "traditional", scope: !161, file: !2, line: 201, type: !360, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !161, file: !2, line: 204, type: !360, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !161, file: !2, line: 208, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !368, line: 101, baseType: !369)
!368 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !370, line: 72, baseType: !260)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !161, file: !2, line: 216, type: !367, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "spec", scope: !161, file: !2, line: 228, type: !375, isLocal: true, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !2, line: 122, size: 384, elements: !377)
!377 = !{!378, !379, !380, !381, !385, !386, !387}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !376, file: !2, line: 124, baseType: !185, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !2, line: 125, baseType: !196, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !376, file: !2, line: 126, baseType: !252, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !376, file: !2, line: 127, baseType: !382, size: 144, offset: 128)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 18)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !376, file: !2, line: 128, baseType: !360, size: 8, offset: 272)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !376, file: !2, line: 129, baseType: !158, size: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !376, file: !2, line: 130, baseType: !256, size: 64, offset: 320)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "n_specs", scope: !161, file: !2, line: 231, type: !256, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !161, file: !2, line: 240, type: !256, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "file_list", scope: !161, file: !2, line: 247, type: !243, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "in_stream", scope: !161, file: !2, line: 254, type: !396, isLocal: true, isDefinition: true)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !398, line: 7, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !400, line: 49, size: 1728, elements: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !417, !419, !420, !421, !423, !424, !426, !427, !430, !432, !435, !438, !439, !440, !441, !442}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !399, file: !400, line: 51, baseType: !158, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !399, file: !400, line: 54, baseType: !160, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !399, file: !400, line: 55, baseType: !160, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !399, file: !400, line: 56, baseType: !160, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !399, file: !400, line: 57, baseType: !160, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !399, file: !400, line: 58, baseType: !160, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !399, file: !400, line: 59, baseType: !160, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !399, file: !400, line: 60, baseType: !160, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !399, file: !400, line: 61, baseType: !160, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !399, file: !400, line: 64, baseType: !160, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !399, file: !400, line: 65, baseType: !160, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !399, file: !400, line: 66, baseType: !160, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !399, file: !400, line: 68, baseType: !415, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !400, line: 36, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !399, file: !400, line: 70, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !399, file: !400, line: 72, baseType: !158, size: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !399, file: !400, line: 73, baseType: !158, size: 32, offset: 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !399, file: !400, line: 74, baseType: !422, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !370, line: 152, baseType: !260)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !399, file: !400, line: 77, baseType: !247, size: 16, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !399, file: !400, line: 78, baseType: !425, size: 8, offset: 1040)
!425 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !399, file: !400, line: 79, baseType: !265, size: 8, offset: 1048)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !399, file: !400, line: 81, baseType: !428, size: 64, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !400, line: 43, baseType: null)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !399, file: !400, line: 89, baseType: !431, size: 64, offset: 1152)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !370, line: 153, baseType: !260)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !399, file: !400, line: 91, baseType: !433, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !400, line: 37, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !399, file: !400, line: 92, baseType: !436, size: 64, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !400, line: 38, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !399, file: !400, line: 93, baseType: !418, size: 64, offset: 1344)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !399, file: !400, line: 94, baseType: !240, size: 64, offset: 1408)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !399, file: !400, line: 95, baseType: !248, size: 64, offset: 1472)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !399, file: !400, line: 96, baseType: !158, size: 32, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !399, file: !400, line: 98, baseType: !443, size: 160, offset: 1568)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 20)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !161, file: !2, line: 257, type: !360, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "input_swap", scope: !161, file: !2, line: 305, type: !360, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !181, line: 729, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 56)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !181, line: 736, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 75)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !462, file: !181, line: 575, type: !158, isLocal: true, isDefinition: true)
!462 = distinct !DISubprogram(name: "oputs_", scope: !181, file: !181, line: 573, type: !463, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !465)
!463 = !DISubroutineType(cc: DW_CC_nocall, types: !464)
!464 = !{null, !245, !245}
!465 = !{!466, !467, !468, !471, !472, !473, !474, !478, !479, !480, !481, !483, !484, !485, !486, !488, !489}
!466 = !DILocalVariable(name: "program", arg: 1, scope: !462, file: !181, line: 573, type: !245)
!467 = !DILocalVariable(name: "option", arg: 2, scope: !462, file: !181, line: 573, type: !245)
!468 = !DILocalVariable(name: "term", scope: !469, file: !181, line: 585, type: !245)
!469 = distinct !DILexicalBlock(scope: !470, file: !181, line: 582, column: 5)
!470 = distinct !DILexicalBlock(scope: !462, file: !181, line: 581, column: 7)
!471 = !DILocalVariable(name: "double_space", scope: !462, file: !181, line: 594, type: !360)
!472 = !DILocalVariable(name: "first_word", scope: !462, file: !181, line: 595, type: !245)
!473 = !DILocalVariable(name: "option_text", scope: !462, file: !181, line: 596, type: !245)
!474 = !DILocalVariable(name: "s", scope: !475, file: !181, line: 608, type: !245)
!475 = distinct !DILexicalBlock(scope: !476, file: !181, line: 605, column: 5)
!476 = distinct !DILexicalBlock(scope: !477, file: !181, line: 604, column: 12)
!477 = distinct !DILexicalBlock(scope: !462, file: !181, line: 597, column: 7)
!478 = !DILocalVariable(name: "spaces", scope: !475, file: !181, line: 609, type: !248)
!479 = !DILocalVariable(name: "anchor_len", scope: !462, file: !181, line: 620, type: !248)
!480 = !DILocalVariable(name: "desc_text", scope: !462, file: !181, line: 625, type: !245)
!481 = !DILocalVariable(name: "__ptr", scope: !482, file: !181, line: 644, type: !245)
!482 = distinct !DILexicalBlock(scope: !462, file: !181, line: 644, column: 3)
!483 = !DILocalVariable(name: "__stream", scope: !482, file: !181, line: 644, type: !396)
!484 = !DILocalVariable(name: "__cnt", scope: !482, file: !181, line: 644, type: !248)
!485 = !DILocalVariable(name: "url_program", scope: !462, file: !181, line: 648, type: !245)
!486 = !DILocalVariable(name: "__ptr", scope: !487, file: !181, line: 686, type: !245)
!487 = distinct !DILexicalBlock(scope: !462, file: !181, line: 686, column: 3)
!488 = !DILocalVariable(name: "__stream", scope: !487, file: !181, line: 686, type: !396)
!489 = !DILocalVariable(name: "__cnt", scope: !487, file: !181, line: 686, type: !248)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !181, line: 585, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 5)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !181, line: 586, type: !492, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !181, line: 595, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 4)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !181, line: 620, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 6)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !287, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !492, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !499, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !24, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !181, line: 650, type: !492, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !504, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !504, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !181, line: 652, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 7)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !181, line: 653, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 8)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !181, line: 654, type: !270, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !181, line: 655, type: !270, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !181, line: 656, type: !270, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !181, line: 657, type: !270, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !181, line: 663, type: !523, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !181, line: 664, type: !270, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !333, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 40)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !353, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 61)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !181, line: 679, type: !24, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !181, line: 683, type: !492, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !181, line: 688, type: !492, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !181, line: 691, type: !528, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !181, line: 839, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 16)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !181, line: 840, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 22)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !181, line: 841, type: !353, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !181, line: 862, type: !499, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !181, line: 868, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 71)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !181, line: 875, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 27)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !120, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 12)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "short_options", scope: !161, file: !2, line: 307, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 280, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 35)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 335, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 11)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !2, line: 336, type: !318, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !603, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !2, line: 338, type: !523, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !382, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !528, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !593, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !504, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 343, type: !523, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !492, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 346, type: !528, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "long_options", scope: !161, file: !2, line: 333, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 3072, elements: !594)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !631, line: 50, size: 256, elements: !632)
!631 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!632 = !{!633, !634, !635, !637}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !631, line: 52, baseType: !245, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !630, file: !631, line: 55, baseType: !158, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !630, file: !631, line: 56, baseType: !636, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !630, file: !631, line: 57, baseType: !158, size: 32, offset: 192)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1267, type: !333, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "format_address", scope: !161, file: !2, line: 213, type: !642, isLocal: true, isDefinition: true)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !367, !4}
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "address_base", scope: !161, file: !2, line: 182, type: !158, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !161, file: !2, line: 190, type: !158, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !270, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !282, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 328, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 41)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !161, file: !2, line: 234, type: !256, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 797, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 23)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 807, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 76)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !504, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !287, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !499, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !282, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !287, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !499, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !287, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !499, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !287, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !499, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !287, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 664, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 83)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 921, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 656, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 82)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !2, line: 993, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !656)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "integral_type_size", scope: !161, file: !2, line: 265, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 288, elements: !283)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !161, file: !2, line: 288, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 544, elements: !334)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !2, line: 585, type: !499, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !2, line: 618, type: !499, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "charname", scope: !161, file: !2, line: 172, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1056, elements: !735)
!735 = !{!736, !501}
!736 = !DISubrange(count: 33)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 651, type: !24, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !24, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !2, line: 659, type: !24, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 663, type: !24, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 667, type: !24, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !2, line: 671, type: !24, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !2, line: 675, type: !24, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !2, line: 679, type: !24, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !24, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !492, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !161, file: !2, line: 225, type: !360, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "endian_types", scope: !161, file: !2, line: 328, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 64, elements: !288)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !523, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !499, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "endian_args", scope: !161, file: !2, line: 323, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, elements: !25)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1488, type: !24, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1294, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !599)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "end_offset", scope: !161, file: !2, line: 220, type: !367, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !287, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "default_file_list", scope: !161, file: !2, line: 251, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !288)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1039, type: !287, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "input_filename", scope: !161, file: !2, line: 244, type: !245, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1227, type: !3, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1086, type: !593, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "width_bytes", scope: !161, file: !2, line: 134, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 288, elements: !283)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 32)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 136, elements: !334)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !804, isLocal: true, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 30)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !655, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "first", scope: !811, file: !2, line: 1313, type: !360, isLocal: true, isDefinition: true)
!811 = distinct !DISubprogram(name: "write_block", scope: !2, file: !2, line: 1310, type: !812, scopeLine: 1312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !367, !256, !245, !245}
!814 = !{!815, !816, !817, !818, !819, !823, !826, !827, !828, !831, !833}
!815 = !DILocalVariable(name: "current_offset", arg: 1, scope: !811, file: !2, line: 1310, type: !367)
!816 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !811, file: !2, line: 1310, type: !256)
!817 = !DILocalVariable(name: "prev_block", arg: 3, scope: !811, file: !2, line: 1311, type: !245)
!818 = !DILocalVariable(name: "curr_block", arg: 4, scope: !811, file: !2, line: 1311, type: !245)
!819 = !DILocalVariable(name: "i", scope: !820, file: !2, line: 1334, type: !256)
!820 = distinct !DILexicalBlock(scope: !821, file: !2, line: 1334, column: 7)
!821 = distinct !DILexicalBlock(scope: !822, file: !2, line: 1332, column: 5)
!822 = distinct !DILexicalBlock(scope: !811, file: !2, line: 1316, column: 7)
!823 = !DILocalVariable(name: "datum_width", scope: !824, file: !2, line: 1336, type: !158)
!824 = distinct !DILexicalBlock(scope: !825, file: !2, line: 1335, column: 9)
!825 = distinct !DILexicalBlock(scope: !820, file: !2, line: 1334, column: 7)
!826 = !DILocalVariable(name: "fields_per_block", scope: !824, file: !2, line: 1337, type: !256)
!827 = !DILocalVariable(name: "blank_fields", scope: !824, file: !2, line: 1338, type: !256)
!828 = !DILocalVariable(name: "field_width", scope: !829, file: !2, line: 1349, type: !158)
!829 = distinct !DILexicalBlock(scope: !830, file: !2, line: 1347, column: 13)
!830 = distinct !DILexicalBlock(scope: !824, file: !2, line: 1346, column: 15)
!831 = !DILocalVariable(name: "f", scope: !832, file: !2, line: 1350, type: !256)
!832 = distinct !DILexicalBlock(scope: !829, file: !2, line: 1350, column: 15)
!833 = !DILocalVariable(name: "pad_width", scope: !829, file: !2, line: 1352, type: !256)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !811, file: !2, line: 1314, type: !360, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1327, type: !24, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !499, isLocal: true, isDefinition: true)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !853, !854, !855, !856, !860, !863, !866, !867, !869, !872, !873, !875, !878, !879}
!841 = !DILocalVariable(name: "argc", arg: 1, scope: !155, file: !2, line: 1677, type: !158)
!842 = !DILocalVariable(name: "argv", arg: 2, scope: !155, file: !2, line: 1677, type: !159)
!843 = !DILocalVariable(name: "n_files", scope: !155, file: !2, line: 1679, type: !158)
!844 = !DILocalVariable(name: "l_c_m", scope: !155, file: !2, line: 1680, type: !158)
!845 = !DILocalVariable(name: "desired_width", scope: !155, file: !2, line: 1681, type: !256)
!846 = !DILocalVariable(name: "modern", scope: !155, file: !2, line: 1682, type: !360)
!847 = !DILocalVariable(name: "ok", scope: !155, file: !2, line: 1683, type: !360)
!848 = !DILocalVariable(name: "width_per_block", scope: !155, file: !2, line: 1684, type: !256)
!849 = !DILocalVariable(name: "max_bytes_to_format", scope: !155, file: !2, line: 1689, type: !367)
!850 = !DILocalVariable(name: "pseudo_start", scope: !155, file: !2, line: 1693, type: !367)
!851 = !DILocalVariable(name: "tmp", scope: !852, file: !2, line: 1705, type: !367)
!852 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1704, column: 5)
!853 = !DILocalVariable(name: "s_err", scope: !852, file: !2, line: 1706, type: !163)
!854 = !DILocalVariable(name: "oi", scope: !852, file: !2, line: 1707, type: !158)
!855 = !DILocalVariable(name: "c", scope: !852, file: !2, line: 1708, type: !158)
!856 = !DILocalVariable(name: "i", scope: !857, file: !2, line: 1769, type: !256)
!857 = distinct !DILexicalBlock(scope: !858, file: !2, line: 1765, column: 13)
!858 = distinct !DILexicalBlock(scope: !859, file: !2, line: 1762, column: 15)
!859 = distinct !DILexicalBlock(scope: !852, file: !2, line: 1713, column: 9)
!860 = !DILocalVariable(name: "w_tmp", scope: !861, file: !2, line: 1847, type: !367)
!861 = distinct !DILexicalBlock(scope: !862, file: !2, line: 1846, column: 13)
!862 = distinct !DILexicalBlock(scope: !859, file: !2, line: 1841, column: 15)
!863 = !DILocalVariable(name: "o1", scope: !864, file: !2, line: 1894, type: !367)
!864 = distinct !DILexicalBlock(scope: !865, file: !2, line: 1893, column: 5)
!865 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1892, column: 7)
!866 = !DILocalVariable(name: "o2", scope: !864, file: !2, line: 1895, type: !367)
!867 = !DILocalVariable(name: "i", scope: !868, file: !2, line: 2027, type: !256)
!868 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2027, column: 3)
!869 = !DILocalVariable(name: "fields_per_block", scope: !870, file: !2, line: 2029, type: !256)
!870 = distinct !DILexicalBlock(scope: !871, file: !2, line: 2028, column: 5)
!871 = distinct !DILexicalBlock(scope: !868, file: !2, line: 2027, column: 3)
!872 = !DILocalVariable(name: "block_width", scope: !870, file: !2, line: 2032, type: !256)
!873 = !DILocalVariable(name: "i", scope: !874, file: !2, line: 2036, type: !256)
!874 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2036, column: 3)
!875 = !DILocalVariable(name: "fields_per_block", scope: !876, file: !2, line: 2038, type: !256)
!876 = distinct !DILexicalBlock(scope: !877, file: !2, line: 2037, column: 5)
!877 = distinct !DILexicalBlock(scope: !874, file: !2, line: 2036, column: 3)
!878 = !DILocalVariable(name: "block_width", scope: !876, file: !2, line: 2039, type: !256)
!879 = !DILabel(scope: !155, name: "cleanup", file: !2, line: 2058)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 120, elements: !354)
!881 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!882 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!883 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!884 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!885 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!886 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!887 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!888 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !891, line: 3, type: !353, isLocal: true, isDefinition: true)
!891 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "Version", scope: !894, file: !891, line: 3, type: !245, isLocal: false, isDefinition: true)
!894 = distinct !DICompileUnit(language: DW_LANG_C11, file: !891, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !895, splitDebugInlining: false, nameTableKind: None)
!895 = !{!889, !892}
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !898, file: !899, line: 65, type: !923, isLocal: false, isDefinition: true)
!898 = distinct !DICompileUnit(language: DW_LANG_C11, file: !899, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !900, retainedTypes: !903, globals: !904, splitDebugInlining: false, nameTableKind: None)
!899 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!900 = !{!901}
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !902, line: 42, baseType: !165, size: 32, elements: !227)
!902 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!903 = !{!240, !245, !251}
!904 = !{!896, !905, !907, !909, !914, !919, !921}
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !899, line: 141, type: !523, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !899, line: 141, type: !586, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !899, line: 142, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 29)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !899, line: 160, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 21)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !899, line: 165, type: !528, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !899, line: 170, type: !492, isLocal: true, isDefinition: true)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !924, line: 69, baseType: !925)
!924 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "file_name", scope: !930, file: !931, line: 45, type: !245, isLocal: true, isDefinition: true)
!930 = distinct !DICompileUnit(language: DW_LANG_C11, file: !931, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !932, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!932 = !{!933, !935, !937, !939, !928, !941}
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !931, line: 121, type: !523, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !931, line: 121, type: !593, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !931, line: 123, type: !523, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !931, line: 126, type: !24, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !930, file: !931, line: 55, type: !360, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !945, file: !946, line: 66, type: !925, isLocal: false, isDefinition: true)
!945 = distinct !DICompileUnit(language: DW_LANG_C11, file: !946, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !947, globals: !948, splitDebugInlining: false, nameTableKind: None)
!946 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!947 = !{!240, !251}
!948 = !{!949, !951, !970, !972, !974, !976, !943, !978, !980, !982, !984, !986}
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !946, line: 272, type: !492, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "old_file_name", scope: !953, file: !946, line: 304, type: !245, isLocal: true, isDefinition: true)
!953 = distinct !DISubprogram(name: "verror_at_line", scope: !946, file: !946, line: 298, type: !954, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !945, retainedNodes: !963)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !158, !158, !245, !165, !245, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !958)
!958 = !{!959, !960, !961, !962}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !957, file: !946, baseType: !165, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !957, file: !946, baseType: !165, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !957, file: !946, baseType: !240, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !957, file: !946, baseType: !240, size: 64, offset: 128)
!963 = !{!964, !965, !966, !967, !968, !969}
!964 = !DILocalVariable(name: "status", arg: 1, scope: !953, file: !946, line: 298, type: !158)
!965 = !DILocalVariable(name: "errnum", arg: 2, scope: !953, file: !946, line: 298, type: !158)
!966 = !DILocalVariable(name: "file_name", arg: 3, scope: !953, file: !946, line: 298, type: !245)
!967 = !DILocalVariable(name: "line_number", arg: 4, scope: !953, file: !946, line: 298, type: !165)
!968 = !DILocalVariable(name: "message", arg: 5, scope: !953, file: !946, line: 298, type: !245)
!969 = !DILocalVariable(name: "args", arg: 6, scope: !953, file: !946, line: 298, type: !956)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "old_line_number", scope: !953, file: !946, line: 305, type: !165, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !946, line: 338, type: !499, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !946, line: 346, type: !528, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !946, line: 346, type: !287, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "error_message_count", scope: !945, file: !946, line: 69, type: !165, isLocal: false, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !945, file: !946, line: 295, type: !158, isLocal: false, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !946, line: 208, type: !523, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !946, line: 208, type: !916, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !946, line: 214, type: !492, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "program_name", scope: !990, file: !991, line: 31, type: !245, isLocal: false, isDefinition: true)
!990 = distinct !DICompileUnit(language: DW_LANG_C11, file: !991, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !992, globals: !993, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!992 = !{!240, !160}
!993 = !{!988, !994, !996}
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !991, line: 46, type: !528, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !991, line: 49, type: !499, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1000, file: !1001, line: 46, type: !1028, isLocal: true, isDefinition: true)
!1000 = distinct !DISubprogram(name: "proper_name_lite", scope: !1001, file: !1001, line: 38, type: !1002, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1004, retainedNodes: !1006)
!1001 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!245, !245, !245}
!1004 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1001, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1005, splitDebugInlining: false, nameTableKind: None)
!1005 = !{!998}
!1006 = !{!1007, !1008, !1009, !1010, !1015}
!1007 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1000, file: !1001, line: 38, type: !245)
!1008 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1000, file: !1001, line: 38, type: !245)
!1009 = !DILocalVariable(name: "translation", scope: !1000, file: !1001, line: 40, type: !245)
!1010 = !DILocalVariable(name: "w", scope: !1000, file: !1001, line: 47, type: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1012, line: 37, baseType: !1013)
!1012 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !370, line: 57, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !370, line: 42, baseType: !165)
!1015 = !DILocalVariable(name: "mbs", scope: !1000, file: !1001, line: 48, type: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1017, line: 6, baseType: !1018)
!1017 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1019, line: 21, baseType: !1020)
!1019 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1019, line: 13, size: 64, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1020, file: !1019, line: 15, baseType: !158, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1020, file: !1019, line: 20, baseType: !1024, size: 32, offset: 32)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !1019, line: 16, size: 32, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1024, file: !1019, line: 18, baseType: !165, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1024, file: !1019, line: 19, baseType: !499, size: 32)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 16, elements: !288)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 78, type: !528, isLocal: true, isDefinition: true)
!1031 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 79, type: !504, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 80, type: !323, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 81, type: !323, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 82, type: !443, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 83, type: !287, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 84, type: !528, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 85, type: !523, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 86, type: !523, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 87, type: !528, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1052, file: !1031, line: 76, type: !1124, isLocal: false, isDefinition: true)
!1052 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1031, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1053, retainedTypes: !1059, globals: !1060, splitDebugInlining: false, nameTableKind: None)
!1053 = !{!901, !1054, !210}
!1054 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !902, line: 254, baseType: !165, size: 32, elements: !1055)
!1055 = !{!1056, !1057, !1058}
!1056 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1057 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1058 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1059 = !{!240, !158, !247, !248}
!1060 = !{!1029, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1061, !1065, !1075, !1077, !1082, !1084, !1086, !1088, !1090, !1113, !1120, !1122}
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1052, file: !1031, line: 92, type: !1063, isLocal: false, isDefinition: true)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 320, elements: !271)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1052, file: !1031, line: 1040, type: !1067, isLocal: false, isDefinition: true)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1031, line: 56, size: 448, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1073, !1074}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1067, file: !1031, line: 59, baseType: !901, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1067, file: !1031, line: 62, baseType: !158, size: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1067, file: !1031, line: 66, baseType: !1072, size: 256, offset: 64)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 256, elements: !529)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1067, file: !1031, line: 69, baseType: !245, size: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1067, file: !1031, line: 72, baseType: !245, size: 64, offset: 384)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1052, file: !1031, line: 107, type: !1067, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "slot0", scope: !1052, file: !1031, line: 831, type: !1079, isLocal: true, isDefinition: true)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 256)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 321, type: !287, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 357, type: !287, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 358, type: !287, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 199, type: !523, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "quote", scope: !1092, file: !1031, line: 228, type: !1111, isLocal: true, isDefinition: true)
!1092 = distinct !DISubprogram(name: "gettext_quote", scope: !1031, file: !1031, line: 197, type: !1093, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1052, retainedNodes: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!245, !245, !901}
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DILocalVariable(name: "msgid", arg: 1, scope: !1092, file: !1031, line: 197, type: !245)
!1097 = !DILocalVariable(name: "s", arg: 2, scope: !1092, file: !1031, line: 197, type: !901)
!1098 = !DILocalVariable(name: "translation", scope: !1092, file: !1031, line: 199, type: !245)
!1099 = !DILocalVariable(name: "w", scope: !1092, file: !1031, line: 229, type: !1011)
!1100 = !DILocalVariable(name: "mbs", scope: !1092, file: !1031, line: 230, type: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1017, line: 6, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1019, line: 21, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1019, line: 13, size: 64, elements: !1104)
!1104 = !{!1105, !1106}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1103, file: !1019, line: 15, baseType: !158, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1103, file: !1019, line: 20, baseType: !1107, size: 32, offset: 32)
!1107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1103, file: !1019, line: 16, size: 32, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1107, file: !1019, line: 18, baseType: !165, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1107, file: !1019, line: 19, baseType: !499, size: 32)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 64, elements: !1112)
!1112 = !{!289, !501}
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(name: "slotvec", scope: !1052, file: !1031, line: 834, type: !1115, isLocal: true, isDefinition: true)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1031, line: 823, size: 128, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !1031, line: 825, baseType: !248, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1116, file: !1031, line: 826, baseType: !160, size: 64, offset: 64)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "nslots", scope: !1052, file: !1031, line: 832, type: !158, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1052, file: !1031, line: 833, type: !1116, isLocal: true, isDefinition: true)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 704, elements: !604)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 67, type: !593, isLocal: true, isDefinition: true)
!1127 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 69, type: !523, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 83, type: !523, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 83, type: !499, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 85, type: !287, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 88, type: !1138, isLocal: true, isDefinition: true)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1139)
!1139 = !{!1140}
!1140 = !DISubrange(count: 171)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 88, type: !1143, isLocal: true, isDefinition: true)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1144)
!1144 = !{!1145}
!1145 = !DISubrange(count: 34)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 105, type: !567, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 109, type: !662, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 113, type: !1152, isLocal: true, isDefinition: true)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 28)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 120, type: !796, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 127, type: !1159, isLocal: true, isDefinition: true)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1160)
!1160 = !{!1161}
!1161 = !DISubrange(count: 36)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 134, type: !547, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 142, type: !110, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 150, type: !1168, isLocal: true, isDefinition: true)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1169)
!1169 = !{!1170}
!1170 = !DISubrange(count: 48)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 159, type: !1173, isLocal: true, isDefinition: true)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1174)
!1174 = !{!1175}
!1175 = !DISubrange(count: 52)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 170, type: !95, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 248, type: !443, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 248, type: !572, isLocal: true, isDefinition: true)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 254, type: !443, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 254, type: !318, isLocal: true, isDefinition: true)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 254, type: !547, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 259, type: !3, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1127, line: 259, type: !911, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1194, file: !1195, line: 26, type: !1197, isLocal: false, isDefinition: true)
!1194 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1195, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1196, splitDebugInlining: false, nameTableKind: None)
!1195 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1196 = !{!1192}
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 376, elements: !1198)
!1198 = !{!1199}
!1199 = !DISubrange(count: 47)
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 34, type: !24, isLocal: true, isDefinition: true)
!1202 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 34, type: !523, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 34, type: !333, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 47, type: !523, isLocal: true, isDefinition: true)
!1209 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1209, line: 47, type: !796, isLocal: true, isDefinition: true)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1214, file: !1215, line: 24, type: !1217, isLocal: false, isDefinition: true)
!1214 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1215, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1216, splitDebugInlining: false, nameTableKind: None)
!1215 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1216 = !{!1212}
!1217 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(scope: null, file: !1220, line: 60, type: !586, isLocal: true, isDefinition: true)
!1220 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(scope: null, file: !1220, line: 65, type: !100, isLocal: true, isDefinition: true)
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(scope: null, file: !1220, line: 69, type: !911, isLocal: true, isDefinition: true)
!1225 = !DIGlobalVariableExpression(var: !1226, expr: !DIExpression())
!1226 = distinct !DIGlobalVariable(scope: null, file: !1220, line: 73, type: !24, isLocal: true, isDefinition: true)
!1227 = !DIGlobalVariableExpression(var: !1228, expr: !DIExpression())
!1228 = distinct !DIGlobalVariable(scope: null, file: !1220, line: 86, type: !523, isLocal: true, isDefinition: true)
!1229 = !DIGlobalVariableExpression(var: !1230, expr: !DIExpression())
!1230 = distinct !DIGlobalVariable(scope: null, file: !1231, line: 108, type: !265, isLocal: true, isDefinition: true)
!1231 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(name: "internal_state", scope: !1234, file: !1231, line: 97, type: !1237, isLocal: true, isDefinition: true)
!1234 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1231, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1235, globals: !1236, splitDebugInlining: false, nameTableKind: None)
!1235 = !{!240, !248, !251}
!1236 = !{!1229, !1232}
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1017, line: 6, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1019, line: 21, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1019, line: 13, size: 64, elements: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1239, file: !1019, line: 15, baseType: !158, size: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1239, file: !1019, line: 20, baseType: !1243, size: 32, offset: 32)
!1243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1239, file: !1019, line: 16, size: 32, elements: !1244)
!1244 = !{!1245, !1246}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1243, file: !1019, line: 18, baseType: !165, size: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1243, file: !1019, line: 19, baseType: !499, size: 32)
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(scope: null, file: !1249, line: 4617, type: !499, isLocal: true, isDefinition: true)
!1249 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1249, line: 5292, type: !504, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(name: "decimal_format", scope: !1254, file: !1249, line: 5889, type: !1715, isLocal: true, isDefinition: true)
!1254 = distinct !DISubprogram(name: "vasnprintf", scope: !1249, file: !1249, line: 2459, type: !1255, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1265, retainedNodes: !1800)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!160, !160, !1257, !245, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1259, file: !1249, baseType: !165, size: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1259, file: !1249, baseType: !165, size: 32, offset: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1259, file: !1249, baseType: !240, size: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1259, file: !1249, baseType: !240, size: 64, offset: 128)
!1265 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1249, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-vasnprintf.o -MD -MP -MF lib/.deps/libcoreutils_a-vasnprintf.Tpo -c lib/vasnprintf.c -o lib/.libcoreutils_a-vasnprintf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1266, retainedTypes: !1703, globals: !1712, splitDebugInlining: false, nameTableKind: None)
!1266 = !{!1267, !1317}
!1267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1268, line: 47, baseType: !165, size: 32, elements: !1269)
!1268 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1269 = !{!1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!1270 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1271 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1272 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1273 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1274 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1275 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1276 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1277 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1278 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1279 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1280 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1281 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1282 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1283 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1284 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1285 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1286 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1287 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1288 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1289 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1290 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1291 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1292 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1293 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1294 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1295 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1296 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1297 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1298 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1299 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1300 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1301 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1302 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1303 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1304 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1305 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1306 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1307 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1308 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1309 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1310 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1311 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1312 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1313 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1314 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1315 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1316 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1317 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1318, line: 41, baseType: !165, size: 32, elements: !1319)
