; ModuleID = 'src/pinky.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }


!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 18, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!174 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !64, !69, !74, !79, !84, !89, !94, !99, !104, !179, !181, !186, !191, !196, !198, !201, !283, !288, !290, !295, !297, !299, !301, !303, !308, !310, !312, !314, !319, !324, !326, !328, !330, !332, !334, !336, !338, !343, !348, !350, !352, !354, !356, !358, !360, !365, !367, !369, !374, !379, !381, !383, !385, !387, !106, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !535, !537, !539, !541, !543, !545, !562, !564, !566, !568, !570, !593, !595, !600, !602, !604, !606, !608, !610, !612, !614, !619, !621}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !86, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 17)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 16)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 12)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !56, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "do_lookup", scope: !108, file: !2, line: 68, type: !200, isLocal: true, isDefinition: true)
!200 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !203, file: !115, line: 575, type: !116, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "oputs_", scope: !115, file: !115, line: 573, type: !204, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !206)
!204 = !DISubroutineType(cc: DW_CC_nocall, types: !205)
!205 = !{null, !175, !175}
!206 = !{!207, !208, !209, !212, !213, !214, !215, !219, !220, !221, !222, !224, !277, !278, !279, !281, !282}
!207 = !DILocalVariable(name: "program", arg: 1, scope: !203, file: !115, line: 573, type: !175)
!208 = !DILocalVariable(name: "option", arg: 2, scope: !203, file: !115, line: 573, type: !175)
!209 = !DILocalVariable(name: "term", scope: !210, file: !115, line: 585, type: !175)
!210 = distinct !DILexicalBlock(scope: !211, file: !115, line: 582, column: 5)
!211 = distinct !DILexicalBlock(scope: !203, file: !115, line: 581, column: 7)
!212 = !DILocalVariable(name: "double_space", scope: !203, file: !115, line: 594, type: !200)
!213 = !DILocalVariable(name: "first_word", scope: !203, file: !115, line: 595, type: !175)
!214 = !DILocalVariable(name: "option_text", scope: !203, file: !115, line: 596, type: !175)
!215 = !DILocalVariable(name: "s", scope: !216, file: !115, line: 608, type: !175)
!216 = distinct !DILexicalBlock(scope: !217, file: !115, line: 605, column: 5)
!217 = distinct !DILexicalBlock(scope: !218, file: !115, line: 604, column: 12)
!218 = distinct !DILexicalBlock(scope: !203, file: !115, line: 597, column: 7)
!219 = !DILocalVariable(name: "spaces", scope: !216, file: !115, line: 609, type: !172)
!220 = !DILocalVariable(name: "anchor_len", scope: !203, file: !115, line: 620, type: !172)
!221 = !DILocalVariable(name: "desc_text", scope: !203, file: !115, line: 625, type: !175)
!222 = !DILocalVariable(name: "__ptr", scope: !223, file: !115, line: 644, type: !175)
!223 = distinct !DILexicalBlock(scope: !203, file: !115, line: 644, column: 3)
!224 = !DILocalVariable(name: "__stream", scope: !223, file: !115, line: 644, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !227, line: 7, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !229, line: 49, size: 1728, elements: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !246, !248, !249, !250, !254, !255, !257, !258, !261, !263, !266, !269, !270, !271, !272, !273}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !228, file: !229, line: 51, baseType: !116, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !228, file: !229, line: 54, baseType: !169, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !228, file: !229, line: 55, baseType: !169, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !228, file: !229, line: 56, baseType: !169, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !228, file: !229, line: 57, baseType: !169, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !228, file: !229, line: 58, baseType: !169, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !228, file: !229, line: 59, baseType: !169, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !228, file: !229, line: 60, baseType: !169, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !228, file: !229, line: 61, baseType: !169, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !228, file: !229, line: 64, baseType: !169, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !228, file: !229, line: 65, baseType: !169, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !228, file: !229, line: 66, baseType: !169, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !228, file: !229, line: 68, baseType: !244, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !229, line: 36, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !228, file: !229, line: 70, baseType: !247, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !228, file: !229, line: 72, baseType: !116, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !228, file: !229, line: 73, baseType: !116, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !228, file: !229, line: 74, baseType: !251, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !252, line: 152, baseType: !253)
!252 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!253 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !228, file: !229, line: 77, baseType: !171, size: 16, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !228, file: !229, line: 78, baseType: !256, size: 8, offset: 1040)
!256 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !228, file: !229, line: 79, baseType: !91, size: 8, offset: 1048)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !228, file: !229, line: 81, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !229, line: 43, baseType: null)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !228, file: !229, line: 89, baseType: !262, size: 64, offset: 1152)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !252, line: 153, baseType: !253)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !228, file: !229, line: 91, baseType: !264, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !229, line: 37, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !228, file: !229, line: 92, baseType: !267, size: 64, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !229, line: 38, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !228, file: !229, line: 93, baseType: !247, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !228, file: !229, line: 94, baseType: !170, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !228, file: !229, line: 95, baseType: !172, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !228, file: !229, line: 96, baseType: !116, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !228, file: !229, line: 98, baseType: !274, size: 160, offset: 1568)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 20)
!277 = !DILocalVariable(name: "__cnt", scope: !223, file: !115, line: 644, type: !172)
!278 = !DILocalVariable(name: "url_program", scope: !203, file: !115, line: 648, type: !175)
!279 = !DILocalVariable(name: "__ptr", scope: !280, file: !115, line: 686, type: !175)
!280 = distinct !DILexicalBlock(scope: !203, file: !115, line: 686, column: 3)
!281 = !DILocalVariable(name: "__stream", scope: !280, file: !115, line: 686, type: !225)
!282 = !DILocalVariable(name: "__cnt", scope: !280, file: !115, line: 686, type: !172)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !115, line: 585, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 5)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !115, line: 586, type: !285, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !115, line: 595, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 4)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !115, line: 620, type: !19, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !14, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !285, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !292, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 3)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !115, line: 650, type: !285, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !115, line: 652, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 7)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !115, line: 653, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !115, line: 654, type: !96, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !115, line: 655, type: !96, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !115, line: 656, type: !96, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !115, line: 657, type: !96, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !115, line: 663, type: !316, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !115, line: 664, type: !96, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !183, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 40)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 15)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !24, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !115, line: 679, type: !305, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !115, line: 683, type: !285, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !115, line: 688, type: !285, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !115, line: 691, type: !321, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !115, line: 839, type: !188, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !115, line: 840, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 22)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !115, line: 841, type: !345, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !115, line: 862, type: !292, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !115, line: 868, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 71)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !115, line: 875, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 27)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !39, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !193, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !316, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !285, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !321, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "do_short_format", scope: !108, file: !2, line: 65, type: !200, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "include_heading", scope: !108, file: !2, line: 49, type: !200, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "include_fullname", scope: !108, file: !2, line: 52, type: !200, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "include_where", scope: !108, file: !2, line: 72, type: !200, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "include_idle", scope: !108, file: !2, line: 46, type: !200, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "include_project", scope: !108, file: !2, line: 55, type: !200, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "include_plan", scope: !108, file: !2, line: 58, type: !200, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !108, file: !2, line: 62, type: !200, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !305, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 422, type: !345, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !193, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "time_format", scope: !108, file: !2, line: 77, type: !175, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "time_format_width", scope: !108, file: !2, line: 78, type: !116, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !285, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !316, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !285, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !19, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !285, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !19, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !285, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !19, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !285, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !292, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !19, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dev_dirfd", scope: !441, file: !2, line: 212, type: !116, isLocal: true, isDefinition: true)
!441 = distinct !DISubprogram(name: "print_entry", scope: !2, file: !2, line: 200, type: !442, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !473)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !136, line: 92, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !136, line: 65, size: 576, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !461, !465, !466, !468}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !447, file: !136, line: 69, baseType: !169, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !447, file: !136, line: 70, baseType: !169, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !447, file: !136, line: 71, baseType: !169, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !447, file: !136, line: 72, baseType: !169, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !447, file: !136, line: 74, baseType: !454, size: 128, offset: 256)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 11, size: 128, elements: !456)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !454, file: !455, line: 16, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !252, line: 160, baseType: !253)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !454, file: !455, line: 21, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !252, line: 197, baseType: !253)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !447, file: !136, line: 75, baseType: !462, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !463, line: 97, baseType: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !252, line: 154, baseType: !116)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !447, file: !136, line: 76, baseType: !462, size: 32, offset: 416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !447, file: !136, line: 77, baseType: !467, size: 16, offset: 448)
!467 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !447, file: !136, line: 79, baseType: !469, size: 64, offset: 480)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !136, line: 79, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !469, file: !136, line: 79, baseType: !116, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !469, file: !136, line: 79, baseType: !116, size: 32, offset: 32)
!473 = !{!474, !475, !476, !477, !478, !506, !509, !510, !511, !525, !529, !530, !533, !534}
!474 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !441, file: !2, line: 200, type: !444)
!475 = !DILocalVariable(name: "line", scope: !441, file: !2, line: 203, type: !169)
!476 = !DILocalVariable(name: "space", scope: !441, file: !2, line: 204, type: !169)
!477 = !DILocalVariable(name: "dirfd", scope: !441, file: !2, line: 207, type: !116)
!478 = !DILocalVariable(name: "stats", scope: !441, file: !2, line: 222, type: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !480, line: 26, size: 1152, elements: !481)
!480 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!481 = !{!482, !484, !486, !488, !490, !492, !494, !495, !496, !497, !499, !501, !502, !503, !504}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !479, file: !480, line: 31, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !252, line: 145, baseType: !174)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !479, file: !480, line: 36, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !252, line: 148, baseType: !174)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !479, file: !480, line: 44, baseType: !487, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !252, line: 151, baseType: !174)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !479, file: !480, line: 45, baseType: !489, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !252, line: 150, baseType: !111)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !479, file: !480, line: 47, baseType: !491, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !252, line: 146, baseType: !111)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !479, file: !480, line: 48, baseType: !493, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !252, line: 147, baseType: !111)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !479, file: !480, line: 50, baseType: !116, size: 32, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !479, file: !480, line: 52, baseType: !483, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !479, file: !480, line: 57, baseType: !251, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !479, file: !480, line: 61, baseType: !498, size: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !252, line: 175, baseType: !253)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !479, file: !480, line: 63, baseType: !500, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !252, line: 180, baseType: !253)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !479, file: !480, line: 74, baseType: !454, size: 128, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !479, file: !480, line: 75, baseType: !454, size: 128, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !479, file: !480, line: 76, baseType: !454, size: 128, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !479, file: !480, line: 89, baseType: !505, size: 192, offset: 960)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 192, elements: !306)
!506 = !DILocalVariable(name: "last_change", scope: !441, file: !2, line: 223, type: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !508, line: 10, baseType: !458)
!508 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!509 = !DILocalVariable(name: "mesg", scope: !441, file: !2, line: 224, type: !4)
!510 = !DILocalVariable(name: "ut_user", scope: !441, file: !2, line: 236, type: !169)
!511 = !DILocalVariable(name: "pw", scope: !512, file: !2, line: 244, type: !514)
!512 = distinct !DILexicalBlock(scope: !513, file: !2, line: 243, column: 5)
!513 = distinct !DILexicalBlock(scope: !441, file: !2, line: 242, column: 7)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !516, line: 49, size: 384, elements: !517)
!516 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!517 = !{!518, !519, !520, !521, !522, !523, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !515, file: !516, line: 51, baseType: !169, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !515, file: !516, line: 52, baseType: !169, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !515, file: !516, line: 54, baseType: !491, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !515, file: !516, line: 55, baseType: !493, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !515, file: !516, line: 56, baseType: !169, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !515, file: !516, line: 57, baseType: !169, size: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !515, file: !516, line: 58, baseType: !169, size: 64, offset: 320)
!525 = !DILocalVariable(name: "comma", scope: !526, file: !2, line: 250, type: !528)
!526 = distinct !DILexicalBlock(scope: !527, file: !2, line: 249, column: 9)
!527 = distinct !DILexicalBlock(scope: !512, file: !2, line: 245, column: 11)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!529 = !DILocalVariable(name: "result", scope: !526, file: !2, line: 255, type: !169)
!530 = !DILocalVariable(name: "ut_host", scope: !531, file: !2, line: 282, type: !169)
!531 = distinct !DILexicalBlock(scope: !532, file: !2, line: 281, column: 5)
!532 = distinct !DILexicalBlock(scope: !441, file: !2, line: 280, column: 7)
!533 = !DILocalVariable(name: "display", scope: !531, file: !2, line: 285, type: !169)
!534 = !DILocalVariable(name: "host", scope: !531, file: !2, line: 289, type: !169)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !285, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !19, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !193, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !96, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !19, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "now", scope: !547, file: !2, line: 158, type: !507, isLocal: true, isDefinition: true)
!547 = distinct !DISubprogram(name: "idle_string", scope: !2, file: !2, line: 156, type: !548, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{!175, !507}
!550 = !{!551, !552, !553, !556, !557}
!551 = !DILocalVariable(name: "when", arg: 1, scope: !547, file: !2, line: 156, type: !507)
!552 = !DILocalVariable(name: "seconds_idle", scope: !547, file: !2, line: 164, type: !507)
!553 = !DILocalVariable(name: "hours", scope: !554, file: !2, line: 169, type: !116)
!554 = distinct !DILexicalBlock(scope: !555, file: !2, line: 168, column: 5)
!555 = distinct !DILexicalBlock(scope: !547, file: !2, line: 167, column: 7)
!556 = !DILocalVariable(name: "minutes", scope: !554, file: !2, line: 170, type: !116)
!557 = !DILocalVariable(name: "days", scope: !558, file: !2, line: 175, type: !559)
!558 = distinct !DILexicalBlock(scope: !555, file: !2, line: 174, column: 5)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !560, line: 101, baseType: !561)
!560 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !252, line: 72, baseType: !253)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "buf", scope: !547, file: !2, line: 159, type: !362, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !19, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !96, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !285, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "buf", scope: !572, file: !2, line: 185, type: !9, isLocal: true, isDefinition: true)
!572 = distinct !DISubprogram(name: "time_string", scope: !2, file: !2, line: 183, type: !573, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !575)
!573 = !DISubroutineType(types: !574)
!574 = !{!175, !444}
!575 = !{!576, !577}
!576 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !572, file: !2, line: 183, type: !444)
!577 = !DILocalVariable(name: "tmp", scope: !572, file: !2, line: 186, type: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !580, line: 7, size: 448, elements: !581)
!580 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !579, file: !580, line: 9, baseType: !116, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !579, file: !580, line: 10, baseType: !116, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !579, file: !580, line: 11, baseType: !116, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !579, file: !580, line: 12, baseType: !116, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !579, file: !580, line: 13, baseType: !116, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !579, file: !580, line: 14, baseType: !116, size: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !579, file: !580, line: 15, baseType: !116, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !579, file: !580, line: 16, baseType: !116, size: 32, offset: 224)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !579, file: !580, line: 17, baseType: !116, size: 32, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !579, file: !580, line: 20, baseType: !253, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !579, file: !580, line: 21, baseType: !175, size: 64, offset: 384)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !115, line: 952, type: !193, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 13)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !19, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !345, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !285, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !2, line: 375, type: !193, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 376, type: !19, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !321, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !96, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 9)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !316, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !19, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 1024, elements: !293)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !626, line: 50, size: 256, elements: !627)
!626 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!627 = !{!628, !629, !630, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !626, line: 52, baseType: !175, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !625, file: !626, line: 55, baseType: !116, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !626, line: 56, baseType: !631, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !625, file: !626, line: 57, baseType: !116, size: 32, offset: 192)
!633 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!634 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!635 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!636 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!637 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!638 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!639 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!640 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!641 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 3, type: !345, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "Version", scope: !647, file: !644, line: 3, type: !175, isLocal: false, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !648, splitDebugInlining: false, nameTableKind: None)
!648 = !{!642, !645}
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "last_cherror", scope: !651, file: !652, line: 28, type: !116, isLocal: true, isDefinition: true)
!651 = distinct !DICompileUnit(language: DW_LANG_C11, file: !652, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-canon-host.o -MD -MP -MF lib/.deps/libcoreutils_a-canon-host.Tpo -c lib/canon-host.c -o lib/.libcoreutils_a-canon-host.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !653, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/canon-host.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b27163e4eb904e69bce9c14960126cc5")
!653 = !{!654, !649}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "hints", scope: !656, file: !652, line: 63, type: !664, isLocal: true, isDefinition: true)
!656 = distinct !DISubprogram(name: "canon_host_r", scope: !652, file: !652, line: 61, type: !657, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !651, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{!169, !175, !631}
!659 = !{!660, !661, !662, !685, !686}
!660 = !DILocalVariable(name: "host", arg: 1, scope: !656, file: !652, line: 61, type: !175)
!661 = !DILocalVariable(name: "cherror", arg: 2, scope: !656, file: !652, line: 61, type: !631)
!662 = !DILocalVariable(name: "res", scope: !656, file: !652, line: 66, type: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !665, line: 565, size: 384, elements: !666)
!665 = !DIFile(filename: "/usr/include/netdb.h", directory: "", checksumkind: CSK_MD5, checksum: "dd84cdc2a8dcb66c232d326e9ca8b469")
!666 = !{!667, !668, !669, !670, !671, !675, !683, !684}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !664, file: !665, line: 567, baseType: !116, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !664, file: !665, line: 568, baseType: !116, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !664, file: !665, line: 569, baseType: !116, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !664, file: !665, line: 570, baseType: !116, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !664, file: !665, line: 571, baseType: !672, size: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !673, line: 33, baseType: !674)
!673 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !252, line: 210, baseType: !111)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !664, file: !665, line: 572, baseType: !676, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !673, line: 180, size: 128, elements: !678)
!678 = !{!679, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !677, file: !673, line: 182, baseType: !680, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !681, line: 28, baseType: !171)
!681 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !677, file: !673, line: 183, baseType: !86, size: 112, offset: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !664, file: !665, line: 573, baseType: !169, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !664, file: !665, line: 574, baseType: !663, size: 64, offset: 320)
!685 = !DILocalVariable(name: "status", scope: !656, file: !652, line: 67, type: !116)
!686 = !DILocalVariable(name: "retval", scope: !656, file: !652, line: 69, type: !169)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "file_name", scope: !689, file: !690, line: 45, type: !175, isLocal: true, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !691, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!691 = !{!692, !694, !696, !698, !687, !700}
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !690, line: 121, type: !316, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !690, line: 121, type: !193, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !690, line: 123, type: !316, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !690, line: 126, type: !305, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !689, file: !690, line: 55, type: !200, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !704, file: !705, line: 66, type: !750, isLocal: false, isDefinition: true)
!704 = distinct !DICompileUnit(language: DW_LANG_C11, file: !705, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !706, globals: !707, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!706 = !{!170, !177}
!707 = !{!708, !710, !729, !731, !733, !735, !702, !737, !739, !741, !743, !748}
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !705, line: 272, type: !285, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "old_file_name", scope: !712, file: !705, line: 304, type: !175, isLocal: true, isDefinition: true)
!712 = distinct !DISubprogram(name: "verror_at_line", scope: !705, file: !705, line: 298, type: !713, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !704, retainedNodes: !722)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !116, !116, !175, !111, !175, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !716, file: !705, baseType: !111, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !716, file: !705, baseType: !111, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !716, file: !705, baseType: !170, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !716, file: !705, baseType: !170, size: 64, offset: 128)
!722 = !{!723, !724, !725, !726, !727, !728}
!723 = !DILocalVariable(name: "status", arg: 1, scope: !712, file: !705, line: 298, type: !116)
!724 = !DILocalVariable(name: "errnum", arg: 2, scope: !712, file: !705, line: 298, type: !116)
!725 = !DILocalVariable(name: "file_name", arg: 3, scope: !712, file: !705, line: 298, type: !175)
!726 = !DILocalVariable(name: "line_number", arg: 4, scope: !712, file: !705, line: 298, type: !111)
!727 = !DILocalVariable(name: "message", arg: 5, scope: !712, file: !705, line: 298, type: !175)
!728 = !DILocalVariable(name: "args", arg: 6, scope: !712, file: !705, line: 298, type: !715)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "old_line_number", scope: !712, file: !705, line: 305, type: !111, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !705, line: 338, type: !292, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !705, line: 346, type: !321, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !705, line: 346, type: !14, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "error_message_count", scope: !704, file: !705, line: 69, type: !111, isLocal: false, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !704, file: !705, line: 295, type: !116, isLocal: false, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !705, line: 208, type: !316, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !705, line: 208, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 21)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !705, line: 214, type: !285, isLocal: true, isDefinition: true)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null}
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !755, line: 35, type: !19, isLocal: true, isDefinition: true)
!755 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "program_name", scope: !758, file: !759, line: 31, type: !175, isLocal: false, isDefinition: true)
!758 = distinct !DICompileUnit(language: DW_LANG_C11, file: !759, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !760, globals: !761, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!760 = !{!170, !169}
!761 = !{!756, !762, !764}
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !759, line: 46, type: !321, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !759, line: 49, type: !292, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "utf07FF", scope: !768, file: !769, line: 46, type: !796, isLocal: true, isDefinition: true)
!768 = distinct !DISubprogram(name: "proper_name_lite", scope: !769, file: !769, line: 38, type: !770, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !772, retainedNodes: !774)
!769 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!770 = !DISubroutineType(types: !771)
!771 = !{!175, !175, !175}
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !773, splitDebugInlining: false, nameTableKind: None)
!773 = !{!766}
!774 = !{!775, !776, !777, !778, !783}
!775 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !768, file: !769, line: 38, type: !175)
!776 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !768, file: !769, line: 38, type: !175)
!777 = !DILocalVariable(name: "translation", scope: !768, file: !769, line: 40, type: !175)
!778 = !DILocalVariable(name: "w", scope: !768, file: !769, line: 47, type: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !780, line: 37, baseType: !781)
!780 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !252, line: 57, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !252, line: 42, baseType: !111)
!783 = !DILocalVariable(name: "mbs", scope: !768, file: !769, line: 48, type: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !785, line: 6, baseType: !786)
!785 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !787, line: 21, baseType: !788)
!787 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !787, line: 13, size: 64, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !788, file: !787, line: 15, baseType: !116, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !788, file: !787, line: 20, baseType: !792, size: 32, offset: 32)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !788, file: !787, line: 16, size: 32, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !792, file: !787, line: 18, baseType: !111, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !792, file: !787, line: 19, baseType: !292, size: 32)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 16, elements: !15)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !799, line: 78, type: !321, isLocal: true, isDefinition: true)
!799 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !799, line: 79, type: !19, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !799, line: 80, type: !597, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !799, line: 81, type: !597, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !799, line: 82, type: !274, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !799, line: 83, type: !14, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !799, line: 84, type: !321, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !799, line: 85, type: !316, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !799, line: 86, type: !316, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !799, line: 87, type: !321, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !820, file: !799, line: 76, type: !894, isLocal: false, isDefinition: true)
!820 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !821, retainedTypes: !829, globals: !830, splitDebugInlining: false, nameTableKind: None)
!821 = !{!822, !824, !120}
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !823, line: 42, baseType: !111, size: 32, elements: !144)
!823 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !823, line: 254, baseType: !111, size: 32, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!827 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!828 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!829 = !{!170, !116, !171, !172}
!830 = !{!797, !800, !802, !804, !806, !808, !810, !812, !814, !816, !818, !831, !835, !845, !847, !852, !854, !856, !858, !860, !883, !890, !892}
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !820, file: !799, line: 92, type: !833, isLocal: false, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 320, elements: !97)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !820, file: !799, line: 1040, type: !837, isLocal: false, isDefinition: true)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !799, line: 56, size: 448, elements: !838)
!838 = !{!839, !840, !841, !843, !844}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !837, file: !799, line: 59, baseType: !822, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !837, file: !799, line: 62, baseType: !116, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !837, file: !799, line: 66, baseType: !842, size: 256, offset: 64)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !322)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !837, file: !799, line: 69, baseType: !175, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !837, file: !799, line: 72, baseType: !175, size: 64, offset: 384)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !820, file: !799, line: 107, type: !837, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "slot0", scope: !820, file: !799, line: 831, type: !849, isLocal: true, isDefinition: true)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 256)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !799, line: 321, type: !14, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !799, line: 357, type: !14, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !799, line: 358, type: !14, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !799, line: 199, type: !316, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "quote", scope: !862, file: !799, line: 228, type: !881, isLocal: true, isDefinition: true)
!862 = distinct !DISubprogram(name: "gettext_quote", scope: !799, file: !799, line: 197, type: !863, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !820, retainedNodes: !865)
!863 = !DISubroutineType(types: !864)
!864 = !{!175, !175, !822}
!865 = !{!866, !867, !868, !869, !870}
!866 = !DILocalVariable(name: "msgid", arg: 1, scope: !862, file: !799, line: 197, type: !175)
!867 = !DILocalVariable(name: "s", arg: 2, scope: !862, file: !799, line: 197, type: !822)
!868 = !DILocalVariable(name: "translation", scope: !862, file: !799, line: 199, type: !175)
!869 = !DILocalVariable(name: "w", scope: !862, file: !799, line: 229, type: !779)
!870 = !DILocalVariable(name: "mbs", scope: !862, file: !799, line: 230, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !785, line: 6, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !787, line: 21, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !787, line: 13, size: 64, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !873, file: !787, line: 15, baseType: !116, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !873, file: !787, line: 20, baseType: !877, size: 32, offset: 32)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !873, file: !787, line: 16, size: 32, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !877, file: !787, line: 18, baseType: !111, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !877, file: !787, line: 19, baseType: !292, size: 32)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !882)
!882 = !{!16, !294}
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "slotvec", scope: !820, file: !799, line: 834, type: !885, isLocal: true, isDefinition: true)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !799, line: 823, size: 128, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !886, file: !799, line: 825, baseType: !172, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !886, file: !799, line: 826, baseType: !169, size: 64, offset: 64)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "nslots", scope: !820, file: !799, line: 832, type: !116, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "slotvec0", scope: !820, file: !799, line: 833, type: !886, isLocal: true, isDefinition: true)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 704, elements: !896)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!896 = !{!897}
!897 = !DISubrange(count: 11)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !900, line: 347, type: !86, isLocal: true, isDefinition: true)
!900 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !900, line: 398, type: !616, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !900, line: 399, type: !14, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !900, line: 446, type: !316, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !900, line: 447, type: !91, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !911, line: 98, type: !912, isLocal: true, isDefinition: true)
!911 = !DIFile(filename: "lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 29)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !911, line: 99, type: !912, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !911, line: 100, type: !745, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !911, line: 40, type: !597, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !911, line: 40, type: !305, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !925, line: 67, type: !193, isLocal: true, isDefinition: true)
!925 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !925, line: 69, type: !316, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !925, line: 83, type: !316, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !925, line: 83, type: !292, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !925, line: 85, type: !14, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !925, line: 88, type: !936, isLocal: true, isDefinition: true)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 171)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !925, line: 88, type: !941, isLocal: true, isDefinition: true)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 34)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !925, line: 105, type: !188, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !925, line: 109, type: !948, isLocal: true, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 23)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !925, line: 113, type: !953, isLocal: true, isDefinition: true)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 28)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !925, line: 120, type: !958, isLocal: true, isDefinition: true)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 32)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !925, line: 127, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 36)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !925, line: 134, type: !340, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !925, line: 142, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 44)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !925, line: 150, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 48)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !925, line: 159, type: !51, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !925, line: 170, type: !982, isLocal: true, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 60)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !925, line: 248, type: !274, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !925, line: 248, type: !362, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !925, line: 254, type: !274, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !925, line: 254, type: !86, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !925, line: 254, type: !340, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !925, line: 259, type: !3, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !925, line: 259, type: !912, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1001, file: !1002, line: 26, type: !1004, isLocal: false, isDefinition: true)
!1001 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1002, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1003, splitDebugInlining: false, nameTableKind: None)
!1002 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1003 = !{!999}
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 376, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 47)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1009, file: !1010, line: 24, type: !1012, isLocal: false, isDefinition: true)
!1009 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1010, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1011, splitDebugInlining: false, nameTableKind: None)
!1010 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1011 = !{!1007}
!1012 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !1015, line: 34, type: !305, isLocal: true, isDefinition: true)
!1015 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !1015, line: 34, type: !316, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !1015, line: 34, type: !183, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !1022, line: 108, type: !91, isLocal: true, isDefinition: true)
!1022 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "internal_state", scope: !1025, file: !1022, line: 97, type: !1028, isLocal: true, isDefinition: true)
!1025 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1022, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1026, globals: !1027, splitDebugInlining: false, nameTableKind: None)
!1026 = !{!170, !172, !177}
!1027 = !{!1020, !1023}
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !785, line: 6, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !787, line: 21, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !787, line: 13, size: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1030, file: !787, line: 15, baseType: !116, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1030, file: !787, line: 20, baseType: !1034, size: 32, offset: 32)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1030, file: !787, line: 16, size: 32, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1034, file: !787, line: 18, baseType: !111, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1034, file: !787, line: 19, baseType: !292, size: 32)
!1038 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1039, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1040, splitDebugInlining: false, nameTableKind: None)
!1039 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1040 = !{!1041}
!1041 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1042, line: 44, baseType: !111, size: 32, elements: !161)
!1042 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!1043 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1044, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-filenamecat.o -MD -MP -MF lib/.deps/libcoreutils_a-filenamecat.Tpo -c lib/filenamecat.c -o lib/.libcoreutils_a-filenamecat.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1045, splitDebugInlining: false, nameTableKind: None)
!1044 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!1045 = !{!170}
!1046 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1047, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-filenamecat-lgpl.o -MD -MP -MF lib/.deps/libcoreutils_a-filenamecat-lgpl.Tpo -c lib/filenamecat-lgpl.c -o lib/.libcoreutils_a-filenamecat-lgpl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1045, splitDebugInlining: false, nameTableKind: None)
!1047 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!1048 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1049, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1049 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1050 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1051, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-full-write.o -MD -MP -MF lib/.deps/libcoreutils_a-full-write.Tpo -c lib/full-write.c -o lib/.libcoreutils_a-full-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1052, splitDebugInlining: false, nameTableKind: None)
!1051 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!1052 = !{!175}
!1053 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1054, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1054 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1055 = distinct !DICompileUnit(language: DW_LANG_C11, file: !755, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1056, splitDebugInlining: false, nameTableKind: None)
!1056 = !{!1057, !753}
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !755, line: 35, type: !14, isLocal: true, isDefinition: true)
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1060, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-imaxtostr.o -MD -MP -MF lib/.deps/libcoreutils_a-imaxtostr.Tpo -c lib/imaxtostr.c -o lib/.libcoreutils_a-imaxtostr.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1061, splitDebugInlining: false, nameTableKind: None)
!1060 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!1061 = !{!559}
