; ModuleID = 'src/printf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { x86_fp80 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s FORMAT [ARGUMENT]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [73 x i8] c"Print ARGUMENT(s) according to FORMAT, or execute according to OPTION:\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"printf\00", align 1, !dbg !17

!117 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!118 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !123, !125, !127, !132, !134, !139, !141, !146, !77, !148, !232, !237, !239, !244, !249, !254, !256, !258, !260, !262, !264, !266, !268, !273, !275, !277, !279, !281, !286, !291, !296, !301, !303, !305, !307, !309, !311, !316, !318, !320, !325, !330, !335, !340, !342, !344, !346, !348, !351, !356, !358, !363, !365, !367, !372, !374}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 709, type: !19, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 712, type: !64, isLocal: true, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 14)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !74, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 730, type: !74, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 747, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 53)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "exit_status", scope: !79, file: !2, line: 36, type: !114, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !150, file: !151, line: 575, type: !114, isLocal: true, isDefinition: true)
!150 = distinct !DISubprogram(name: "oputs_", scope: !151, file: !151, line: 573, type: !152, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !154)
!151 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!152 = !DISubroutineType(cc: DW_CC_nocall, types: !153)
!153 = !{null, !119, !119}
!154 = !{!155, !156, !157, !160, !162, !163, !164, !168, !169, !170, !171, !173, !226, !227, !228, !230, !231}
!155 = !DILocalVariable(name: "program", arg: 1, scope: !150, file: !151, line: 573, type: !119)
!156 = !DILocalVariable(name: "option", arg: 2, scope: !150, file: !151, line: 573, type: !119)
!157 = !DILocalVariable(name: "term", scope: !158, file: !151, line: 585, type: !119)
!158 = distinct !DILexicalBlock(scope: !159, file: !151, line: 582, column: 5)
!159 = distinct !DILexicalBlock(scope: !150, file: !151, line: 581, column: 7)
!160 = !DILocalVariable(name: "double_space", scope: !150, file: !151, line: 594, type: !161)
!161 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!162 = !DILocalVariable(name: "first_word", scope: !150, file: !151, line: 595, type: !119)
!163 = !DILocalVariable(name: "option_text", scope: !150, file: !151, line: 596, type: !119)
!164 = !DILocalVariable(name: "s", scope: !165, file: !151, line: 608, type: !119)
!165 = distinct !DILexicalBlock(scope: !166, file: !151, line: 605, column: 5)
!166 = distinct !DILexicalBlock(scope: !167, file: !151, line: 604, column: 12)
!167 = distinct !DILexicalBlock(scope: !150, file: !151, line: 597, column: 7)
!168 = !DILocalVariable(name: "spaces", scope: !165, file: !151, line: 609, type: !116)
!169 = !DILocalVariable(name: "anchor_len", scope: !150, file: !151, line: 620, type: !116)
!170 = !DILocalVariable(name: "desc_text", scope: !150, file: !151, line: 625, type: !119)
!171 = !DILocalVariable(name: "__ptr", scope: !172, file: !151, line: 644, type: !119)
!172 = distinct !DILexicalBlock(scope: !150, file: !151, line: 644, column: 3)
!173 = !DILocalVariable(name: "__stream", scope: !172, file: !151, line: 644, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !195, !197, !198, !199, !203, !204, !206, !207, !210, !212, !215, !218, !219, !220, !221, !222}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !178, line: 51, baseType: !114, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !178, line: 36, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !178, line: 70, baseType: !196, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !201, line: 152, baseType: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!202 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !178, line: 43, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !201, line: 153, baseType: !202)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !178, line: 37, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !178, line: 38, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !178, line: 93, baseType: !196, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 20)
!226 = !DILocalVariable(name: "__cnt", scope: !172, file: !151, line: 644, type: !116)
!227 = !DILocalVariable(name: "url_program", scope: !150, file: !151, line: 648, type: !119)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !151, line: 686, type: !119)
!229 = distinct !DILexicalBlock(scope: !150, file: !151, line: 686, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !151, line: 686, type: !174)
!231 = !DILocalVariable(name: "__cnt", scope: !229, file: !151, line: 686, type: !116)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !151, line: 585, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 5)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !151, line: 586, type: !234, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !151, line: 595, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 4)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !151, line: 620, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 6)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !151, line: 648, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !151, line: 648, type: !234, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !151, line: 649, type: !241, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !151, line: 649, type: !136, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !151, line: 650, type: !234, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !151, line: 651, type: !246, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !151, line: 651, type: !246, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !151, line: 652, type: !19, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !151, line: 653, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !151, line: 654, type: !64, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !151, line: 655, type: !64, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !151, line: 656, type: !64, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !151, line: 657, type: !64, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !151, line: 669, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 17)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !151, line: 669, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 40)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !151, line: 676, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 15)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !151, line: 676, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 61)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !151, line: 679, type: !136, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !151, line: 683, type: !234, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !151, line: 688, type: !234, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !151, line: 691, type: !270, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !151, line: 839, type: !74, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !151, line: 840, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 22)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !151, line: 841, type: !293, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !151, line: 862, type: !241, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !151, line: 868, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 71)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !151, line: 875, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 27)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !151, line: 877, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 51)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !151, line: 877, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 12)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !69, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 638, type: !313, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 662, type: !3, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !14, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !79, file: !2, line: 43, type: !350, isLocal: true, isDefinition: true)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 29)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !136, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 35)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !251, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !251, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 37)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 246, type: !337, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 41)
!379 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !382, line: 3, type: !293, isLocal: true, isDefinition: true)
!382 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "Version", scope: !385, file: !382, line: 3, type: !119, isLocal: false, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C11, file: !382, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !386, splitDebugInlining: false, nameTableKind: None)
!386 = !{!380, !383}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "file_name", scope: !389, file: !390, line: 45, type: !119, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !390, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!391 = !{!392, !394, !396, !398, !387, !400}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !19, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !337, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !390, line: 123, type: !19, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !390, line: 126, type: !136, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !389, file: !390, line: 55, type: !161, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !404, file: !405, line: 66, type: !450, isLocal: false, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C11, file: !405, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!406 = !{!112, !121}
!407 = !{!408, !410, !429, !431, !433, !435, !402, !437, !439, !441, !443, !448}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !405, line: 272, type: !234, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "old_file_name", scope: !412, file: !405, line: 304, type: !119, isLocal: true, isDefinition: true)
!412 = distinct !DISubprogram(name: "verror_at_line", scope: !405, file: !405, line: 298, type: !413, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !422)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !114, !114, !119, !83, !119, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !416, file: !405, baseType: !83, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !416, file: !405, baseType: !83, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !416, file: !405, baseType: !112, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !416, file: !405, baseType: !112, size: 64, offset: 128)
!422 = !{!423, !424, !425, !426, !427, !428}
!423 = !DILocalVariable(name: "status", arg: 1, scope: !412, file: !405, line: 298, type: !114)
!424 = !DILocalVariable(name: "errnum", arg: 2, scope: !412, file: !405, line: 298, type: !114)
!425 = !DILocalVariable(name: "file_name", arg: 3, scope: !412, file: !405, line: 298, type: !119)
!426 = !DILocalVariable(name: "line_number", arg: 4, scope: !412, file: !405, line: 298, type: !83)
!427 = !DILocalVariable(name: "message", arg: 5, scope: !412, file: !405, line: 298, type: !119)
!428 = !DILocalVariable(name: "args", arg: 6, scope: !412, file: !405, line: 298, type: !415)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "old_line_number", scope: !412, file: !405, line: 305, type: !83, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !405, line: 338, type: !241, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !270, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !251, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "error_message_count", scope: !404, file: !405, line: 69, type: !83, isLocal: false, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !404, file: !405, line: 295, type: !114, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !19, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 21)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !405, line: 214, type: !234, isLocal: true, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{null}
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "program_name", scope: !455, file: !456, line: 31, type: !119, isLocal: false, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C11, file: !456, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !457, globals: !458, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!457 = !{!112, !113}
!458 = !{!453, !459, !461}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !456, line: 46, type: !270, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !456, line: 49, type: !241, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "utf07FF", scope: !465, file: !466, line: 46, type: !493, isLocal: true, isDefinition: true)
!465 = distinct !DISubprogram(name: "proper_name_lite", scope: !466, file: !466, line: 38, type: !467, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !469, retainedNodes: !471)
!466 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!467 = !DISubroutineType(types: !468)
!468 = !{!119, !119, !119}
!469 = distinct !DICompileUnit(language: DW_LANG_C11, file: !466, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !470, splitDebugInlining: false, nameTableKind: None)
!470 = !{!463}
!471 = !{!472, !473, !474, !475, !480}
!472 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !465, file: !466, line: 38, type: !119)
!473 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !465, file: !466, line: 38, type: !119)
!474 = !DILocalVariable(name: "translation", scope: !465, file: !466, line: 40, type: !119)
!475 = !DILocalVariable(name: "w", scope: !465, file: !466, line: 47, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !477, line: 37, baseType: !478)
!477 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !201, line: 57, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !201, line: 42, baseType: !83)
!480 = !DILocalVariable(name: "mbs", scope: !465, file: !466, line: 48, type: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !482, line: 6, baseType: !483)
!482 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !484, line: 21, baseType: !485)
!484 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 13, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !485, file: !484, line: 15, baseType: !114, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !485, file: !484, line: 20, baseType: !489, size: 32, offset: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !485, file: !484, line: 16, size: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !489, file: !484, line: 18, baseType: !83, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !489, file: !484, line: 19, baseType: !241, size: 32)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 16, elements: !252)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !496, line: 78, type: !270, isLocal: true, isDefinition: true)
!496 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !496, line: 79, type: !246, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !496, line: 80, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 13)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !496, line: 81, type: !501, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !496, line: 82, type: !223, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !496, line: 83, type: !251, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !496, line: 84, type: !270, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !496, line: 85, type: !19, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !496, line: 86, type: !19, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !496, line: 87, type: !270, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !520, file: !496, line: 76, type: !594, isLocal: false, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C11, file: !496, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !521, retainedTypes: !529, globals: !530, splitDebugInlining: false, nameTableKind: None)
!521 = !{!522, !524, !81}
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !523, line: 42, baseType: !83, size: 32, elements: !99)
!523 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!524 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !523, line: 254, baseType: !83, size: 32, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!527 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!528 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!529 = !{!112, !114, !115, !116}
!530 = !{!494, !497, !499, !504, !506, !508, !510, !512, !514, !516, !518, !531, !535, !545, !547, !552, !554, !556, !558, !560, !583, !590, !592}
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !520, file: !496, line: 92, type: !533, isLocal: false, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 320, elements: !65)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !520, file: !496, line: 1040, type: !537, isLocal: false, isDefinition: true)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !496, line: 56, size: 448, elements: !538)
!538 = !{!539, !540, !541, !543, !544}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !537, file: !496, line: 59, baseType: !522, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !537, file: !496, line: 62, baseType: !114, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !537, file: !496, line: 66, baseType: !542, size: 256, offset: 64)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !271)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !537, file: !496, line: 69, baseType: !119, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !537, file: !496, line: 72, baseType: !119, size: 64, offset: 384)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !520, file: !496, line: 107, type: !537, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "slot0", scope: !520, file: !496, line: 831, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 256)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !496, line: 321, type: !251, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !496, line: 357, type: !251, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !496, line: 358, type: !251, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !496, line: 199, type: !19, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "quote", scope: !562, file: !496, line: 228, type: !581, isLocal: true, isDefinition: true)
!562 = distinct !DISubprogram(name: "gettext_quote", scope: !496, file: !496, line: 197, type: !563, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !520, retainedNodes: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{!119, !119, !522}
!565 = !{!566, !567, !568, !569, !570}
!566 = !DILocalVariable(name: "msgid", arg: 1, scope: !562, file: !496, line: 197, type: !119)
!567 = !DILocalVariable(name: "s", arg: 2, scope: !562, file: !496, line: 197, type: !522)
!568 = !DILocalVariable(name: "translation", scope: !562, file: !496, line: 199, type: !119)
!569 = !DILocalVariable(name: "w", scope: !562, file: !496, line: 229, type: !476)
!570 = !DILocalVariable(name: "mbs", scope: !562, file: !496, line: 230, type: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !482, line: 6, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !484, line: 21, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 13, size: 64, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !573, file: !484, line: 15, baseType: !114, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !573, file: !484, line: 20, baseType: !577, size: 32, offset: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !573, file: !484, line: 16, size: 32, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !577, file: !484, line: 18, baseType: !83, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !577, file: !484, line: 19, baseType: !241, size: 32)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !582)
!582 = !{!253, !243}
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "slotvec", scope: !520, file: !496, line: 834, type: !585, isLocal: true, isDefinition: true)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !496, line: 823, size: 128, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !496, line: 825, baseType: !116, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !586, file: !496, line: 826, baseType: !113, size: 64, offset: 64)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "nslots", scope: !520, file: !496, line: 832, type: !114, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "slotvec0", scope: !520, file: !496, line: 833, type: !586, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 704, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 11)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!598 = distinct !DIGlobalVariable(name: "initialized", scope: !599, file: !600, line: 71, type: !114, isLocal: true, isDefinition: true)
!599 = distinct !DISubprogram(name: "unicode_to_mb", scope: !600, file: !600, line: 64, type: !601, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !609, retainedNodes: !682)
!600 = !DIFile(filename: "lib/unicodeio.c", directory: "/src", checksumkind: CSK_MD5, checksum: "34bd73d3f6fd35e045c925e67e34cd2b")
!601 = !DISubroutineType(types: !602)
!602 = !{!202, !83, !603, !606, !112}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!202, !119, !116, !112}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!202, !83, !119, !112}
!609 = distinct !DICompileUnit(language: DW_LANG_C11, file: !600, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-unicodeio.o -MD -MP -MF lib/.deps/libcoreutils_a-unicodeio.Tpo -c lib/unicodeio.c -o lib/.libcoreutils_a-unicodeio.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !610, globals: !649, splitDebugInlining: false, nameTableKind: None)
!610 = !{!611, !613, !614, !116, !615, !112}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !612, line: 29, baseType: !112)
!612 = !DIFile(filename: "/usr/include/iconv.h", directory: "", checksumkind: CSK_MD5, checksum: "694d7c23a6e081413ae05832107726a3")
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !617, file: !178, line: 51, baseType: !114, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !617, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !617, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !617, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !617, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !617, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !617, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !617, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !617, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !617, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !617, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !617, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !617, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !617, file: !178, line: 70, baseType: !633, size: 64, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !617, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !617, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !617, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !617, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !617, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !617, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !617, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !617, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !617, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !617, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !617, file: !178, line: 93, baseType: !633, size: 64, offset: 1344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !617, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !617, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !617, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !617, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!649 = !{!650, !651, !653, !655, !657, !659, !661, !666, !671, !676, !678, !680}
!650 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "is_utf8", scope: !599, file: !600, line: 72, type: !114, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "utf8_to_local", scope: !599, file: !600, line: 74, type: !611, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !600, line: 81, type: !246, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !600, line: 88, type: !246, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !600, line: 99, type: !19, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !600, line: 99, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 26)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !600, line: 109, type: !668, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 23)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !600, line: 178, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 45)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !600, line: 180, type: !9, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !600, line: 195, type: !19, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !600, line: 197, type: !19, isLocal: true, isDefinition: true)
!682 = !{!683, !684, !685, !686, !687, !690, !691, !692, !698, !699, !700, !701, !702}
!683 = !DILocalVariable(name: "code", arg: 1, scope: !599, file: !600, line: 64, type: !83)
!684 = !DILocalVariable(name: "success", arg: 2, scope: !599, file: !600, line: 65, type: !603)
!685 = !DILocalVariable(name: "failure", arg: 3, scope: !599, file: !600, line: 67, type: !606)
!686 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !599, file: !600, line: 69, type: !112)
!687 = !DILocalVariable(name: "charset", scope: !688, file: !600, line: 79, type: !119)
!688 = distinct !DILexicalBlock(scope: !689, file: !600, line: 78, column: 5)
!689 = distinct !DILexicalBlock(scope: !599, file: !600, line: 77, column: 7)
!690 = !DILocalVariable(name: "inbuf", scope: !599, file: !600, line: 106, type: !246)
!691 = !DILocalVariable(name: "count", scope: !599, file: !600, line: 107, type: !114)
!692 = !DILocalVariable(name: "outbuf", scope: !693, file: !600, line: 114, type: !695)
!693 = distinct !DILexicalBlock(scope: !694, file: !600, line: 113, column: 5)
!694 = distinct !DILexicalBlock(scope: !599, file: !600, line: 112, column: 7)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 25)
!698 = !DILocalVariable(name: "inptr", scope: !693, file: !600, line: 115, type: !119)
!699 = !DILocalVariable(name: "inbytesleft", scope: !693, file: !600, line: 116, type: !116)
!700 = !DILocalVariable(name: "outptr", scope: !693, file: !600, line: 117, type: !113)
!701 = !DILocalVariable(name: "outbytesleft", scope: !693, file: !600, line: 118, type: !116)
!702 = !DILocalVariable(name: "res", scope: !693, file: !600, line: 121, type: !116)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !705, line: 67, type: !337, isLocal: true, isDefinition: true)
!705 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !705, line: 69, type: !19, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !705, line: 83, type: !19, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !705, line: 83, type: !241, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !705, line: 85, type: !251, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !705, line: 88, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 171)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !705, line: 88, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 34)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !705, line: 105, type: !74, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !705, line: 109, type: !668, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !705, line: 113, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 28)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !705, line: 120, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 32)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !705, line: 127, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 36)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !705, line: 134, type: !288, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !705, line: 142, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 44)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !705, line: 150, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 48)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !705, line: 159, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 52)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !705, line: 170, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 60)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !705, line: 248, type: !223, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !705, line: 248, type: !313, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !705, line: 254, type: !223, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !705, line: 254, type: !129, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !705, line: 254, type: !288, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !705, line: 259, type: !3, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !705, line: 259, type: !353, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !781, file: !782, line: 26, type: !784, isLocal: false, isDefinition: true)
!781 = distinct !DICompileUnit(language: DW_LANG_C11, file: !782, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !783, splitDebugInlining: false, nameTableKind: None)
!782 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!783 = !{!779}
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 376, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 47)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !789, line: 34, type: !136, isLocal: true, isDefinition: true)
!789 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !789, line: 34, type: !19, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !789, line: 34, type: !283, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "exit_failure", scope: !796, file: !797, line: 24, type: !799, isLocal: false, isDefinition: true)
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !798, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!798 = !{!794}
!799 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !802, line: 47, type: !19, isLocal: true, isDefinition: true)
!802 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !802, line: 47, type: !735, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !807, file: !833, line: 58, type: !834, isLocal: true, isDefinition: true)
!807 = distinct !DICompileUnit(language: DW_LANG_C11, file: !808, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-c-strtold.o -MD -MP -MF lib/.deps/libcoreutils_a-c-strtold.Tpo -c lib/c-strtold.c -o lib/.libcoreutils_a-c-strtold.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !809, globals: !830, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!809 = !{!113, !810}
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !811, line: 24, baseType: !812)
!811 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !813, line: 41, baseType: !814)
!813 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !813, line: 27, size: 1856, elements: !816)
!816 = !{!817, !821, !824, !827, !828}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !815, file: !813, line: 30, baseType: !818, size: 832)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 832, elements: !502)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !813, line: 30, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !815, file: !813, line: 33, baseType: !822, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !815, file: !813, line: 34, baseType: !825, size: 64, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !815, file: !813, line: 35, baseType: !825, size: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !815, file: !813, line: 38, baseType: !829, size: 832, offset: 1024)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 832, elements: !502)
!830 = !{!831, !805}
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !833, line: 66, type: !251, isLocal: true, isDefinition: true)
!833 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !810)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !837, line: 35, type: !246, isLocal: true, isDefinition: true)
!837 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !840, line: 873, type: !59, isLocal: true, isDefinition: true)
!840 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !840, line: 1032, type: !246, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !845, line: 108, type: !59, isLocal: true, isDefinition: true)
!845 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "internal_state", scope: !848, file: !845, line: 97, type: !851, isLocal: true, isDefinition: true)
!848 = distinct !DICompileUnit(language: DW_LANG_C11, file: !845, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !849, globals: !850, splitDebugInlining: false, nameTableKind: None)
!849 = !{!112, !116, !121}
!850 = !{!843, !846}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !482, line: 6, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !484, line: 21, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 13, size: 64, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !853, file: !484, line: 15, baseType: !114, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !853, file: !484, line: 20, baseType: !857, size: 32, offset: 32)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !853, file: !484, line: 16, size: 32, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !857, file: !484, line: 18, baseType: !83, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !857, file: !484, line: 19, baseType: !241, size: 32)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !863, line: 4617, type: !241, isLocal: true, isDefinition: true)
!863 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !863, line: 5292, type: !246, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "decimal_format", scope: !868, file: !863, line: 5889, type: !1329, isLocal: true, isDefinition: true)
!868 = distinct !DISubprogram(name: "vasnprintf", scope: !863, file: !863, line: 2459, type: !869, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !879, retainedNodes: !1414)
!869 = !DISubroutineType(types: !870)
!870 = !{!113, !113, !871, !119, !872}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !874)
!874 = !{!875, !876, !877, !878}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !873, file: !863, baseType: !83, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !873, file: !863, baseType: !83, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !873, file: !863, baseType: !112, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !873, file: !863, baseType: !112, size: 64, offset: 128)
!879 = distinct !DICompileUnit(language: DW_LANG_C11, file: !863, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-vasnprintf.o -MD -MP -MF lib/.deps/libcoreutils_a-vasnprintf.Tpo -c lib/vasnprintf.c -o lib/.libcoreutils_a-vasnprintf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !880, retainedTypes: !1317, globals: !1326, splitDebugInlining: false, nameTableKind: None)
!880 = !{!881, !931}
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !882, line: 47, baseType: !83, size: 32, elements: !883)
!882 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!884 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!885 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!886 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!887 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!888 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!889 = !DIEnumerator(name: "TYPE_INT", value: 5)
!890 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!891 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!892 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!893 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!894 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!895 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!896 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!897 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!898 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!899 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!900 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!901 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!902 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!903 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!904 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!905 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!906 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!907 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!908 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!909 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!910 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!911 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!912 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!913 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!914 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!915 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!916 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!917 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!918 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!919 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!920 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!921 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!922 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!923 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!924 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!925 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!926 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!927 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!928 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!929 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!930 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !932, line: 41, baseType: !83, size: 32, elements: !933)
!932 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!934 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!935 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!936 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!937 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!938 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!939 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!940 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!941 = !DIEnumerator(name: "DAY_1", value: 131079)
!942 = !DIEnumerator(name: "DAY_2", value: 131080)
!943 = !DIEnumerator(name: "DAY_3", value: 131081)
!944 = !DIEnumerator(name: "DAY_4", value: 131082)
!945 = !DIEnumerator(name: "DAY_5", value: 131083)
!946 = !DIEnumerator(name: "DAY_6", value: 131084)
!947 = !DIEnumerator(name: "DAY_7", value: 131085)
!948 = !DIEnumerator(name: "ABMON_1", value: 131086)
!949 = !DIEnumerator(name: "ABMON_2", value: 131087)
!950 = !DIEnumerator(name: "ABMON_3", value: 131088)
!951 = !DIEnumerator(name: "ABMON_4", value: 131089)
!952 = !DIEnumerator(name: "ABMON_5", value: 131090)
!953 = !DIEnumerator(name: "ABMON_6", value: 131091)
!954 = !DIEnumerator(name: "ABMON_7", value: 131092)
!955 = !DIEnumerator(name: "ABMON_8", value: 131093)
!956 = !DIEnumerator(name: "ABMON_9", value: 131094)
!957 = !DIEnumerator(name: "ABMON_10", value: 131095)
!958 = !DIEnumerator(name: "ABMON_11", value: 131096)
!959 = !DIEnumerator(name: "ABMON_12", value: 131097)
!960 = !DIEnumerator(name: "MON_1", value: 131098)
!961 = !DIEnumerator(name: "MON_2", value: 131099)
!962 = !DIEnumerator(name: "MON_3", value: 131100)
!963 = !DIEnumerator(name: "MON_4", value: 131101)
!964 = !DIEnumerator(name: "MON_5", value: 131102)
!965 = !DIEnumerator(name: "MON_6", value: 131103)
!966 = !DIEnumerator(name: "MON_7", value: 131104)
!967 = !DIEnumerator(name: "MON_8", value: 131105)
!968 = !DIEnumerator(name: "MON_9", value: 131106)
!969 = !DIEnumerator(name: "MON_10", value: 131107)
!970 = !DIEnumerator(name: "MON_11", value: 131108)
!971 = !DIEnumerator(name: "MON_12", value: 131109)
!972 = !DIEnumerator(name: "AM_STR", value: 131110)
!973 = !DIEnumerator(name: "PM_STR", value: 131111)
!974 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!975 = !DIEnumerator(name: "D_FMT", value: 131113)
!976 = !DIEnumerator(name: "T_FMT", value: 131114)
!977 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!978 = !DIEnumerator(name: "ERA", value: 131116)
!979 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!980 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!981 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!982 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!983 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!984 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!985 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!986 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!987 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!988 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!989 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!990 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!991 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!992 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!993 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!994 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!995 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!996 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!997 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!998 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!999 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!1000 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!1001 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!1002 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!1003 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!1004 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!1005 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!1006 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!1007 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!1008 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!1009 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!1010 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!1011 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!1012 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!1013 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!1014 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!1015 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!1016 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!1017 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!1018 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!1019 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!1020 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!1021 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!1022 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!1023 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!1024 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!1025 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!1026 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!1027 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!1028 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!1029 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!1030 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!1031 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!1032 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!1033 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!1034 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!1035 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!1036 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!1037 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!1038 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!1039 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!1040 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!1041 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!1042 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!1043 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!1044 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!1045 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!1046 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!1047 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!1048 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!1049 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!1050 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!1051 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!1052 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!1053 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!1054 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!1055 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!1056 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!1057 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!1058 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!1059 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!1060 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!1061 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!1062 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!1063 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!1064 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!1065 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!1066 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!1067 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!1068 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!1069 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!1070 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!1071 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!1072 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!1073 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!1074 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!1075 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!1076 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!1077 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!1078 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!1079 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!1080 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!1081 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!1082 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!1083 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!1084 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!1085 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!1086 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!1087 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!1088 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!1089 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!1090 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!1091 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!1092 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!1093 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!1094 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!1095 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!1096 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!1097 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!1098 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!1099 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!1100 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!1101 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!1102 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!1103 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!1104 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!1105 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!1106 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!1107 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!1108 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!1109 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!1110 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!1111 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!1112 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!1113 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!1114 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!1115 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!1116 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!1117 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!1118 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!1119 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!1120 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!1121 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!1122 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!1123 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!1124 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!1125 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!1126 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!1127 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!1128 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!1129 = !DIEnumerator(name: "CODESET", value: 14)
!1130 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!1131 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!1132 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!1133 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!1134 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!1135 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!1136 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!1137 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!1138 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!1139 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!1140 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!1141 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!1142 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!1143 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!1144 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!1145 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!1146 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!1147 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!1148 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!1149 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!1150 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!1151 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!1152 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!1153 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!1154 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!1155 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!1156 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!1157 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!1158 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!1159 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!1160 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!1161 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!1162 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!1163 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!1164 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!1165 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!1166 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!1167 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!1168 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!1169 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!1170 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!1171 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!1172 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!1173 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
