; ModuleID = 'src/rm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.15 }
%union.anon.15 = type { i32 }
%struct.rm_options = type { i8, i32, i8, i8, i8, ptr, i8, i8, i8, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }

!197 = !{!198, !200, !201, !158, !202, !203, !205, !207}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!202 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !204, line: 18, baseType: !188)
!204 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!207 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!208 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !79, !84, !89, !94, !99, !104, !109, !114, !209, !214, !219, !221, !226, !231, !233, !238, !243, !248, !253, !255, !299, !301, !306, !311, !313, !318, !323, !325, !330, !335, !413, !418, !420, !422, !427, !429, !431, !433, !435, !437, !439, !441, !446, !448, !450, !452, !454, !456, !458, !460, !465, !470, !475, !480, !482, !484, !486, !488, !490, !495, !497, !499, !504, !506, !511, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !119, !536, !540, !542, !544, !546, !548, !550, !552, !556}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 289, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 14)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 19)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !69, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 329, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 4)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 42)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !211, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 11)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 16)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 20)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 13)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !240, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !257, file: !2, line: 368, type: !276, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 234, type: !258, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !261)
!258 = !DISubroutineType(types: !259)
!259 = !{!158, !158, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!261 = !{!262, !263, !264, !266, !290, !291, !292, !296, !297, !298}
!262 = !DILocalVariable(name: "argc", arg: 1, scope: !257, file: !2, line: 234, type: !158)
!263 = !DILocalVariable(name: "argv", arg: 2, scope: !257, file: !2, line: 234, type: !260)
!264 = !DILocalVariable(name: "preserve_root", scope: !257, file: !2, line: 236, type: !265)
!265 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!266 = !DILocalVariable(name: "x", scope: !257, file: !2, line: 237, type: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !124, line: 32, size: 256, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !286, !287, !288, !289}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !267, file: !124, line: 35, baseType: !265, size: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !267, file: !124, line: 38, baseType: !123, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !267, file: !124, line: 47, baseType: !265, size: 8, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !267, file: !124, line: 50, baseType: !265, size: 8, offset: 72)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !267, file: !124, line: 53, baseType: !265, size: 8, offset: 80)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !267, file: !124, line: 57, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !277, line: 30, size: 128, elements: !278)
!277 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!278 = !{!279, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !276, file: !277, line: 32, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !281, line: 47, baseType: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !192, line: 148, baseType: !188)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !276, file: !277, line: 33, baseType: !284, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !281, line: 59, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !192, line: 145, baseType: !188)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !267, file: !124, line: 61, baseType: !265, size: 8, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !267, file: !124, line: 64, baseType: !265, size: 8, offset: 200)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !267, file: !124, line: 67, baseType: !265, size: 8, offset: 208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !267, file: !124, line: 75, baseType: !265, size: 8, offset: 216)
!290 = !DILocalVariable(name: "prompt_once", scope: !257, file: !2, line: 238, type: !265)
!291 = !DILocalVariable(name: "c", scope: !257, file: !2, line: 239, type: !158)
!292 = !DILocalVariable(name: "i", scope: !293, file: !2, line: 287, type: !158)
!293 = distinct !DILexicalBlock(scope: !294, file: !2, line: 286, column: 11)
!294 = distinct !DILexicalBlock(scope: !295, file: !2, line: 257, column: 9)
!295 = distinct !DILexicalBlock(scope: !257, file: !2, line: 255, column: 5)
!296 = !DILocalVariable(name: "n_files", scope: !257, file: !2, line: 375, type: !189)
!297 = !DILocalVariable(name: "file", scope: !257, file: !2, line: 376, type: !260)
!298 = !DILocalVariable(name: "status", scope: !257, file: !2, line: 393, type: !162)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !14, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 2)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 38)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !3, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 26)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 27)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !86, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 9)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 184, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 23)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !337, file: !157, line: 575, type: !158, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "oputs_", scope: !157, file: !157, line: 573, type: !338, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !340)
!338 = !DISubroutineType(cc: DW_CC_nocall, types: !339)
!339 = !{null, !205, !205}
!340 = !{!341, !342, !343, !346, !347, !348, !349, !353, !354, !355, !356, !358, !407, !408, !409, !411, !412}
!341 = !DILocalVariable(name: "program", arg: 1, scope: !337, file: !157, line: 573, type: !205)
!342 = !DILocalVariable(name: "option", arg: 2, scope: !337, file: !157, line: 573, type: !205)
!343 = !DILocalVariable(name: "term", scope: !344, file: !157, line: 585, type: !205)
!344 = distinct !DILexicalBlock(scope: !345, file: !157, line: 582, column: 5)
!345 = distinct !DILexicalBlock(scope: !337, file: !157, line: 581, column: 7)
!346 = !DILocalVariable(name: "double_space", scope: !337, file: !157, line: 594, type: !265)
!347 = !DILocalVariable(name: "first_word", scope: !337, file: !157, line: 595, type: !205)
!348 = !DILocalVariable(name: "option_text", scope: !337, file: !157, line: 596, type: !205)
!349 = !DILocalVariable(name: "s", scope: !350, file: !157, line: 608, type: !205)
!350 = distinct !DILexicalBlock(scope: !351, file: !157, line: 605, column: 5)
!351 = distinct !DILexicalBlock(scope: !352, file: !157, line: 604, column: 12)
!352 = distinct !DILexicalBlock(scope: !337, file: !157, line: 597, column: 7)
!353 = !DILocalVariable(name: "spaces", scope: !350, file: !157, line: 609, type: !203)
!354 = !DILocalVariable(name: "anchor_len", scope: !337, file: !157, line: 620, type: !203)
!355 = !DILocalVariable(name: "desc_text", scope: !337, file: !157, line: 625, type: !205)
!356 = !DILocalVariable(name: "__ptr", scope: !357, file: !157, line: 644, type: !205)
!357 = distinct !DILexicalBlock(scope: !337, file: !157, line: 644, column: 3)
!358 = !DILocalVariable(name: "__stream", scope: !357, file: !157, line: 644, type: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !361, line: 7, baseType: !362)
!361 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !363, line: 49, size: 1728, elements: !364)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !380, !382, !383, !384, !387, !388, !390, !391, !394, !396, !399, !402, !403, !404, !405, !406}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !362, file: !363, line: 51, baseType: !158, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !362, file: !363, line: 54, baseType: !200, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !362, file: !363, line: 55, baseType: !200, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !362, file: !363, line: 56, baseType: !200, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !362, file: !363, line: 57, baseType: !200, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !362, file: !363, line: 58, baseType: !200, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !362, file: !363, line: 59, baseType: !200, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !362, file: !363, line: 60, baseType: !200, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !362, file: !363, line: 61, baseType: !200, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !362, file: !363, line: 64, baseType: !200, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !362, file: !363, line: 65, baseType: !200, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !362, file: !363, line: 66, baseType: !200, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !362, file: !363, line: 68, baseType: !378, size: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !363, line: 36, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !362, file: !363, line: 70, baseType: !381, size: 64, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !362, file: !363, line: 72, baseType: !158, size: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !362, file: !363, line: 73, baseType: !158, size: 32, offset: 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !362, file: !363, line: 74, baseType: !385, size: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !192, line: 152, baseType: !386)
!386 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !362, file: !363, line: 77, baseType: !202, size: 16, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !362, file: !363, line: 78, baseType: !389, size: 8, offset: 1040)
!389 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !362, file: !363, line: 79, baseType: !101, size: 8, offset: 1048)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !362, file: !363, line: 81, baseType: !392, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !363, line: 43, baseType: null)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !362, file: !363, line: 89, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !192, line: 153, baseType: !386)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !362, file: !363, line: 91, baseType: !397, size: 64, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !363, line: 37, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !362, file: !363, line: 92, baseType: !400, size: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !363, line: 38, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !362, file: !363, line: 93, baseType: !381, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !362, file: !363, line: 94, baseType: !201, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !362, file: !363, line: 95, baseType: !203, size: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !362, file: !363, line: 96, baseType: !158, size: 32, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !362, file: !363, line: 98, baseType: !245, size: 160, offset: 1568)
!407 = !DILocalVariable(name: "__cnt", scope: !357, file: !157, line: 644, type: !203)
!408 = !DILocalVariable(name: "url_program", scope: !337, file: !157, line: 648, type: !205)
!409 = !DILocalVariable(name: "__ptr", scope: !410, file: !157, line: 686, type: !205)
!410 = distinct !DILexicalBlock(scope: !337, file: !157, line: 686, column: 3)
!411 = !DILocalVariable(name: "__stream", scope: !410, file: !157, line: 686, type: !359)
!412 = !DILocalVariable(name: "__cnt", scope: !410, file: !157, line: 686, type: !203)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !157, line: 585, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 5)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !157, line: 586, type: !415, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !157, line: 595, type: !223, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !157, line: 620, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 6)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !303, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !415, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !223, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !19, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !157, line: 650, type: !415, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !424, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !424, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !157, line: 652, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 7)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !157, line: 653, type: !116, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !157, line: 654, type: !106, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !157, line: 655, type: !106, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !157, line: 656, type: !106, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !157, line: 657, type: !106, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !157, line: 663, type: !443, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !157, line: 664, type: !106, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 17)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 40)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 15)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 61)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !157, line: 679, type: !19, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !157, line: 683, type: !415, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !157, line: 688, type: !415, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !157, line: 691, type: !116, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !157, line: 839, type: !240, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !157, line: 840, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 22)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !157, line: 841, type: !472, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !157, line: 862, type: !223, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !157, line: 868, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 71)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !157, line: 875, type: !320, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 51)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 12)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !424, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !513, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !240, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !462, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !211, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !216, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !106, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !116, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !415, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !116, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "interactive_types", scope: !121, file: !2, line: 90, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 192, elements: !425)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !424, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !19, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !415, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !415, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !443, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !223, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "interactive_args", scope: !121, file: !2, line: 84, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 448, elements: !444)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !308, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 3072, elements: !514)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !561, line: 50, size: 256, elements: !562)
!561 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!562 = !{!563, !564, !565, !567}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !561, line: 52, baseType: !205, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !560, file: !561, line: 55, baseType: !158, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !561, line: 56, baseType: !566, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !560, file: !561, line: 57, baseType: !158, size: 32, offset: 192)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !570, line: 625, type: !240, isLocal: true, isDefinition: true)
!570 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !570, line: 639, type: !462, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !570, line: 456, type: !462, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !508, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !303, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !19, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !303, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 45)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 58)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 49)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !570, line: 498, type: !14, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !570, line: 511, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 46)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !570, line: 514, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 37)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !570, line: 576, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 186)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !570, line: 583, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 21)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !570, line: 589, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 56)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !570, line: 589, type: !492, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !570, line: 276, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 48)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !570, line: 276, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !570, line: 297, type: !508, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !570, line: 309, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 35)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !570, line: 309, type: !216, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !570, line: 398, type: !492, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !570, line: 398, type: !513, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !652, line: 3, type: !472, isLocal: true, isDefinition: true)
!652 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "Version", scope: !655, file: !652, line: 3, type: !205, isLocal: false, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C11, file: !652, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !656, splitDebugInlining: false, nameTableKind: None)
!656 = !{!650, !653}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !659, file: !660, line: 65, type: !681, isLocal: false, isDefinition: true)
!659 = distinct !DICompileUnit(language: DW_LANG_C11, file: !660, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !661, retainedTypes: !664, globals: !665, splitDebugInlining: false, nameTableKind: None)
!660 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!661 = !{!662}
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !663, line: 42, baseType: !125, size: 32, elements: !144)
!663 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!664 = !{!201, !205, !207}
!665 = !{!657, !666, !668, !670, !675, !677, !679}
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !660, line: 141, type: !443, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !660, line: 141, type: !320, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !660, line: 142, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 29)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !660, line: 160, type: !617, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !660, line: 165, type: !116, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !660, line: 170, type: !415, isLocal: true, isDefinition: true)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !682, line: 69, baseType: !683)
!682 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null}
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "file_name", scope: !688, file: !689, line: 36, type: !205, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closein.o -MD -MP -MF lib/.deps/libcoreutils_a-closein.Tpo -c lib/closein.c -o lib/.libcoreutils_a-closein.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !690, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!690 = !{!691, !693, !695, !697, !686}
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !689, line: 99, type: !443, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !689, line: 99, type: !216, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !689, line: 101, type: !443, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !689, line: 104, type: !19, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "file_name", scope: !701, file: !702, line: 45, type: !205, isLocal: true, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !703, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!703 = !{!704, !706, !708, !710, !699, !712}
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !702, line: 121, type: !443, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !702, line: 121, type: !513, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !702, line: 123, type: !443, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !702, line: 126, type: !19, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !701, file: !702, line: 55, type: !265, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !716, file: !717, line: 66, type: !683, isLocal: false, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !718, globals: !719, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!718 = !{!201, !207}
!719 = !{!720, !722, !741, !743, !745, !747, !714, !749, !751, !753, !755, !757}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !717, line: 272, type: !415, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "old_file_name", scope: !724, file: !717, line: 304, type: !205, isLocal: true, isDefinition: true)
!724 = distinct !DISubprogram(name: "verror_at_line", scope: !717, file: !717, line: 298, type: !725, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !716, retainedNodes: !734)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !158, !158, !205, !125, !205, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !728, file: !717, baseType: !125, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !728, file: !717, baseType: !125, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !728, file: !717, baseType: !201, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !728, file: !717, baseType: !201, size: 64, offset: 128)
!734 = !{!735, !736, !737, !738, !739, !740}
!735 = !DILocalVariable(name: "status", arg: 1, scope: !724, file: !717, line: 298, type: !158)
!736 = !DILocalVariable(name: "errnum", arg: 2, scope: !724, file: !717, line: 298, type: !158)
!737 = !DILocalVariable(name: "file_name", arg: 3, scope: !724, file: !717, line: 298, type: !205)
!738 = !DILocalVariable(name: "line_number", arg: 4, scope: !724, file: !717, line: 298, type: !125)
!739 = !DILocalVariable(name: "message", arg: 5, scope: !724, file: !717, line: 298, type: !205)
!740 = !DILocalVariable(name: "args", arg: 6, scope: !724, file: !717, line: 298, type: !727)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "old_line_number", scope: !724, file: !717, line: 305, type: !125, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !717, line: 338, type: !223, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !717, line: 346, type: !116, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !717, line: 346, type: !303, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "error_message_count", scope: !716, file: !717, line: 69, type: !125, isLocal: false, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !716, file: !717, line: 295, type: !158, isLocal: false, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !717, line: 208, type: !443, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !717, line: 208, type: !617, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !717, line: 214, type: !415, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !761, line: 30, type: !443, isLocal: true, isDefinition: true)
!761 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !764, line: 399, type: !303, isLocal: true, isDefinition: true)
!764 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !764, line: 441, type: !101, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !764, line: 1080, type: !19, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !771, line: 226, type: !111, isLocal: true, isDefinition: true)
!771 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !771, line: 227, type: !111, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !771, line: 228, type: !9, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !771, line: 231, type: !111, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "default_tuning", scope: !780, file: !771, line: 134, type: !784, isLocal: true, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !781, globals: !783, splitDebugInlining: false, nameTableKind: None)
!781 = !{!188, !201, !782, !203}
!782 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!783 = !{!769, !772, !774, !776, !778}
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !786, line: 52, baseType: !787)
!786 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !786, line: 40, size: 160, elements: !788)
!788 = !{!789, !790, !791, !792, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !787, file: !786, line: 45, baseType: !782, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !787, file: !786, line: 46, baseType: !782, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !787, file: !786, line: 47, baseType: !782, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !787, file: !786, line: 48, baseType: !782, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !787, file: !786, line: 49, baseType: !265, size: 8, offset: 128)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "program_name", scope: !796, file: !797, line: 31, type: !205, isLocal: false, isDefinition: true)
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !798, globals: !799, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!798 = !{!201, !200}
!799 = !{!794, !800, !802}
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !797, line: 46, type: !116, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !797, line: 49, type: !223, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "utf07FF", scope: !806, file: !807, line: 46, type: !834, isLocal: true, isDefinition: true)
!806 = distinct !DISubprogram(name: "proper_name_lite", scope: !807, file: !807, line: 38, type: !808, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !810, retainedNodes: !812)
!807 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!808 = !DISubroutineType(types: !809)
!809 = !{!205, !205, !205}
!810 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !811, splitDebugInlining: false, nameTableKind: None)
!811 = !{!804}
!812 = !{!813, !814, !815, !816, !821}
!813 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !806, file: !807, line: 38, type: !205)
!814 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !806, file: !807, line: 38, type: !205)
!815 = !DILocalVariable(name: "translation", scope: !806, file: !807, line: 40, type: !205)
!816 = !DILocalVariable(name: "w", scope: !806, file: !807, line: 47, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !818, line: 37, baseType: !819)
!818 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !192, line: 57, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !192, line: 42, baseType: !125)
!821 = !DILocalVariable(name: "mbs", scope: !806, file: !807, line: 48, type: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !823, line: 6, baseType: !824)
!823 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !825, line: 21, baseType: !826)
!825 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 13, size: 64, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !826, file: !825, line: 15, baseType: !158, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !826, file: !825, line: 20, baseType: !830, size: 32, offset: 32)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !826, file: !825, line: 16, size: 32, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !830, file: !825, line: 18, baseType: !125, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !830, file: !825, line: 19, baseType: !223, size: 32)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 16, elements: !304)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !837, line: 78, type: !116, isLocal: true, isDefinition: true)
!837 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !837, line: 79, type: !424, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !837, line: 80, type: !250, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !837, line: 81, type: !250, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !837, line: 82, type: !245, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !837, line: 83, type: !303, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !837, line: 84, type: !116, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !837, line: 85, type: !443, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !837, line: 86, type: !443, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !837, line: 87, type: !116, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !858, file: !837, line: 76, type: !930, isLocal: false, isDefinition: true)
!858 = distinct !DICompileUnit(language: DW_LANG_C11, file: !837, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !859, retainedTypes: !865, globals: !866, splitDebugInlining: false, nameTableKind: None)
!859 = !{!662, !860, !169}
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !663, line: 254, baseType: !125, size: 32, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!863 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!864 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!865 = !{!201, !158, !202, !203}
!866 = !{!835, !838, !840, !842, !844, !846, !848, !850, !852, !854, !856, !867, !871, !881, !883, !888, !890, !892, !894, !896, !919, !926, !928}
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !858, file: !837, line: 92, type: !869, isLocal: false, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 320, elements: !107)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !858, file: !837, line: 1040, type: !873, isLocal: false, isDefinition: true)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !837, line: 56, size: 448, elements: !874)
!874 = !{!875, !876, !877, !879, !880}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !873, file: !837, line: 59, baseType: !662, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !873, file: !837, line: 62, baseType: !158, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !873, file: !837, line: 66, baseType: !878, size: 256, offset: 64)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !117)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !873, file: !837, line: 69, baseType: !205, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !873, file: !837, line: 72, baseType: !205, size: 64, offset: 384)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !858, file: !837, line: 107, type: !873, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "slot0", scope: !858, file: !837, line: 831, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 256)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !837, line: 321, type: !303, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !837, line: 357, type: !303, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !837, line: 358, type: !303, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !837, line: 199, type: !443, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "quote", scope: !898, file: !837, line: 228, type: !917, isLocal: true, isDefinition: true)
!898 = distinct !DISubprogram(name: "gettext_quote", scope: !837, file: !837, line: 197, type: !899, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !858, retainedNodes: !901)
!899 = !DISubroutineType(types: !900)
!900 = !{!205, !205, !662}
!901 = !{!902, !903, !904, !905, !906}
!902 = !DILocalVariable(name: "msgid", arg: 1, scope: !898, file: !837, line: 197, type: !205)
!903 = !DILocalVariable(name: "s", arg: 2, scope: !898, file: !837, line: 197, type: !662)
!904 = !DILocalVariable(name: "translation", scope: !898, file: !837, line: 199, type: !205)
!905 = !DILocalVariable(name: "w", scope: !898, file: !837, line: 229, type: !817)
!906 = !DILocalVariable(name: "mbs", scope: !898, file: !837, line: 230, type: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !823, line: 6, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !825, line: 21, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 13, size: 64, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !909, file: !825, line: 15, baseType: !158, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !909, file: !825, line: 20, baseType: !913, size: 32, offset: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !825, line: 16, size: 32, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !913, file: !825, line: 18, baseType: !125, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !913, file: !825, line: 19, baseType: !223, size: 32)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, elements: !918)
!918 = !{!305, !225}
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "slotvec", scope: !858, file: !837, line: 834, type: !921, isLocal: true, isDefinition: true)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !837, line: 823, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !922, file: !837, line: 825, baseType: !203, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !922, file: !837, line: 826, baseType: !200, size: 64, offset: 64)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "nslots", scope: !858, file: !837, line: 832, type: !158, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "slotvec0", scope: !858, file: !837, line: 833, type: !922, isLocal: true, isDefinition: true)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 704, elements: !236)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !933, line: 32, type: !303, isLocal: true, isDefinition: true)
!933 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !936, line: 67, type: !513, isLocal: true, isDefinition: true)
!936 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !936, line: 69, type: !443, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !936, line: 83, type: !443, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !936, line: 83, type: !223, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !936, line: 85, type: !303, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !936, line: 88, type: !947, isLocal: true, isDefinition: true)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 171)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !936, line: 88, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 34)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !936, line: 105, type: !240, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !936, line: 109, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !333)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !936, line: 113, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 28)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !936, line: 120, type: !634, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !936, line: 127, type: !969, isLocal: true, isDefinition: true)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 36)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !936, line: 134, type: !467, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !936, line: 142, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 44)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !936, line: 150, type: !629, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !936, line: 159, type: !983, isLocal: true, isDefinition: true)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 52)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !936, line: 170, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 60)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !936, line: 248, type: !245, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !936, line: 248, type: !492, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !936, line: 254, type: !245, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !936, line: 254, type: !211, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !936, line: 254, type: !467, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !936, line: 259, type: !3, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !936, line: 259, type: !672, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1007, file: !1008, line: 26, type: !1010, isLocal: false, isDefinition: true)
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1008, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1009, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1009 = !{!1005}
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 376, elements: !65)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1012 = distinct !DIGlobalVariable(name: "initialized", scope: !1013, file: !1014, line: 41, type: !265, isLocal: true, isDefinition: true)
!1013 = distinct !DISubprogram(name: "can_write_any_file", scope: !1014, file: !1014, line: 39, type: !1015, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1017, retainedNodes: !1022)
!1014 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!265}
!1017 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1014, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-write-any-file.o -MD -MP -MF lib/.deps/libcoreutils_a-write-any-file.Tpo -c lib/write-any-file.c -o lib/.libcoreutils_a-write-any-file.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1018, splitDebugInlining: false, nameTableKind: None)
!1018 = !{!1019, !1020}
!1019 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "can_write", scope: !1013, file: !1014, line: 42, type: !265, isLocal: true, isDefinition: true)
!1022 = !{!1023}
!1023 = !DILocalVariable(name: "can", scope: !1024, file: !1014, line: 46, type: !265)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !1014, line: 45, column: 5)
!1025 = distinct !DILexicalBlock(scope: !1013, file: !1014, line: 44, column: 7)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1028, file: !1029, line: 24, type: !1031, isLocal: false, isDefinition: true)
!1028 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!1029 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1030 = !{!1026}
!1031 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 34, type: !19, isLocal: true, isDefinition: true)
!1034 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 34, type: !443, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 34, type: !462, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 40, type: !672, isLocal: true, isDefinition: true)
!1041 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 40, type: !235, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 40, type: !1046, isLocal: true, isDefinition: true)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 624, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 78)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 40, type: !216, isLocal: true, isDefinition: true)
!1051 = !DIFile(filename: "lib/c-file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3dfce754b72420a39e7e891cf0b31be")
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 40, type: !250, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 43, type: !106, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 46, type: !211, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 66, type: !216, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 69, type: !959, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 75, type: !415, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 105, type: !443, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !1051, line: 110, type: !235, isLocal: true, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !1070, line: 59, type: !111, isLocal: true, isDefinition: true)
!1070 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1070, line: 59, type: !1073, isLocal: true, isDefinition: true)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 18)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !1070, line: 59, type: !1078, isLocal: true, isDefinition: true)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 536, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 67)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1083, file: !1084, line: 506, type: !158, isLocal: true, isDefinition: true)
!1083 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1084, file: !1084, line: 485, type: !1085, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1087, retainedNodes: !1089)
!1084 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!158, !158, !158}
!1087 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1084, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1088, splitDebugInlining: false, nameTableKind: None)
!1088 = !{!1081}
!1089 = !{!1090, !1091, !1092, !1093, !1096}
!1090 = !DILocalVariable(name: "fd", arg: 1, scope: !1083, file: !1084, line: 485, type: !158)
!1091 = !DILocalVariable(name: "target", arg: 2, scope: !1083, file: !1084, line: 485, type: !158)
!1092 = !DILocalVariable(name: "result", scope: !1083, file: !1084, line: 487, type: !158)
!1093 = !DILocalVariable(name: "flags", scope: !1094, file: !1084, line: 530, type: !158)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !1084, line: 529, column: 5)
!1095 = distinct !DILexicalBlock(scope: !1083, file: !1084, line: 528, column: 7)
!1096 = !DILocalVariable(name: "saved_errno", scope: !1097, file: !1084, line: 533, type: !158)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !1084, line: 532, column: 9)
!1098 = distinct !DILexicalBlock(scope: !1094, file: !1084, line: 531, column: 11)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !1101, line: 108, type: !101, isLocal: true, isDefinition: true)
!1101 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(name: "internal_state", scope: !1104, file: !1101, line: 97, type: !1107, isLocal: true, isDefinition: true)
!1104 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1101, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1105, globals: !1106, splitDebugInlining: false, nameTableKind: None)
!1105 = !{!201, !203, !207}
!1106 = !{!1099, !1102}
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !823, line: 6, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !825, line: 21, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 13, size: 64, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1109, file: !825, line: 15, baseType: !158, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1109, file: !825, line: 20, baseType: !1113, size: 32, offset: 32)
!1113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1109, file: !825, line: 16, size: 32, elements: !1114)
!1114 = !{!1115, !1116}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1113, file: !825, line: 18, baseType: !125, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1113, file: !825, line: 19, baseType: !223, size: 32)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !1119, line: 35, type: !424, isLocal: true, isDefinition: true)
!1119 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !570, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/remove.o -MD -MP -MF src/.deps/remove.Tpo -c src/remove.c -o src/.remove.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1121, retainedTypes: !1143, globals: !1144, splitDebugInlining: false, nameTableKind: None)
!1121 = !{!162, !123, !1122, !142, !1127, !1131}
!1122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 299, baseType: !158, size: 32, elements: !1123)
!1123 = !{!1124, !1125, !1126}
!1124 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!1125 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!1126 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!1127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !570, line: 38, baseType: !125, size: 32, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!1130 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!1131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1132, line: 97, baseType: !125, size: 32, elements: !1133)
!1132 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142}
!1134 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!1135 = !DIEnumerator(name: "DT_FIFO", value: 1)
!1136 = !DIEnumerator(name: "DT_CHR", value: 2)
!1137 = !DIEnumerator(name: "DT_DIR", value: 4)
!1138 = !DIEnumerator(name: "DT_BLK", value: 6)
!1139 = !DIEnumerator(name: "DT_REG", value: 8)
!1140 = !DIEnumerator(name: "DT_LNK", value: 10)
!1141 = !DIEnumerator(name: "DT_SOCK", value: 12)
!1142 = !DIEnumerator(name: "DT_WHT", value: 14)
!1143 = !{!201}
!1144 = !{!568, !1145, !1150, !1152, !571, !573, !575, !577, !579, !581, !583, !588, !593, !598, !600, !605, !610, !615, !620, !625, !627, !632, !637, !639, !644, !646, !648}
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !1147, isLocal: true, isDefinition: true)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 704, elements: !1148)
!1148 = !{!1149}
!1149 = !DISubrange(count: 88)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !250, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !1154, isLocal: true, isDefinition: true)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 480, elements: !989)
!1155 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1156, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-basename-lgpl.o -MD -MP -MF lib/.deps/libcoreutils_a-basename-lgpl.Tpo -c lib/basename-lgpl.c -o lib/.libcoreutils_a-basename-lgpl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1157, splitDebugInlining: false, nameTableKind: None)
!1156 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!1157 = !{!200}
!1158 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1159, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1143, splitDebugInlining: false, nameTableKind: None)
!1159 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1160 = distinct !DICompileUnit(language: DW_LANG_C11, file: !761, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-file-type.o -MD -MP -MF lib/.deps/libcoreutils_a-file-type.Tpo -c lib/file-type.c -o lib/.libcoreutils_a-file-type.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1161, splitDebugInlining: false, nameTableKind: None)
