; ModuleID = 'src/rmdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [48 x i8] c"Remove the DIRECTORY(ies), if they are empty.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"rmdir\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [95 x i8] c"      --ignore-fail-on-non-empty\0A         ignore each failure to remove a non-empty directory\0A\00", align 1, !dbg !22

!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !126, !131, !136, !138, !143, !145, !150, !153, !155, !157, !236, !241, !243, !248, !250, !255, !257, !259, !261, !263, !265, !267, !272, !277, !279, !281, !283, !285, !287, !289, !294, !299, !304, !309, !311, !313, !315, !317, !319, !324, !326, !328, !333, !338, !343, !348, !353, !355, !357, !359, !361, !67, !363}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 14)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 16)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !133, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 242, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 23)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !14, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 20)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "remove_empty_parents", scope: !69, file: !2, line: 40, type: !152, isLocal: true, isDefinition: true)
!152 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "ignore_fail_on_non_empty", scope: !69, file: !2, line: 44, type: !152, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "verbose", scope: !69, file: !2, line: 47, type: !152, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !159, file: !76, line: 575, type: !77, isLocal: true, isDefinition: true)
!159 = distinct !DISubprogram(name: "oputs_", scope: !76, file: !76, line: 573, type: !160, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !162)
!160 = !DISubroutineType(cc: DW_CC_nocall, types: !161)
!161 = !{null, !122, !122}
!162 = !{!163, !164, !165, !168, !169, !170, !171, !175, !176, !177, !178, !180, !230, !231, !232, !234, !235}
!163 = !DILocalVariable(name: "program", arg: 1, scope: !159, file: !76, line: 573, type: !122)
!164 = !DILocalVariable(name: "option", arg: 2, scope: !159, file: !76, line: 573, type: !122)
!165 = !DILocalVariable(name: "term", scope: !166, file: !76, line: 585, type: !122)
!166 = distinct !DILexicalBlock(scope: !167, file: !76, line: 582, column: 5)
!167 = distinct !DILexicalBlock(scope: !159, file: !76, line: 581, column: 7)
!168 = !DILocalVariable(name: "double_space", scope: !159, file: !76, line: 594, type: !152)
!169 = !DILocalVariable(name: "first_word", scope: !159, file: !76, line: 595, type: !122)
!170 = !DILocalVariable(name: "option_text", scope: !159, file: !76, line: 596, type: !122)
!171 = !DILocalVariable(name: "s", scope: !172, file: !76, line: 608, type: !122)
!172 = distinct !DILexicalBlock(scope: !173, file: !76, line: 605, column: 5)
!173 = distinct !DILexicalBlock(scope: !174, file: !76, line: 604, column: 12)
!174 = distinct !DILexicalBlock(scope: !159, file: !76, line: 597, column: 7)
!175 = !DILocalVariable(name: "spaces", scope: !172, file: !76, line: 609, type: !119)
!176 = !DILocalVariable(name: "anchor_len", scope: !159, file: !76, line: 620, type: !119)
!177 = !DILocalVariable(name: "desc_text", scope: !159, file: !76, line: 625, type: !122)
!178 = !DILocalVariable(name: "__ptr", scope: !179, file: !76, line: 644, type: !122)
!179 = distinct !DILexicalBlock(scope: !159, file: !76, line: 644, column: 3)
!180 = !DILocalVariable(name: "__stream", scope: !179, file: !76, line: 644, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !183, line: 7, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !185, line: 49, size: 1728, elements: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !204, !205, !206, !210, !211, !213, !214, !217, !219, !222, !225, !226, !227, !228, !229}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !184, file: !185, line: 51, baseType: !77, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !184, file: !185, line: 54, baseType: !116, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !184, file: !185, line: 55, baseType: !116, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !184, file: !185, line: 56, baseType: !116, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !184, file: !185, line: 57, baseType: !116, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !184, file: !185, line: 58, baseType: !116, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !184, file: !185, line: 59, baseType: !116, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !184, file: !185, line: 60, baseType: !116, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !184, file: !185, line: 61, baseType: !116, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !184, file: !185, line: 64, baseType: !116, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !184, file: !185, line: 65, baseType: !116, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !184, file: !185, line: 66, baseType: !116, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !184, file: !185, line: 68, baseType: !200, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !185, line: 36, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !184, file: !185, line: 70, baseType: !203, size: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !184, file: !185, line: 72, baseType: !77, size: 32, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !184, file: !185, line: 73, baseType: !77, size: 32, offset: 928)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !184, file: !185, line: 74, baseType: !207, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !208, line: 152, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!209 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !184, file: !185, line: 77, baseType: !118, size: 16, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !184, file: !185, line: 78, baseType: !212, size: 8, offset: 1040)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !184, file: !185, line: 79, baseType: !49, size: 8, offset: 1048)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !184, file: !185, line: 81, baseType: !215, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !185, line: 43, baseType: null)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !184, file: !185, line: 89, baseType: !218, size: 64, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !208, line: 153, baseType: !209)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !184, file: !185, line: 91, baseType: !220, size: 64, offset: 1216)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !185, line: 37, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !184, file: !185, line: 92, baseType: !223, size: 64, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !185, line: 38, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !184, file: !185, line: 93, baseType: !203, size: 64, offset: 1344)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !184, file: !185, line: 94, baseType: !117, size: 64, offset: 1408)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !184, file: !185, line: 95, baseType: !119, size: 64, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !184, file: !185, line: 96, baseType: !77, size: 32, offset: 1536)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !184, file: !185, line: 98, baseType: !147, size: 160, offset: 1568)
!230 = !DILocalVariable(name: "__cnt", scope: !179, file: !76, line: 644, type: !119)
!231 = !DILocalVariable(name: "url_program", scope: !159, file: !76, line: 648, type: !122)
!232 = !DILocalVariable(name: "__ptr", scope: !233, file: !76, line: 686, type: !122)
!233 = distinct !DILexicalBlock(scope: !159, file: !76, line: 686, column: 3)
!234 = !DILocalVariable(name: "__stream", scope: !233, file: !76, line: 686, type: !181)
!235 = !DILocalVariable(name: "__cnt", scope: !233, file: !76, line: 686, type: !119)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !76, line: 585, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 5)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !76, line: 586, type: !238, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !76, line: 595, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 4)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !76, line: 620, type: !19, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !238, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !245, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !64, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !76, line: 650, type: !238, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !19, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !19, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !76, line: 652, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 7)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !76, line: 653, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 8)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !76, line: 654, type: !54, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !76, line: 655, type: !54, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !76, line: 656, type: !54, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !76, line: 657, type: !54, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !76, line: 663, type: !269, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !76, line: 664, type: !54, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 17)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 40)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 15)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 61)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !76, line: 679, type: !64, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !76, line: 683, type: !238, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !76, line: 688, type: !238, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !76, line: 691, type: !274, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !76, line: 839, type: !133, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !76, line: 840, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 22)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !76, line: 841, type: !301, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !76, line: 862, type: !245, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !76, line: 868, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 71)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !76, line: 875, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 27)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 51)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 12)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 25)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !238, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !274, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !274, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !238, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !274, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 30)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 1792, elements: !270)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !371, line: 50, size: 256, elements: !372)
!371 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!372 = !{!373, !374, !375, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !371, line: 52, baseType: !122, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !370, file: !371, line: 55, baseType: !77, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !371, line: 56, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !370, file: !371, line: 57, baseType: !77, size: 32, offset: 192)
!378 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!379 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !383, line: 32, type: !64, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !386, line: 3, type: !301, isLocal: true, isDefinition: true)
!386 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "Version", scope: !389, file: !386, line: 3, type: !122, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !386, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !390, splitDebugInlining: false, nameTableKind: None)
!390 = !{!384, !387}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "file_name", scope: !393, file: !394, line: 45, type: !122, isLocal: true, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C11, file: !394, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !395, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!395 = !{!396, !398, !400, !402, !391, !404}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !394, line: 121, type: !269, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !394, line: 121, type: !345, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !394, line: 123, type: !269, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !394, line: 126, type: !64, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !393, file: !394, line: 55, type: !152, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !408, file: !409, line: 66, type: !454, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, globals: !411, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!410 = !{!117, !124}
!411 = !{!412, !414, !433, !435, !437, !439, !406, !441, !443, !445, !447, !452}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !409, line: 272, type: !238, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "old_file_name", scope: !416, file: !409, line: 304, type: !122, isLocal: true, isDefinition: true)
!416 = distinct !DISubprogram(name: "verror_at_line", scope: !409, file: !409, line: 298, type: !417, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !426)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !77, !77, !122, !72, !122, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !421)
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !420, file: !409, baseType: !72, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !420, file: !409, baseType: !72, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !420, file: !409, baseType: !117, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !420, file: !409, baseType: !117, size: 64, offset: 128)
!426 = !{!427, !428, !429, !430, !431, !432}
!427 = !DILocalVariable(name: "status", arg: 1, scope: !416, file: !409, line: 298, type: !77)
!428 = !DILocalVariable(name: "errnum", arg: 2, scope: !416, file: !409, line: 298, type: !77)
!429 = !DILocalVariable(name: "file_name", arg: 3, scope: !416, file: !409, line: 298, type: !122)
!430 = !DILocalVariable(name: "line_number", arg: 4, scope: !416, file: !409, line: 298, type: !72)
!431 = !DILocalVariable(name: "message", arg: 5, scope: !416, file: !409, line: 298, type: !122)
!432 = !DILocalVariable(name: "args", arg: 6, scope: !416, file: !409, line: 298, type: !419)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "old_line_number", scope: !416, file: !409, line: 305, type: !72, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !409, line: 338, type: !245, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !409, line: 346, type: !274, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !409, line: 346, type: !252, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "error_message_count", scope: !408, file: !409, line: 69, type: !72, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !408, file: !409, line: 295, type: !77, isLocal: false, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !409, line: 208, type: !269, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !409, line: 208, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 21)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !409, line: 214, type: !238, isLocal: true, isDefinition: true)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "program_name", scope: !459, file: !460, line: 31, type: !122, isLocal: false, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C11, file: !460, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !461, globals: !462, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!461 = !{!117, !116}
!462 = !{!457, !463, !465}
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !460, line: 46, type: !274, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !460, line: 49, type: !245, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "utf07FF", scope: !469, file: !470, line: 46, type: !497, isLocal: true, isDefinition: true)
!469 = distinct !DISubprogram(name: "proper_name_lite", scope: !470, file: !470, line: 38, type: !471, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !473, retainedNodes: !475)
!470 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!471 = !DISubroutineType(types: !472)
!472 = !{!122, !122, !122}
!473 = distinct !DICompileUnit(language: DW_LANG_C11, file: !470, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !474, splitDebugInlining: false, nameTableKind: None)
!474 = !{!467}
!475 = !{!476, !477, !478, !479, !484}
!476 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !469, file: !470, line: 38, type: !122)
!477 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !469, file: !470, line: 38, type: !122)
!478 = !DILocalVariable(name: "translation", scope: !469, file: !470, line: 40, type: !122)
!479 = !DILocalVariable(name: "w", scope: !469, file: !470, line: 47, type: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !481, line: 37, baseType: !482)
!481 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !208, line: 57, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !208, line: 42, baseType: !72)
!484 = !DILocalVariable(name: "mbs", scope: !469, file: !470, line: 48, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !486, line: 6, baseType: !487)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !488, line: 21, baseType: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 13, size: 64, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !489, file: !488, line: 15, baseType: !77, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !489, file: !488, line: 20, baseType: !493, size: 32, offset: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !489, file: !488, line: 16, size: 32, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !493, file: !488, line: 18, baseType: !72, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !493, file: !488, line: 19, baseType: !245, size: 32)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 16, elements: !253)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !500, line: 78, type: !274, isLocal: true, isDefinition: true)
!500 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !500, line: 79, type: !19, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !500, line: 80, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 13)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !500, line: 81, type: !505, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !500, line: 82, type: !147, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !500, line: 83, type: !252, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !500, line: 84, type: !274, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !500, line: 85, type: !269, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !500, line: 86, type: !269, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !500, line: 87, type: !274, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !524, file: !500, line: 76, type: !598, isLocal: false, isDefinition: true)
!524 = distinct !DICompileUnit(language: DW_LANG_C11, file: !500, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !525, retainedTypes: !533, globals: !534, splitDebugInlining: false, nameTableKind: None)
!525 = !{!526, !528, !95}
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !527, line: 42, baseType: !72, size: 32, elements: !83)
!527 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !527, line: 254, baseType: !72, size: 32, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!531 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!532 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!533 = !{!117, !77, !118, !119}
!534 = !{!498, !501, !503, !508, !510, !512, !514, !516, !518, !520, !522, !535, !539, !549, !551, !556, !558, !560, !562, !564, !587, !594, !596}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !524, file: !500, line: 92, type: !537, isLocal: false, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 320, elements: !55)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !524, file: !500, line: 1040, type: !541, isLocal: false, isDefinition: true)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !500, line: 56, size: 448, elements: !542)
!542 = !{!543, !544, !545, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !541, file: !500, line: 59, baseType: !526, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !541, file: !500, line: 62, baseType: !77, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !541, file: !500, line: 66, baseType: !546, size: 256, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !275)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !541, file: !500, line: 69, baseType: !122, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !541, file: !500, line: 72, baseType: !122, size: 64, offset: 384)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !524, file: !500, line: 107, type: !541, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "slot0", scope: !524, file: !500, line: 831, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 256)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !500, line: 321, type: !252, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !500, line: 357, type: !252, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !500, line: 358, type: !252, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !500, line: 199, type: !269, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "quote", scope: !566, file: !500, line: 228, type: !585, isLocal: true, isDefinition: true)
!566 = distinct !DISubprogram(name: "gettext_quote", scope: !500, file: !500, line: 197, type: !567, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !524, retainedNodes: !569)
!567 = !DISubroutineType(types: !568)
!568 = !{!122, !122, !526}
!569 = !{!570, !571, !572, !573, !574}
!570 = !DILocalVariable(name: "msgid", arg: 1, scope: !566, file: !500, line: 197, type: !122)
!571 = !DILocalVariable(name: "s", arg: 2, scope: !566, file: !500, line: 197, type: !526)
!572 = !DILocalVariable(name: "translation", scope: !566, file: !500, line: 199, type: !122)
!573 = !DILocalVariable(name: "w", scope: !566, file: !500, line: 229, type: !480)
!574 = !DILocalVariable(name: "mbs", scope: !566, file: !500, line: 230, type: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !486, line: 6, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !488, line: 21, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 13, size: 64, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !577, file: !488, line: 15, baseType: !77, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !577, file: !488, line: 20, baseType: !581, size: 32, offset: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !488, line: 16, size: 32, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !581, file: !488, line: 18, baseType: !72, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !581, file: !488, line: 19, baseType: !245, size: 32)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !586)
!586 = !{!254, !247}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "slotvec", scope: !524, file: !500, line: 834, type: !589, isLocal: true, isDefinition: true)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !500, line: 823, size: 128, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !500, line: 825, baseType: !119, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !590, file: !500, line: 826, baseType: !116, size: 64, offset: 64)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "nslots", scope: !524, file: !500, line: 832, type: !77, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "slotvec0", scope: !524, file: !500, line: 833, type: !590, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 704, elements: !600)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!600 = !{!601}
!601 = !DISubrange(count: 11)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !604, line: 67, type: !345, isLocal: true, isDefinition: true)
!604 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !604, line: 69, type: !269, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !604, line: 83, type: !269, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !604, line: 83, type: !245, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !604, line: 85, type: !252, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !604, line: 88, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 171)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !604, line: 88, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 34)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !604, line: 105, type: !133, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !604, line: 109, type: !140, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !604, line: 113, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 28)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !604, line: 120, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !604, line: 127, type: !9, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !604, line: 134, type: !296, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !604, line: 142, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 44)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !604, line: 150, type: !14, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !604, line: 159, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 52)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !604, line: 170, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 60)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !604, line: 248, type: !147, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !604, line: 248, type: !321, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !604, line: 254, type: !147, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !604, line: 254, type: !128, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !604, line: 254, type: !296, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !604, line: 259, type: !3, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !604, line: 259, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 29)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !677, file: !678, line: 26, type: !680, isLocal: false, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C11, file: !678, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !679, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!679 = !{!675}
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 376, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 47)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "exit_failure", scope: !685, file: !686, line: 24, type: !688, isLocal: false, isDefinition: true)
!685 = distinct !DICompileUnit(language: DW_LANG_C11, file: !686, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !687, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!687 = !{!683}
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !691, line: 34, type: !64, isLocal: true, isDefinition: true)
!691 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !691, line: 34, type: !269, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !691, line: 34, type: !291, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !698, line: 108, type: !49, isLocal: true, isDefinition: true)
!698 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "internal_state", scope: !701, file: !698, line: 97, type: !704, isLocal: true, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !698, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !702, globals: !703, splitDebugInlining: false, nameTableKind: None)
!702 = !{!117, !119, !124}
!703 = !{!696, !699}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !486, line: 6, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !488, line: 21, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 13, size: 64, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !706, file: !488, line: 15, baseType: !77, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !706, file: !488, line: 20, baseType: !710, size: 32, offset: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !706, file: !488, line: 16, size: 32, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !710, file: !488, line: 18, baseType: !72, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !710, file: !488, line: 19, baseType: !245, size: 32)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !716, line: 35, type: !19, isLocal: true, isDefinition: true)
!716 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !383, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/prog-fprintf.o -MD -MP -MF src/.deps/prog-fprintf.Tpo -c src/prog-fprintf.c -o src/.prog-fprintf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !718, globals: !719, splitDebugInlining: false, nameTableKind: None)
!718 = !{!124}
!719 = !{!381}
!720 = distinct !DICompileUnit(language: DW_LANG_C11, file: !721, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-stripslash.o -MD -MP -MF lib/.deps/libcoreutils_a-stripslash.Tpo -c lib/stripslash.c -o lib/.libcoreutils_a-stripslash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!722 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !604, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !725, retainedTypes: !729, globals: !730, splitDebugInlining: false, nameTableKind: None)
!725 = !{!726}
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !604, line: 40, baseType: !72, size: 32, elements: !727)
!727 = !{!728}
!728 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!729 = !{!117}
!730 = !{!602, !605, !607, !609, !611, !613, !618, !623, !625, !627, !632, !637, !639, !641, !646, !648, !653, !658, !660, !662, !664, !666, !668, !670}
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !732, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !733, retainedTypes: !765, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!733 = !{!734, !746}
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !735, file: !732, line: 188, baseType: !72, size: 32, elements: !744)
!735 = distinct !DISubprogram(name: "x2nrealloc", scope: !732, file: !732, line: 176, type: !736, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !731, retainedNodes: !739)
!736 = !DISubroutineType(types: !737)
!737 = !{!117, !117, !738, !119}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!739 = !{!740, !741, !742, !743}
!740 = !DILocalVariable(name: "p", arg: 1, scope: !735, file: !732, line: 176, type: !117)
!741 = !DILocalVariable(name: "pn", arg: 2, scope: !735, file: !732, line: 176, type: !738)
!742 = !DILocalVariable(name: "s", arg: 3, scope: !735, file: !732, line: 176, type: !119)
!743 = !DILocalVariable(name: "n", scope: !735, file: !732, line: 178, type: !119)
!744 = !{!745}
!745 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !747, file: !732, line: 228, baseType: !72, size: 32, elements: !744)
!747 = distinct !DISubprogram(name: "xpalloc", scope: !732, file: !732, line: 223, type: !748, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !731, retainedNodes: !755)
!748 = !DISubroutineType(types: !749)
!749 = !{!117, !117, !750, !751, !753, !751}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !752, line: 130, baseType: !753)
!752 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !754, line: 18, baseType: !209)
!754 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764}
!756 = !DILocalVariable(name: "pa", arg: 1, scope: !747, file: !732, line: 223, type: !117)
!757 = !DILocalVariable(name: "pn", arg: 2, scope: !747, file: !732, line: 223, type: !750)
!758 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !747, file: !732, line: 223, type: !751)
!759 = !DILocalVariable(name: "n_max", arg: 4, scope: !747, file: !732, line: 223, type: !753)
!760 = !DILocalVariable(name: "s", arg: 5, scope: !747, file: !732, line: 223, type: !751)
!761 = !DILocalVariable(name: "n0", scope: !747, file: !732, line: 230, type: !751)
!762 = !DILocalVariable(name: "n", scope: !747, file: !732, line: 237, type: !751)
!763 = !DILocalVariable(name: "nbytes", scope: !747, file: !732, line: 248, type: !751)
!764 = !DILocalVariable(name: "adjusted_nbytes", scope: !747, file: !732, line: 252, type: !751)
!765 = !{!116, !117}
!766 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !767, splitDebugInlining: false, nameTableKind: None)
!767 = !{!689, !692, !694}
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-basename-lgpl.o -MD -MP -MF lib/.deps/libcoreutils_a-basename-lgpl.Tpo -c lib/basename-lgpl.c -o lib/.libcoreutils_a-basename-lgpl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !770, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!770 = !{!116}
!771 = distinct !DICompileUnit(language: DW_LANG_C11, file: !772, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!773 = distinct !DICompileUnit(language: DW_LANG_C11, file: !774, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!775 = distinct !DICompileUnit(language: DW_LANG_C11, file: !776, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!776 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!777 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !780, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!780 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!781 = distinct !DICompileUnit(language: DW_LANG_C11, file: !716, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !782, splitDebugInlining: false, nameTableKind: None)
!782 = !{!783, !714}
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !716, line: 35, type: !252, isLocal: true, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!787 = distinct !DICompileUnit(language: DW_LANG_C11, file: !788, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!789 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!790 = !{i32 7, !"Dwarf Version", i32 5}
!791 = !{i32 2, !"Debug Info Version", i32 3}
!792 = !{i32 1, !"wchar_size", i32 4}
!793 = !{i32 8, !"PIC Level", i32 2}
!794 = !{i32 7, !"PIE Level", i32 2}
!795 = !{i32 7, !"uwtable", i32 2}
!796 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!797 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 166, type: !798, scopeLine: 167, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !77}
!800 = !{!801}
!801 = !DILocalVariable(name: "status", arg: 1, scope: !797, file: !2, line: 166, type: !77)
!802 = !DILocation(line: 0, scope: !797)
!803 = !DILocation(line: 168, column: 14, scope: !804)
!804 = distinct !DILexicalBlock(scope: !797, file: !2, line: 168, column: 7)
!805 = !DILocation(line: 168, column: 7, scope: !797)
!806 = !DILocation(line: 169, column: 5, scope: !807)
!807 = distinct !DILexicalBlock(scope: !804, file: !2, line: 169, column: 5)
!808 = !{!809, !809, i64 0}
!809 = !{!"any pointer", !810, i64 0}
!810 = !{!"omnipotent char", !811, i64 0}
!811 = !{!"Simple C/C++ TBAA"}
!812 = !DILocation(line: 172, column: 7, scope: !813)
!813 = distinct !DILexicalBlock(scope: !804, file: !2, line: 171, column: 5)
!814 = !DILocation(line: 173, column: 7, scope: !813)
!815 = !DILocation(line: 177, column: 7, scope: !813)
!816 = !DILocation(line: 181, column: 7, scope: !813)
!817 = !DILocation(line: 186, column: 7, scope: !813)
!818 = !DILocation(line: 190, column: 7, scope: !813)
!819 = !DILocation(line: 191, column: 7, scope: !813)
!820 = !DILocalVariable(name: "program", arg: 1, scope: !821, file: !76, line: 836, type: !122)
!821 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !76, file: !76, line: 836, type: !822, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !824)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !122}
!824 = !{!820, !825, !832, !833, !835, !836}
!825 = !DILocalVariable(name: "infomap", scope: !821, file: !76, line: 838, type: !826)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 896, elements: !270)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !821, file: !76, line: 838, size: 128, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !828, file: !76, line: 838, baseType: !122, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !828, file: !76, line: 838, baseType: !122, size: 64, offset: 64)
!832 = !DILocalVariable(name: "node", scope: !821, file: !76, line: 848, type: !122)
!833 = !DILocalVariable(name: "map_prog", scope: !821, file: !76, line: 849, type: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!835 = !DILocalVariable(name: "lc_messages", scope: !821, file: !76, line: 861, type: !122)
!836 = !DILocalVariable(name: "url_program", scope: !821, file: !76, line: 874, type: !122)
!837 = !DILocation(line: 0, scope: !821, inlinedAt: !838)
!838 = distinct !DILocation(line: 192, column: 7, scope: !813)
!839 = !{}
!840 = !DILocation(line: 857, column: 3, scope: !821, inlinedAt: !838)
!841 = !DILocation(line: 861, column: 29, scope: !821, inlinedAt: !838)
!842 = !DILocation(line: 862, column: 7, scope: !843, inlinedAt: !838)
!843 = distinct !DILexicalBlock(scope: !821, file: !76, line: 862, column: 7)
!844 = !DILocation(line: 862, column: 19, scope: !843, inlinedAt: !838)
!845 = !DILocation(line: 862, column: 22, scope: !843, inlinedAt: !838)
!846 = !DILocation(line: 862, column: 7, scope: !821, inlinedAt: !838)
!847 = !DILocation(line: 868, column: 7, scope: !848, inlinedAt: !838)
!848 = distinct !DILexicalBlock(scope: !843, file: !76, line: 863, column: 5)
!849 = !DILocation(line: 870, column: 5, scope: !848, inlinedAt: !838)
!850 = !DILocation(line: 875, column: 3, scope: !821, inlinedAt: !838)
!851 = !DILocation(line: 877, column: 3, scope: !821, inlinedAt: !838)
!852 = !DILocation(line: 194, column: 3, scope: !797)
!853 = !DISubprogram(name: "dcgettext", scope: !854, file: !854, line: 51, type: !855, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!854 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!855 = !DISubroutineType(types: !856)
!856 = !{!116, !122, !122, !77}
!857 = !DISubprogram(name: "__fprintf_chk", scope: !858, file: !858, line: 93, type: !859, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!858 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!859 = !DISubroutineType(types: !860)
!860 = !{!77, !861, !77, !862, null}
!861 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !181)
!862 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !122)
!863 = !DISubprogram(name: "__printf_chk", scope: !858, file: !858, line: 95, type: !864, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!864 = !DISubroutineType(types: !865)
!865 = !{!77, !77, !862, null}
!866 = !DISubprogram(name: "fputs_unlocked", scope: !867, file: !867, line: 691, type: !868, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!867 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!868 = !DISubroutineType(types: !869)
!869 = !{!77, !862, !861}
!870 = !DILocation(line: 0, scope: !159)
!871 = !DILocation(line: 581, column: 7, scope: !167)
!872 = !{!873, !873, i64 0}
!873 = !{!"int", !810, i64 0}
!874 = !DILocation(line: 581, column: 19, scope: !167)
!875 = !DILocation(line: 581, column: 7, scope: !159)
!876 = !DILocation(line: 585, column: 26, scope: !166)
!877 = !DILocation(line: 0, scope: !166)
!878 = !DILocation(line: 586, column: 23, scope: !166)
!879 = !DILocation(line: 586, column: 28, scope: !166)
!880 = !DILocation(line: 586, column: 32, scope: !166)
!881 = !{!810, !810, i64 0}
!882 = !DILocation(line: 586, column: 38, scope: !166)
!883 = !DILocalVariable(name: "__s1", arg: 1, scope: !884, file: !885, line: 1359, type: !122)
!884 = distinct !DISubprogram(name: "streq", scope: !885, file: !885, line: 1359, type: !886, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !888)
!885 = !DIFile(filename: "./lib/string.h", directory: "/src")
!886 = !DISubroutineType(types: !887)
!887 = !{!152, !122, !122}
!888 = !{!883, !889}
!889 = !DILocalVariable(name: "__s2", arg: 2, scope: !884, file: !885, line: 1359, type: !122)
!890 = !DILocation(line: 0, scope: !884, inlinedAt: !891)
!891 = distinct !DILocation(line: 586, column: 41, scope: !166)
!892 = !DILocation(line: 1361, column: 11, scope: !884, inlinedAt: !891)
!893 = !DILocation(line: 1361, column: 10, scope: !884, inlinedAt: !891)
!894 = !DILocation(line: 586, column: 19, scope: !166)
!895 = !DILocation(line: 587, column: 5, scope: !166)
!896 = !DILocation(line: 588, column: 7, scope: !897)
!897 = distinct !DILexicalBlock(scope: !159, file: !76, line: 588, column: 7)
!898 = !DILocation(line: 588, column: 7, scope: !159)
!899 = !DILocation(line: 590, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !897, file: !76, line: 589, column: 5)
!901 = !DILocation(line: 591, column: 7, scope: !900)
!902 = !DILocation(line: 595, column: 37, scope: !159)
!903 = !DILocation(line: 595, column: 35, scope: !159)
!904 = !DILocation(line: 596, column: 29, scope: !159)
!905 = !DILocation(line: 597, column: 8, scope: !174)
!906 = !DILocation(line: 597, column: 7, scope: !159)
!907 = !DILocation(line: 604, column: 24, scope: !173)
!908 = !DILocation(line: 604, column: 12, scope: !174)
!909 = !DILocation(line: 0, scope: !172)
!910 = !DILocation(line: 610, column: 16, scope: !172)
!911 = !DILocation(line: 610, column: 7, scope: !172)
!912 = !DILocation(line: 611, column: 21, scope: !172)
!913 = !{!914, !914, i64 0}
!914 = !{!"short", !810, i64 0}
!915 = !DILocation(line: 611, column: 19, scope: !172)
!916 = !DILocation(line: 611, column: 16, scope: !172)
!917 = !DILocation(line: 610, column: 30, scope: !172)
!918 = distinct !{!918, !911, !912, !919}
!919 = !{!"llvm.loop.mustprogress"}
!920 = !DILocation(line: 612, column: 18, scope: !921)
!921 = distinct !DILexicalBlock(scope: !172, file: !76, line: 612, column: 11)
!922 = !DILocation(line: 612, column: 11, scope: !172)
!923 = !DILocation(line: 620, column: 23, scope: !159)
!924 = !DILocation(line: 625, column: 39, scope: !159)
!925 = !DILocation(line: 626, column: 3, scope: !159)
!926 = !DILocation(line: 626, column: 10, scope: !159)
!927 = !DILocation(line: 626, column: 21, scope: !159)
!928 = !DILocation(line: 628, column: 44, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !76, line: 628, column: 11)
!930 = distinct !DILexicalBlock(scope: !159, file: !76, line: 627, column: 5)
!931 = !DILocation(line: 628, column: 32, scope: !929)
!932 = !DILocation(line: 628, column: 49, scope: !929)
!933 = !DILocation(line: 628, column: 11, scope: !930)
!934 = !DILocation(line: 630, column: 11, scope: !935)
!935 = distinct !DILexicalBlock(scope: !930, file: !76, line: 630, column: 11)
!936 = !DILocation(line: 630, column: 11, scope: !930)
!937 = !DILocation(line: 632, column: 26, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !76, line: 632, column: 15)
!939 = distinct !DILexicalBlock(scope: !935, file: !76, line: 631, column: 9)
!940 = !DILocation(line: 632, column: 34, scope: !938)
!941 = !DILocation(line: 632, column: 37, scope: !938)
!942 = !DILocation(line: 632, column: 15, scope: !939)
!943 = !DILocation(line: 636, column: 16, scope: !944)
!944 = distinct !DILexicalBlock(scope: !939, file: !76, line: 636, column: 15)
!945 = !DILocation(line: 636, column: 29, scope: !944)
!946 = !DILocation(line: 640, column: 16, scope: !930)
!947 = distinct !{!947, !925, !948, !919}
!948 = !DILocation(line: 641, column: 5, scope: !159)
!949 = !DILocation(line: 644, column: 3, scope: !159)
!950 = !DILocation(line: 0, scope: !884, inlinedAt: !951)
!951 = distinct !DILocation(line: 648, column: 31, scope: !159)
!952 = !DILocation(line: 0, scope: !884, inlinedAt: !953)
!953 = distinct !DILocation(line: 649, column: 31, scope: !159)
!954 = !DILocation(line: 0, scope: !884, inlinedAt: !955)
!955 = distinct !DILocation(line: 650, column: 31, scope: !159)
!956 = !DILocation(line: 0, scope: !884, inlinedAt: !957)
!957 = distinct !DILocation(line: 651, column: 31, scope: !159)
!958 = !DILocation(line: 0, scope: !884, inlinedAt: !959)
!959 = distinct !DILocation(line: 652, column: 31, scope: !159)
!960 = !DILocation(line: 0, scope: !884, inlinedAt: !961)
!961 = distinct !DILocation(line: 653, column: 31, scope: !159)
!962 = !DILocation(line: 0, scope: !884, inlinedAt: !963)
!963 = distinct !DILocation(line: 654, column: 31, scope: !159)
!964 = !DILocation(line: 0, scope: !884, inlinedAt: !965)
!965 = distinct !DILocation(line: 655, column: 31, scope: !159)
!966 = !DILocation(line: 0, scope: !884, inlinedAt: !967)
!967 = distinct !DILocation(line: 656, column: 31, scope: !159)
!968 = !DILocation(line: 0, scope: !884, inlinedAt: !969)
!969 = distinct !DILocation(line: 657, column: 31, scope: !159)
!970 = !DILocation(line: 663, column: 7, scope: !971)
!971 = distinct !DILexicalBlock(scope: !159, file: !76, line: 663, column: 7)
!972 = !DILocation(line: 664, column: 7, scope: !971)
!973 = !DILocation(line: 664, column: 10, scope: !971)
!974 = !DILocation(line: 663, column: 7, scope: !159)
!975 = !DILocation(line: 669, column: 7, scope: !976)
!976 = distinct !DILexicalBlock(scope: !971, file: !76, line: 665, column: 5)
!977 = !DILocation(line: 671, column: 5, scope: !976)
!978 = !DILocation(line: 676, column: 7, scope: !979)
!979 = distinct !DILexicalBlock(scope: !971, file: !76, line: 673, column: 5)
!980 = !DILocation(line: 679, column: 3, scope: !159)
!981 = !DILocation(line: 683, column: 3, scope: !159)
!982 = !DILocation(line: 686, column: 3, scope: !159)
!983 = !DILocation(line: 688, column: 3, scope: !159)
!984 = !DILocation(line: 691, column: 3, scope: !159)
!985 = !DILocation(line: 695, column: 3, scope: !159)
!986 = !DILocation(line: 696, column: 1, scope: !159)
!987 = !DISubprogram(name: "setlocale", scope: !988, file: !988, line: 122, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!988 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!989 = !DISubroutineType(types: !990)
!990 = !{!116, !77, !122}
!991 = !DISubprogram(name: "strncmp", scope: !992, file: !992, line: 159, type: !993, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!992 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!993 = !DISubroutineType(types: !994)
!994 = !{!77, !122, !122, !119}
!995 = !DISubprogram(name: "exit", scope: !996, file: !996, line: 624, type: !798, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!996 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!997 = !DISubprogram(name: "getenv", scope: !996, file: !996, line: 641, type: !998, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!998 = !DISubroutineType(types: !999)
!999 = !{!116, !122}
!1000 = !DISubprogram(name: "strcmp", scope: !992, file: !992, line: 156, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!77, !122, !122}
!1003 = !DISubprogram(name: "strspn", scope: !992, file: !992, line: 297, type: !1004, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!121, !122, !122}
!1006 = !DISubprogram(name: "strchr", scope: !992, file: !992, line: 246, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!116, !122, !77}
!1009 = !DISubprogram(name: "__ctype_b_loc", scope: !96, file: !96, line: 79, type: !1010, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!1015 = !DISubprogram(name: "strcspn", scope: !992, file: !992, line: 293, type: !1004, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1016 = !DISubprogram(name: "fwrite_unlocked", scope: !867, file: !867, line: 704, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!119, !1019, !119, !119, !861}
!1019 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1022 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 198, type: !1023, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1026)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!77, !77, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1035, !1038, !1039, !1042, !1079, !1080}
!1027 = !DILocalVariable(name: "argc", arg: 1, scope: !1022, file: !2, line: 198, type: !77)
!1028 = !DILocalVariable(name: "argv", arg: 2, scope: !1022, file: !2, line: 198, type: !1025)
!1029 = !DILocalVariable(name: "optc", scope: !1022, file: !2, line: 208, type: !77)
!1030 = !DILocalVariable(name: "ok", scope: !1022, file: !2, line: 235, type: !152)
!1031 = !DILocalVariable(name: "dir", scope: !1032, file: !2, line: 238, type: !116)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !2, line: 237, column: 5)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !2, line: 236, column: 3)
!1034 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 236, column: 3)
!1035 = !DILocalVariable(name: "rmdir_errno", scope: !1036, file: !2, line: 246, type: !77)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 245, column: 9)
!1037 = distinct !DILexicalBlock(scope: !1032, file: !2, line: 244, column: 11)
!1038 = !DILocalVariable(name: "custom_error", scope: !1036, file: !2, line: 255, type: !152)
!1039 = !DILocalVariable(name: "last_unix_slash", scope: !1040, file: !2, line: 258, type: !122)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 257, column: 13)
!1041 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 256, column: 15)
!1042 = !DILocalVariable(name: "st", scope: !1043, file: !2, line: 261, type: !1045)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 260, column: 17)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 259, column: 19)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1046, line: 26, size: 1152, elements: !1047)
!1046 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1047 = !{!1048, !1050, !1052, !1054, !1056, !1058, !1060, !1061, !1062, !1063, !1065, !1067, !1075, !1076, !1077}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1045, file: !1046, line: 31, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !208, line: 145, baseType: !121)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1045, file: !1046, line: 36, baseType: !1051, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !208, line: 148, baseType: !121)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1045, file: !1046, line: 44, baseType: !1053, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !208, line: 151, baseType: !121)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1045, file: !1046, line: 45, baseType: !1055, size: 32, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !208, line: 150, baseType: !72)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1045, file: !1046, line: 47, baseType: !1057, size: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !208, line: 146, baseType: !72)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1045, file: !1046, line: 48, baseType: !1059, size: 32, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !208, line: 147, baseType: !72)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1045, file: !1046, line: 50, baseType: !77, size: 32, offset: 288)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1045, file: !1046, line: 52, baseType: !1049, size: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1045, file: !1046, line: 57, baseType: !207, size: 64, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1045, file: !1046, line: 61, baseType: !1064, size: 64, offset: 448)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !208, line: 175, baseType: !209)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1045, file: !1046, line: 63, baseType: !1066, size: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !208, line: 180, baseType: !209)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1045, file: !1046, line: 74, baseType: !1068, size: 128, offset: 576)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1069, line: 11, size: 128, elements: !1070)
!1069 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1070 = !{!1071, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1068, file: !1069, line: 16, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !208, line: 160, baseType: !209)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1068, file: !1069, line: 21, baseType: !1074, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !208, line: 197, baseType: !209)
