; ModuleID = 'src/split.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.numname = type { i32, [8 x i8] }
%struct.__mbstate_t = type { i32, %struct.sched_param }
%struct.sched_param = type { i32 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.posix_spawnattr_t = type { i16, i32, %struct.__sigset_t, %struct.__sigset_t, %struct.sched_param, i32, [16 x i32] }
%struct.__sigset_t = type { [16 x i64] }
%struct.posix_spawn_file_actions_t = type { i32, i32, ptr, [16 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon }
%union.anon = type { x86_fp80 }


!328 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1623, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 63)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1637, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 28)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1637, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 2)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1656, type: !292, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1664, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 64)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1670, type: !339, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1672, type: !239, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1684, type: !263, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1701, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 31)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1750, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 12)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1750, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 184, elements: !271)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "filter_command", scope: !110, file: !2, line: 56, type: !215, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "filter_pid", scope: !110, file: !2, line: 59, type: !372, isLocal: true, isDefinition: true)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !373, line: 97, baseType: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !203, line: 154, baseType: !107)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "default_SIGPIPE", scope: !110, file: !2, line: 67, type: !377, isLocal: true, isDefinition: true)
!377 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "outfile", scope: !110, file: !2, line: 73, type: !109, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "suffix_length", scope: !110, file: !2, line: 83, type: !382, isLocal: true, isDefinition: true)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !383, line: 130, baseType: !384)
!383 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !385, line: 18, baseType: !204)
!385 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !110, file: !2, line: 89, type: !215, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !110, file: !2, line: 92, type: !215, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !110, file: !2, line: 98, type: !392, isLocal: true, isDefinition: true)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !393, line: 26, size: 1152, elements: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!394 = !{!395, !397, !399, !401, !403, !405, !407, !408, !409, !410, !412, !414, !422, !423, !424}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !392, file: !393, line: 31, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !203, line: 145, baseType: !214)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !392, file: !393, line: 36, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !203, line: 148, baseType: !214)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !392, file: !393, line: 44, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !203, line: 151, baseType: !214)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !392, file: !393, line: 45, baseType: !402, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !203, line: 150, baseType: !113)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !392, file: !393, line: 47, baseType: !404, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !203, line: 146, baseType: !113)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !392, file: !393, line: 48, baseType: !406, size: 32, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !203, line: 147, baseType: !113)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !392, file: !393, line: 50, baseType: !107, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !392, file: !393, line: 52, baseType: !396, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !392, file: !393, line: 57, baseType: !202, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !392, file: !393, line: 61, baseType: !411, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !203, line: 175, baseType: !204)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !392, file: !393, line: 63, baseType: !413, size: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !203, line: 180, baseType: !204)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !392, file: !393, line: 74, baseType: !415, size: 128, offset: 576)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !416, line: 11, size: 128, elements: !417)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!417 = !{!418, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !415, file: !416, line: 16, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !203, line: 160, baseType: !204)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !415, file: !416, line: 21, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !203, line: 197, baseType: !204)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !392, file: !393, line: 75, baseType: !415, size: 128, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !392, file: !393, line: 76, baseType: !415, size: 128, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !392, file: !393, line: 89, baseType: !425, size: 192, offset: 960)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 192, elements: !264)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "verbose", scope: !110, file: !2, line: 105, type: !377, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !110, file: !2, line: 108, type: !377, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "unbuffered", scope: !110, file: !2, line: 112, type: !377, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !156, line: 729, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 56)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !156, line: 736, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 75)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !444, file: !156, line: 575, type: !107, isLocal: true, isDefinition: true)
!444 = distinct !DISubprogram(name: "oputs_", scope: !156, file: !156, line: 573, type: !445, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !447)
!445 = !DISubroutineType(cc: DW_CC_nocall, types: !446)
!446 = !{null, !215, !215}
!447 = !{!448, !449, !450, !453, !454, !455, !456, !460, !461, !462, !463, !465, !511, !512, !513, !515, !516}
!448 = !DILocalVariable(name: "program", arg: 1, scope: !444, file: !156, line: 573, type: !215)
!449 = !DILocalVariable(name: "option", arg: 2, scope: !444, file: !156, line: 573, type: !215)
!450 = !DILocalVariable(name: "term", scope: !451, file: !156, line: 585, type: !215)
!451 = distinct !DILexicalBlock(scope: !452, file: !156, line: 582, column: 5)
!452 = distinct !DILexicalBlock(scope: !444, file: !156, line: 581, column: 7)
!453 = !DILocalVariable(name: "double_space", scope: !444, file: !156, line: 594, type: !377)
!454 = !DILocalVariable(name: "first_word", scope: !444, file: !156, line: 595, type: !215)
!455 = !DILocalVariable(name: "option_text", scope: !444, file: !156, line: 596, type: !215)
!456 = !DILocalVariable(name: "s", scope: !457, file: !156, line: 608, type: !215)
!457 = distinct !DILexicalBlock(scope: !458, file: !156, line: 605, column: 5)
!458 = distinct !DILexicalBlock(scope: !459, file: !156, line: 604, column: 12)
!459 = distinct !DILexicalBlock(scope: !444, file: !156, line: 597, column: 7)
!460 = !DILocalVariable(name: "spaces", scope: !457, file: !156, line: 609, type: !212)
!461 = !DILocalVariable(name: "anchor_len", scope: !444, file: !156, line: 620, type: !212)
!462 = !DILocalVariable(name: "desc_text", scope: !444, file: !156, line: 625, type: !215)
!463 = !DILocalVariable(name: "__ptr", scope: !464, file: !156, line: 644, type: !215)
!464 = distinct !DILexicalBlock(scope: !444, file: !156, line: 644, column: 3)
!465 = !DILocalVariable(name: "__stream", scope: !464, file: !156, line: 644, type: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !468, line: 7, baseType: !469)
!468 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !470, line: 49, size: 1728, elements: !471)
!470 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !487, !489, !490, !491, !492, !493, !494, !495, !498, !500, !503, !506, !507, !508, !509, !510}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !469, file: !470, line: 51, baseType: !107, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !469, file: !470, line: 54, baseType: !109, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !469, file: !470, line: 55, baseType: !109, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !469, file: !470, line: 56, baseType: !109, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !469, file: !470, line: 57, baseType: !109, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !469, file: !470, line: 58, baseType: !109, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !469, file: !470, line: 59, baseType: !109, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !469, file: !470, line: 60, baseType: !109, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !469, file: !470, line: 61, baseType: !109, size: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !469, file: !470, line: 64, baseType: !109, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !469, file: !470, line: 65, baseType: !109, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !469, file: !470, line: 66, baseType: !109, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !469, file: !470, line: 68, baseType: !485, size: 64, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !470, line: 36, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !469, file: !470, line: 70, baseType: !488, size: 64, offset: 832)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !469, file: !470, line: 72, baseType: !107, size: 32, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !469, file: !470, line: 73, baseType: !107, size: 32, offset: 928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !469, file: !470, line: 74, baseType: !202, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !469, file: !470, line: 77, baseType: !205, size: 16, offset: 1024)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !469, file: !470, line: 78, baseType: !220, size: 8, offset: 1040)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !469, file: !470, line: 79, baseType: !224, size: 8, offset: 1048)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !469, file: !470, line: 81, baseType: !496, size: 64, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !470, line: 43, baseType: null)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !469, file: !470, line: 89, baseType: !499, size: 64, offset: 1152)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !203, line: 153, baseType: !204)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !469, file: !470, line: 91, baseType: !501, size: 64, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !470, line: 37, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !469, file: !470, line: 92, baseType: !504, size: 64, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !470, line: 38, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !469, file: !470, line: 93, baseType: !488, size: 64, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !469, file: !470, line: 94, baseType: !206, size: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !469, file: !470, line: 95, baseType: !212, size: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !469, file: !470, line: 96, baseType: !107, size: 32, offset: 1536)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !469, file: !470, line: 98, baseType: !324, size: 160, offset: 1568)
!511 = !DILocalVariable(name: "__cnt", scope: !464, file: !156, line: 644, type: !212)
!512 = !DILocalVariable(name: "url_program", scope: !444, file: !156, line: 648, type: !215)
!513 = !DILocalVariable(name: "__ptr", scope: !514, file: !156, line: 686, type: !215)
!514 = distinct !DILexicalBlock(scope: !444, file: !156, line: 686, column: 3)
!515 = !DILocalVariable(name: "__stream", scope: !514, file: !156, line: 686, type: !466)
!516 = !DILocalVariable(name: "__cnt", scope: !514, file: !156, line: 686, type: !212)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !156, line: 585, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 5)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !156, line: 586, type: !519, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !156, line: 595, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 4)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !156, line: 620, type: !16, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !156, line: 648, type: !339, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !156, line: 648, type: !519, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !156, line: 649, type: !526, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !156, line: 649, type: !263, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !156, line: 650, type: !519, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !156, line: 651, type: !16, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !156, line: 651, type: !16, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !156, line: 652, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 7)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !156, line: 653, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 8)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !156, line: 654, type: !229, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !156, line: 655, type: !229, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !156, line: 656, type: !229, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !156, line: 657, type: !229, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !156, line: 663, type: !547, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !156, line: 664, type: !229, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !156, line: 669, type: !292, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !156, line: 669, type: !282, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !156, line: 676, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 15)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !156, line: 676, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 61)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !156, line: 679, type: !263, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !156, line: 683, type: !519, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !156, line: 688, type: !519, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !156, line: 691, type: !552, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !156, line: 744, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 216)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !156, line: 839, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 16)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !156, line: 840, type: !244, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !156, line: 841, type: !573, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !156, line: 862, type: !526, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !156, line: 868, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 71)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !156, line: 875, type: !239, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !156, line: 877, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 51)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !156, line: 877, type: !362, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !16, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 137, type: !16, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 138, type: !287, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 139, type: !547, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !314, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 141, type: !287, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 142, type: !309, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !314, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !292, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 146, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 13)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !547, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !552, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !229, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !362, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !519, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !552, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "longopts", scope: !110, file: !2, line: 134, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 4352, elements: !293)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !659, line: 50, size: 256, elements: !660)
!659 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!660 = !{!661, !662, !663, !665}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !658, file: !659, line: 52, baseType: !215, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !658, file: !659, line: 55, baseType: !107, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !659, line: 56, baseType: !664, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !658, file: !659, line: 57, baseType: !107, size: 32, offset: 192)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1363, type: !547, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1396, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 25)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1398, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 21)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "eolchar", scope: !110, file: !2, line: 115, type: !107, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !239, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !110, file: !2, line: 86, type: !215, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 209, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 42)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !110, file: !2, line: 80, type: !377, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "infile", scope: !110, file: !2, line: 95, type: !215, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !339, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "outbase", scope: !110, file: !2, line: 70, type: !215, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "sufindex", scope: !699, file: !2, line: 409, type: !713, isLocal: true, isDefinition: true)
!699 = distinct !DISubprogram(name: "next_file_name", scope: !2, file: !2, line: 406, type: !700, scopeLine: 407, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{null}
!702 = !{!703, !706, !707, !708, !709, !712, !714}
!703 = !DILocalVariable(name: "overflow", scope: !704, file: !2, line: 416, type: !377)
!704 = distinct !DILexicalBlock(scope: !705, file: !2, line: 415, column: 5)
!705 = distinct !DILexicalBlock(scope: !699, file: !2, line: 414, column: 7)
!706 = !DILocalVariable(name: "widen", scope: !704, file: !2, line: 416, type: !377)
!707 = !DILabel(scope: !704, name: "new_name", file: !2, line: 418)
!708 = !DILocalVariable(name: "outfile_size", scope: !704, file: !2, line: 441, type: !382)
!709 = !DILocalVariable(name: "i", scope: !710, file: !2, line: 470, type: !382)
!710 = distinct !DILexicalBlock(scope: !711, file: !2, line: 466, column: 9)
!711 = distinct !DILexicalBlock(scope: !704, file: !2, line: 465, column: 11)
!712 = !DILocalVariable(name: "sufindex_end", scope: !710, file: !2, line: 474, type: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!714 = !DILocalVariable(name: "i", scope: !715, file: !2, line: 497, type: !382)
!715 = distinct !DILexicalBlock(scope: !705, file: !2, line: 494, column: 5)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "outbase_length", scope: !699, file: !2, line: 410, type: !382, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "outfile_length", scope: !699, file: !2, line: 411, type: !382, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !699, file: !2, line: 412, type: !382, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !552, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 208, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 26)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !357, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !110, file: !2, line: 77, type: !109, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !2, line: 521, type: !314, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 532, type: !314, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 534, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 35)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !2, line: 538, type: !675, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 544, type: !519, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !282, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !2, line: 548, type: !234, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 569, type: !254, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !244, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 592, type: !670, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !2, line: 595, type: !16, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !552, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !2, line: 598, type: !263, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !254, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !2, line: 611, type: !239, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !110, file: !2, line: 64, type: !107, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "open_pipes", scope: !110, file: !2, line: 62, type: !664, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !110, file: !2, line: 63, type: !382, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1074, type: !596, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1074, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 608, elements: !64)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 945, type: !362, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 945, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 592, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 74)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !156, line: 952, type: !362, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1197, type: !339, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 646, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !727)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 654, type: !263, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 41)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 664, type: !3, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !2, line: 670, type: !739, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "output_desc", scope: !110, file: !2, line: 101, type: !107, isLocal: true, isDefinition: true)
!804 = !{!805, !806, !807, !808, !809, !810, !814, !815, !816, !817, !818, !820, !823, !825, !826, !829}
!805 = !DILocalVariable(name: "argc", arg: 1, scope: !104, file: !2, line: 1407, type: !107)
!806 = !DILocalVariable(name: "argv", arg: 2, scope: !104, file: !2, line: 1407, type: !108)
!807 = !DILocalVariable(name: "split_type", scope: !104, file: !2, line: 1409, type: !112)
!808 = !DILocalVariable(name: "in_blk_size", scope: !104, file: !2, line: 1410, type: !382)
!809 = !DILocalVariable(name: "page_size", scope: !104, file: !2, line: 1411, type: !382)
!810 = !DILocalVariable(name: "k_units", scope: !104, file: !2, line: 1412, type: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !812, line: 101, baseType: !813)
!812 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !203, line: 72, baseType: !204)
!814 = !DILocalVariable(name: "n_units", scope: !104, file: !2, line: 1413, type: !811)
!815 = !DILocalVariable(name: "c", scope: !104, file: !2, line: 1416, type: !107)
!816 = !DILocalVariable(name: "digits_optind", scope: !104, file: !2, line: 1417, type: !107)
!817 = !DILocalVariable(name: "file_size", scope: !104, file: !2, line: 1418, type: !200)
!818 = !DILocalVariable(name: "this_optind", scope: !819, file: !2, line: 1433, type: !107)
!819 = distinct !DILexicalBlock(scope: !104, file: !2, line: 1431, column: 5)
!820 = !DILocalVariable(name: "suffix_len", scope: !821, file: !2, line: 1449, type: !107)
!821 = distinct !DILexicalBlock(scope: !822, file: !2, line: 1448, column: 11)
!822 = distinct !DILexicalBlock(scope: !819, file: !2, line: 1441, column: 9)
!823 = !DILocalVariable(name: "neweol", scope: !824, file: !2, line: 1512, type: !4)
!824 = distinct !DILexicalBlock(scope: !822, file: !2, line: 1511, column: 11)
!825 = !DILocalVariable(name: "buf", scope: !104, file: !2, line: 1693, type: !109)
!826 = !DILocalVariable(name: "initial_read", scope: !104, file: !2, line: 1694, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !201, line: 77, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !203, line: 194, baseType: !204)
!829 = !DILocalVariable(name: "files", scope: !830, file: !2, line: 1744, type: !832)
!830 = distinct !DILexicalBlock(scope: !831, file: !2, line: 1743, column: 7)
!831 = distinct !DILexicalBlock(scope: !104, file: !2, line: 1712, column: 5)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "of_t", file: !2, line: 1122, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "of_info", file: !2, line: 1116, size: 256, elements: !835)
!835 = !{!836, !837, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "of_name", scope: !834, file: !2, line: 1118, baseType: !109, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ofd", scope: !834, file: !2, line: 1119, baseType: !107, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ofile", scope: !834, file: !2, line: 1120, baseType: !466, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "opid", scope: !834, file: !2, line: 1121, baseType: !372, size: 32, offset: 192)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 120, elements: !574)
!841 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!842 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!843 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!844 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "tempfile", scope: !847, file: !848, line: 86, type: !109, isLocal: true, isDefinition: true)
!847 = distinct !DISubprogram(name: "temp_stream", scope: !848, file: !848, line: 84, type: !849, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !886, retainedNodes: !907)
!848 = !DIFile(filename: "src/temp-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8878e64e34a1409e8108ead719db2042")
!849 = !DISubroutineType(types: !850)
!850 = !{!377, !851, !108}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !468, line: 7, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !470, line: 49, size: 1728, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !854, file: !470, line: 51, baseType: !107, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !854, file: !470, line: 54, baseType: !109, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !854, file: !470, line: 55, baseType: !109, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !854, file: !470, line: 56, baseType: !109, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !854, file: !470, line: 57, baseType: !109, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !854, file: !470, line: 58, baseType: !109, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !854, file: !470, line: 59, baseType: !109, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !854, file: !470, line: 60, baseType: !109, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !854, file: !470, line: 61, baseType: !109, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !854, file: !470, line: 64, baseType: !109, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !854, file: !470, line: 65, baseType: !109, size: 64, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !854, file: !470, line: 66, baseType: !109, size: 64, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !854, file: !470, line: 68, baseType: !485, size: 64, offset: 768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !854, file: !470, line: 70, baseType: !870, size: 64, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !854, file: !470, line: 72, baseType: !107, size: 32, offset: 896)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !854, file: !470, line: 73, baseType: !107, size: 32, offset: 928)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !854, file: !470, line: 74, baseType: !202, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !854, file: !470, line: 77, baseType: !205, size: 16, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !854, file: !470, line: 78, baseType: !220, size: 8, offset: 1040)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !854, file: !470, line: 79, baseType: !224, size: 8, offset: 1048)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !854, file: !470, line: 81, baseType: !496, size: 64, offset: 1088)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !854, file: !470, line: 89, baseType: !499, size: 64, offset: 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !854, file: !470, line: 91, baseType: !501, size: 64, offset: 1216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !854, file: !470, line: 92, baseType: !504, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !854, file: !470, line: 93, baseType: !870, size: 64, offset: 1344)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !854, file: !470, line: 94, baseType: !206, size: 64, offset: 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !854, file: !470, line: 95, baseType: !212, size: 64, offset: 1472)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !854, file: !470, line: 96, baseType: !107, size: 32, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !854, file: !470, line: 98, baseType: !324, size: 160, offset: 1568)
!886 = distinct !DICompileUnit(language: DW_LANG_C11, file: !848, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/temp-stream.o -MD -MP -MF src/.deps/temp-stream.Tpo -c src/temp-stream.c -o src/.temp-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !887, retainedTypes: !888, globals: !889, splitDebugInlining: false, nameTableKind: None)
!887 = !{!160}
!888 = !{!206}
!889 = !{!845, !890, !892, !894, !896, !898, !900, !905}
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !847, file: !848, line: 87, type: !852, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !848, line: 97, type: !739, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !848, line: 101, type: !16, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !848, line: 128, type: !739, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !848, line: 133, type: !263, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !848, line: 136, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 30)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !848, line: 154, type: !357, isLocal: true, isDefinition: true)
!907 = !{!908, !909, !910, !913, !914, !915}
!908 = !DILocalVariable(name: "fp", arg: 1, scope: !847, file: !848, line: 84, type: !851)
!909 = !DILocalVariable(name: "file_name", arg: 2, scope: !847, file: !848, line: 84, type: !108)
!910 = !DILocalVariable(name: "tempbuf", scope: !911, file: !848, line: 90, type: !109)
!911 = distinct !DILexicalBlock(scope: !912, file: !848, line: 89, column: 5)
!912 = distinct !DILexicalBlock(scope: !847, file: !848, line: 88, column: 7)
!913 = !DILocalVariable(name: "tempbuf_len", scope: !911, file: !848, line: 91, type: !212)
!914 = !DILocalVariable(name: "fd", scope: !911, file: !848, line: 125, type: !107)
!915 = !DILabel(scope: !916, name: "Reset", file: !848, line: 140)
!916 = distinct !DILexicalBlock(scope: !917, file: !848, line: 135, column: 9)
!917 = distinct !DILexicalBlock(scope: !911, file: !848, line: 134, column: 11)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !920, line: 3, type: !573, isLocal: true, isDefinition: true)
!920 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "Version", scope: !923, file: !920, line: 3, type: !215, isLocal: false, isDefinition: true)
!923 = distinct !DICompileUnit(language: DW_LANG_C11, file: !920, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !924, splitDebugInlining: false, nameTableKind: None)
!924 = !{!918, !921}
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "file_name", scope: !927, file: !928, line: 45, type: !215, isLocal: true, isDefinition: true)
!927 = distinct !DICompileUnit(language: DW_LANG_C11, file: !928, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !929, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!929 = !{!930, !932, !934, !936, !925, !938}
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !928, line: 121, type: !547, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !928, line: 121, type: !362, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !928, line: 123, type: !547, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !928, line: 126, type: !263, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !927, file: !928, line: 55, type: !377, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !942, file: !943, line: 66, type: !985, isLocal: false, isDefinition: true)
!942 = distinct !DICompileUnit(language: DW_LANG_C11, file: !943, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !944, globals: !945, splitDebugInlining: false, nameTableKind: None)
!943 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!944 = !{!206, !217}
!945 = !{!946, !948, !967, !969, !971, !973, !940, !975, !977, !979, !981, !983}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !943, line: 272, type: !519, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "old_file_name", scope: !950, file: !943, line: 304, type: !215, isLocal: true, isDefinition: true)
!950 = distinct !DISubprogram(name: "verror_at_line", scope: !943, file: !943, line: 298, type: !951, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !942, retainedNodes: !960)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !107, !107, !215, !113, !215, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !955)
!955 = !{!956, !957, !958, !959}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !954, file: !943, baseType: !113, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !954, file: !943, baseType: !113, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !954, file: !943, baseType: !206, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !954, file: !943, baseType: !206, size: 64, offset: 128)
!960 = !{!961, !962, !963, !964, !965, !966}
!961 = !DILocalVariable(name: "status", arg: 1, scope: !950, file: !943, line: 298, type: !107)
!962 = !DILocalVariable(name: "errnum", arg: 2, scope: !950, file: !943, line: 298, type: !107)
!963 = !DILocalVariable(name: "file_name", arg: 3, scope: !950, file: !943, line: 298, type: !215)
!964 = !DILocalVariable(name: "line_number", arg: 4, scope: !950, file: !943, line: 298, type: !113)
!965 = !DILocalVariable(name: "message", arg: 5, scope: !950, file: !943, line: 298, type: !215)
!966 = !DILocalVariable(name: "args", arg: 6, scope: !950, file: !943, line: 298, type: !953)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "old_line_number", scope: !950, file: !943, line: 305, type: !113, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !943, line: 338, type: !526, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !943, line: 346, type: !552, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !943, line: 346, type: !339, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "error_message_count", scope: !942, file: !943, line: 69, type: !113, isLocal: false, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !942, file: !943, line: 295, type: !107, isLocal: false, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !943, line: 208, type: !547, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !943, line: 208, type: !675, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !943, line: 214, type: !519, isLocal: true, isDefinition: true)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "program_name", scope: !988, file: !989, line: 31, type: !215, isLocal: false, isDefinition: true)
!988 = distinct !DICompileUnit(language: DW_LANG_C11, file: !989, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !990, globals: !991, splitDebugInlining: false, nameTableKind: None)
!989 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!990 = !{!206, !109}
!991 = !{!986, !992, !994}
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !989, line: 46, type: !552, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !989, line: 49, type: !526, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "utf07FF", scope: !998, file: !999, line: 46, type: !1026, isLocal: true, isDefinition: true)
!998 = distinct !DISubprogram(name: "proper_name_lite", scope: !999, file: !999, line: 38, type: !1000, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1002, retainedNodes: !1004)
!999 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!215, !215, !215}
!1002 = distinct !DICompileUnit(language: DW_LANG_C11, file: !999, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1003, splitDebugInlining: false, nameTableKind: None)
!1003 = !{!996}
!1004 = !{!1005, !1006, !1007, !1008, !1013}
!1005 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !998, file: !999, line: 38, type: !215)
!1006 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !998, file: !999, line: 38, type: !215)
!1007 = !DILocalVariable(name: "translation", scope: !998, file: !999, line: 40, type: !215)
!1008 = !DILocalVariable(name: "w", scope: !998, file: !999, line: 47, type: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1010, line: 37, baseType: !1011)
!1010 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !203, line: 57, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !203, line: 42, baseType: !113)
!1013 = !DILocalVariable(name: "mbs", scope: !998, file: !999, line: 48, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1015, line: 6, baseType: !1016)
!1015 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1017, line: 21, baseType: !1018)
!1017 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 13, size: 64, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1018, file: !1017, line: 15, baseType: !107, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1018, file: !1017, line: 20, baseType: !1022, size: 32, offset: 32)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1018, file: !1017, line: 16, size: 32, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1022, file: !1017, line: 18, baseType: !113, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1022, file: !1017, line: 19, baseType: !526, size: 32)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 16, elements: !340)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 78, type: !552, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 79, type: !16, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 80, type: !639, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 81, type: !639, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 82, type: !324, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 83, type: !339, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 84, type: !552, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 85, type: !547, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 86, type: !547, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 87, type: !552, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1050, file: !1029, line: 76, type: !1124, isLocal: false, isDefinition: true)
!1050 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1051, retainedTypes: !1059, globals: !1060, splitDebugInlining: false, nameTableKind: None)
!1051 = !{!1052, !1054, !129}
!1052 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1053, line: 42, baseType: !113, size: 32, elements: !162)
!1053 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1054 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !1053, line: 254, baseType: !113, size: 32, elements: !1055)
!1055 = !{!1056, !1057, !1058}
!1056 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1057 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1058 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1059 = !{!206, !107, !205, !212}
!1060 = !{!1027, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1061, !1065, !1075, !1077, !1082, !1084, !1086, !1088, !1090, !1113, !1120, !1122}
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1050, file: !1029, line: 92, type: !1063, isLocal: false, isDefinition: true)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 320, elements: !230)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1050, file: !1029, line: 1040, type: !1067, isLocal: false, isDefinition: true)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1029, line: 56, size: 448, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1073, !1074}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1067, file: !1029, line: 59, baseType: !1052, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1067, file: !1029, line: 62, baseType: !107, size: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1067, file: !1029, line: 66, baseType: !1072, size: 256, offset: 64)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, elements: !553)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1067, file: !1029, line: 69, baseType: !215, size: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1067, file: !1029, line: 72, baseType: !215, size: 64, offset: 384)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1050, file: !1029, line: 107, type: !1067, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "slot0", scope: !1050, file: !1029, line: 831, type: !1079, isLocal: true, isDefinition: true)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 256)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 321, type: !339, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 357, type: !339, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 358, type: !339, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 199, type: !547, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "quote", scope: !1092, file: !1029, line: 228, type: !1111, isLocal: true, isDefinition: true)
!1092 = distinct !DISubprogram(name: "gettext_quote", scope: !1029, file: !1029, line: 197, type: !1093, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1050, retainedNodes: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!215, !215, !1052}
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DILocalVariable(name: "msgid", arg: 1, scope: !1092, file: !1029, line: 197, type: !215)
!1097 = !DILocalVariable(name: "s", arg: 2, scope: !1092, file: !1029, line: 197, type: !1052)
!1098 = !DILocalVariable(name: "translation", scope: !1092, file: !1029, line: 199, type: !215)
!1099 = !DILocalVariable(name: "w", scope: !1092, file: !1029, line: 229, type: !1009)
!1100 = !DILocalVariable(name: "mbs", scope: !1092, file: !1029, line: 230, type: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1015, line: 6, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1017, line: 21, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 13, size: 64, elements: !1104)
!1104 = !{!1105, !1106}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1103, file: !1017, line: 15, baseType: !107, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1103, file: !1017, line: 20, baseType: !1107, size: 32, offset: 32)
!1107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1103, file: !1017, line: 16, size: 32, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1107, file: !1017, line: 18, baseType: !113, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1107, file: !1017, line: 19, baseType: !526, size: 32)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 64, elements: !1112)
!1112 = !{!341, !528}
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(name: "slotvec", scope: !1050, file: !1029, line: 834, type: !1115, isLocal: true, isDefinition: true)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1029, line: 823, size: 128, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !1029, line: 825, baseType: !212, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1116, file: !1029, line: 826, baseType: !109, size: 64, offset: 64)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "nslots", scope: !1050, file: !1029, line: 832, type: !107, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1050, file: !1029, line: 833, type: !1116, isLocal: true, isDefinition: true)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 704, elements: !288)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(name: "numname_table", scope: !1128, file: !1129, line: 43, type: !1138, isLocal: true, isDefinition: true)
!1128 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1129, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-sig2str.o -MD -MP -MF lib/.deps/libcoreutils_a-sig2str.Tpo -c lib/sig2str.c -o lib/.libcoreutils_a-sig2str.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1130, globals: !1131, splitDebugInlining: false, nameTableKind: None)
!1129 = !DIFile(filename: "lib/sig2str.c", directory: "/src", checksumkind: CSK_MD5, checksum: "828136ef7ede39101f7053cda7cea598")
!1130 = !{!113}
!1131 = !{!1132, !1134, !1136, !1126}
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 351, type: !16, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 356, type: !16, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !1129, line: 362, type: !526, isLocal: true, isDefinition: true)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 3360, elements: !740)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !1129, line: 43, size: 96, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1139, file: !1129, line: 43, baseType: !107, size: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1139, file: !1129, line: 43, baseType: !1143, size: 64, offset: 32)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 64, elements: !553)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !1146, line: 98, type: !519, isLocal: true, isDefinition: true)
!1146 = !DIFile(filename: "lib/tmpdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6bb1205c798131b3318a3c96a85b8877")
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1146, line: 110, type: !547, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !1146, line: 132, type: !519, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !1146, line: 160, type: !362, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 67, type: !362, isLocal: true, isDefinition: true)
!1155 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 69, type: !547, isLocal: true, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 83, type: !547, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 83, type: !526, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 85, type: !339, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 88, type: !1166, isLocal: true, isDefinition: true)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1167)
!1167 = !{!1168}
!1168 = !DISubrange(count: 171)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 88, type: !254, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 105, type: !596, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 109, type: !270, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 113, type: !334, isLocal: true, isDefinition: true)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 120, type: !1179, isLocal: true, isDefinition: true)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1180)
!1180 = !{!1181}
!1181 = !DISubrange(count: 32)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 127, type: !1184, isLocal: true, isDefinition: true)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1185)
!1185 = !{!1186}
!1186 = !DISubrange(count: 36)
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 134, type: !282, isLocal: true, isDefinition: true)
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 142, type: !1191, isLocal: true, isDefinition: true)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1192)
!1192 = !{!1193}
!1193 = !DISubrange(count: 44)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 150, type: !249, isLocal: true, isDefinition: true)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 159, type: !1198, isLocal: true, isDefinition: true)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1199)
!1199 = !{!1200}
!1200 = !DISubrange(count: 52)
!1201 = !DIGlobalVariableExpression(var: !1202, expr: !DIExpression())
!1202 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 170, type: !31, isLocal: true, isDefinition: true)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 248, type: !324, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 248, type: !244, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 254, type: !324, isLocal: true, isDefinition: true)
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 254, type: !309, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 254, type: !282, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 259, type: !3, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 259, type: !277, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1219, file: !1220, line: 26, type: !1222, isLocal: false, isDefinition: true)
!1219 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1220, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1221, splitDebugInlining: false, nameTableKind: None)
!1220 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1221 = !{!1217}
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 376, elements: !303)
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1225, file: !1226, line: 24, type: !1228, isLocal: false, isDefinition: true)
!1225 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1226, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1227, splitDebugInlining: false, nameTableKind: None)
!1226 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1227 = !{!1223}
!1228 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!1229 = !DIGlobalVariableExpression(var: !1230, expr: !DIExpression())
!1230 = distinct !DIGlobalVariable(scope: null, file: !1231, line: 34, type: !263, isLocal: true, isDefinition: true)
!1231 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !1231, line: 34, type: !547, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !1231, line: 34, type: !292, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !1238, line: 80, type: !547, isLocal: true, isDefinition: true)
!1238 = !DIFile(filename: "lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(scope: null, file: !1238, line: 80, type: !547, isLocal: true, isDefinition: true)
!1241 = !DIGlobalVariableExpression(var: !1242, expr: !DIExpression())
!1242 = distinct !DIGlobalVariable(scope: null, file: !1243, line: 108, type: !224, isLocal: true, isDefinition: true)
!1243 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(name: "internal_state", scope: !1246, file: !1243, line: 97, type: !1249, isLocal: true, isDefinition: true)
!1246 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1243, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1247, globals: !1248, splitDebugInlining: false, nameTableKind: None)
!1247 = !{!206, !212, !217}
!1248 = !{!1241, !1244}
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1015, line: 6, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1017, line: 21, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 13, size: 64, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1251, file: !1017, line: 15, baseType: !107, size: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1251, file: !1017, line: 20, baseType: !1255, size: 32, offset: 32)
!1255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1251, file: !1017, line: 16, size: 32, elements: !1256)
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1255, file: !1017, line: 18, baseType: !113, size: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1255, file: !1017, line: 19, baseType: !526, size: 32)
!1259 = !DIGlobalVariableExpression(var: !1260, expr: !DIExpression())
!1260 = distinct !DIGlobalVariable(scope: null, file: !1261, line: 4617, type: !526, isLocal: true, isDefinition: true)
!1261 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(scope: null, file: !1261, line: 5292, type: !16, isLocal: true, isDefinition: true)
!1264 = !DIGlobalVariableExpression(var: !1265, expr: !DIExpression())
!1265 = distinct !DIGlobalVariable(name: "decimal_format", scope: !1266, file: !1261, line: 5889, type: !1727, isLocal: true, isDefinition: true)
!1266 = distinct !DISubprogram(name: "vasnprintf", scope: !1261, file: !1261, line: 2459, type: !1267, scopeLine: 2461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1277, retainedNodes: !1812)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!109, !109, !1269, !215, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1271, file: !1261, baseType: !113, size: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1271, file: !1261, baseType: !113, size: 32, offset: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1271, file: !1261, baseType: !206, size: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1271, file: !1261, baseType: !206, size: 64, offset: 128)
!1277 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1261, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-vasnprintf.o -MD -MP -MF lib/.deps/libcoreutils_a-vasnprintf.Tpo -c lib/vasnprintf.c -o lib/.libcoreutils_a-vasnprintf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1278, retainedTypes: !1715, globals: !1724, splitDebugInlining: false, nameTableKind: None)
!1278 = !{!1279, !1329}
!1279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1280, line: 47, baseType: !113, size: 32, elements: !1281)
!1280 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
