; ModuleID = 'src/stty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.mode_info = type { ptr, i32, i8, i64, i64 }
%struct.control_info = type { ptr, i8, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.winsize = type { i16, i16, i16, i16 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.9 }
%union.anon.9 = type { x86_fp80 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 953, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 41)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !2, line: 971, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1624, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 203)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 978, type: !465, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1672, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 209)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !2, line: 978, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 31)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 256)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !445, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !289, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 61)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1083, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2216, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 277)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "mode", scope: !494, file: !2, line: 1291, type: !527, isLocal: true, isDefinition: true)
!494 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1287, type: !495, scopeLine: 1288, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !498)
!495 = !DISubroutineType(types: !496)
!496 = !{!134, !134, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !507, !508, !509, !510, !511, !512, !515, !523, !526}
!499 = !DILocalVariable(name: "argc", arg: 1, scope: !494, file: !2, line: 1287, type: !134)
!500 = !DILocalVariable(name: "argv", arg: 2, scope: !494, file: !2, line: 1287, type: !497)
!501 = !DILocalVariable(name: "output_type", scope: !494, file: !2, line: 1293, type: !123)
!502 = !DILocalVariable(name: "optc", scope: !494, file: !2, line: 1294, type: !134)
!503 = !DILocalVariable(name: "argi", scope: !494, file: !2, line: 1295, type: !134)
!504 = !DILocalVariable(name: "opti", scope: !494, file: !2, line: 1296, type: !134)
!505 = !DILocalVariable(name: "require_set_attr", scope: !494, file: !2, line: 1297, type: !506)
!506 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!507 = !DILocalVariable(name: "verbose_output", scope: !494, file: !2, line: 1298, type: !506)
!508 = !DILocalVariable(name: "recoverable_output", scope: !494, file: !2, line: 1299, type: !506)
!509 = !DILocalVariable(name: "noargs", scope: !494, file: !2, line: 1300, type: !506)
!510 = !DILocalVariable(name: "file_name", scope: !494, file: !2, line: 1301, type: !188)
!511 = !DILocalVariable(name: "device_name", scope: !494, file: !2, line: 1302, type: !196)
!512 = !DILocalVariable(name: "fdflags", scope: !513, file: !2, line: 1401, type: !134)
!513 = distinct !DILexicalBlock(scope: !514, file: !2, line: 1400, column: 5)
!514 = distinct !DILexicalBlock(scope: !494, file: !2, line: 1399, column: 7)
!515 = !DILocalVariable(name: "i", scope: !516, file: !2, line: 1449, type: !124)
!516 = distinct !DILexicalBlock(scope: !517, file: !2, line: 1449, column: 15)
!517 = distinct !DILexicalBlock(scope: !518, file: !2, line: 1447, column: 13)
!518 = distinct !DILexicalBlock(scope: !519, file: !2, line: 1446, column: 15)
!519 = distinct !DILexicalBlock(scope: !520, file: !2, line: 1445, column: 9)
!520 = distinct !DILexicalBlock(scope: !521, file: !2, line: 1444, column: 11)
!521 = distinct !DILexicalBlock(scope: !522, file: !2, line: 1426, column: 5)
!522 = distinct !DILexicalBlock(scope: !494, file: !2, line: 1425, column: 7)
!523 = !DILocalVariable(name: "newc", scope: !524, file: !2, line: 1451, type: !124)
!524 = distinct !DILexicalBlock(scope: !525, file: !2, line: 1450, column: 17)
!525 = distinct !DILexicalBlock(scope: !516, file: !2, line: 1449, column: 15)
!526 = !DILocalVariable(name: "oldc", scope: !524, file: !2, line: 1452, type: !124)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !528, line: 24, size: 480, elements: !529)
!528 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios-struct.h", directory: "", checksumkind: CSK_MD5, checksum: "a512dc8866a1d12d70982670557f907e")
!529 = !{!530, !531, !532, !533, !534, !535, !539, !540}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !527, file: !528, line: 26, baseType: !201, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !527, file: !528, line: 27, baseType: !201, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !527, file: !528, line: 28, baseType: !201, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !527, file: !528, line: 29, baseType: !201, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !527, file: !528, line: 30, baseType: !200, size: 8, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !527, file: !528, line: 31, baseType: !536, size: 256, offset: 136)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !527, file: !528, line: 32, baseType: !198, size: 32, offset: 416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !527, file: !528, line: 33, baseType: !198, size: 32, offset: 448)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1306, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 1)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1307, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 10)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1307, type: !391, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1326, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 6)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1344, type: !368, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1354, type: !450, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1354, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 16)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1359, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 7)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1360, type: !555, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1381, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 632, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 79)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1387, type: !101, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1390, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 15)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "check_mode", scope: !494, file: !2, line: 1394, type: !527, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1403, type: !205, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1406, type: !321, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "new_mode", scope: !494, file: !2, line: 1429, type: !527, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1448, type: !391, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1453, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 25)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1453, type: !205, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1458, type: !84, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "max_col", scope: !121, file: !2, line: 464, type: !134, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "current_col", scope: !121, file: !2, line: 467, type: !134, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "dev_debug", scope: !121, file: !2, line: 473, type: !506, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !133, line: 736, type: !258, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !615, file: !133, line: 575, type: !134, isLocal: true, isDefinition: true)
!615 = distinct !DISubprogram(name: "oputs_", scope: !133, file: !133, line: 573, type: !616, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !618)
!616 = !DISubroutineType(cc: DW_CC_nocall, types: !617)
!617 = !{null, !196, !196}
!618 = !{!619, !620, !621, !624, !625, !626, !627, !631, !632, !633, !634, !636, !689, !690, !691, !693, !694}
!619 = !DILocalVariable(name: "program", arg: 1, scope: !615, file: !133, line: 573, type: !196)
!620 = !DILocalVariable(name: "option", arg: 2, scope: !615, file: !133, line: 573, type: !196)
!621 = !DILocalVariable(name: "term", scope: !622, file: !133, line: 585, type: !196)
!622 = distinct !DILexicalBlock(scope: !623, file: !133, line: 582, column: 5)
!623 = distinct !DILexicalBlock(scope: !615, file: !133, line: 581, column: 7)
!624 = !DILocalVariable(name: "double_space", scope: !615, file: !133, line: 594, type: !506)
!625 = !DILocalVariable(name: "first_word", scope: !615, file: !133, line: 595, type: !196)
!626 = !DILocalVariable(name: "option_text", scope: !615, file: !133, line: 596, type: !196)
!627 = !DILocalVariable(name: "s", scope: !628, file: !133, line: 608, type: !196)
!628 = distinct !DILexicalBlock(scope: !629, file: !133, line: 605, column: 5)
!629 = distinct !DILexicalBlock(scope: !630, file: !133, line: 604, column: 12)
!630 = distinct !DILexicalBlock(scope: !615, file: !133, line: 597, column: 7)
!631 = !DILocalVariable(name: "spaces", scope: !628, file: !133, line: 609, type: !193)
!632 = !DILocalVariable(name: "anchor_len", scope: !615, file: !133, line: 620, type: !193)
!633 = !DILocalVariable(name: "desc_text", scope: !615, file: !133, line: 625, type: !196)
!634 = !DILocalVariable(name: "__ptr", scope: !635, file: !133, line: 644, type: !196)
!635 = distinct !DILexicalBlock(scope: !615, file: !133, line: 644, column: 3)
!636 = !DILocalVariable(name: "__stream", scope: !635, file: !133, line: 644, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !639, line: 7, baseType: !640)
!639 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !641, line: 49, size: 1728, elements: !642)
!641 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !658, !660, !661, !662, !666, !667, !669, !670, !673, !675, !678, !681, !682, !683, !684, !685}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !640, file: !641, line: 51, baseType: !134, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !640, file: !641, line: 54, baseType: !188, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !640, file: !641, line: 55, baseType: !188, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !640, file: !641, line: 56, baseType: !188, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !640, file: !641, line: 57, baseType: !188, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !640, file: !641, line: 58, baseType: !188, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !640, file: !641, line: 59, baseType: !188, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !640, file: !641, line: 60, baseType: !188, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !640, file: !641, line: 61, baseType: !188, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !640, file: !641, line: 64, baseType: !188, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !640, file: !641, line: 65, baseType: !188, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !640, file: !641, line: 66, baseType: !188, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !640, file: !641, line: 68, baseType: !656, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !641, line: 36, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !640, file: !641, line: 70, baseType: !659, size: 64, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !640, file: !641, line: 72, baseType: !134, size: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !640, file: !641, line: 73, baseType: !134, size: 32, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !640, file: !641, line: 74, baseType: !663, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !664, line: 152, baseType: !665)
!664 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!665 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !640, file: !641, line: 77, baseType: !192, size: 16, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !640, file: !641, line: 78, baseType: !668, size: 8, offset: 1040)
!668 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !640, file: !641, line: 79, baseType: !543, size: 8, offset: 1048)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !640, file: !641, line: 81, baseType: !671, size: 64, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !641, line: 43, baseType: null)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !640, file: !641, line: 89, baseType: !674, size: 64, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !664, line: 153, baseType: !665)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !640, file: !641, line: 91, baseType: !676, size: 64, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !641, line: 37, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !640, file: !641, line: 92, baseType: !679, size: 64, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !641, line: 38, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !640, file: !641, line: 93, baseType: !659, size: 64, offset: 1344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !640, file: !641, line: 94, baseType: !189, size: 64, offset: 1408)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !640, file: !641, line: 95, baseType: !193, size: 64, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !640, file: !641, line: 96, baseType: !134, size: 32, offset: 1536)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !640, file: !641, line: 98, baseType: !686, size: 160, offset: 1568)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 20)
!689 = !DILocalVariable(name: "__cnt", scope: !635, file: !133, line: 644, type: !193)
!690 = !DILocalVariable(name: "url_program", scope: !615, file: !133, line: 648, type: !196)
!691 = !DILocalVariable(name: "__ptr", scope: !692, file: !133, line: 686, type: !196)
!692 = distinct !DILexicalBlock(scope: !615, file: !133, line: 686, column: 3)
!693 = !DILocalVariable(name: "__stream", scope: !692, file: !133, line: 686, type: !637)
!694 = !DILocalVariable(name: "__cnt", scope: !692, file: !133, line: 686, type: !193)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !133, line: 585, type: !19, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !133, line: 586, type: !19, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !133, line: 595, type: !210, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !133, line: 620, type: !555, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !133, line: 648, type: !705, isLocal: true, isDefinition: true)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 2)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !133, line: 648, type: !19, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !133, line: 649, type: !210, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !133, line: 649, type: !205, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !133, line: 650, type: !19, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !133, line: 651, type: !555, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !133, line: 651, type: !555, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !133, line: 652, type: !569, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !133, line: 653, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 8)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !133, line: 654, type: !548, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !133, line: 655, type: !548, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !133, line: 656, type: !548, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !133, line: 657, type: !548, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !133, line: 663, type: !569, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !133, line: 664, type: !548, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !133, line: 669, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 17)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !133, line: 669, type: !217, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !133, line: 676, type: !583, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !133, line: 676, type: !484, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !133, line: 679, type: !205, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !133, line: 683, type: !19, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !133, line: 688, type: !19, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !133, line: 691, type: !724, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !133, line: 839, type: !564, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !133, line: 840, type: !54, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !133, line: 841, type: !583, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !133, line: 862, type: !210, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !133, line: 868, type: !361, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !133, line: 875, type: !378, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !133, line: 877, type: !296, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !133, line: 877, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 12)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 488, type: !210, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 489, type: !19, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !2, line: 490, type: !19, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !569, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !19, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 493, type: !724, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "longopts", scope: !121, file: !2, line: 486, type: !791, isLocal: true, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 1792, elements: !570)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !794, line: 50, size: 256, elements: !795)
!794 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!795 = !{!796, !797, !798, !800}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !793, file: !794, line: 52, baseType: !196, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !793, file: !794, line: 55, baseType: !134, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !793, file: !794, line: 56, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !793, file: !794, line: 57, baseType: !134, size: 32, offset: 192)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1152, type: !686, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1161, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 23)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1172, type: !569, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1178, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 18)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1186, type: !569, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1192, type: !812, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1216, type: !19, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1225, type: !19, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1226, type: !724, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1235, type: !19, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1245, type: !19, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1251, type: !378, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1256, type: !555, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !569, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !2, line: 206, type: !569, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !569, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !2, line: 210, type: !210, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !210, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !210, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !210, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !2, line: 214, type: !555, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !210, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !569, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !555, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 218, type: !569, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !2, line: 220, type: !724, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !569, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !569, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !569, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !569, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !555, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !569, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !555, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !2, line: 233, type: !555, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !555, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !19, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !555, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !569, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !2, line: 239, type: !555, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !2, line: 242, type: !555, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !724, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !555, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !555, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !555, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !555, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !555, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !555, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !569, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !555, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !555, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !210, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !2, line: 275, type: !210, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !210, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !2, line: 279, type: !210, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !2, line: 280, type: !210, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !2, line: 281, type: !210, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !2, line: 285, type: !19, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !2, line: 288, type: !19, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !2, line: 291, type: !19, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !19, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !210, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !210, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !2, line: 306, type: !210, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !2, line: 307, type: !210, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !210, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !210, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !2, line: 314, type: !19, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !569, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !2, line: 317, type: !569, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !19, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !555, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 9)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !555, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !2, line: 323, type: !569, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !569, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !555, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !2, line: 329, type: !569, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !724, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !2, line: 333, type: !951, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 336, type: !724, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !724, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !569, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !724, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !2, line: 344, type: !569, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !724, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !555, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !2, line: 353, type: !569, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !2, line: 354, type: !19, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !2, line: 355, type: !205, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !205, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 357, type: !19, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !2, line: 358, type: !569, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !210, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 360, type: !555, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !569, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 362, type: !569, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !724, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 367, type: !19, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !2, line: 370, type: !555, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !555, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !2, line: 373, type: !210, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !2, line: 374, type: !210, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "mode_info", scope: !121, file: !2, line: 203, type: !1016, isLocal: true, isDefinition: true)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 23040, elements: !1025)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_info", file: !2, line: 194, size: 256, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !2, line: 196, baseType: !196, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1018, file: !2, line: 197, baseType: !172, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !2, line: 198, baseType: !4, size: 8, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1018, file: !2, line: 199, baseType: !195, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1018, file: !2, line: 200, baseType: !195, size: 64, offset: 192)
!1025 = !{!1026}
!1026 = !DISubrange(count: 90)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !19, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !2, line: 392, type: !19, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !555, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !19, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !2, line: 395, type: !210, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !2, line: 396, type: !210, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !2, line: 398, type: !19, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !2, line: 401, type: !555, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !555, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !2, line: 404, type: !19, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !19, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !2, line: 410, type: !555, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !2, line: 417, type: !569, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !555, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !555, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !2, line: 424, type: !724, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !2, line: 431, type: !210, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !2, line: 432, type: !19, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "control_info", scope: !121, file: !2, line: 389, type: !1065, isLocal: true, isDefinition: true)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 3648, elements: !283)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_info", file: !2, line: 380, size: 192, elements: !1068)
!1068 = !{!1069, !1070, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1067, file: !2, line: 382, baseType: !196, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "saneval", scope: !1067, file: !2, line: 383, baseType: !200, size: 8, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1067, file: !2, line: 384, baseType: !193, size: 64, offset: 128)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1703, type: !205, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1703, type: !555, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2223, type: !19, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2225, type: !19, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1725, type: !416, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1725, type: !1084, isLocal: true, isDefinition: true)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !1085)
!1085 = !{!1086}
!1086 = !DISubrange(count: 11)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1725, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 536, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 67)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1731, type: !54, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1737, type: !54, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(name: "last_ibaud", scope: !121, file: !2, line: 476, type: !198, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "last_obaud", scope: !121, file: !2, line: 477, type: !198, isLocal: true, isDefinition: true)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2326, type: !205, isLocal: true, isDefinition: true)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2326, type: !598, isLocal: true, isDefinition: true)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1822, type: !217, isLocal: true, isDefinition: true)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1828, type: !416, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1828, type: !569, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2092, type: !564, isLocal: true, isDefinition: true)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2092, type: !19, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2095, type: !1116, isLocal: true, isDefinition: true)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 34)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2095, type: !951, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2082, type: !1123, isLocal: true, isDefinition: true)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !1124)
!1124 = !{!1125}
!1125 = !DISubrange(count: 58)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1853, type: !724, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1920, type: !1084, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !951, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1955, type: !391, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1991, type: !210, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(name: "buf", scope: !1138, file: !2, line: 2274, type: !548, isLocal: true, isDefinition: true)
!1138 = distinct !DISubprogram(name: "visible", scope: !2, file: !2, line: 2272, type: !1139, scopeLine: 2273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !1141)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!196, !200}
!1141 = !{!1142, !1143}
!1142 = !DILocalVariable(name: "ch", arg: 1, scope: !1138, file: !2, line: 2272, type: !200)
!1143 = !DILocalVariable(name: "bpout", scope: !1138, file: !2, line: 2275, type: !188)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2278, type: !724, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2042, type: !805, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2105, type: !564, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2111, type: !19, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !1155, line: 3, type: !583, isLocal: true, isDefinition: true)
!1155 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(name: "Version", scope: !1158, file: !1155, line: 3, type: !196, isLocal: false, isDefinition: true)
!1158 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1155, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1159, splitDebugInlining: false, nameTableKind: None)
!1159 = !{!1153, !1156}
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(name: "file_name", scope: !1162, file: !1163, line: 45, type: !196, isLocal: true, isDefinition: true)
!1162 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1163, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1164, splitDebugInlining: false, nameTableKind: None)
!1163 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1164 = !{!1165, !1167, !1169, !1171, !1160, !1173}
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 121, type: !569, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 121, type: !774, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 123, type: !569, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1163, line: 126, type: !205, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1162, file: !1163, line: 55, type: !506, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1177, file: !1178, line: 66, type: !1220, isLocal: false, isDefinition: true)
!1177 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1178, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1179, globals: !1180, splitDebugInlining: false, nameTableKind: None)
!1178 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1179 = !{!189, !191}
!1180 = !{!1181, !1183, !1202, !1204, !1206, !1208, !1175, !1210, !1212, !1214, !1216, !1218}
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 272, type: !19, isLocal: true, isDefinition: true)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1185, file: !1178, line: 304, type: !196, isLocal: true, isDefinition: true)
!1185 = distinct !DISubprogram(name: "verror_at_line", scope: !1178, file: !1178, line: 298, type: !1186, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1177, retainedNodes: !1195)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{null, !134, !134, !196, !124, !196, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1189, file: !1178, baseType: !124, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1189, file: !1178, baseType: !124, size: 32, offset: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1189, file: !1178, baseType: !189, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1189, file: !1178, baseType: !189, size: 64, offset: 128)
!1195 = !{!1196, !1197, !1198, !1199, !1200, !1201}
!1196 = !DILocalVariable(name: "status", arg: 1, scope: !1185, file: !1178, line: 298, type: !134)
!1197 = !DILocalVariable(name: "errnum", arg: 2, scope: !1185, file: !1178, line: 298, type: !134)
!1198 = !DILocalVariable(name: "file_name", arg: 3, scope: !1185, file: !1178, line: 298, type: !196)
!1199 = !DILocalVariable(name: "line_number", arg: 4, scope: !1185, file: !1178, line: 298, type: !124)
!1200 = !DILocalVariable(name: "message", arg: 5, scope: !1185, file: !1178, line: 298, type: !196)
!1201 = !DILocalVariable(name: "args", arg: 6, scope: !1185, file: !1178, line: 298, type: !1188)
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1185, file: !1178, line: 305, type: !124, isLocal: true, isDefinition: true)
!1204 = !DIGlobalVariableExpression(var: !1205, expr: !DIExpression())
!1205 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 338, type: !210, isLocal: true, isDefinition: true)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 346, type: !724, isLocal: true, isDefinition: true)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 346, type: !705, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1177, file: !1178, line: 69, type: !124, isLocal: false, isDefinition: true)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1177, file: !1178, line: 295, type: !134, isLocal: false, isDefinition: true)
!1214 = !DIGlobalVariableExpression(var: !1215, expr: !DIExpression())
!1215 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 208, type: !569, isLocal: true, isDefinition: true)
!1216 = !DIGlobalVariableExpression(var: !1217, expr: !DIExpression())
!1217 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 208, type: !416, isLocal: true, isDefinition: true)
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 214, type: !19, isLocal: true, isDefinition: true)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null}
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1225, file: !1226, line: 506, type: !134, isLocal: true, isDefinition: true)
!1225 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1226, file: !1226, line: 485, type: !1227, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1229, retainedNodes: !1231)
!1226 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!134, !134, !134}
!1229 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1226, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1230, splitDebugInlining: false, nameTableKind: None)
!1230 = !{!1223}
!1231 = !{!1232, !1233, !1234, !1235, !1238}
!1232 = !DILocalVariable(name: "fd", arg: 1, scope: !1225, file: !1226, line: 485, type: !134)
!1233 = !DILocalVariable(name: "target", arg: 2, scope: !1225, file: !1226, line: 485, type: !134)
!1234 = !DILocalVariable(name: "result", scope: !1225, file: !1226, line: 487, type: !134)
!1235 = !DILocalVariable(name: "flags", scope: !1236, file: !1226, line: 530, type: !134)
!1236 = distinct !DILexicalBlock(scope: !1237, file: !1226, line: 529, column: 5)
!1237 = distinct !DILexicalBlock(scope: !1225, file: !1226, line: 528, column: 7)
!1238 = !DILocalVariable(name: "saved_errno", scope: !1239, file: !1226, line: 533, type: !134)
!1239 = distinct !DILexicalBlock(scope: !1240, file: !1226, line: 532, column: 9)
!1240 = distinct !DILexicalBlock(scope: !1236, file: !1226, line: 531, column: 11)
!1241 = !DIGlobalVariableExpression(var: !1242, expr: !DIExpression())
!1242 = distinct !DIGlobalVariable(name: "program_name", scope: !1243, file: !1244, line: 31, type: !196, isLocal: false, isDefinition: true)
!1243 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1244, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1245, globals: !1246, splitDebugInlining: false, nameTableKind: None)
!1244 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1245 = !{!189, !188}
!1246 = !{!1241, !1247, !1249}
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 46, type: !724, isLocal: true, isDefinition: true)
!1249 = !DIGlobalVariableExpression(var: !1250, expr: !DIExpression())
!1250 = distinct !DIGlobalVariable(scope: null, file: !1244, line: 49, type: !210, isLocal: true, isDefinition: true)
!1251 = !DIGlobalVariableExpression(var: !1252, expr: !DIExpression())
!1252 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1253, file: !1254, line: 46, type: !1281, isLocal: true, isDefinition: true)
!1253 = distinct !DISubprogram(name: "proper_name_lite", scope: !1254, file: !1254, line: 38, type: !1255, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1257, retainedNodes: !1259)
!1254 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!196, !196, !196}
!1257 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1254, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1258, splitDebugInlining: false, nameTableKind: None)
!1258 = !{!1251}
!1259 = !{!1260, !1261, !1262, !1263, !1268}
!1260 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1253, file: !1254, line: 38, type: !196)
!1261 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1253, file: !1254, line: 38, type: !196)
!1262 = !DILocalVariable(name: "translation", scope: !1253, file: !1254, line: 40, type: !196)
!1263 = !DILocalVariable(name: "w", scope: !1253, file: !1254, line: 47, type: !1264)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1265, line: 37, baseType: !1266)
!1265 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !664, line: 57, baseType: !1267)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !664, line: 42, baseType: !124)
!1268 = !DILocalVariable(name: "mbs", scope: !1253, file: !1254, line: 48, type: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1270, line: 6, baseType: !1271)
!1270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1272, line: 21, baseType: !1273)
!1272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1272, line: 13, size: 64, elements: !1274)
!1274 = !{!1275, !1276}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1273, file: !1272, line: 15, baseType: !134, size: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1273, file: !1272, line: 20, baseType: !1277, size: 32, offset: 32)
!1277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1273, file: !1272, line: 16, size: 32, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1277, file: !1272, line: 18, baseType: !124, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1277, file: !1272, line: 19, baseType: !210, size: 32)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 16, elements: !706)
!1282 = !DIGlobalVariableExpression(var: !1283, expr: !DIExpression())
!1283 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 78, type: !724, isLocal: true, isDefinition: true)
!1284 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1285 = !DIGlobalVariableExpression(var: !1286, expr: !DIExpression())
!1286 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 79, type: !555, isLocal: true, isDefinition: true)
!1287 = !DIGlobalVariableExpression(var: !1288, expr: !DIExpression())
!1288 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 80, type: !1289, isLocal: true, isDefinition: true)
!1289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1290)
!1290 = !{!1291}
!1291 = !DISubrange(count: 13)
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 81, type: !1289, isLocal: true, isDefinition: true)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 82, type: !686, isLocal: true, isDefinition: true)
!1296 = !DIGlobalVariableExpression(var: !1297, expr: !DIExpression())
!1297 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 83, type: !705, isLocal: true, isDefinition: true)
!1298 = !DIGlobalVariableExpression(var: !1299, expr: !DIExpression())
!1299 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 84, type: !724, isLocal: true, isDefinition: true)
!1300 = !DIGlobalVariableExpression(var: !1301, expr: !DIExpression())
!1301 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 85, type: !569, isLocal: true, isDefinition: true)
!1302 = !DIGlobalVariableExpression(var: !1303, expr: !DIExpression())
!1303 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 86, type: !569, isLocal: true, isDefinition: true)
!1304 = !DIGlobalVariableExpression(var: !1305, expr: !DIExpression())
!1305 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 87, type: !724, isLocal: true, isDefinition: true)
!1306 = !DIGlobalVariableExpression(var: !1307, expr: !DIExpression())
!1307 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1308, file: !1284, line: 76, type: !1379, isLocal: false, isDefinition: true)
!1308 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1284, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1309, retainedTypes: !1317, globals: !1318, splitDebugInlining: false, nameTableKind: None)
!1309 = !{!1310, !1312, !152}
!1310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1311, line: 42, baseType: !124, size: 32, elements: !140)
!1311 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !1311, line: 254, baseType: !124, size: 32, elements: !1313)
!1313 = !{!1314, !1315, !1316}
!1314 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1315 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1316 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1317 = !{!189, !134, !192, !193}
!1318 = !{!1282, !1285, !1287, !1292, !1294, !1296, !1298, !1300, !1302, !1304, !1306, !1319, !1323, !1333, !1335, !1337, !1339, !1341, !1343, !1345, !1368, !1375, !1377}
!1319 = !DIGlobalVariableExpression(var: !1320, expr: !DIExpression())
!1320 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1308, file: !1284, line: 92, type: !1321, isLocal: false, isDefinition: true)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1322, size: 320, elements: !549)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1323 = !DIGlobalVariableExpression(var: !1324, expr: !DIExpression())
!1324 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1308, file: !1284, line: 1040, type: !1325, isLocal: false, isDefinition: true)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1284, line: 56, size: 448, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1331, !1332}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1325, file: !1284, line: 59, baseType: !1310, size: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1325, file: !1284, line: 62, baseType: !134, size: 32, offset: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1325, file: !1284, line: 66, baseType: !1330, size: 256, offset: 64)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 256, elements: !725)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1325, file: !1284, line: 69, baseType: !196, size: 64, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1325, file: !1284, line: 72, baseType: !196, size: 64, offset: 384)
!1333 = !DIGlobalVariableExpression(var: !1334, expr: !DIExpression())
!1334 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1308, file: !1284, line: 107, type: !1325, isLocal: true, isDefinition: true)
!1335 = !DIGlobalVariableExpression(var: !1336, expr: !DIExpression())
!1336 = distinct !DIGlobalVariable(name: "slot0", scope: !1308, file: !1284, line: 831, type: !475, isLocal: true, isDefinition: true)
!1337 = !DIGlobalVariableExpression(var: !1338, expr: !DIExpression())
!1338 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 321, type: !705, isLocal: true, isDefinition: true)
!1339 = !DIGlobalVariableExpression(var: !1340, expr: !DIExpression())
!1340 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 357, type: !705, isLocal: true, isDefinition: true)
!1341 = !DIGlobalVariableExpression(var: !1342, expr: !DIExpression())
!1342 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 358, type: !705, isLocal: true, isDefinition: true)
!1343 = !DIGlobalVariableExpression(var: !1344, expr: !DIExpression())
!1344 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 199, type: !569, isLocal: true, isDefinition: true)
!1345 = !DIGlobalVariableExpression(var: !1346, expr: !DIExpression())
!1346 = distinct !DIGlobalVariable(name: "quote", scope: !1347, file: !1284, line: 228, type: !1366, isLocal: true, isDefinition: true)
!1347 = distinct !DISubprogram(name: "gettext_quote", scope: !1284, file: !1284, line: 197, type: !1348, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1308, retainedNodes: !1350)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!196, !196, !1310}
!1350 = !{!1351, !1352, !1353, !1354, !1355}
!1351 = !DILocalVariable(name: "msgid", arg: 1, scope: !1347, file: !1284, line: 197, type: !196)
!1352 = !DILocalVariable(name: "s", arg: 2, scope: !1347, file: !1284, line: 197, type: !1310)
!1353 = !DILocalVariable(name: "translation", scope: !1347, file: !1284, line: 199, type: !196)
!1354 = !DILocalVariable(name: "w", scope: !1347, file: !1284, line: 229, type: !1264)
!1355 = !DILocalVariable(name: "mbs", scope: !1347, file: !1284, line: 230, type: !1356)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1270, line: 6, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1272, line: 21, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1272, line: 13, size: 64, elements: !1359)
!1359 = !{!1360, !1361}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1358, file: !1272, line: 15, baseType: !134, size: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1358, file: !1272, line: 20, baseType: !1362, size: 32, offset: 32)
!1362 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1358, file: !1272, line: 16, size: 32, elements: !1363)
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1362, file: !1272, line: 18, baseType: !124, size: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1362, file: !1272, line: 19, baseType: !210, size: 32)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !1367)
!1367 = !{!707, !212}
!1368 = !DIGlobalVariableExpression(var: !1369, expr: !DIExpression())
!1369 = distinct !DIGlobalVariable(name: "slotvec", scope: !1308, file: !1284, line: 834, type: !1370, isLocal: true, isDefinition: true)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1284, line: 823, size: 128, elements: !1372)
!1372 = !{!1373, !1374}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1371, file: !1284, line: 825, baseType: !193, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1371, file: !1284, line: 826, baseType: !188, size: 64, offset: 64)
!1375 = !DIGlobalVariableExpression(var: !1376, expr: !DIExpression())
!1376 = distinct !DIGlobalVariable(name: "nslots", scope: !1308, file: !1284, line: 832, type: !134, isLocal: true, isDefinition: true)
!1377 = !DIGlobalVariableExpression(var: !1378, expr: !DIExpression())
!1378 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1308, file: !1284, line: 833, type: !1371, isLocal: true, isDefinition: true)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 704, elements: !1085)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!1381 = !DIGlobalVariableExpression(var: !1382, expr: !DIExpression())
!1382 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 67, type: !774, isLocal: true, isDefinition: true)
!1383 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1384 = !DIGlobalVariableExpression(var: !1385, expr: !DIExpression())
!1385 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 69, type: !569, isLocal: true, isDefinition: true)
!1386 = !DIGlobalVariableExpression(var: !1387, expr: !DIExpression())
!1387 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 83, type: !569, isLocal: true, isDefinition: true)
!1388 = !DIGlobalVariableExpression(var: !1389, expr: !DIExpression())
!1389 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 83, type: !210, isLocal: true, isDefinition: true)
!1390 = !DIGlobalVariableExpression(var: !1391, expr: !DIExpression())
!1391 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 85, type: !705, isLocal: true, isDefinition: true)
!1392 = !DIGlobalVariableExpression(var: !1393, expr: !DIExpression())
!1393 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 88, type: !1394, isLocal: true, isDefinition: true)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1395)
!1395 = !{!1396}
!1396 = !DISubrange(count: 171)
!1397 = !DIGlobalVariableExpression(var: !1398, expr: !DIExpression())
!1398 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 88, type: !1116, isLocal: true, isDefinition: true)
!1399 = !DIGlobalVariableExpression(var: !1400, expr: !DIExpression())
!1400 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 105, type: !564, isLocal: true, isDefinition: true)
!1401 = !DIGlobalVariableExpression(var: !1402, expr: !DIExpression())
!1402 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 109, type: !805, isLocal: true, isDefinition: true)
!1403 = !DIGlobalVariableExpression(var: !1404, expr: !DIExpression())
!1404 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 113, type: !423, isLocal: true, isDefinition: true)
!1405 = !DIGlobalVariableExpression(var: !1406, expr: !DIExpression())
!1406 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 120, type: !1407, isLocal: true, isDefinition: true)
!1407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !537)
!1408 = !DIGlobalVariableExpression(var: !1409, expr: !DIExpression())
!1409 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 127, type: !1410, isLocal: true, isDefinition: true)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1411)
!1411 = !{!1412}
!1412 = !DISubrange(count: 36)
!1413 = !DIGlobalVariableExpression(var: !1414, expr: !DIExpression())
!1414 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 134, type: !217, isLocal: true, isDefinition: true)
!1415 = !DIGlobalVariableExpression(var: !1416, expr: !DIExpression())
!1416 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 142, type: !435, isLocal: true, isDefinition: true)
!1417 = !DIGlobalVariableExpression(var: !1418, expr: !DIExpression())
!1418 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 150, type: !1419, isLocal: true, isDefinition: true)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1420)
!1420 = !{!1421}
!1421 = !DISubrange(count: 48)
!1422 = !DIGlobalVariableExpression(var: !1423, expr: !DIExpression())
!1423 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 159, type: !89, isLocal: true, isDefinition: true)
!1424 = !DIGlobalVariableExpression(var: !1425, expr: !DIExpression())
!1425 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 170, type: !79, isLocal: true, isDefinition: true)
!1426 = !DIGlobalVariableExpression(var: !1427, expr: !DIExpression())
!1427 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 248, type: !686, isLocal: true, isDefinition: true)
!1428 = !DIGlobalVariableExpression(var: !1429, expr: !DIExpression())
!1429 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 248, type: !54, isLocal: true, isDefinition: true)
!1430 = !DIGlobalVariableExpression(var: !1431, expr: !DIExpression())
!1431 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 254, type: !686, isLocal: true, isDefinition: true)
!1432 = !DIGlobalVariableExpression(var: !1433, expr: !DIExpression())
!1433 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 254, type: !450, isLocal: true, isDefinition: true)
!1434 = !DIGlobalVariableExpression(var: !1435, expr: !DIExpression())
!1435 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 254, type: !217, isLocal: true, isDefinition: true)
!1436 = !DIGlobalVariableExpression(var: !1437, expr: !DIExpression())
!1437 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 259, type: !3, isLocal: true, isDefinition: true)
!1438 = !DIGlobalVariableExpression(var: !1439, expr: !DIExpression())
!1439 = distinct !DIGlobalVariable(scope: null, file: !1383, line: 259, type: !411, isLocal: true, isDefinition: true)
!1440 = !DIGlobalVariableExpression(var: !1441, expr: !DIExpression())
!1441 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1442, file: !1443, line: 26, type: !1445, isLocal: false, isDefinition: true)
!1442 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1443, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1444, splitDebugInlining: false, nameTableKind: None)
!1443 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1444 = !{!1440}
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 376, elements: !85)
!1446 = !DIGlobalVariableExpression(var: !1447, expr: !DIExpression())
!1447 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1448, file: !1449, line: 24, type: !1451, isLocal: false, isDefinition: true)
!1448 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1449, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1450, splitDebugInlining: false, nameTableKind: None)
!1449 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1450 = !{!1446}
!1451 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !134)
!1452 = !DIGlobalVariableExpression(var: !1453, expr: !DIExpression())
!1453 = distinct !DIGlobalVariable(scope: null, file: !1454, line: 34, type: !205, isLocal: true, isDefinition: true)
!1454 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1455 = !DIGlobalVariableExpression(var: !1456, expr: !DIExpression())
!1456 = distinct !DIGlobalVariable(scope: null, file: !1454, line: 34, type: !569, isLocal: true, isDefinition: true)
!1457 = !DIGlobalVariableExpression(var: !1458, expr: !DIExpression())
!1458 = distinct !DIGlobalVariable(scope: null, file: !1454, line: 34, type: !741, isLocal: true, isDefinition: true)
!1459 = !DIGlobalVariableExpression(var: !1460, expr: !DIExpression())
