; ModuleID = 'src/sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@.str = private unnamed_addr constant [9 x i8] c"%05d %5s\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c" %s\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"%d %s\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !17
@.str.1.4 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !23
@.str.2.5 = private unnamed_addr constant [39 x i8] c"Print or check %s (%d-bit) checksums.\0A\00", align 1, !dbg !28
@.str.3.6 = private unnamed_addr constant [4 x i8] c"BSD\00", align 1, !dbg !30

!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 35)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1866, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1868, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 54)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1893, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 15)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !61, file: !19, line: 194, type: !224, isLocal: true, isDefinition: true)
!224 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !61, file: !19, line: 197, type: !227, isLocal: true, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !228, line: 130, baseType: !229)
!228 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !230, line: 18, baseType: !231)
!230 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!231 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !61, file: !19, line: 200, type: !227, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "sum_algorithm", scope: !61, file: !19, line: 253, type: !63, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !69, line: 729, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 56)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !243, file: !69, line: 575, type: !70, isLocal: true, isDefinition: true)
!243 = distinct !DISubprogram(name: "oputs_", scope: !69, file: !69, line: 573, type: !244, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !61, retainedNodes: !246)
!244 = !DISubroutineType(cc: DW_CC_nocall, types: !245)
!245 = !{null, !131, !131}
!246 = !{!247, !248, !249, !252, !253, !254, !255, !259, !260, !261, !262, !264, !315, !316, !317, !319, !320}
!247 = !DILocalVariable(name: "program", arg: 1, scope: !243, file: !69, line: 573, type: !131)
!248 = !DILocalVariable(name: "option", arg: 2, scope: !243, file: !69, line: 573, type: !131)
!249 = !DILocalVariable(name: "term", scope: !250, file: !69, line: 585, type: !131)
!250 = distinct !DILexicalBlock(scope: !251, file: !69, line: 582, column: 5)
!251 = distinct !DILexicalBlock(scope: !243, file: !69, line: 581, column: 7)
!252 = !DILocalVariable(name: "double_space", scope: !243, file: !69, line: 594, type: !224)
!253 = !DILocalVariable(name: "first_word", scope: !243, file: !69, line: 595, type: !131)
!254 = !DILocalVariable(name: "option_text", scope: !243, file: !69, line: 596, type: !131)
!255 = !DILocalVariable(name: "s", scope: !256, file: !69, line: 608, type: !131)
!256 = distinct !DILexicalBlock(scope: !257, file: !69, line: 605, column: 5)
!257 = distinct !DILexicalBlock(scope: !258, file: !69, line: 604, column: 12)
!258 = distinct !DILexicalBlock(scope: !243, file: !69, line: 597, column: 7)
!259 = !DILocalVariable(name: "spaces", scope: !256, file: !69, line: 609, type: !129)
!260 = !DILocalVariable(name: "anchor_len", scope: !243, file: !69, line: 620, type: !129)
!261 = !DILocalVariable(name: "desc_text", scope: !243, file: !69, line: 625, type: !131)
!262 = !DILocalVariable(name: "__ptr", scope: !263, file: !69, line: 644, type: !131)
!263 = distinct !DILexicalBlock(scope: !243, file: !69, line: 644, column: 3)
!264 = !DILocalVariable(name: "__stream", scope: !263, file: !69, line: 644, type: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !267, line: 7, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !269, line: 49, size: 1728, elements: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !286, !288, !289, !290, !292, !293, !295, !296, !299, !301, !304, !307, !308, !309, !310, !311}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !268, file: !269, line: 51, baseType: !70, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !268, file: !269, line: 54, baseType: !126, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !268, file: !269, line: 55, baseType: !126, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !268, file: !269, line: 56, baseType: !126, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !268, file: !269, line: 57, baseType: !126, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !268, file: !269, line: 58, baseType: !126, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !268, file: !269, line: 59, baseType: !126, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !268, file: !269, line: 60, baseType: !126, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !268, file: !269, line: 61, baseType: !126, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !268, file: !269, line: 64, baseType: !126, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !268, file: !269, line: 65, baseType: !126, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !268, file: !269, line: 66, baseType: !126, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !268, file: !269, line: 68, baseType: !284, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !269, line: 36, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !268, file: !269, line: 70, baseType: !287, size: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !268, file: !269, line: 72, baseType: !70, size: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !268, file: !269, line: 73, baseType: !70, size: 32, offset: 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !268, file: !269, line: 74, baseType: !291, size: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !231)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !268, file: !269, line: 77, baseType: !128, size: 16, offset: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !268, file: !269, line: 78, baseType: !294, size: 8, offset: 1040)
!294 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !268, file: !269, line: 79, baseType: !138, size: 8, offset: 1048)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !268, file: !269, line: 81, baseType: !297, size: 64, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !269, line: 43, baseType: null)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !268, file: !269, line: 89, baseType: !300, size: 64, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !231)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !268, file: !269, line: 91, baseType: !302, size: 64, offset: 1216)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !269, line: 37, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !268, file: !269, line: 92, baseType: !305, size: 64, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !269, line: 38, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !268, file: !269, line: 93, baseType: !287, size: 64, offset: 1344)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !268, file: !269, line: 94, baseType: !127, size: 64, offset: 1408)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !268, file: !269, line: 95, baseType: !129, size: 64, offset: 1472)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !268, file: !269, line: 96, baseType: !70, size: 32, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !268, file: !269, line: 98, baseType: !312, size: 160, offset: 1568)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 20)
!315 = !DILocalVariable(name: "__cnt", scope: !263, file: !69, line: 644, type: !129)
!316 = !DILocalVariable(name: "url_program", scope: !243, file: !69, line: 648, type: !131)
!317 = !DILocalVariable(name: "__ptr", scope: !318, file: !69, line: 686, type: !131)
!318 = distinct !DILexicalBlock(scope: !243, file: !69, line: 686, column: 3)
!319 = !DILocalVariable(name: "__stream", scope: !318, file: !69, line: 686, type: !265)
!320 = !DILocalVariable(name: "__cnt", scope: !318, file: !69, line: 686, type: !129)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !69, line: 585, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 5)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !69, line: 586, type: !323, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !69, line: 595, type: !9, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !69, line: 620, type: !14, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !209, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !323, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !9, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !153, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !69, line: 650, type: !323, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !14, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !14, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !69, line: 652, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 7)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !69, line: 653, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 8)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !69, line: 654, type: !143, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !69, line: 655, type: !143, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !69, line: 656, type: !143, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !69, line: 657, type: !143, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !69, line: 663, type: !348, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !69, line: 664, type: !143, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 17)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !34, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !219, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 61)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !153, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !323, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !323, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !353, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !168, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 22)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !219, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !9, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 71)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 27)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 51)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !418, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 12)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !19, line: 480, type: !323, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !19, line: 483, type: !323, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !19, line: 484, type: !353, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression(DW_OP_constu, 10, DW_OP_stack_value))
!428 = distinct !DIGlobalVariable(name: "digest_delim", scope: !61, file: !19, line: 224, type: !133, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!430 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !61, file: !19, line: 211, type: !224, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!432 = distinct !DIGlobalVariable(name: "status_only", scope: !61, file: !19, line: 204, type: !224, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!434 = distinct !DIGlobalVariable(name: "warn", scope: !61, file: !19, line: 208, type: !224, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!436 = distinct !DIGlobalVariable(name: "quiet", scope: !61, file: !19, line: 214, type: !224, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!438 = distinct !DIGlobalVariable(name: "strict", scope: !61, file: !19, line: 218, type: !224, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!440 = distinct !DIGlobalVariable(name: "raw_digest", scope: !61, file: !19, line: 232, type: !224, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1390, type: !209, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1393, type: !153, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1410, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 28)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1440, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 47)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1461, type: !353, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1461, type: !312, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1490, type: !14, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1490, type: !348, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1492, type: !153, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1512, type: !219, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1520, type: !452, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1528, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 42)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1528, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 44)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1536, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 43)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1536, type: !476, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1544, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 45)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1544, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 46)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1552, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 25)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression(DW_OP_constu, 18446744073709551615, DW_OP_stack_value))
!502 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !61, file: !19, line: 221, type: !70, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "bin2hex", scope: !505, file: !19, line: 1345, type: !515, isLocal: true, isDefinition: true)
!505 = distinct !DISubprogram(name: "hex_equal", scope: !19, file: !19, line: 1343, type: !506, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !61, retainedNodes: !510)
!506 = !DISubroutineType(types: !507)
!507 = !{!224, !508, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!510 = !{!511, !512, !513, !514}
!511 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !505, file: !19, line: 1343, type: !508)
!512 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !505, file: !19, line: 1343, type: !508)
!513 = !DILocalVariable(name: "digest_bin_bytes", scope: !505, file: !19, line: 1349, type: !227)
!514 = !DILocalVariable(name: "cnt", scope: !505, file: !19, line: 1353, type: !227)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 128, elements: !169)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !69, line: 952, type: !418, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "sumfns", scope: !61, file: !19, line: 254, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 128, elements: !210)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !522, line: 7, baseType: !523)
!522 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!70, !265, !127, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !109, line: 101, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !111, line: 72, baseType: !231)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "sum_output_fns", scope: !61, file: !19, line: 259, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 128, elements: !210)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !19, line: 244, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !131, !70, !536, !224, !224, !133, !224, !527}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 1024, elements: !10)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !541, line: 50, size: 256, elements: !542)
!541 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!542 = !{!543, !544, !545, !547}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !541, line: 52, baseType: !131, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !540, file: !541, line: 55, baseType: !70, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !541, line: 56, baseType: !546, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !540, file: !541, line: 57, baseType: !70, size: 32, offset: 192)
!548 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!549 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !552, line: 3, type: !219, isLocal: true, isDefinition: true)
!552 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "Version", scope: !555, file: !552, line: 3, type: !131, isLocal: false, isDefinition: true)
!555 = distinct !DICompileUnit(language: DW_LANG_C11, file: !552, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !556, splitDebugInlining: false, nameTableKind: None)
!556 = !{!550, !553}
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "file_name", scope: !559, file: !560, line: 45, type: !131, isLocal: true, isDefinition: true)
!559 = distinct !DICompileUnit(language: DW_LANG_C11, file: !560, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !561, splitDebugInlining: false, nameTableKind: None)
!560 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!561 = !{!562, !564, !566, !568, !557, !570}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !560, line: 121, type: !348, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !560, line: 121, type: !418, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !560, line: 123, type: !348, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !560, line: 126, type: !153, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !559, file: !560, line: 55, type: !224, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !574, file: !575, line: 66, type: !620, isLocal: false, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C11, file: !575, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !576, globals: !577, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!576 = !{!127, !133}
!577 = !{!578, !580, !599, !601, !603, !605, !572, !607, !609, !611, !613, !618}
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !575, line: 272, type: !323, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "old_file_name", scope: !582, file: !575, line: 304, type: !131, isLocal: true, isDefinition: true)
!582 = distinct !DISubprogram(name: "verror_at_line", scope: !575, file: !575, line: 298, type: !583, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !574, retainedNodes: !592)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !70, !70, !131, !64, !131, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !587)
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !586, file: !575, baseType: !64, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !586, file: !575, baseType: !64, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !586, file: !575, baseType: !127, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !586, file: !575, baseType: !127, size: 64, offset: 128)
!592 = !{!593, !594, !595, !596, !597, !598}
!593 = !DILocalVariable(name: "status", arg: 1, scope: !582, file: !575, line: 298, type: !70)
!594 = !DILocalVariable(name: "errnum", arg: 2, scope: !582, file: !575, line: 298, type: !70)
!595 = !DILocalVariable(name: "file_name", arg: 3, scope: !582, file: !575, line: 298, type: !131)
!596 = !DILocalVariable(name: "line_number", arg: 4, scope: !582, file: !575, line: 298, type: !64)
!597 = !DILocalVariable(name: "message", arg: 5, scope: !582, file: !575, line: 298, type: !131)
!598 = !DILocalVariable(name: "args", arg: 6, scope: !582, file: !575, line: 298, type: !585)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "old_line_number", scope: !582, file: !575, line: 305, type: !64, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !575, line: 338, type: !9, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !575, line: 346, type: !353, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !575, line: 346, type: !209, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "error_message_count", scope: !574, file: !575, line: 69, type: !64, isLocal: false, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !574, file: !575, line: 295, type: !70, isLocal: false, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !575, line: 208, type: !348, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !575, line: 208, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 21)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !575, line: 214, type: !323, isLocal: true, isDefinition: true)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null}
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !625, line: 161, type: !209, isLocal: true, isDefinition: true)
!625 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !625, line: 163, type: !138, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !625, line: 233, type: !14, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !625, line: 251, type: !14, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "power_letter", scope: !634, file: !625, line: 36, type: !682, isLocal: true, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C11, file: !625, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-human.o -MD -MP -MF lib/.deps/libcoreutils_a-human.Tpo -c lib/human.c -o lib/.libcoreutils_a-human.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!635 = !{!636, !649}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !637, line: 47, baseType: !64, size: 32, elements: !638)
!637 = !DIFile(filename: "lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!639 = !DIEnumerator(name: "human_ceiling", value: 0)
!640 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!641 = !DIEnumerator(name: "human_floor", value: 2)
!642 = !DIEnumerator(name: "human_group_digits", value: 4)
!643 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!644 = !DIEnumerator(name: "human_autoscale", value: 16)
!645 = !DIEnumerator(name: "human_base_1024", value: 32)
!646 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!647 = !DIEnumerator(name: "human_SI", value: 128)
!648 = !DIEnumerator(name: "human_B", value: 256)
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !650, line: 30, baseType: !64, size: 32, elements: !651)
!650 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!651 = !{!652, !653, !654, !655, !656}
!652 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!653 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!654 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!655 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!656 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!657 = !{!536, !127}
!658 = !{!623, !626, !628, !630, !632, !659, !664, !666, !668, !670, !672, !676, !680}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !625, line: 417, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 11)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !625, line: 418, type: !143, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !625, line: 438, type: !163, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !625, line: 398, type: !219, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !625, line: 398, type: !153, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "block_size_args", scope: !634, file: !625, line: 398, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 192, elements: !154)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !634, file: !625, line: 399, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 64, elements: !210)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !625, line: 408, type: !168, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 88, elements: !662)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "program_name", scope: !685, file: !686, line: 31, type: !131, isLocal: false, isDefinition: true)
!685 = distinct !DICompileUnit(language: DW_LANG_C11, file: !686, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !687, globals: !688, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!687 = !{!127, !126}
!688 = !{!683, !689, !691}
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !686, line: 46, type: !353, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !686, line: 49, type: !9, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "utf07FF", scope: !695, file: !696, line: 46, type: !723, isLocal: true, isDefinition: true)
!695 = distinct !DISubprogram(name: "proper_name_lite", scope: !696, file: !696, line: 38, type: !697, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !699, retainedNodes: !701)
!696 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!697 = !DISubroutineType(types: !698)
!698 = !{!131, !131, !131}
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !696, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !700, splitDebugInlining: false, nameTableKind: None)
!700 = !{!693}
!701 = !{!702, !703, !704, !705, !710}
!702 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !695, file: !696, line: 38, type: !131)
!703 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !695, file: !696, line: 38, type: !131)
!704 = !DILocalVariable(name: "translation", scope: !695, file: !696, line: 40, type: !131)
!705 = !DILocalVariable(name: "w", scope: !695, file: !696, line: 47, type: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !707, line: 37, baseType: !708)
!707 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !111, line: 57, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !111, line: 42, baseType: !64)
!710 = !DILocalVariable(name: "mbs", scope: !695, file: !696, line: 48, type: !711)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !712, line: 6, baseType: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !714, line: 21, baseType: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 13, size: 64, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !715, file: !714, line: 15, baseType: !70, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !715, file: !714, line: 20, baseType: !719, size: 32, offset: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !714, line: 16, size: 32, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !719, file: !714, line: 18, baseType: !64, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !719, file: !714, line: 19, baseType: !9, size: 32)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 16, elements: !210)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !726, line: 78, type: !353, isLocal: true, isDefinition: true)
!726 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !726, line: 79, type: !14, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !726, line: 80, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 13)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !726, line: 81, type: !731, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !726, line: 82, type: !312, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !726, line: 83, type: !209, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !726, line: 84, type: !353, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !726, line: 85, type: !348, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !726, line: 86, type: !348, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !726, line: 87, type: !353, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !750, file: !726, line: 76, type: !824, isLocal: false, isDefinition: true)
!750 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !751, retainedTypes: !759, globals: !760, splitDebugInlining: false, nameTableKind: None)
!751 = !{!752, !754, !74}
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !753, line: 42, baseType: !64, size: 32, elements: !91)
!753 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!754 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !753, line: 254, baseType: !64, size: 32, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!757 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!758 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!759 = !{!127, !70, !128, !129}
!760 = !{!724, !727, !729, !734, !736, !738, !740, !742, !744, !746, !748, !761, !765, !775, !777, !782, !784, !786, !788, !790, !813, !820, !822}
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !750, file: !726, line: 92, type: !763, isLocal: false, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 320, elements: !144)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !750, file: !726, line: 1040, type: !767, isLocal: false, isDefinition: true)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !726, line: 56, size: 448, elements: !768)
!768 = !{!769, !770, !771, !773, !774}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !767, file: !726, line: 59, baseType: !752, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !767, file: !726, line: 62, baseType: !70, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !767, file: !726, line: 66, baseType: !772, size: 256, offset: 64)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !354)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !767, file: !726, line: 69, baseType: !131, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !767, file: !726, line: 72, baseType: !131, size: 64, offset: 384)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !750, file: !726, line: 107, type: !767, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "slot0", scope: !750, file: !726, line: 831, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 256)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !726, line: 321, type: !209, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !726, line: 357, type: !209, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !726, line: 358, type: !209, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !726, line: 199, type: !348, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "quote", scope: !792, file: !726, line: 228, type: !811, isLocal: true, isDefinition: true)
!792 = distinct !DISubprogram(name: "gettext_quote", scope: !726, file: !726, line: 197, type: !793, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !750, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{!131, !131, !752}
!795 = !{!796, !797, !798, !799, !800}
!796 = !DILocalVariable(name: "msgid", arg: 1, scope: !792, file: !726, line: 197, type: !131)
!797 = !DILocalVariable(name: "s", arg: 2, scope: !792, file: !726, line: 197, type: !752)
!798 = !DILocalVariable(name: "translation", scope: !792, file: !726, line: 199, type: !131)
!799 = !DILocalVariable(name: "w", scope: !792, file: !726, line: 229, type: !706)
!800 = !DILocalVariable(name: "mbs", scope: !792, file: !726, line: 230, type: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !712, line: 6, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !714, line: 21, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 13, size: 64, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !803, file: !714, line: 15, baseType: !70, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !803, file: !714, line: 20, baseType: !807, size: 32, offset: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !714, line: 16, size: 32, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !807, file: !714, line: 18, baseType: !64, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !807, file: !714, line: 19, baseType: !9, size: 32)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !812)
!812 = !{!211, !11}
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "slotvec", scope: !750, file: !726, line: 834, type: !815, isLocal: true, isDefinition: true)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !726, line: 823, size: 128, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !816, file: !726, line: 825, baseType: !129, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !816, file: !726, line: 826, baseType: !126, size: 64, offset: 64)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "nslots", scope: !750, file: !726, line: 832, type: !70, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "slotvec0", scope: !750, file: !726, line: 833, type: !816, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 704, elements: !662)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !827, line: 67, type: !418, isLocal: true, isDefinition: true)
!827 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !827, line: 69, type: !348, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !827, line: 83, type: !348, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !827, line: 83, type: !9, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !827, line: 85, type: !209, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !827, line: 88, type: !838, isLocal: true, isDefinition: true)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 171)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !827, line: 88, type: !843, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 34)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !827, line: 105, type: !168, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !827, line: 109, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 23)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !827, line: 113, type: !447, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !827, line: 120, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 32)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !827, line: 127, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 36)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !827, line: 134, type: !34, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !827, line: 142, type: !476, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !827, line: 150, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 48)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !827, line: 159, type: !876, isLocal: true, isDefinition: true)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 52)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !827, line: 170, type: !173, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !827, line: 248, type: !312, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !827, line: 248, type: !394, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !827, line: 254, type: !312, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !827, line: 254, type: !158, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !827, line: 254, type: !34, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !827, line: 259, type: !20, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !827, line: 259, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 29)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !900, file: !901, line: 26, type: !903, isLocal: false, isDefinition: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C11, file: !901, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !902, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!902 = !{!898}
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 376, elements: !453)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "exit_failure", scope: !906, file: !907, line: 24, type: !909, isLocal: false, isDefinition: true)
!906 = distinct !DICompileUnit(language: DW_LANG_C11, file: !907, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !908, splitDebugInlining: false, nameTableKind: None)
!907 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!908 = !{!904}
!909 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !912, line: 34, type: !153, isLocal: true, isDefinition: true)
!912 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !912, line: 34, type: !348, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !912, line: 34, type: !370, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !919, file: !920, line: 65, type: !936, isLocal: false, isDefinition: true)
!919 = distinct !DICompileUnit(language: DW_LANG_C11, file: !920, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !921, retainedTypes: !922, globals: !923, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!921 = !{!752}
!922 = !{!127, !131, !133}
!923 = !{!917, !924, !926, !928, !930, !932, !934}
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !920, line: 141, type: !348, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !920, line: 141, type: !408, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !920, line: 142, type: !895, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !920, line: 160, type: !615, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !920, line: 165, type: !353, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !920, line: 170, type: !323, isLocal: true, isDefinition: true)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !937, line: 69, baseType: !620)
!937 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !940, file: !941, line: 506, type: !70, isLocal: true, isDefinition: true)
!940 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !941, file: !941, line: 485, type: !942, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !944, retainedNodes: !946)
!941 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!942 = !DISubroutineType(types: !943)
!943 = !{!70, !70, !70}
!944 = distinct !DICompileUnit(language: DW_LANG_C11, file: !941, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !945, splitDebugInlining: false, nameTableKind: None)
!945 = !{!938}
!946 = !{!947, !948, !949, !950, !953}
!947 = !DILocalVariable(name: "fd", arg: 1, scope: !940, file: !941, line: 485, type: !70)
!948 = !DILocalVariable(name: "target", arg: 2, scope: !940, file: !941, line: 485, type: !70)
!949 = !DILocalVariable(name: "result", scope: !940, file: !941, line: 487, type: !70)
!950 = !DILocalVariable(name: "flags", scope: !951, file: !941, line: 530, type: !70)
!951 = distinct !DILexicalBlock(scope: !952, file: !941, line: 529, column: 5)
!952 = distinct !DILexicalBlock(scope: !940, file: !941, line: 528, column: 7)
!953 = !DILocalVariable(name: "saved_errno", scope: !954, file: !941, line: 533, type: !70)
!954 = distinct !DILexicalBlock(scope: !955, file: !941, line: 532, column: 9)
!955 = distinct !DILexicalBlock(scope: !951, file: !941, line: 531, column: 11)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !958, line: 108, type: !138, isLocal: true, isDefinition: true)
!958 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "internal_state", scope: !961, file: !958, line: 97, type: !964, isLocal: true, isDefinition: true)
!961 = distinct !DICompileUnit(language: DW_LANG_C11, file: !958, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !962, globals: !963, splitDebugInlining: false, nameTableKind: None)
!962 = !{!127, !129, !133}
!963 = !{!956, !959}
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !712, line: 6, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !714, line: 21, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 13, size: 64, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !966, file: !714, line: 15, baseType: !70, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !966, file: !714, line: 20, baseType: !970, size: 32, offset: 32)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !966, file: !714, line: 16, size: 32, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !970, file: !714, line: 18, baseType: !64, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !970, file: !714, line: 19, baseType: !9, size: 32)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !976, line: 35, type: !14, isLocal: true, isDefinition: true)
!976 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!977 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -D HASH_ALGO_SUM=1 -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/sum-sum.o -MD -MP -MF src/.deps/sum-sum.Tpo -c src/sum.c -o src/.sum-sum.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !978, retainedTypes: !1065, globals: !1067, splitDebugInlining: false, nameTableKind: None)
!978 = !{!979, !1041, !1063}
!979 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !980, file: !2, line: 40, baseType: !64, size: 32, elements: !1039)
!980 = distinct !DISubprogram(name: "bsd_sum_stream", scope: !2, file: !2, line: 34, type: !981, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !977, retainedNodes: !1017)
!981 = !DISubroutineType(types: !982)
!982 = !{!70, !983, !127, !526}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !267, line: 7, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !269, line: 49, size: 1728, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !985, file: !269, line: 51, baseType: !70, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !985, file: !269, line: 54, baseType: !126, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !985, file: !269, line: 55, baseType: !126, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !985, file: !269, line: 56, baseType: !126, size: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !985, file: !269, line: 57, baseType: !126, size: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !985, file: !269, line: 58, baseType: !126, size: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !985, file: !269, line: 59, baseType: !126, size: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !985, file: !269, line: 60, baseType: !126, size: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !985, file: !269, line: 61, baseType: !126, size: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !985, file: !269, line: 64, baseType: !126, size: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !985, file: !269, line: 65, baseType: !126, size: 64, offset: 640)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !985, file: !269, line: 66, baseType: !126, size: 64, offset: 704)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !985, file: !269, line: 68, baseType: !284, size: 64, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !985, file: !269, line: 70, baseType: !1001, size: 64, offset: 832)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !985, file: !269, line: 72, baseType: !70, size: 32, offset: 896)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !985, file: !269, line: 73, baseType: !70, size: 32, offset: 928)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !985, file: !269, line: 74, baseType: !291, size: 64, offset: 960)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !985, file: !269, line: 77, baseType: !128, size: 16, offset: 1024)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !985, file: !269, line: 78, baseType: !294, size: 8, offset: 1040)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !985, file: !269, line: 79, baseType: !138, size: 8, offset: 1048)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !985, file: !269, line: 81, baseType: !297, size: 64, offset: 1088)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !985, file: !269, line: 89, baseType: !300, size: 64, offset: 1152)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !985, file: !269, line: 91, baseType: !302, size: 64, offset: 1216)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !985, file: !269, line: 92, baseType: !305, size: 64, offset: 1280)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !985, file: !269, line: 93, baseType: !1001, size: 64, offset: 1344)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !985, file: !269, line: 94, baseType: !127, size: 64, offset: 1408)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !985, file: !269, line: 95, baseType: !129, size: 64, offset: 1472)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !985, file: !269, line: 96, baseType: !70, size: 32, offset: 1536)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !985, file: !269, line: 98, baseType: !312, size: 160, offset: 1568)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1030, !1033, !1035, !1036, !1038}
!1018 = !DILocalVariable(name: "stream", arg: 1, scope: !980, file: !2, line: 34, type: !983)
!1019 = !DILocalVariable(name: "resstream", arg: 2, scope: !980, file: !2, line: 34, type: !127)
!1020 = !DILocalVariable(name: "length", arg: 3, scope: !980, file: !2, line: 34, type: !526)
!1021 = !DILocalVariable(name: "ret", scope: !980, file: !2, line: 36, type: !70)
!1022 = !DILocalVariable(name: "sum", scope: !980, file: !2, line: 37, type: !227)
!1023 = !DILocalVariable(name: "checksum", scope: !980, file: !2, line: 38, type: !70)
!1024 = !DILocalVariable(name: "total_bytes", scope: !980, file: !2, line: 39, type: !527)
!1025 = !DILocalVariable(name: "buffer", scope: !980, file: !2, line: 41, type: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1028, line: 24, baseType: !1029)
!1028 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !111, line: 38, baseType: !133)
!1030 = !DILocalVariable(name: "n", scope: !1031, file: !2, line: 54, type: !129)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !2, line: 53, column: 5)
!1032 = distinct !DILexicalBlock(scope: !980, file: !2, line: 48, column: 3)
!1033 = !DILocalVariable(name: "i", scope: !1034, file: !2, line: 71, type: !129)
!1034 = distinct !DILexicalBlock(scope: !1032, file: !2, line: 71, column: 5)
!1035 = !DILabel(scope: !980, name: "final_process", file: !2, line: 84)
!1036 = !DILocalVariable(name: "i", scope: !1037, file: !2, line: 86, type: !227)
!1037 = distinct !DILexicalBlock(scope: !980, file: !2, line: 86, column: 3)
!1038 = !DILabel(scope: !980, name: "cleanup_buffer", file: !2, line: 101)
!1039 = !{!1040}
!1040 = !DIEnumerator(name: "buffer_length", value: 32768)
!1041 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1042, file: !2, line: 115, baseType: !64, size: 32, elements: !1039)
!1042 = distinct !DISubprogram(name: "sysv_sum_stream", scope: !2, file: !2, line: 110, type: !981, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !977, retainedNodes: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1055, !1057, !1058, !1060, !1061, !1062}
!1044 = !DILocalVariable(name: "stream", arg: 1, scope: !1042, file: !2, line: 110, type: !983)
!1045 = !DILocalVariable(name: "resstream", arg: 2, scope: !1042, file: !2, line: 110, type: !127)
!1046 = !DILocalVariable(name: "length", arg: 3, scope: !1042, file: !2, line: 110, type: !526)
!1047 = !DILocalVariable(name: "ret", scope: !1042, file: !2, line: 112, type: !70)
!1048 = !DILocalVariable(name: "sum", scope: !1042, file: !2, line: 113, type: !227)
!1049 = !DILocalVariable(name: "total_bytes", scope: !1042, file: !2, line: 114, type: !527)
!1050 = !DILocalVariable(name: "buffer", scope: !1042, file: !2, line: 116, type: !1026)
!1051 = !DILocalVariable(name: "s", scope: !1042, file: !2, line: 122, type: !64)
!1052 = !DILocalVariable(name: "n", scope: !1053, file: !2, line: 132, type: !129)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !2, line: 131, column: 5)
!1054 = distinct !DILexicalBlock(scope: !1042, file: !2, line: 126, column: 3)
!1055 = !DILocalVariable(name: "i", scope: !1056, file: !2, line: 149, type: !129)
!1056 = distinct !DILexicalBlock(scope: !1054, file: !2, line: 149, column: 5)
!1057 = !DILabel(scope: !1042, name: "final_process", file: !2, line: 159)
!1058 = !DILocalVariable(name: "i", scope: !1059, file: !2, line: 161, type: !129)
!1059 = distinct !DILexicalBlock(scope: !1042, file: !2, line: 161, column: 3)
!1060 = !DILocalVariable(name: "r", scope: !1042, file: !2, line: 170, type: !70)
!1061 = !DILocalVariable(name: "checksum", scope: !1042, file: !2, line: 171, type: !70)
!1062 = !DILabel(scope: !1042, name: "cleanup_buffer", file: !2, line: 176)
!1063 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1064, line: 47, baseType: !64, size: 32, elements: !638)
!1064 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!1065 = !{!546, !131, !129, !1066, !133}
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !111, line: 40, baseType: !128)
!1067 = !{!0, !7, !12}
!1068 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1069, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1070, splitDebugInlining: false, nameTableKind: None)
!1069 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1070 = !{!1071}
!1071 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1072, line: 44, baseType: !64, size: 32, elements: !118)
!1072 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!1073 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1074, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1074 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1075 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1076, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1077, splitDebugInlining: false, nameTableKind: None)
!1076 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1077 = !{!127}
!1078 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1079, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fopen-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-fopen-safer.Tpo -c lib/fopen-safer.c -o lib/.libcoreutils_a-fopen-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1079 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1080 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1081, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1077, splitDebugInlining: false, nameTableKind: None)
!1081 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1082 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1083, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1083 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1084 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1085, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-dup-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-dup-safer.Tpo -c lib/dup-safer.c -o lib/.libcoreutils_a-dup-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1085 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1086 = distinct !DICompileUnit(language: DW_LANG_C11, file: !827, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1087, retainedTypes: !1077, globals: !1091, splitDebugInlining: false, nameTableKind: None)
!1087 = !{!1088}
!1088 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !827, line: 40, baseType: !64, size: 32, elements: !1089)
!1089 = !{!1090}
!1090 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1091 = !{!825, !828, !830, !832, !834, !836, !841, !846, !848, !853, !855, !860, !865, !867, !869, !874, !879, !881, !883, !885, !887, !889, !891, !893}
!1092 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1093, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1094, retainedTypes: !1124, splitDebugInlining: false, nameTableKind: None)
!1093 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1094 = !{!1095, !1107}
!1095 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1096, file: !1093, line: 188, baseType: !64, size: 32, elements: !1105)
!1096 = distinct !DISubprogram(name: "x2nrealloc", scope: !1093, file: !1093, line: 176, type: !1097, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1092, retainedNodes: !1100)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!127, !127, !1099, !129}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!1100 = !{!1101, !1102, !1103, !1104}
!1101 = !DILocalVariable(name: "p", arg: 1, scope: !1096, file: !1093, line: 176, type: !127)
!1102 = !DILocalVariable(name: "pn", arg: 2, scope: !1096, file: !1093, line: 176, type: !1099)
!1103 = !DILocalVariable(name: "s", arg: 3, scope: !1096, file: !1093, line: 176, type: !129)
!1104 = !DILocalVariable(name: "n", scope: !1096, file: !1093, line: 178, type: !129)
!1105 = !{!1106}
!1106 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1107 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1108, file: !1093, line: 228, baseType: !64, size: 32, elements: !1105)
!1108 = distinct !DISubprogram(name: "xpalloc", scope: !1093, file: !1093, line: 223, type: !1109, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1092, retainedNodes: !1114)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!127, !127, !1111, !1112, !229, !1112}
