; ModuleID = 'src/touch.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.table = type { ptr, i32, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.parser_control = type { ptr, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }
%struct.tm_zone = type { ptr, i8, [0 x i8] }


!152 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !153, !158, !163, !168, !173, !178, !180, !185, !187, !192, !194, !196, !201, !206, !208, !211, !213, !215, !217, !231, !233, !235, !315, !320, !322, !327, !329, !332, !334, !336, !341, !343, !345, !347, !349, !354, !356, !358, !360, !362, !364, !366, !371, !376, !378, !383, !385, !387, !389, !391, !393, !398, !400, !402, !407, !412, !417, !419, !421, !423, !425, !427, !429, !431, !97, !433, !437, !439, !441, !443, !445, !447, !451, !453, !458, !460, !465, !470, !472}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 23)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 334, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 7)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 14)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 11)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 15)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !94, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 16)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !94, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 47)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !2, line: 363, type: !9, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !2, line: 414, type: !182, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 75)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !2, line: 444, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 21)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "change_times", scope: !99, file: !2, line: 51, type: !107, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "no_create", scope: !99, file: !2, line: 54, type: !210, isLocal: true, isDefinition: true)
!210 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "use_ref", scope: !99, file: !2, line: 57, type: !210, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "no_dereference", scope: !99, file: !2, line: 60, type: !210, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "amtime_now", scope: !99, file: !2, line: 67, type: !210, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "newtime", scope: !99, file: !2, line: 70, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 256, elements: !229)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !221, line: 11, size: 128, elements: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!222 = !{!223, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !220, file: !221, line: 16, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !225, line: 160, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!226 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !220, file: !221, line: 21, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !225, line: 197, baseType: !226)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "ref_file", scope: !99, file: !2, line: 73, type: !143, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !106, line: 736, type: !198, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !237, file: !106, line: 575, type: !107, isLocal: true, isDefinition: true)
!237 = distinct !DISubprogram(name: "oputs_", scope: !106, file: !106, line: 573, type: !238, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !99, retainedNodes: !240)
!238 = !DISubroutineType(cc: DW_CC_nocall, types: !239)
!239 = !{null, !149, !149}
!240 = !{!241, !242, !243, !246, !247, !248, !249, !253, !254, !255, !256, !258, !309, !310, !311, !313, !314}
!241 = !DILocalVariable(name: "program", arg: 1, scope: !237, file: !106, line: 573, type: !149)
!242 = !DILocalVariable(name: "option", arg: 2, scope: !237, file: !106, line: 573, type: !149)
!243 = !DILocalVariable(name: "term", scope: !244, file: !106, line: 585, type: !149)
!244 = distinct !DILexicalBlock(scope: !245, file: !106, line: 582, column: 5)
!245 = distinct !DILexicalBlock(scope: !237, file: !106, line: 581, column: 7)
!246 = !DILocalVariable(name: "double_space", scope: !237, file: !106, line: 594, type: !210)
!247 = !DILocalVariable(name: "first_word", scope: !237, file: !106, line: 595, type: !149)
!248 = !DILocalVariable(name: "option_text", scope: !237, file: !106, line: 596, type: !149)
!249 = !DILocalVariable(name: "s", scope: !250, file: !106, line: 608, type: !149)
!250 = distinct !DILexicalBlock(scope: !251, file: !106, line: 605, column: 5)
!251 = distinct !DILexicalBlock(scope: !252, file: !106, line: 604, column: 12)
!252 = distinct !DILexicalBlock(scope: !237, file: !106, line: 597, column: 7)
!253 = !DILocalVariable(name: "spaces", scope: !250, file: !106, line: 609, type: !146)
!254 = !DILocalVariable(name: "anchor_len", scope: !237, file: !106, line: 620, type: !146)
!255 = !DILocalVariable(name: "desc_text", scope: !237, file: !106, line: 625, type: !149)
!256 = !DILocalVariable(name: "__ptr", scope: !257, file: !106, line: 644, type: !149)
!257 = distinct !DILexicalBlock(scope: !237, file: !106, line: 644, column: 3)
!258 = !DILocalVariable(name: "__stream", scope: !257, file: !106, line: 644, type: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !261, line: 7, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !263, line: 49, size: 1728, elements: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !280, !282, !283, !284, !286, !287, !289, !290, !293, !295, !298, !301, !302, !303, !304, !305}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !262, file: !263, line: 51, baseType: !107, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !262, file: !263, line: 54, baseType: !143, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !262, file: !263, line: 55, baseType: !143, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !262, file: !263, line: 56, baseType: !143, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !262, file: !263, line: 57, baseType: !143, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !262, file: !263, line: 58, baseType: !143, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !262, file: !263, line: 59, baseType: !143, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !262, file: !263, line: 60, baseType: !143, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !262, file: !263, line: 61, baseType: !143, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !262, file: !263, line: 64, baseType: !143, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !262, file: !263, line: 65, baseType: !143, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !262, file: !263, line: 66, baseType: !143, size: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !262, file: !263, line: 68, baseType: !278, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !263, line: 36, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !262, file: !263, line: 70, baseType: !281, size: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !262, file: !263, line: 72, baseType: !107, size: 32, offset: 896)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !262, file: !263, line: 73, baseType: !107, size: 32, offset: 928)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !262, file: !263, line: 74, baseType: !285, size: 64, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !225, line: 152, baseType: !226)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !262, file: !263, line: 77, baseType: !145, size: 16, offset: 1024)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !262, file: !263, line: 78, baseType: !288, size: 8, offset: 1040)
!288 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !262, file: !263, line: 79, baseType: !79, size: 8, offset: 1048)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !262, file: !263, line: 81, baseType: !291, size: 64, offset: 1088)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !263, line: 43, baseType: null)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !262, file: !263, line: 89, baseType: !294, size: 64, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !225, line: 153, baseType: !226)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !262, file: !263, line: 91, baseType: !296, size: 64, offset: 1216)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !263, line: 37, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !262, file: !263, line: 92, baseType: !299, size: 64, offset: 1280)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !263, line: 38, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !262, file: !263, line: 93, baseType: !281, size: 64, offset: 1344)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !262, file: !263, line: 94, baseType: !144, size: 64, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !262, file: !263, line: 95, baseType: !146, size: 64, offset: 1472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !262, file: !263, line: 96, baseType: !107, size: 32, offset: 1536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !262, file: !263, line: 98, baseType: !306, size: 160, offset: 1568)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 20)
!309 = !DILocalVariable(name: "__cnt", scope: !257, file: !106, line: 644, type: !146)
!310 = !DILocalVariable(name: "url_program", scope: !237, file: !106, line: 648, type: !149)
!311 = !DILocalVariable(name: "__ptr", scope: !312, file: !106, line: 686, type: !149)
!312 = distinct !DILexicalBlock(scope: !237, file: !106, line: 686, column: 3)
!313 = !DILocalVariable(name: "__stream", scope: !312, file: !106, line: 686, type: !259)
!314 = !DILocalVariable(name: "__cnt", scope: !312, file: !106, line: 686, type: !146)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !106, line: 585, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 5)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !106, line: 586, type: !317, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !106, line: 595, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 4)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !106, line: 620, type: !19, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !106, line: 648, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !229)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !106, line: 648, type: !317, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !106, line: 649, type: !324, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !106, line: 649, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 3)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !106, line: 650, type: !317, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !106, line: 651, type: !19, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !106, line: 651, type: !19, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !106, line: 652, type: !160, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !106, line: 653, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 8)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !106, line: 654, type: !84, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !106, line: 655, type: !84, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !106, line: 656, type: !84, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !106, line: 657, type: !84, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !106, line: 663, type: !160, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !106, line: 664, type: !84, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !106, line: 669, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 17)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !106, line: 669, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 40)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !106, line: 676, type: !175, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !106, line: 676, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 61)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !106, line: 679, type: !338, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !106, line: 683, type: !317, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !106, line: 688, type: !317, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !106, line: 691, type: !351, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !106, line: 839, type: !182, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !106, line: 840, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 22)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !106, line: 841, type: !175, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !106, line: 862, type: !324, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !106, line: 868, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 71)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !106, line: 875, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 27)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !106, line: 877, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 51)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !106, line: 877, type: !94, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 84, type: !317, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !84, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !317, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !84, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !175, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !317, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !351, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "time_masks", scope: !99, file: !2, line: 101, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 160, elements: !318)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !19, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !160, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !324, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !19, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !160, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "time_args", scope: !99, file: !2, line: 95, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 384, elements: !20)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 127, type: !331, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 18)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !94, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 208, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 26)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 19)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !182, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !2, line: 201, type: !306, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 2048, elements: !352)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !477, line: 50, size: 256, elements: !478)
!477 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!478 = !{!479, !480, !481, !483}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !477, line: 52, baseType: !149, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !476, file: !477, line: 55, baseType: !107, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !476, file: !477, line: 56, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !476, file: !477, line: 57, baseType: !107, size: 32, offset: 192)
!484 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!485 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!486 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!487 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !490, line: 3, type: !175, isLocal: true, isDefinition: true)
!490 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "Version", scope: !493, file: !490, line: 3, type: !149, isLocal: false, isDefinition: true)
!493 = distinct !DICompileUnit(language: DW_LANG_C11, file: !490, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !494, splitDebugInlining: false, nameTableKind: None)
!494 = !{!488, !491}
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !497, file: !498, line: 65, type: !519, isLocal: false, isDefinition: true)
!497 = distinct !DICompileUnit(language: DW_LANG_C11, file: !498, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !499, retainedTypes: !502, globals: !503, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!499 = !{!500}
!500 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !501, line: 42, baseType: !102, size: 32, elements: !113)
!501 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!502 = !{!144, !149, !151}
!503 = !{!495, !504, !506, !508, !513, !515, !517}
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !498, line: 141, type: !160, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !498, line: 141, type: !409, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !498, line: 142, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 29)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !498, line: 160, type: !203, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !498, line: 165, type: !351, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !498, line: 170, type: !317, isLocal: true, isDefinition: true)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !520, line: 69, baseType: !521)
!520 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null}
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "file_name", scope: !526, file: !527, line: 45, type: !149, isLocal: true, isDefinition: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C11, file: !527, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !528, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!528 = !{!529, !531, !533, !535, !524, !537}
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !527, line: 121, type: !160, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !527, line: 121, type: !94, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !527, line: 123, type: !160, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !527, line: 126, type: !338, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !526, file: !527, line: 55, type: !210, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !541, file: !542, line: 66, type: !521, isLocal: false, isDefinition: true)
!541 = distinct !DICompileUnit(language: DW_LANG_C11, file: !542, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !543, globals: !544, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!543 = !{!144, !151}
!544 = !{!545, !547, !566, !568, !570, !572, !539, !574, !576, !578, !580, !582}
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !542, line: 272, type: !317, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "old_file_name", scope: !549, file: !542, line: 304, type: !149, isLocal: true, isDefinition: true)
!549 = distinct !DISubprogram(name: "verror_at_line", scope: !542, file: !542, line: 298, type: !550, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !541, retainedNodes: !559)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !107, !107, !149, !102, !149, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !554)
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !553, file: !542, baseType: !102, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !553, file: !542, baseType: !102, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !553, file: !542, baseType: !144, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !553, file: !542, baseType: !144, size: 64, offset: 128)
!559 = !{!560, !561, !562, !563, !564, !565}
!560 = !DILocalVariable(name: "status", arg: 1, scope: !549, file: !542, line: 298, type: !107)
!561 = !DILocalVariable(name: "errnum", arg: 2, scope: !549, file: !542, line: 298, type: !107)
!562 = !DILocalVariable(name: "file_name", arg: 3, scope: !549, file: !542, line: 298, type: !149)
!563 = !DILocalVariable(name: "line_number", arg: 4, scope: !549, file: !542, line: 298, type: !102)
!564 = !DILocalVariable(name: "message", arg: 5, scope: !549, file: !542, line: 298, type: !149)
!565 = !DILocalVariable(name: "args", arg: 6, scope: !549, file: !542, line: 298, type: !552)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "old_line_number", scope: !549, file: !542, line: 305, type: !102, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !542, line: 338, type: !324, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !542, line: 346, type: !351, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !542, line: 346, type: !331, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "error_message_count", scope: !541, file: !542, line: 69, type: !102, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !541, file: !542, line: 295, type: !107, isLocal: false, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !542, line: 208, type: !160, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !542, line: 208, type: !203, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !542, line: 214, type: !317, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "yyval_default", scope: !586, file: !587, line: 1600, type: !919, isLocal: true, isDefinition: true)
!586 = distinct !DISubprogram(name: "yyparse", scope: !587, file: !587, line: 1591, type: !588, scopeLine: 1592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !662, retainedNodes: !1576)
!587 = !DIFile(filename: "parse-datetime.c", directory: "/src")
!588 = !DISubroutineType(types: !589)
!589 = !{!107, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !592, line: 252, baseType: !593)
!592 = !DIFile(filename: "parse-datetime.y", directory: "/src")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 184, size: 2304, elements: !594)
!594 = !{!595, !596, !600, !601, !602, !603, !604, !615, !616, !617, !618, !619, !624, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !593, file: !592, line: 187, baseType: !149, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !593, file: !592, line: 190, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !598, line: 101, baseType: !599)
!598 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !225, line: 72, baseType: !226)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !593, file: !592, line: 193, baseType: !107, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !593, file: !592, line: 196, baseType: !107, size: 32, offset: 160)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !593, file: !592, line: 199, baseType: !107, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !593, file: !592, line: 202, baseType: !107, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !593, file: !592, line: 205, baseType: !605, size: 192, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !592, line: 143, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 138, size: 192, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !606, file: !592, line: 140, baseType: !210, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !606, file: !592, line: 141, baseType: !597, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !606, file: !592, line: 142, baseType: !611, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !612, line: 130, baseType: !613)
!612 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !614, line: 18, baseType: !226)
!614 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!615 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !593, file: !592, line: 206, baseType: !597, size: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !593, file: !592, line: 207, baseType: !597, size: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !593, file: !592, line: 208, baseType: !597, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !593, file: !592, line: 209, baseType: !597, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !593, file: !592, line: 210, baseType: !620, size: 128, offset: 704)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !221, line: 11, size: 128, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !620, file: !221, line: 16, baseType: !224, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !620, file: !221, line: 21, baseType: !228, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !593, file: !592, line: 213, baseType: !625, size: 448, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !592, line: 175, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 165, size: 448, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !626, file: !592, line: 168, baseType: !597, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !626, file: !592, line: 169, baseType: !597, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !626, file: !592, line: 170, baseType: !597, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !626, file: !592, line: 171, baseType: !597, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !626, file: !592, line: 172, baseType: !597, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !626, file: !592, line: 173, baseType: !597, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !626, file: !592, line: 174, baseType: !107, size: 32, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !593, file: !592, line: 216, baseType: !210, size: 8, offset: 1280)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !593, file: !592, line: 217, baseType: !210, size: 8, offset: 1288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !593, file: !592, line: 218, baseType: !611, size: 64, offset: 1344)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !593, file: !592, line: 219, baseType: !611, size: 64, offset: 1408)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "J_zones_seen", scope: !593, file: !592, line: 220, baseType: !611, size: 64, offset: 1472)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !593, file: !592, line: 221, baseType: !611, size: 64, offset: 1536)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !593, file: !592, line: 222, baseType: !611, size: 64, offset: 1600)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !593, file: !592, line: 223, baseType: !611, size: 64, offset: 1664)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !593, file: !592, line: 224, baseType: !611, size: 64, offset: 1728)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !593, file: !592, line: 225, baseType: !210, size: 8, offset: 1792)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "not_decimal", scope: !593, file: !592, line: 227, baseType: !210, size: 8, offset: 1800)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !593, file: !592, line: 231, baseType: !210, size: 8, offset: 1808)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !593, file: !592, line: 235, baseType: !210, size: 8, offset: 1816)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !593, file: !592, line: 236, baseType: !210, size: 8, offset: 1824)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !593, file: !592, line: 237, baseType: !210, size: 8, offset: 1832)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !593, file: !592, line: 238, baseType: !210, size: 8, offset: 1840)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !593, file: !592, line: 239, baseType: !210, size: 8, offset: 1848)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !593, file: !592, line: 240, baseType: !210, size: 8, offset: 1856)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !593, file: !592, line: 243, baseType: !210, size: 8, offset: 1864)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !593, file: !592, line: 246, baseType: !655, size: 384, offset: 1920)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 384, elements: !339)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !592, line: 151, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 146, size: 128, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !592, line: 148, baseType: !149, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !657, file: !592, line: 149, baseType: !107, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !657, file: !592, line: 150, baseType: !107, size: 32, offset: 96)
!662 = distinct !DICompileUnit(language: DW_LANG_C11, file: !663, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-parse-datetime.o -MD -MP -MF lib/.deps/libcoreutils_a-parse-datetime.Tpo -c lib/parse-datetime.c -o lib/.libcoreutils_a-parse-datetime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !664, retainedTypes: !911, globals: !927, splitDebugInlining: false, nameTableKind: None)
!663 = !DIFile(filename: "lib/parse-datetime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4ad0112e68fb719bedea01398b4b2919")
!664 = !{!665, !725, !752, !757, !761, !908}
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yysymbol_kind_t", file: !587, line: 734, baseType: !107, size: 32, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!667 = !DIEnumerator(name: "YYSYMBOL_YYEMPTY", value: -2)
!668 = !DIEnumerator(name: "YYSYMBOL_YYEOF", value: 0)
!669 = !DIEnumerator(name: "YYSYMBOL_YYerror", value: 1)
!670 = !DIEnumerator(name: "YYSYMBOL_YYUNDEF", value: 2)
!671 = !DIEnumerator(name: "YYSYMBOL_tAGO", value: 3)
!672 = !DIEnumerator(name: "YYSYMBOL_tDST", value: 4)
!673 = !DIEnumerator(name: "YYSYMBOL_tYEAR_UNIT", value: 5)
!674 = !DIEnumerator(name: "YYSYMBOL_tMONTH_UNIT", value: 6)
!675 = !DIEnumerator(name: "YYSYMBOL_tHOUR_UNIT", value: 7)
!676 = !DIEnumerator(name: "YYSYMBOL_tMINUTE_UNIT", value: 8)
!677 = !DIEnumerator(name: "YYSYMBOL_tSEC_UNIT", value: 9)
!678 = !DIEnumerator(name: "YYSYMBOL_tDAY_UNIT", value: 10)
!679 = !DIEnumerator(name: "YYSYMBOL_tDAY_SHIFT", value: 11)
!680 = !DIEnumerator(name: "YYSYMBOL_tDAY", value: 12)
!681 = !DIEnumerator(name: "YYSYMBOL_tDAYZONE", value: 13)
!682 = !DIEnumerator(name: "YYSYMBOL_tLOCAL_ZONE", value: 14)
!683 = !DIEnumerator(name: "YYSYMBOL_tMERIDIAN", value: 15)
!684 = !DIEnumerator(name: "YYSYMBOL_tMONTH", value: 16)
!685 = !DIEnumerator(name: "YYSYMBOL_tORDINAL", value: 17)
!686 = !DIEnumerator(name: "YYSYMBOL_tZONE", value: 18)
!687 = !DIEnumerator(name: "YYSYMBOL_tSNUMBER", value: 19)
!688 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER", value: 20)
!689 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER_DOTTED", value: 21)
!690 = !DIEnumerator(name: "YYSYMBOL_tSDECIMAL_NUMBER", value: 22)
!691 = !DIEnumerator(name: "YYSYMBOL_tUDECIMAL_NUMBER", value: 23)
!692 = !DIEnumerator(name: "YYSYMBOL_24_", value: 24)
!693 = !DIEnumerator(name: "YYSYMBOL_25_J_", value: 25)
!694 = !DIEnumerator(name: "YYSYMBOL_26_T_", value: 26)
!695 = !DIEnumerator(name: "YYSYMBOL_27_", value: 27)
!696 = !DIEnumerator(name: "YYSYMBOL_28_", value: 28)
!697 = !DIEnumerator(name: "YYSYMBOL_29_", value: 29)
!698 = !DIEnumerator(name: "YYSYMBOL_30_", value: 30)
!699 = !DIEnumerator(name: "YYSYMBOL_YYACCEPT", value: 31)
!700 = !DIEnumerator(name: "YYSYMBOL_spec", value: 32)
!701 = !DIEnumerator(name: "YYSYMBOL_timespec", value: 33)
!702 = !DIEnumerator(name: "YYSYMBOL_items", value: 34)
!703 = !DIEnumerator(name: "YYSYMBOL_item", value: 35)
!704 = !DIEnumerator(name: "YYSYMBOL_datetime", value: 36)
!705 = !DIEnumerator(name: "YYSYMBOL_iso_8601_datetime", value: 37)
!706 = !DIEnumerator(name: "YYSYMBOL_time", value: 38)
!707 = !DIEnumerator(name: "YYSYMBOL_iso_8601_time", value: 39)
!708 = !DIEnumerator(name: "YYSYMBOL_o_zone_offset", value: 40)
!709 = !DIEnumerator(name: "YYSYMBOL_zone_offset", value: 41)
!710 = !DIEnumerator(name: "YYSYMBOL_local_zone", value: 42)
!711 = !DIEnumerator(name: "YYSYMBOL_zone", value: 43)
!712 = !DIEnumerator(name: "YYSYMBOL_day", value: 44)
!713 = !DIEnumerator(name: "YYSYMBOL_date", value: 45)
!714 = !DIEnumerator(name: "YYSYMBOL_iso_8601_date", value: 46)
!715 = !DIEnumerator(name: "YYSYMBOL_rel", value: 47)
!716 = !DIEnumerator(name: "YYSYMBOL_relunit", value: 48)
!717 = !DIEnumerator(name: "YYSYMBOL_relunit_snumber", value: 49)
!718 = !DIEnumerator(name: "YYSYMBOL_dayshift", value: 50)
!719 = !DIEnumerator(name: "YYSYMBOL_seconds", value: 51)
!720 = !DIEnumerator(name: "YYSYMBOL_signed_seconds", value: 52)
!721 = !DIEnumerator(name: "YYSYMBOL_unsigned_seconds", value: 53)
!722 = !DIEnumerator(name: "YYSYMBOL_number", value: 54)
!723 = !DIEnumerator(name: "YYSYMBOL_hybrid", value: 55)
!724 = !DIEnumerator(name: "YYSYMBOL_o_colon_minutes", value: 56)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !587, line: 676, baseType: !107, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!727 = !DIEnumerator(name: "YYEMPTY", value: -2)
!728 = !DIEnumerator(name: "YYEOF", value: 0)
!729 = !DIEnumerator(name: "YYerror", value: 256)
!730 = !DIEnumerator(name: "YYUNDEF", value: 257)
!731 = !DIEnumerator(name: "tAGO", value: 258)
!732 = !DIEnumerator(name: "tDST", value: 259)
!733 = !DIEnumerator(name: "tYEAR_UNIT", value: 260)
!734 = !DIEnumerator(name: "tMONTH_UNIT", value: 261)
!735 = !DIEnumerator(name: "tHOUR_UNIT", value: 262)
!736 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263)
!737 = !DIEnumerator(name: "tSEC_UNIT", value: 264)
!738 = !DIEnumerator(name: "tDAY_UNIT", value: 265)
!739 = !DIEnumerator(name: "tDAY_SHIFT", value: 266)
!740 = !DIEnumerator(name: "tDAY", value: 267)
!741 = !DIEnumerator(name: "tDAYZONE", value: 268)
!742 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269)
!743 = !DIEnumerator(name: "tMERIDIAN", value: 270)
!744 = !DIEnumerator(name: "tMONTH", value: 271)
!745 = !DIEnumerator(name: "tORDINAL", value: 272)
!746 = !DIEnumerator(name: "tZONE", value: 273)
!747 = !DIEnumerator(name: "tSNUMBER", value: 274)
!748 = !DIEnumerator(name: "tUNUMBER", value: 275)
!749 = !DIEnumerator(name: "tUNUMBER_DOTTED", value: 276)
!750 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 277)
!751 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 278)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !592, line: 154, baseType: !102, size: 32, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIEnumerator(name: "MERam", value: 0)
!755 = !DIEnumerator(name: "MERpm", value: 1)
!756 = !DIEnumerator(name: "MER24", value: 2)
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !592, line: 162, baseType: !102, size: 32, elements: !758)
!758 = !{!759, !760}
!759 = !DIEnumerator(name: "BILLION", value: 1000000000)
!760 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !762, file: !592, line: 1781, baseType: !102, size: 32, elements: !906)
!762 = distinct !DISubprogram(name: "parse_datetime_body", scope: !592, file: !592, line: 1767, type: !763, scopeLine: 1770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !662, retainedNodes: !772)
!763 = !DISubroutineType(types: !764)
!764 = !{!210, !765, !149, !766, !102, !768, !149}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !769, line: 1039, baseType: !770)
!769 = !DIFile(filename: "./lib/time.h", directory: "/src")
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !769, line: 1039, flags: DIFlagFwdDecl)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !794, !795, !796, !800, !801, !802, !803, !804, !805, !808, !809, !810, !811, !813, !816, !817, !818, !824, !825, !826, !827, !828, !830, !833, !834, !841, !844, !845, !851, !852, !853, !856, !857, !860, !861, !862, !870, !873, !874, !875, !876, !879, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !893, !894, !897, !898, !899, !900, !901, !904, !905}
!773 = !DILocalVariable(name: "result", arg: 1, scope: !762, file: !592, line: 1767, type: !765)
!774 = !DILocalVariable(name: "p", arg: 2, scope: !762, file: !592, line: 1767, type: !149)
!775 = !DILocalVariable(name: "now", arg: 3, scope: !762, file: !592, line: 1768, type: !766)
!776 = !DILocalVariable(name: "flags", arg: 4, scope: !762, file: !592, line: 1768, type: !102)
!777 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !762, file: !592, line: 1769, type: !768)
!778 = !DILocalVariable(name: "tzstring", arg: 6, scope: !762, file: !592, line: 1769, type: !149)
!779 = !DILocalVariable(name: "tm", scope: !762, file: !592, line: 1771, type: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !781, line: 7, size: 448, elements: !782)
!781 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !780, file: !781, line: 9, baseType: !107, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !780, file: !781, line: 10, baseType: !107, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !780, file: !781, line: 11, baseType: !107, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !780, file: !781, line: 12, baseType: !107, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !780, file: !781, line: 13, baseType: !107, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !780, file: !781, line: 14, baseType: !107, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !780, file: !781, line: 15, baseType: !107, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !780, file: !781, line: 16, baseType: !107, size: 32, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !780, file: !781, line: 17, baseType: !107, size: 32, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !780, file: !781, line: 20, baseType: !226, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !780, file: !781, line: 21, baseType: !149, size: 64, offset: 384)
!794 = !DILocalVariable(name: "tm0", scope: !762, file: !592, line: 1772, type: !780)
!795 = !DILocalVariable(name: "time_zone_buf", scope: !762, file: !592, line: 1773, type: !409)
!796 = !DILocalVariable(name: "dbg_tm", scope: !762, file: !592, line: 1774, type: !797)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 100)
!800 = !DILocalVariable(name: "ok", scope: !762, file: !592, line: 1775, type: !210)
!801 = !DILocalVariable(name: "input_sentinel", scope: !762, file: !592, line: 1776, type: !149)
!802 = !DILocalVariable(name: "tz1alloc", scope: !762, file: !592, line: 1777, type: !143)
!803 = !DILocalVariable(name: "tz1buf", scope: !762, file: !592, line: 1782, type: !797)
!804 = !DILocalVariable(name: "gettime_buffer", scope: !762, file: !592, line: 1784, type: !620)
!805 = !DILocalVariable(name: "Start", scope: !762, file: !592, line: 1791, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !807, line: 10, baseType: !224)
!807 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!808 = !DILocalVariable(name: "Start_ns", scope: !762, file: !592, line: 1792, type: !107)
!809 = !DILocalVariable(name: "c", scope: !762, file: !592, line: 1794, type: !151)
!810 = !DILocalVariable(name: "tz", scope: !762, file: !592, line: 1798, type: !768)
!811 = !DILocalVariable(name: "rel_time_0", scope: !762, file: !592, line: 1803, type: !812)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!813 = !DILocalVariable(name: "tzbase", scope: !814, file: !592, line: 1807, type: !149)
!814 = distinct !DILexicalBlock(scope: !815, file: !592, line: 1806, column: 5)
!815 = distinct !DILexicalBlock(scope: !762, file: !592, line: 1805, column: 7)
!816 = !DILocalVariable(name: "tzsize", scope: !814, file: !592, line: 1808, type: !611)
!817 = !DILocalVariable(name: "s", scope: !814, file: !592, line: 1809, type: !149)
!818 = !DILocalVariable(name: "tz1", scope: !819, file: !592, line: 1820, type: !768)
!819 = distinct !DILexicalBlock(scope: !820, file: !592, line: 1819, column: 11)
!820 = distinct !DILexicalBlock(scope: !821, file: !592, line: 1818, column: 18)
!821 = distinct !DILexicalBlock(scope: !822, file: !592, line: 1812, column: 13)
!822 = distinct !DILexicalBlock(scope: !823, file: !592, line: 1811, column: 7)
!823 = distinct !DILexicalBlock(scope: !814, file: !592, line: 1811, column: 7)
!824 = !DILocalVariable(name: "tz1string", scope: !819, file: !592, line: 1821, type: !143)
!825 = !DILocalVariable(name: "z", scope: !819, file: !592, line: 1822, type: !143)
!826 = !DILocalVariable(name: "tmp", scope: !762, file: !592, line: 1848, type: !780)
!827 = !DILocalVariable(name: "pc", scope: !762, file: !592, line: 1858, type: !591)
!828 = !DILocalVariable(name: "quarter", scope: !829, file: !592, line: 1903, type: !107)
!829 = distinct !DILexicalBlock(scope: !762, file: !592, line: 1903, column: 3)
!830 = !DILocalVariable(name: "probe", scope: !831, file: !592, line: 1905, type: !806)
!831 = distinct !DILexicalBlock(scope: !832, file: !592, line: 1904, column: 5)
!832 = distinct !DILexicalBlock(scope: !829, file: !592, line: 1903, column: 3)
!833 = !DILocalVariable(name: "probe_tm", scope: !831, file: !592, line: 1908, type: !780)
!834 = !DILocalVariable(name: "mrd", scope: !835, file: !592, line: 2015, type: !149)
!835 = distinct !DILexicalBlock(scope: !836, file: !592, line: 2014, column: 13)
!836 = distinct !DILexicalBlock(scope: !837, file: !592, line: 2013, column: 15)
!837 = distinct !DILexicalBlock(scope: !838, file: !592, line: 2011, column: 9)
!838 = distinct !DILexicalBlock(scope: !839, file: !592, line: 2010, column: 11)
!839 = distinct !DILexicalBlock(scope: !840, file: !592, line: 1982, column: 5)
!840 = distinct !DILexicalBlock(scope: !762, file: !592, line: 1979, column: 7)
!841 = !DILocalVariable(name: "repaired", scope: !842, file: !592, line: 2061, type: !210)
!842 = distinct !DILexicalBlock(scope: !843, file: !592, line: 2060, column: 9)
!843 = distinct !DILexicalBlock(scope: !839, file: !592, line: 2059, column: 11)
!844 = !DILocalVariable(name: "time_zone_seen", scope: !842, file: !592, line: 2062, type: !210)
!845 = !DILocalVariable(name: "tz2buf", scope: !846, file: !592, line: 2075, type: !848)
!846 = distinct !DILexicalBlock(scope: !847, file: !592, line: 2064, column: 13)
!847 = distinct !DILexicalBlock(scope: !842, file: !592, line: 2063, column: 15)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 30)
!851 = !DILocalVariable(name: "tz2", scope: !846, file: !592, line: 2078, type: !768)
!852 = !DILocalVariable(name: "dbg_ord", scope: !839, file: !592, line: 2105, type: !797)
!853 = !DILocalVariable(name: "dayincr", scope: !854, file: !592, line: 2109, type: !597)
!854 = distinct !DILexicalBlock(scope: !855, file: !592, line: 2108, column: 9)
!855 = distinct !DILexicalBlock(scope: !839, file: !592, line: 2107, column: 11)
!856 = !DILocalVariable(name: "day_ordinal", scope: !854, file: !592, line: 2111, type: !597)
!857 = !DILocalVariable(name: "year", scope: !858, file: !592, line: 2173, type: !107)
!858 = distinct !DILexicalBlock(scope: !859, file: !592, line: 2160, column: 9)
!859 = distinct !DILexicalBlock(scope: !839, file: !592, line: 2159, column: 11)
!860 = !DILocalVariable(name: "month", scope: !858, file: !592, line: 2173, type: !107)
!861 = !DILocalVariable(name: "day", scope: !858, file: !592, line: 2173, type: !107)
!862 = !DILocalVariable(name: "tm_year_buf", scope: !863, file: !592, line: 2247, type: !867)
!863 = distinct !DILexicalBlock(scope: !864, file: !592, line: 2244, column: 17)
!864 = distinct !DILexicalBlock(scope: !865, file: !592, line: 2241, column: 19)
!865 = distinct !DILexicalBlock(scope: !866, file: !592, line: 2202, column: 13)
!866 = distinct !DILexicalBlock(scope: !858, file: !592, line: 2201, column: 15)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 13)
!870 = !DILocalVariable(name: "overflow", scope: !871, file: !592, line: 2262, type: !210)
!871 = distinct !DILexicalBlock(scope: !872, file: !592, line: 2261, column: 9)
!872 = distinct !DILexicalBlock(scope: !839, file: !592, line: 2260, column: 11)
!873 = !DILocalVariable(name: "utcoff", scope: !871, file: !592, line: 2264, type: !226)
!874 = !DILocalVariable(name: "delta", scope: !871, file: !592, line: 2272, type: !597)
!875 = !DILocalVariable(name: "t1", scope: !871, file: !592, line: 2274, type: !806)
!876 = !DILocalVariable(name: "Starti", scope: !877, file: !592, line: 2288, type: !597)
!877 = distinct !DILexicalBlock(scope: !878, file: !592, line: 2287, column: 9)
!878 = distinct !DILexicalBlock(scope: !839, file: !592, line: 2286, column: 11)
!879 = !DILocalVariable(name: "orig_ns", scope: !880, file: !592, line: 2303, type: !597)
!880 = distinct !DILexicalBlock(scope: !839, file: !592, line: 2302, column: 7)
!881 = !DILocalVariable(name: "sum_ns", scope: !880, file: !592, line: 2304, type: !597)
!882 = !DILocalVariable(name: "normalized_ns", scope: !880, file: !592, line: 2305, type: !107)
!883 = !DILocalVariable(name: "d4", scope: !880, file: !592, line: 2306, type: !107)
!884 = !DILocalVariable(name: "d1", scope: !880, file: !592, line: 2307, type: !597)
!885 = !DILocalVariable(name: "t1", scope: !880, file: !592, line: 2307, type: !597)
!886 = !DILocalVariable(name: "d2", scope: !880, file: !592, line: 2307, type: !597)
!887 = !DILocalVariable(name: "t2", scope: !880, file: !592, line: 2307, type: !597)
!888 = !DILocalVariable(name: "t3", scope: !880, file: !592, line: 2307, type: !597)
!889 = !DILocalVariable(name: "t4", scope: !880, file: !592, line: 2308, type: !806)
!890 = !DILocalVariable(name: "t4i", scope: !891, file: !592, line: 2333, type: !597)
!891 = distinct !DILexicalBlock(scope: !892, file: !592, line: 2327, column: 11)
!892 = distinct !DILexicalBlock(scope: !880, file: !592, line: 2325, column: 13)
!893 = !DILocalVariable(name: "lmt", scope: !891, file: !592, line: 2347, type: !780)
!894 = !DILocalVariable(name: "sec", scope: !895, file: !592, line: 2366, type: !597)
!895 = distinct !DILexicalBlock(scope: !896, file: !592, line: 2357, column: 5)
!896 = distinct !DILexicalBlock(scope: !762, file: !592, line: 2356, column: 7)
!897 = !DILocalVariable(name: "nsec", scope: !895, file: !592, line: 2367, type: !107)
!898 = !DILocalVariable(name: "gmt", scope: !895, file: !592, line: 2371, type: !780)
!899 = !DILocalVariable(name: "lmt", scope: !895, file: !592, line: 2371, type: !780)
!900 = !DILocalVariable(name: "got_utc", scope: !895, file: !592, line: 2372, type: !210)
!901 = !DILocalVariable(name: "got_utcoff", scope: !902, file: !592, line: 2380, type: !210)
!902 = distinct !DILexicalBlock(scope: !903, file: !592, line: 2378, column: 9)
!903 = distinct !DILexicalBlock(scope: !895, file: !592, line: 2377, column: 11)
!904 = !DILocalVariable(name: "utcoff", scope: !902, file: !592, line: 2381, type: !226)
!905 = !DILabel(scope: !762, name: "fail", file: !592, line: 2400)
!906 = !{!907}
!907 = !DIEnumerator(name: "TZBUFSIZE", value: 100)
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !592, line: 1275, baseType: !102, size: 32, elements: !909)
!909 = !{!910}
!910 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900)
!911 = !{!912, !914, !148, !226, !926, !144}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_t", file: !587, line: 910, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !587, line: 822, baseType: !288)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !587, line: 1063, size: 448, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !915, file: !587, line: 1065, baseType: !912, size: 8)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !915, file: !587, line: 1066, baseType: !919, size: 448)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !587, line: 721, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !587, line: 709, size: 448, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !920, file: !592, line: 583, baseType: !597, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !920, file: !592, line: 584, baseType: !605, size: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !920, file: !592, line: 585, baseType: !620, size: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !920, file: !592, line: 586, baseType: !625, size: 448)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "yysymbol_kind_t", file: !587, line: 795, baseType: !665)
!927 = !{!584, !928, !930, !932, !937, !939, !941, !943, !945, !947, !949, !951, !953, !955, !960, !965, !967, !969, !971, !973, !975, !977, !979, !985, !990, !992, !994, !996, !1001, !1003, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1038, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1072, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !1146, !1148, !1150, !1152, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1175, !1177, !1179, !1181, !1183, !1185, !1187, !1189, !1191, !1193, !1195, !1197, !1199, !1201, !1203, !1205, !1207, !1209, !1211, !1213, !1215, !1217, !1219, !1221, !1223, !1225, !1227, !1229, !1231, !1233, !1235, !1237, !1239, !1241, !1243, !1245, !1247, !1249, !1254, !1256, !1259, !1261, !1263, !1265, !1267, !1269, !1271, !1273, !1275, !1277, !1279, !1282, !1284, !1286, !1288, !1290, !1292, !1294, !1296, !1298, !1300, !1302, !1304, !1306, !1308, !1310, !1312, !1314, !1316, !1318, !1320, !1322, !1325, !1327, !1329, !1331, !1333, !1335, !1337, !1339, !1341, !1343, !1345, !1347, !1349, !1351, !1353, !1355, !1357, !1359, !1361, !1363, !1365, !1367, !1369, !1371, !1373, !1375, !1378, !1380, !1382, !1387, !1389, !1391, !1393, !1395, !1397, !1399, !1401, !1403, !1405, !1407, !1409, !1411, !1416, !1418, !1420, !1425, !1430, !1435, !1437, !1439, !1444, !1446, !1448, !1450, !1452, !1454, !1456, !1458, !1463, !1465, !1470, !1472, !1474, !1476, !1481, !1483, !1485, !1487, !1492, !1497, !1499, !1501, !1503, !1506, !1511, !1513, !1515, !1517, !1519, !1521, !1523, !1525, !1527, !1529, !1534, !1536, !1538, !1540, !1542, !1544, !1546, !1548, !1550, !1552, !1554, !1556, !1558, !1560, !1562, !1564, !1566, !1568, !1570, !1572, !1574}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !592, line: 618, type: !160, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !592, line: 618, type: !455, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !592, line: 631, type: !934, isLocal: true, isDefinition: true)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 9)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !592, line: 636, type: !317, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !592, line: 641, type: !170, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !592, line: 646, type: !331, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !592, line: 651, type: !317, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !592, line: 656, type: !317, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !592, line: 661, type: !324, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !592, line: 665, type: !934, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !592, line: 669, type: !160, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !592, line: 673, type: !160, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !592, line: 831, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 56)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !592, line: 843, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 528, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 66)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !587, line: 2521, type: !867, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !587, line: 2537, type: !455, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !587, line: 2593, type: !175, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !587, line: 2632, type: !368, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !587, line: 2646, type: !848, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !587, line: 2655, type: !368, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !592, line: 2428, type: !338, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "yypact", scope: !662, file: !587, line: 1238, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 968, elements: !983)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!983 = !{!984}
!984 = !DISubrange(count: 121)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "yytranslate", scope: !662, file: !587, line: 1145, type: !987, isLocal: true, isDefinition: true)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 2232, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 279)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "yycheck", scope: !662, file: !587, line: 1311, type: !981, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "yytable", scope: !662, file: !587, line: 1294, type: !981, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "yydefact", scope: !662, file: !587, line: 1258, type: !981, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "yyr2", scope: !662, file: !587, line: 1363, type: !998, isLocal: true, isDefinition: true)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 760, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 95)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !592, line: 446, type: !368, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !592, line: 451, type: !1005, isLocal: true, isDefinition: true)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !463)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !592, line: 461, type: !94, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !592, line: 470, type: !467, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !592, line: 475, type: !19, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !592, line: 478, type: !338, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !592, line: 489, type: !9, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !592, line: 500, type: !94, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !592, line: 500, type: !317, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !592, line: 500, type: !79, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !592, line: 509, type: !160, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !592, line: 520, type: !155, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !1028, file: !592, line: 351, type: !1036, isLocal: true, isDefinition: true)
!1028 = distinct !DISubprogram(name: "str_days", scope: !592, file: !592, line: 348, type: !1029, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !662, retainedNodes: !1031)
!1029 = !DISubroutineType(cc: DW_CC_nocall, types: !1030)
!1030 = !{!149, !590, !143, !107}
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DILocalVariable(name: "pc", arg: 1, scope: !1028, file: !592, line: 348, type: !590)
!1033 = !DILocalVariable(name: "buffer", arg: 2, scope: !1028, file: !592, line: 348, type: !143)
!1034 = !DILocalVariable(name: "n", arg: 3, scope: !1028, file: !592, line: 348, type: !107)
!1035 = !DILocalVariable(name: "len", scope: !1028, file: !592, line: 378, type: !107)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 1232, elements: !1037)
!1037 = !{!167, !172}
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "days_values", scope: !1028, file: !592, line: 368, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 224, elements: !1041)
!1041 = !{!162, !326}
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !592, line: 386, type: !338, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !592, line: 387, type: !324, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !592, line: 397, type: !324, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !592, line: 414, type: !160, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !592, line: 553, type: !182, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !592, line: 557, type: !351, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !592, line: 558, type: !934, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !592, line: 559, type: !160, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !592, line: 560, type: !351, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !592, line: 561, type: !351, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !592, line: 562, type: !351, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !592, line: 563, type: !94, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !592, line: 533, type: !934, isLocal: true, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !592, line: 115, type: !160, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "yyr1", scope: !662, file: !587, line: 1348, type: !998, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "yypgoto", scope: !662, file: !587, line: 1276, type: !1074, isLocal: true, isDefinition: true)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 208, elements: !463)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !662, file: !587, line: 1284, type: !1074, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(scope: null, file: !587, line: 1573, type: !934, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "yystos", scope: !662, file: !587, line: 1330, type: !981, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1566, type: !1005, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1034, type: !338, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1035, type: !317, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1036, type: !338, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1037, type: !317, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(name: "meridian_table", scope: !662, file: !592, line: 1032, type: !1093, isLocal: true, isDefinition: true)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 640, elements: !318)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1048, type: !351, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1049, type: !934, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1050, type: !19, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1051, type: !19, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1052, type: !324, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1053, type: !317, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1054, type: !317, isLocal: true, isDefinition: true)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1055, type: !160, isLocal: true, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1056, type: !84, isLocal: true, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1057, type: !317, isLocal: true, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1058, type: !351, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1059, type: !934, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1060, type: !934, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1061, type: !160, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1062, type: !160, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1063, type: !351, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1064, type: !317, isLocal: true, isDefinition: true)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1065, type: !84, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1066, type: !160, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1067, type: !934, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1068, type: !317, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1069, type: !19, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1070, type: !160, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1071, type: !934, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !662, file: !592, line: 1046, type: !1145, isLocal: true, isDefinition: true)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 3200, elements: !40)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1122, type: !324, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1123, type: !338, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1124, type: !324, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !662, file: !592, line: 1120, type: !1154, isLocal: true, isDefinition: true)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 512, elements: !325)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1135, type: !324, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1136, type: !317, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1137, type: !324, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1138, type: !324, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1139, type: !324, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1140, type: !317, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1141, type: !324, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1142, type: !324, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1143, type: !324, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1144, type: !324, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1145, type: !324, isLocal: true, isDefinition: true)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1146, type: !317, isLocal: true, isDefinition: true)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1147, type: !324, isLocal: true, isDefinition: true)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !592, line: 1148, type: !324, isLocal: true, isDefinition: true)
