; ModuleID = 'src/true.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating success.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"true\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !24

!162 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 15)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !3, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !127, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !9, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !9, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !140, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 22)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !163, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !108, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 71)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 27)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 51)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 12)
!210 = !{!211, !212, !213, !216, !218, !219, !220, !224, !225, !226, !227, !229, !282, !283, !284, !286, !287}
!211 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!212 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!213 = !DILocalVariable(name: "term", scope: !214, file: !69, line: 585, type: !72)
!214 = distinct !DILexicalBlock(scope: !215, file: !69, line: 582, column: 5)
!215 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!216 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !217)
!217 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!218 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!219 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!220 = !DILocalVariable(name: "s", scope: !221, file: !69, line: 608, type: !72)
!221 = distinct !DILexicalBlock(scope: !222, file: !69, line: 605, column: 5)
!222 = distinct !DILexicalBlock(scope: !223, file: !69, line: 604, column: 12)
!223 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!224 = !DILocalVariable(name: "spaces", scope: !221, file: !69, line: 609, type: !97)
!225 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !97)
!226 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!227 = !DILocalVariable(name: "__ptr", scope: !228, file: !69, line: 644, type: !72)
!228 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!229 = !DILocalVariable(name: "__stream", scope: !228, file: !69, line: 644, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !251, !253, !254, !255, !259, !260, !262, !263, !266, !268, !271, !274, !275, !276, !277, !278}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !233, file: !234, line: 51, baseType: !95, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !233, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !233, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !233, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !233, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !233, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !233, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !233, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !233, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !233, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !233, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !233, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !233, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !234, line: 36, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !233, file: !234, line: 70, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !233, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !233, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !233, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 152, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!258 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !233, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !233, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!261 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !233, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !233, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !234, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !233, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 153, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !233, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !234, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !233, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !234, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !233, file: !234, line: 93, baseType: !252, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !233, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !233, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !233, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !233, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocalVariable(name: "__cnt", scope: !228, file: !69, line: 644, type: !97)
!283 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !69, line: 686, type: !72)
!285 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !69, line: 686, type: !230)
!287 = !DILocalVariable(name: "__cnt", scope: !285, file: !69, line: 686, type: !97)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !290, line: 3, type: !163, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !290, line: 3, type: !72, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !290, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !294, splitDebugInlining: false, nameTableKind: None)
!294 = !{!288, !291}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 45, type: !72, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!299 = !{!300, !302, !304, !306, !295, !308}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !51, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !207, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !298, line: 123, type: !51, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !298, line: 126, type: !127, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 55, type: !217, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !312, file: !313, line: 66, type: !358, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !315, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!314 = !{!94, !100}
!315 = !{!316, !318, !337, !339, !341, !343, !310, !345, !347, !349, !351, !356}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !313, line: 272, type: !9, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "old_file_name", scope: !320, file: !313, line: 304, type: !72, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "verror_at_line", scope: !313, file: !313, line: 298, type: !321, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !330)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !95, !95, !72, !78, !72, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !324, file: !313, baseType: !78, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !324, file: !313, baseType: !78, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !324, file: !313, baseType: !94, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !324, file: !313, baseType: !94, size: 64, offset: 128)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DILocalVariable(name: "status", arg: 1, scope: !320, file: !313, line: 298, type: !95)
!332 = !DILocalVariable(name: "errnum", arg: 2, scope: !320, file: !313, line: 298, type: !95)
!333 = !DILocalVariable(name: "file_name", arg: 3, scope: !320, file: !313, line: 298, type: !72)
!334 = !DILocalVariable(name: "line_number", arg: 4, scope: !320, file: !313, line: 298, type: !78)
!335 = !DILocalVariable(name: "message", arg: 5, scope: !320, file: !313, line: 298, type: !72)
!336 = !DILocalVariable(name: "args", arg: 6, scope: !320, file: !313, line: 298, type: !323)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "old_line_number", scope: !320, file: !313, line: 305, type: !78, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !313, line: 338, type: !108, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !140, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !118, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "error_message_count", scope: !312, file: !313, line: 69, type: !78, isLocal: false, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !312, file: !313, line: 295, type: !95, isLocal: false, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !51, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 21)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !313, line: 214, type: !9, isLocal: true, isDefinition: true)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "program_name", scope: !363, file: !364, line: 31, type: !72, isLocal: false, isDefinition: true)
!363 = distinct !DICompileUnit(language: DW_LANG_C11, file: !364, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !365, globals: !366, splitDebugInlining: false, nameTableKind: None)
!364 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!365 = !{!94, !93}
!366 = !{!361, !367, !369}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !364, line: 46, type: !140, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !364, line: 49, type: !108, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "utf07FF", scope: !373, file: !374, line: 46, type: !401, isLocal: true, isDefinition: true)
!373 = distinct !DISubprogram(name: "proper_name_lite", scope: !374, file: !374, line: 38, type: !375, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !379)
!374 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!375 = !DISubroutineType(types: !376)
!376 = !{!72, !72, !72}
!377 = distinct !DICompileUnit(language: DW_LANG_C11, file: !374, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !378, splitDebugInlining: false, nameTableKind: None)
!378 = !{!371}
!379 = !{!380, !381, !382, !383, !388}
!380 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !373, file: !374, line: 38, type: !72)
!381 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !373, file: !374, line: 38, type: !72)
!382 = !DILocalVariable(name: "translation", scope: !373, file: !374, line: 40, type: !72)
!383 = !DILocalVariable(name: "w", scope: !373, file: !374, line: 47, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !385, line: 37, baseType: !386)
!385 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !257, line: 57, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !257, line: 42, baseType: !78)
!388 = !DILocalVariable(name: "mbs", scope: !373, file: !374, line: 48, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !390, line: 6, baseType: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !392, line: 21, baseType: !393)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 13, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !393, file: !392, line: 15, baseType: !95, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !393, file: !392, line: 20, baseType: !397, size: 32, offset: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !393, file: !392, line: 16, size: 32, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !397, file: !392, line: 18, baseType: !78, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !397, file: !392, line: 19, baseType: !108, size: 32)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !119)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !404, line: 78, type: !140, isLocal: true, isDefinition: true)
!404 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !404, line: 79, type: !113, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !404, line: 80, type: !63, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !404, line: 81, type: !63, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !404, line: 82, type: !279, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !404, line: 83, type: !118, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !404, line: 84, type: !140, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !404, line: 85, type: !51, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !404, line: 86, type: !51, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !404, line: 87, type: !140, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !425, file: !404, line: 76, type: !511, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C11, file: !404, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !426, retainedTypes: !446, globals: !447, splitDebugInlining: false, nameTableKind: None)
!426 = !{!427, !441, !76}
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !428, line: 42, baseType: !78, size: 32, elements: !429)
!428 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!430 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!431 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!432 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!433 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!434 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!435 = !DIEnumerator(name: "c_quoting_style", value: 5)
!436 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!437 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!438 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!439 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!440 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!441 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !428, line: 254, baseType: !78, size: 32, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!444 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!445 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!446 = !{!94, !95, !96, !97}
!447 = !{!402, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !448, !452, !462, !464, !469, !471, !473, !475, !477, !500, !507, !509}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !425, file: !404, line: 92, type: !450, isLocal: false, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 320, elements: !42)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !425, file: !404, line: 1040, type: !454, isLocal: false, isDefinition: true)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !404, line: 56, size: 448, elements: !455)
!455 = !{!456, !457, !458, !460, !461}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !454, file: !404, line: 59, baseType: !427, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !454, file: !404, line: 62, baseType: !95, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !454, file: !404, line: 66, baseType: !459, size: 256, offset: 64)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !141)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !454, file: !404, line: 69, baseType: !72, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !454, file: !404, line: 72, baseType: !72, size: 64, offset: 384)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !425, file: !404, line: 107, type: !454, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "slot0", scope: !425, file: !404, line: 831, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 256)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !404, line: 321, type: !118, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !404, line: 357, type: !118, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !404, line: 358, type: !118, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !404, line: 199, type: !51, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "quote", scope: !479, file: !404, line: 228, type: !498, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "gettext_quote", scope: !404, file: !404, line: 197, type: !480, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !425, retainedNodes: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!72, !72, !427}
!482 = !{!483, !484, !485, !486, !487}
!483 = !DILocalVariable(name: "msgid", arg: 1, scope: !479, file: !404, line: 197, type: !72)
!484 = !DILocalVariable(name: "s", arg: 2, scope: !479, file: !404, line: 197, type: !427)
!485 = !DILocalVariable(name: "translation", scope: !479, file: !404, line: 199, type: !72)
!486 = !DILocalVariable(name: "w", scope: !479, file: !404, line: 229, type: !384)
!487 = !DILocalVariable(name: "mbs", scope: !479, file: !404, line: 230, type: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !390, line: 6, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !392, line: 21, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 13, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !490, file: !392, line: 15, baseType: !95, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !490, file: !392, line: 20, baseType: !494, size: 32, offset: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !392, line: 16, size: 32, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !494, file: !392, line: 18, baseType: !78, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !494, file: !392, line: 19, baseType: !108, size: 32)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !499)
!499 = !{!120, !110}
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "slotvec", scope: !425, file: !404, line: 834, type: !502, isLocal: true, isDefinition: true)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !404, line: 823, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !503, file: !404, line: 825, baseType: !97, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !503, file: !404, line: 826, baseType: !93, size: 64, offset: 64)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "nslots", scope: !425, file: !404, line: 832, type: !95, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "slotvec0", scope: !425, file: !404, line: 833, type: !503, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 704, elements: !513)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!513 = !{!514}
!514 = !DISubrange(count: 11)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !517, line: 67, type: !207, isLocal: true, isDefinition: true)
!517 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !517, line: 69, type: !51, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !517, line: 83, type: !51, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !517, line: 83, type: !108, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !517, line: 85, type: !118, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !517, line: 88, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 171)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !517, line: 88, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 34)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !517, line: 105, type: !178, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !517, line: 109, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 23)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !517, line: 113, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 28)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !517, line: 120, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 32)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !517, line: 127, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 36)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !517, line: 134, type: !158, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !517, line: 142, type: !14, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !517, line: 150, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 48)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !517, line: 159, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 52)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !517, line: 170, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 60)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !517, line: 248, type: !279, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !517, line: 248, type: !183, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !517, line: 254, type: !279, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !517, line: 254, type: !58, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !517, line: 254, type: !158, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !517, line: 259, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 39)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !517, line: 259, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 29)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !599, file: !600, line: 26, type: !602, isLocal: false, isDefinition: true)
!599 = distinct !DICompileUnit(language: DW_LANG_C11, file: !600, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !601, splitDebugInlining: false, nameTableKind: None)
!600 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!601 = !{!597}
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 47)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "exit_failure", scope: !607, file: !608, line: 24, type: !610, isLocal: false, isDefinition: true)
!607 = distinct !DICompileUnit(language: DW_LANG_C11, file: !608, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !609, splitDebugInlining: false, nameTableKind: None)
!608 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!609 = !{!605}
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !613, line: 34, type: !127, isLocal: true, isDefinition: true)
!613 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !613, line: 34, type: !51, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !613, line: 34, type: !153, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !620, line: 108, type: !36, isLocal: true, isDefinition: true)
!620 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "internal_state", scope: !623, file: !620, line: 97, type: !626, isLocal: true, isDefinition: true)
!623 = distinct !DICompileUnit(language: DW_LANG_C11, file: !620, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !624, globals: !625, splitDebugInlining: false, nameTableKind: None)
!624 = !{!94, !97, !100}
!625 = !{!618, !621}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !390, line: 6, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !392, line: 21, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 13, size: 64, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !628, file: !392, line: 15, baseType: !95, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !628, file: !392, line: 20, baseType: !632, size: 32, offset: 32)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !628, file: !392, line: 16, size: 32, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !632, file: !392, line: 18, baseType: !78, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !632, file: !392, line: 19, baseType: !108, size: 32)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !638, line: 35, type: !113, isLocal: true, isDefinition: true)
!638 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!639 = distinct !DICompileUnit(language: DW_LANG_C11, file: !640, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!640 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!641 = distinct !DICompileUnit(language: DW_LANG_C11, file: !517, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !642, retainedTypes: !646, globals: !647, splitDebugInlining: false, nameTableKind: None)
!642 = !{!643}
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !517, line: 40, baseType: !78, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!646 = !{!94}
!647 = !{!515, !518, !520, !522, !524, !526, !531, !536, !538, !543, !548, !553, !558, !560, !562, !567, !572, !577, !579, !581, !583, !585, !587, !592}
!648 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !650, retainedTypes: !682, splitDebugInlining: false, nameTableKind: None)
!649 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!650 = !{!651, !663}
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !652, file: !649, line: 188, baseType: !78, size: 32, elements: !661)
!652 = distinct !DISubprogram(name: "x2nrealloc", scope: !649, file: !649, line: 176, type: !653, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !648, retainedNodes: !656)
!653 = !DISubroutineType(types: !654)
!654 = !{!94, !94, !655, !97}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!656 = !{!657, !658, !659, !660}
!657 = !DILocalVariable(name: "p", arg: 1, scope: !652, file: !649, line: 176, type: !94)
!658 = !DILocalVariable(name: "pn", arg: 2, scope: !652, file: !649, line: 176, type: !655)
!659 = !DILocalVariable(name: "s", arg: 3, scope: !652, file: !649, line: 176, type: !97)
!660 = !DILocalVariable(name: "n", scope: !652, file: !649, line: 178, type: !97)
!661 = !{!662}
!662 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !664, file: !649, line: 228, baseType: !78, size: 32, elements: !661)
!664 = distinct !DISubprogram(name: "xpalloc", scope: !649, file: !649, line: 223, type: !665, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !648, retainedNodes: !672)
!665 = !DISubroutineType(types: !666)
!666 = !{!94, !94, !667, !668, !670, !668}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !669, line: 130, baseType: !670)
!669 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !671, line: 18, baseType: !258)
!671 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681}
!673 = !DILocalVariable(name: "pa", arg: 1, scope: !664, file: !649, line: 223, type: !94)
!674 = !DILocalVariable(name: "pn", arg: 2, scope: !664, file: !649, line: 223, type: !667)
!675 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !664, file: !649, line: 223, type: !668)
!676 = !DILocalVariable(name: "n_max", arg: 4, scope: !664, file: !649, line: 223, type: !670)
!677 = !DILocalVariable(name: "s", arg: 5, scope: !664, file: !649, line: 223, type: !668)
!678 = !DILocalVariable(name: "n0", scope: !664, file: !649, line: 230, type: !668)
!679 = !DILocalVariable(name: "n", scope: !664, file: !649, line: 237, type: !668)
!680 = !DILocalVariable(name: "nbytes", scope: !664, file: !649, line: 248, type: !668)
!681 = !DILocalVariable(name: "adjusted_nbytes", scope: !664, file: !649, line: 252, type: !668)
!682 = !{!93, !94}
!683 = distinct !DICompileUnit(language: DW_LANG_C11, file: !613, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !684, splitDebugInlining: false, nameTableKind: None)
!684 = !{!611, !614, !616}
!685 = distinct !DICompileUnit(language: DW_LANG_C11, file: !686, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !646, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!691 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !646, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !694, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !646, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!695 = distinct !DICompileUnit(language: DW_LANG_C11, file: !638, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !696, splitDebugInlining: false, nameTableKind: None)
!696 = !{!697, !636}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !638, line: 35, type: !118, isLocal: true, isDefinition: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !646, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!703 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!704 = !{i32 7, !"Dwarf Version", i32 5}
!705 = !{i32 2, !"Debug Info Version", i32 3}
!706 = !{i32 1, !"wchar_size", i32 4}
!707 = !{i32 8, !"PIC Level", i32 2}
!708 = !{i32 7, !"PIE Level", i32 2}
!709 = !{i32 7, !"uwtable", i32 2}
!710 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!711 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !712, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !95}
!714 = !{!715}
!715 = !DILocalVariable(name: "status", arg: 1, scope: !711, file: !2, line: 36, type: !95)
!716 = !DILocation(line: 0, scope: !711)
!717 = !DILocation(line: 38, column: 3, scope: !711)
!718 = !{!719, !719, i64 0}
!719 = !{!"any pointer", !720, i64 0}
!720 = !{!"omnipotent char", !721, i64 0}
!721 = !{!"Simple C/C++ TBAA"}
!722 = !DILocation(line: 43, column: 3, scope: !711)
!723 = !DILocation(line: 47, column: 3, scope: !711)
!724 = !DILocation(line: 48, column: 3, scope: !711)
!725 = !DILocation(line: 49, column: 3, scope: !711)
!726 = !DILocation(line: 50, column: 3, scope: !711)
!727 = !DILocation(line: 51, column: 3, scope: !711)
!728 = !DISubprogram(name: "dcgettext", scope: !729, file: !729, line: 51, type: !730, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!729 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!730 = !DISubroutineType(types: !731)
!731 = !{!93, !72, !72, !95}
!732 = !DISubprogram(name: "__printf_chk", scope: !733, file: !733, line: 95, type: !734, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!734 = !DISubroutineType(types: !735)
!735 = !{!95, !95, !736, null}
!736 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!737 = !DILocation(line: 0, scope: !68)
!738 = !DILocation(line: 581, column: 7, scope: !215)
!739 = !{!740, !740, i64 0}
!740 = !{!"int", !720, i64 0}
!741 = !DILocation(line: 581, column: 19, scope: !215)
!742 = !DILocation(line: 581, column: 7, scope: !68)
!743 = !DILocation(line: 585, column: 26, scope: !214)
!744 = !DILocation(line: 0, scope: !214)
!745 = !DILocation(line: 586, column: 23, scope: !214)
!746 = !DILocation(line: 586, column: 28, scope: !214)
!747 = !DILocation(line: 586, column: 32, scope: !214)
!748 = !{!720, !720, i64 0}
!749 = !DILocation(line: 586, column: 38, scope: !214)
!750 = !DILocalVariable(name: "__s1", arg: 1, scope: !751, file: !752, line: 1359, type: !72)
!751 = distinct !DISubprogram(name: "streq", scope: !752, file: !752, line: 1359, type: !753, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !755)
!752 = !DIFile(filename: "./lib/string.h", directory: "/src")
!753 = !DISubroutineType(types: !754)
!754 = !{!217, !72, !72}
!755 = !{!750, !756}
!756 = !DILocalVariable(name: "__s2", arg: 2, scope: !751, file: !752, line: 1359, type: !72)
!757 = !DILocation(line: 0, scope: !751, inlinedAt: !758)
!758 = distinct !DILocation(line: 586, column: 41, scope: !214)
!759 = !DILocation(line: 1361, column: 11, scope: !751, inlinedAt: !758)
!760 = !DILocation(line: 1361, column: 10, scope: !751, inlinedAt: !758)
!761 = !DILocation(line: 586, column: 19, scope: !214)
!762 = !DILocation(line: 587, column: 5, scope: !214)
!763 = !DILocation(line: 588, column: 7, scope: !764)
!764 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!765 = !DILocation(line: 588, column: 7, scope: !68)
!766 = !DILocation(line: 590, column: 7, scope: !767)
!767 = distinct !DILexicalBlock(scope: !764, file: !69, line: 589, column: 5)
!768 = !DILocation(line: 591, column: 7, scope: !767)
!769 = !DILocation(line: 595, column: 37, scope: !68)
!770 = !DILocation(line: 595, column: 35, scope: !68)
!771 = !DILocation(line: 596, column: 29, scope: !68)
!772 = !DILocation(line: 597, column: 8, scope: !223)
!773 = !DILocation(line: 597, column: 7, scope: !68)
!774 = !DILocation(line: 604, column: 24, scope: !222)
!775 = !DILocation(line: 604, column: 12, scope: !223)
!776 = !DILocation(line: 0, scope: !221)
!777 = !DILocation(line: 610, column: 16, scope: !221)
!778 = !DILocation(line: 610, column: 7, scope: !221)
!779 = !DILocation(line: 611, column: 21, scope: !221)
!780 = !{!781, !781, i64 0}
!781 = !{!"short", !720, i64 0}
!782 = !DILocation(line: 611, column: 19, scope: !221)
!783 = !DILocation(line: 611, column: 16, scope: !221)
!784 = !DILocation(line: 610, column: 30, scope: !221)
!785 = distinct !{!785, !778, !779, !786}
!786 = !{!"llvm.loop.mustprogress"}
!787 = !DILocation(line: 612, column: 18, scope: !788)
!788 = distinct !DILexicalBlock(scope: !221, file: !69, line: 612, column: 11)
!789 = !DILocation(line: 612, column: 11, scope: !221)
!790 = !DILocation(line: 620, column: 23, scope: !68)
!791 = !DILocation(line: 625, column: 39, scope: !68)
!792 = !DILocation(line: 626, column: 3, scope: !68)
!793 = !DILocation(line: 626, column: 10, scope: !68)
!794 = !DILocation(line: 626, column: 21, scope: !68)
!795 = !DILocation(line: 628, column: 44, scope: !796)
!796 = distinct !DILexicalBlock(scope: !797, file: !69, line: 628, column: 11)
!797 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!798 = !DILocation(line: 628, column: 32, scope: !796)
!799 = !DILocation(line: 628, column: 49, scope: !796)
!800 = !DILocation(line: 628, column: 11, scope: !797)
!801 = !DILocation(line: 630, column: 11, scope: !802)
!802 = distinct !DILexicalBlock(scope: !797, file: !69, line: 630, column: 11)
!803 = !DILocation(line: 630, column: 11, scope: !797)
!804 = !DILocation(line: 632, column: 26, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !69, line: 632, column: 15)
!806 = distinct !DILexicalBlock(scope: !802, file: !69, line: 631, column: 9)
!807 = !DILocation(line: 632, column: 34, scope: !805)
!808 = !DILocation(line: 632, column: 37, scope: !805)
!809 = !DILocation(line: 632, column: 15, scope: !806)
!810 = !DILocation(line: 636, column: 16, scope: !811)
!811 = distinct !DILexicalBlock(scope: !806, file: !69, line: 636, column: 15)
!812 = !DILocation(line: 636, column: 29, scope: !811)
!813 = !DILocation(line: 640, column: 16, scope: !797)
!814 = distinct !{!814, !792, !815, !786}
!815 = !DILocation(line: 641, column: 5, scope: !68)
!816 = !DILocation(line: 644, column: 3, scope: !68)
!817 = !DILocation(line: 0, scope: !751, inlinedAt: !818)
!818 = distinct !DILocation(line: 648, column: 31, scope: !68)
!819 = !{}
!820 = !DILocation(line: 0, scope: !751, inlinedAt: !821)
!821 = distinct !DILocation(line: 649, column: 31, scope: !68)
!822 = !DILocation(line: 0, scope: !751, inlinedAt: !823)
!823 = distinct !DILocation(line: 650, column: 31, scope: !68)
!824 = !DILocation(line: 0, scope: !751, inlinedAt: !825)
!825 = distinct !DILocation(line: 651, column: 31, scope: !68)
!826 = !DILocation(line: 0, scope: !751, inlinedAt: !827)
!827 = distinct !DILocation(line: 652, column: 31, scope: !68)
!828 = !DILocation(line: 0, scope: !751, inlinedAt: !829)
!829 = distinct !DILocation(line: 653, column: 31, scope: !68)
!830 = !DILocation(line: 0, scope: !751, inlinedAt: !831)
!831 = distinct !DILocation(line: 654, column: 31, scope: !68)
!832 = !DILocation(line: 0, scope: !751, inlinedAt: !833)
!833 = distinct !DILocation(line: 655, column: 31, scope: !68)
!834 = !DILocation(line: 0, scope: !751, inlinedAt: !835)
!835 = distinct !DILocation(line: 656, column: 31, scope: !68)
!836 = !DILocation(line: 0, scope: !751, inlinedAt: !837)
!837 = distinct !DILocation(line: 657, column: 31, scope: !68)
!838 = !DILocation(line: 663, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!840 = !DILocation(line: 664, column: 7, scope: !839)
!841 = !DILocation(line: 664, column: 10, scope: !839)
!842 = !DILocation(line: 663, column: 7, scope: !68)
!843 = !DILocation(line: 669, column: 7, scope: !844)
!844 = distinct !DILexicalBlock(scope: !839, file: !69, line: 665, column: 5)
!845 = !DILocation(line: 671, column: 5, scope: !844)
!846 = !DILocation(line: 676, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !839, file: !69, line: 673, column: 5)
!848 = !DILocation(line: 679, column: 3, scope: !68)
!849 = !DILocation(line: 683, column: 3, scope: !68)
!850 = !DILocation(line: 686, column: 3, scope: !68)
!851 = !DILocation(line: 688, column: 3, scope: !68)
!852 = !DILocation(line: 691, column: 3, scope: !68)
!853 = !DILocation(line: 695, column: 3, scope: !68)
!854 = !DILocation(line: 696, column: 1, scope: !68)
!855 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !856, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !858)
!856 = !DISubroutineType(cc: DW_CC_nocall, types: !857)
!857 = !{null, !72}
!858 = !{!859, !860, !867, !868, !870, !871}
!859 = !DILocalVariable(name: "program", arg: 1, scope: !855, file: !69, line: 836, type: !72)
!860 = !DILocalVariable(name: "infomap", scope: !855, file: !69, line: 838, type: !861)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 896, elements: !52)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !855, file: !69, line: 838, size: 128, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !863, file: !69, line: 838, baseType: !72, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !863, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!867 = !DILocalVariable(name: "node", scope: !855, file: !69, line: 848, type: !72)
!868 = !DILocalVariable(name: "map_prog", scope: !855, file: !69, line: 849, type: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!870 = !DILocalVariable(name: "lc_messages", scope: !855, file: !69, line: 861, type: !72)
!871 = !DILocalVariable(name: "url_program", scope: !855, file: !69, line: 874, type: !72)
!872 = !DILocation(line: 0, scope: !855)
!873 = !DILocation(line: 857, column: 3, scope: !855)
!874 = !DILocation(line: 861, column: 29, scope: !855)
!875 = !DILocation(line: 862, column: 7, scope: !876)
!876 = distinct !DILexicalBlock(scope: !855, file: !69, line: 862, column: 7)
!877 = !DILocation(line: 862, column: 19, scope: !876)
!878 = !DILocation(line: 862, column: 22, scope: !876)
!879 = !DILocation(line: 862, column: 7, scope: !855)
!880 = !DILocation(line: 868, column: 7, scope: !881)
!881 = distinct !DILexicalBlock(scope: !876, file: !69, line: 863, column: 5)
!882 = !DILocation(line: 870, column: 5, scope: !881)
!883 = !DILocation(line: 875, column: 3, scope: !855)
!884 = !DILocation(line: 877, column: 3, scope: !855)
!885 = !DILocation(line: 879, column: 1, scope: !855)
!886 = !DISubprogram(name: "exit", scope: !887, file: !887, line: 624, type: !712, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!887 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!888 = !DISubprogram(name: "setlocale", scope: !889, file: !889, line: 122, type: !890, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!889 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!890 = !DISubroutineType(types: !891)
!891 = !{!93, !95, !72}
!892 = !DISubprogram(name: "strncmp", scope: !893, file: !893, line: 159, type: !894, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!893 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!894 = !DISubroutineType(types: !895)
!895 = !{!95, !72, !72, !97}
!896 = !DISubprogram(name: "fputs_unlocked", scope: !897, file: !897, line: 691, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!897 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!898 = !DISubroutineType(types: !899)
!899 = !{!95, !736, !900}
!900 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !230)
!901 = !DISubprogram(name: "getenv", scope: !887, file: !887, line: 641, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!902 = !DISubroutineType(types: !903)
!903 = !{!93, !72}
!904 = !DISubprogram(name: "strcmp", scope: !893, file: !893, line: 156, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!905 = !DISubroutineType(types: !906)
!906 = !{!95, !72, !72}
!907 = !DISubprogram(name: "strspn", scope: !893, file: !893, line: 297, type: !908, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!908 = !DISubroutineType(types: !909)
!909 = !{!99, !72, !72}
!910 = !DISubprogram(name: "strchr", scope: !893, file: !893, line: 246, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!911 = !DISubroutineType(types: !912)
!912 = !{!93, !72, !95}
!913 = !DISubprogram(name: "__ctype_b_loc", scope: !77, file: !77, line: 79, type: !914, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!914 = !DISubroutineType(types: !915)
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!919 = !DISubprogram(name: "strcspn", scope: !893, file: !893, line: 293, type: !908, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!920 = !DISubprogram(name: "fwrite_unlocked", scope: !897, file: !897, line: 704, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!921 = !DISubroutineType(types: !922)
!922 = !{!97, !923, !97, !97, !900}
!923 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!926 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !927, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !930)
!927 = !DISubroutineType(types: !928)
!928 = !{!95, !95, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!930 = !{!931, !932}
!931 = !DILocalVariable(name: "argc", arg: 1, scope: !926, file: !2, line: 55, type: !95)
!932 = !DILocalVariable(name: "argv", arg: 2, scope: !926, file: !2, line: 55, type: !929)
!933 = !DILocation(line: 0, scope: !926)
!934 = !DILocation(line: 59, column: 12, scope: !935)
!935 = distinct !DILexicalBlock(scope: !926, file: !2, line: 59, column: 7)
!936 = !DILocation(line: 59, column: 7, scope: !926)
!937 = !DILocation(line: 62, column: 25, scope: !938)
!938 = distinct !DILexicalBlock(scope: !935, file: !2, line: 60, column: 5)
!939 = !DILocation(line: 62, column: 7, scope: !938)
!940 = !DILocation(line: 63, column: 7, scope: !938)
!941 = !DILocation(line: 64, column: 7, scope: !938)
!942 = !DILocation(line: 65, column: 7, scope: !938)
!943 = !DILocation(line: 69, column: 7, scope: !938)
!944 = !DILocation(line: 71, column: 18, scope: !945)
!945 = distinct !DILexicalBlock(scope: !938, file: !2, line: 71, column: 11)
!946 = !DILocation(line: 0, scope: !751, inlinedAt: !947)
!947 = distinct !DILocation(line: 71, column: 11, scope: !945)
!948 = !DILocation(line: 1361, column: 11, scope: !751, inlinedAt: !947)
!949 = !DILocation(line: 1361, column: 10, scope: !751, inlinedAt: !947)
!950 = !DILocation(line: 71, column: 11, scope: !938)
!951 = !DILocation(line: 72, column: 9, scope: !945)
!952 = !DILocation(line: 0, scope: !751, inlinedAt: !953)
!953 = distinct !DILocation(line: 74, column: 11, scope: !954)
!954 = distinct !DILexicalBlock(scope: !938, file: !2, line: 74, column: 11)
!955 = !DILocation(line: 1361, column: 11, scope: !751, inlinedAt: !953)
!956 = !DILocation(line: 1361, column: 10, scope: !751, inlinedAt: !953)
!957 = !DILocation(line: 74, column: 11, scope: !938)
!958 = !DILocation(line: 75, column: 22, scope: !954)
!959 = !DILocation(line: 75, column: 58, scope: !954)
!960 = !DILocation(line: 75, column: 67, scope: !954)
!961 = !DILocation(line: 75, column: 9, scope: !954)
!962 = !DILocation(line: 79, column: 3, scope: !926)
!963 = !DISubprogram(name: "bindtextdomain", scope: !729, file: !729, line: 86, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!964 = !DISubroutineType(types: !965)
!965 = !{!93, !72, !72}
!966 = !DISubprogram(name: "textdomain", scope: !729, file: !729, line: 82, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!967 = !DISubprogram(name: "atexit", scope: !887, file: !887, line: 602, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!968 = !DISubroutineType(types: !969)
!969 = !{!95, !358}
!970 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !298, file: !298, line: 50, type: !971, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !972)
!971 = !DISubroutineType(types: !857)
!972 = !{!973}
!973 = !DILocalVariable(name: "file", arg: 1, scope: !970, file: !298, line: 50, type: !72)
!974 = !DILocation(line: 0, scope: !970)
!975 = !DILocation(line: 52, column: 13, scope: !970)
!976 = !DILocation(line: 53, column: 1, scope: !970)
!977 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !298, file: !298, line: 87, type: !978, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !217}
!980 = !{!981}
!981 = !DILocalVariable(name: "ignore", arg: 1, scope: !977, file: !298, line: 87, type: !217)
!982 = !DILocation(line: 0, scope: !977)
!983 = !DILocation(line: 89, column: 16, scope: !977)
!984 = !{!985, !985, i64 0}
!985 = !{!"_Bool", !720, i64 0}
!986 = !DILocation(line: 90, column: 1, scope: !977)
!987 = distinct !DISubprogram(name: "close_stdout", scope: !298, file: !298, line: 116, type: !359, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !988)
!988 = !{!989}
!989 = !DILocalVariable(name: "write_error", scope: !990, file: !298, line: 121, type: !72)
!990 = distinct !DILexicalBlock(scope: !991, file: !298, line: 120, column: 5)
!991 = distinct !DILexicalBlock(scope: !987, file: !298, line: 118, column: 7)
!992 = !DILocation(line: 118, column: 21, scope: !991)
!993 = !DILocation(line: 118, column: 7, scope: !991)
!994 = !DILocation(line: 118, column: 29, scope: !991)
!995 = !DILocation(line: 119, column: 7, scope: !991)
!996 = !DILocation(line: 119, column: 12, scope: !991)
!997 = !{i8 0, i8 2}
!998 = !DILocation(line: 119, column: 25, scope: !991)
!999 = !DILocation(line: 119, column: 28, scope: !991)
!1000 = !DILocation(line: 119, column: 34, scope: !991)
!1001 = !DILocation(line: 118, column: 7, scope: !987)
!1002 = !DILocation(line: 121, column: 33, scope: !990)
!1003 = !DILocation(line: 0, scope: !990)
!1004 = !DILocation(line: 122, column: 11, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !990, file: !298, line: 122, column: 11)
!1006 = !DILocation(line: 0, scope: !1005)
!1007 = !DILocation(line: 122, column: 11, scope: !990)
!1008 = !DILocation(line: 123, column: 9, scope: !1005)
!1009 = !DILocation(line: 126, column: 9, scope: !1005)
!1010 = !DILocation(line: 128, column: 14, scope: !990)
!1011 = !DILocation(line: 128, column: 7, scope: !990)
!1012 = !DILocation(line: 133, column: 42, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !987, file: !298, line: 133, column: 7)
!1014 = !DILocation(line: 133, column: 28, scope: !1013)
!1015 = !DILocation(line: 133, column: 50, scope: !1013)
!1016 = !DILocation(line: 133, column: 7, scope: !987)
!1017 = !DILocation(line: 134, column: 12, scope: !1013)
!1018 = !DILocation(line: 134, column: 5, scope: !1013)
!1019 = !DILocation(line: 135, column: 1, scope: !987)
!1020 = !DISubprogram(name: "__errno_location", scope: !1021, file: !1021, line: 37, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1021 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!1025 = !DISubprogram(name: "_exit", scope: !1026, file: !1026, line: 624, type: !712, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1026 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1027 = distinct !DISubprogram(name: "verror", scope: !313, file: !313, line: 251, type: !1028, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1030)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !95, !95, !72, !323}
!1030 = !{!1031, !1032, !1033, !1034}
!1031 = !DILocalVariable(name: "status", arg: 1, scope: !1027, file: !313, line: 251, type: !95)
!1032 = !DILocalVariable(name: "errnum", arg: 2, scope: !1027, file: !313, line: 251, type: !95)
!1033 = !DILocalVariable(name: "message", arg: 3, scope: !1027, file: !313, line: 251, type: !72)
!1034 = !DILocalVariable(name: "args", arg: 4, scope: !1027, file: !313, line: 251, type: !323)
!1035 = !DILocation(line: 0, scope: !1027)
!1036 = !DILocation(line: 261, column: 3, scope: !1027)
!1037 = !DILocation(line: 265, column: 7, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1027, file: !313, line: 265, column: 7)
!1039 = !DILocation(line: 265, column: 7, scope: !1027)
!1040 = !DILocation(line: 266, column: 5, scope: !1038)
!1041 = !DILocation(line: 272, column: 7, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !313, line: 268, column: 5)
!1043 = !DILocation(line: 276, column: 3, scope: !1027)
!1044 = !DILocation(line: 282, column: 1, scope: !1027)
!1045 = distinct !DISubprogram(name: "flush_stdout", scope: !313, file: !313, line: 163, type: !359, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1046)
!1046 = !{!1047}
!1047 = !DILocalVariable(name: "stdout_fd", scope: !1045, file: !313, line: 166, type: !95)
!1048 = !DILocation(line: 0, scope: !1045)
!1049 = !DILocalVariable(name: "fd", arg: 1, scope: !1050, file: !313, line: 145, type: !95)
!1050 = distinct !DISubprogram(name: "is_open", scope: !313, file: !313, line: 145, type: !1051, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!95, !95}
!1053 = !{!1049}
!1054 = !DILocation(line: 0, scope: !1050, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 182, column: 25, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1045, file: !313, line: 182, column: 7)
!1057 = !DILocation(line: 157, column: 15, scope: !1050, inlinedAt: !1055)
!1058 = !DILocation(line: 157, column: 12, scope: !1050, inlinedAt: !1055)
!1059 = !DILocation(line: 182, column: 7, scope: !1045)
!1060 = !DILocation(line: 184, column: 5, scope: !1056)
!1061 = !DILocation(line: 185, column: 1, scope: !1045)
!1062 = !DISubprogram(name: "__fprintf_chk", scope: !733, file: !733, line: 93, type: !1063, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!95, !1065, !95, !736, null}
!1065 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1068, file: !234, line: 51, baseType: !95, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1068, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1068, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1068, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1068, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1068, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1068, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1068, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1068, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1068, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1068, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1068, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1068, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1068, file: !234, line: 70, baseType: !1084, size: 64, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1068, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1068, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1068, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1068, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1068, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1068, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1068, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1068, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1068, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1068, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1068, file: !234, line: 93, baseType: !1084, size: 64, offset: 1344)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1068, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1068, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1068, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1068, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!1100 = distinct !DISubprogram(name: "error_tail", scope: !313, file: !313, line: 219, type: !1028, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1101)
!1101 = !{!1102, !1103, !1104, !1105}
!1102 = !DILocalVariable(name: "status", arg: 1, scope: !1100, file: !313, line: 219, type: !95)
!1103 = !DILocalVariable(name: "errnum", arg: 2, scope: !1100, file: !313, line: 219, type: !95)
!1104 = !DILocalVariable(name: "message", arg: 3, scope: !1100, file: !313, line: 219, type: !72)
!1105 = !DILocalVariable(name: "args", arg: 4, scope: !1100, file: !313, line: 219, type: !323)
!1106 = distinct !DIAssignID()
!1107 = !DILocation(line: 0, scope: !1100)
!1108 = !DILocation(line: 229, column: 13, scope: !1100)
!1109 = !DILocalVariable(name: "__stream", arg: 1, scope: !1110, file: !733, line: 132, type: !1065)
!1110 = distinct !DISubprogram(name: "vfprintf", scope: !733, file: !733, line: 132, type: !1111, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1113)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!95, !1065, !736, !323}
!1113 = !{!1109, !1114, !1115}
!1114 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1110, file: !733, line: 133, type: !736)
!1115 = !DILocalVariable(name: "__ap", arg: 3, scope: !1110, file: !733, line: 133, type: !323)
!1116 = !DILocation(line: 0, scope: !1110, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 229, column: 3, scope: !1100)
!1118 = !DILocation(line: 135, column: 10, scope: !1110, inlinedAt: !1117)
!1119 = !DILocation(line: 232, column: 3, scope: !1100)
!1120 = !DILocation(line: 233, column: 7, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1100, file: !313, line: 233, column: 7)
!1122 = !DILocation(line: 233, column: 7, scope: !1100)
!1123 = !DILocalVariable(name: "errbuf", scope: !1124, file: !313, line: 193, type: !1128)
!1124 = distinct !DISubprogram(name: "print_errno_message", scope: !313, file: !313, line: 188, type: !712, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1125)
!1125 = !{!1126, !1127, !1123}
!1126 = !DILocalVariable(name: "errnum", arg: 1, scope: !1124, file: !313, line: 188, type: !95)
!1127 = !DILocalVariable(name: "s", scope: !1124, file: !313, line: 190, type: !72)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 1024)
!1131 = !DILocation(line: 0, scope: !1124, inlinedAt: !1132)
!1132 = distinct !DILocation(line: 234, column: 5, scope: !1121)
!1133 = !DILocation(line: 193, column: 3, scope: !1124, inlinedAt: !1132)
!1134 = !DILocation(line: 195, column: 7, scope: !1124, inlinedAt: !1132)
!1135 = !DILocation(line: 207, column: 9, scope: !1136, inlinedAt: !1132)
!1136 = distinct !DILexicalBlock(scope: !1124, file: !313, line: 207, column: 7)
!1137 = !DILocation(line: 207, column: 7, scope: !1124, inlinedAt: !1132)
!1138 = !DILocation(line: 208, column: 9, scope: !1136, inlinedAt: !1132)
!1139 = !DILocation(line: 208, column: 5, scope: !1136, inlinedAt: !1132)
!1140 = !DILocation(line: 214, column: 3, scope: !1124, inlinedAt: !1132)
!1141 = !DILocation(line: 216, column: 1, scope: !1124, inlinedAt: !1132)
!1142 = !DILocation(line: 234, column: 5, scope: !1121)
!1143 = !DILocation(line: 238, column: 3, scope: !1100)
!1144 = !DILocalVariable(name: "__c", arg: 1, scope: !1145, file: !1146, line: 101, type: !95)
!1145 = distinct !DISubprogram(name: "putc_unlocked", scope: !1146, file: !1146, line: 101, type: !1147, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1149)
!1146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!95, !95, !1066}
!1149 = !{!1144, !1150}
!1150 = !DILocalVariable(name: "__stream", arg: 2, scope: !1145, file: !1146, line: 101, type: !1066)
!1151 = !DILocation(line: 0, scope: !1145, inlinedAt: !1152)
!1152 = distinct !DILocation(line: 238, column: 3, scope: !1100)
!1153 = !DILocation(line: 103, column: 10, scope: !1145, inlinedAt: !1152)
!1154 = !{!1155, !719, i64 40}
!1155 = !{!"_IO_FILE", !740, i64 0, !719, i64 8, !719, i64 16, !719, i64 24, !719, i64 32, !719, i64 40, !719, i64 48, !719, i64 56, !719, i64 64, !719, i64 72, !719, i64 80, !719, i64 88, !719, i64 96, !719, i64 104, !740, i64 112, !740, i64 116, !1156, i64 120, !781, i64 128, !720, i64 130, !720, i64 131, !719, i64 136, !1156, i64 144, !719, i64 152, !719, i64 160, !719, i64 168, !719, i64 176, !1156, i64 184, !740, i64 192, !720, i64 196}
!1156 = !{!"long", !720, i64 0}
!1157 = !{!1155, !719, i64 48}
!1158 = !{!"branch_weights", i32 2000, i32 1}
!1159 = !DILocation(line: 240, column: 3, scope: !1100)
!1160 = !DILocation(line: 241, column: 7, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1100, file: !313, line: 241, column: 7)
!1162 = !DILocation(line: 241, column: 7, scope: !1100)
!1163 = !DILocation(line: 242, column: 5, scope: !1161)
!1164 = !DILocation(line: 243, column: 1, scope: !1100)
!1165 = !DISubprogram(name: "__vfprintf_chk", scope: !733, file: !733, line: 96, type: !1166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
