; ModuleID = 'src/unlink.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s FILE\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [57 x i8] c"Call the unlink function to remove the specified FILE.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"unlink\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 15)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 61)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !143, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !117, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !117, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !156, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !56, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 22)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !180, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !124, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 71)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 27)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 51)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 12)
!227 = !{!228, !229, !230, !233, !235, !236, !237, !241, !242, !243, !244, !246, !300, !301, !302, !304, !305}
!228 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!229 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!230 = !DILocalVariable(name: "term", scope: !231, file: !69, line: 585, type: !72)
!231 = distinct !DILexicalBlock(scope: !232, file: !69, line: 582, column: 5)
!232 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!233 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !234)
!234 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!236 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!237 = !DILocalVariable(name: "s", scope: !238, file: !69, line: 608, type: !72)
!238 = distinct !DILexicalBlock(scope: !239, file: !69, line: 605, column: 5)
!239 = distinct !DILexicalBlock(scope: !240, file: !69, line: 604, column: 12)
!240 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!241 = !DILocalVariable(name: "spaces", scope: !238, file: !69, line: 609, type: !110)
!242 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !110)
!243 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!244 = !DILocalVariable(name: "__ptr", scope: !245, file: !69, line: 644, type: !72)
!245 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!246 = !DILocalVariable(name: "__stream", scope: !245, file: !69, line: 644, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !250)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!252 = !{!253, !254, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !269, !271, !272, !273, !277, !278, !280, !281, !284, !286, !289, !292, !293, !294, !295, !296}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !250, file: !251, line: 51, baseType: !108, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !250, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !250, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !250, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !250, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !250, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !250, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !250, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !250, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !250, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !250, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !250, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !250, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !251, line: 36, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !250, file: !251, line: 70, baseType: !270, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !250, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !250, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !250, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !275, line: 152, baseType: !276)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!276 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !250, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !250, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!279 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !250, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !250, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !251, line: 43, baseType: null)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !250, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !275, line: 153, baseType: !276)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !250, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !251, line: 37, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !250, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !251, line: 38, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !250, file: !251, line: 93, baseType: !270, size: 64, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !250, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !250, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !250, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !250, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 20)
!300 = !DILocalVariable(name: "__cnt", scope: !245, file: !69, line: 644, type: !110)
!301 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!302 = !DILocalVariable(name: "__ptr", scope: !303, file: !69, line: 686, type: !72)
!303 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!304 = !DILocalVariable(name: "__stream", scope: !303, file: !69, line: 686, type: !247)
!305 = !DILocalVariable(name: "__cnt", scope: !303, file: !69, line: 686, type: !110)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !308, line: 3, type: !180, isLocal: true, isDefinition: true)
!308 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "Version", scope: !311, file: !308, line: 3, type: !72, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C11, file: !308, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !312, splitDebugInlining: false, nameTableKind: None)
!312 = !{!306, !309}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "file_name", scope: !315, file: !316, line: 45, type: !72, isLocal: true, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C11, file: !316, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!316 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!317 = !{!318, !320, !322, !324, !313, !326}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !19, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !224, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !316, line: 123, type: !19, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !316, line: 126, type: !143, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !315, file: !316, line: 55, type: !234, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !330, file: !331, line: 66, type: !376, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C11, file: !331, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !332, globals: !333, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!332 = !{!107, !113}
!333 = !{!334, !336, !355, !357, !359, !361, !328, !363, !365, !367, !369, !374}
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !331, line: 272, type: !117, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "old_file_name", scope: !338, file: !331, line: 304, type: !72, isLocal: true, isDefinition: true)
!338 = distinct !DISubprogram(name: "verror_at_line", scope: !331, file: !331, line: 298, type: !339, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !348)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !108, !108, !72, !78, !72, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !343)
!343 = !{!344, !345, !346, !347}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !342, file: !331, baseType: !78, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !342, file: !331, baseType: !78, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !342, file: !331, baseType: !107, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !342, file: !331, baseType: !107, size: 64, offset: 128)
!348 = !{!349, !350, !351, !352, !353, !354}
!349 = !DILocalVariable(name: "status", arg: 1, scope: !338, file: !331, line: 298, type: !108)
!350 = !DILocalVariable(name: "errnum", arg: 2, scope: !338, file: !331, line: 298, type: !108)
!351 = !DILocalVariable(name: "file_name", arg: 3, scope: !338, file: !331, line: 298, type: !72)
!352 = !DILocalVariable(name: "line_number", arg: 4, scope: !338, file: !331, line: 298, type: !78)
!353 = !DILocalVariable(name: "message", arg: 5, scope: !338, file: !331, line: 298, type: !72)
!354 = !DILocalVariable(name: "args", arg: 6, scope: !338, file: !331, line: 298, type: !341)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "old_line_number", scope: !338, file: !331, line: 305, type: !78, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !331, line: 338, type: !124, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !156, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !134, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "error_message_count", scope: !330, file: !331, line: 69, type: !78, isLocal: false, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !330, file: !331, line: 295, type: !108, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !19, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 21)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !331, line: 214, type: !117, isLocal: true, isDefinition: true)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !381, line: 60, type: !134, isLocal: true, isDefinition: true)
!381 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "long_options", scope: !384, file: !381, line: 34, type: !393, isLocal: true, isDefinition: true)
!384 = distinct !DICompileUnit(language: DW_LANG_C11, file: !381, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !385, globals: !386, splitDebugInlining: false, nameTableKind: None)
!385 = !{!107}
!386 = !{!379, !387, !389, !391, !382}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !381, line: 112, type: !34, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !381, line: 36, type: !117, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !381, line: 37, type: !156, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 768, elements: !144)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !396, line: 50, size: 256, elements: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!397 = !{!398, !399, !400, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !396, line: 52, baseType: !72, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !395, file: !396, line: 55, baseType: !108, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !396, line: 56, baseType: !401, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !395, file: !396, line: 57, baseType: !108, size: 32, offset: 192)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "program_name", scope: !405, file: !406, line: 31, type: !72, isLocal: false, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C11, file: !406, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, globals: !408, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!407 = !{!107, !255}
!408 = !{!403, !409, !411}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !406, line: 46, type: !156, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !406, line: 49, type: !124, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "utf07FF", scope: !415, file: !416, line: 46, type: !443, isLocal: true, isDefinition: true)
!415 = distinct !DISubprogram(name: "proper_name_lite", scope: !416, file: !416, line: 38, type: !417, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !419, retainedNodes: !421)
!416 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!417 = !DISubroutineType(types: !418)
!418 = !{!72, !72, !72}
!419 = distinct !DICompileUnit(language: DW_LANG_C11, file: !416, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !420, splitDebugInlining: false, nameTableKind: None)
!420 = !{!413}
!421 = !{!422, !423, !424, !425, !430}
!422 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !415, file: !416, line: 38, type: !72)
!423 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !415, file: !416, line: 38, type: !72)
!424 = !DILocalVariable(name: "translation", scope: !415, file: !416, line: 40, type: !72)
!425 = !DILocalVariable(name: "w", scope: !415, file: !416, line: 47, type: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !427, line: 37, baseType: !428)
!427 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !275, line: 57, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !275, line: 42, baseType: !78)
!430 = !DILocalVariable(name: "mbs", scope: !415, file: !416, line: 48, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !432, line: 6, baseType: !433)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !434, line: 21, baseType: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 13, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !435, file: !434, line: 15, baseType: !108, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !435, file: !434, line: 20, baseType: !439, size: 32, offset: 32)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !434, line: 16, size: 32, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !439, file: !434, line: 18, baseType: !78, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !439, file: !434, line: 19, baseType: !124, size: 32)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !135)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !446, line: 78, type: !156, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !446, line: 79, type: !129, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !446, line: 80, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 13)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !446, line: 81, type: !451, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !446, line: 82, type: !297, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !446, line: 83, type: !134, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !446, line: 84, type: !156, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !446, line: 85, type: !19, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !446, line: 86, type: !19, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !446, line: 87, type: !156, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !470, file: !446, line: 76, type: !544, isLocal: false, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C11, file: !446, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !479, globals: !480, splitDebugInlining: false, nameTableKind: None)
!471 = !{!472, !474, !91}
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !473, line: 42, baseType: !78, size: 32, elements: !79)
!473 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !473, line: 254, baseType: !78, size: 32, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!477 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!478 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!479 = !{!107, !108, !109, !110}
!480 = !{!444, !447, !449, !454, !456, !458, !460, !462, !464, !466, !468, !481, !485, !495, !497, !502, !504, !506, !508, !510, !533, !540, !542}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !470, file: !446, line: 92, type: !483, isLocal: false, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 320, elements: !40)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !470, file: !446, line: 1040, type: !487, isLocal: false, isDefinition: true)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !446, line: 56, size: 448, elements: !488)
!488 = !{!489, !490, !491, !493, !494}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !487, file: !446, line: 59, baseType: !472, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !487, file: !446, line: 62, baseType: !108, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !487, file: !446, line: 66, baseType: !492, size: 256, offset: 64)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !157)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !487, file: !446, line: 69, baseType: !72, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !487, file: !446, line: 72, baseType: !72, size: 64, offset: 384)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !470, file: !446, line: 107, type: !487, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "slot0", scope: !470, file: !446, line: 831, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 256)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !446, line: 321, type: !134, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !446, line: 357, type: !134, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !446, line: 358, type: !134, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !446, line: 199, type: !19, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "quote", scope: !512, file: !446, line: 228, type: !531, isLocal: true, isDefinition: true)
!512 = distinct !DISubprogram(name: "gettext_quote", scope: !446, file: !446, line: 197, type: !513, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !470, retainedNodes: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{!72, !72, !472}
!515 = !{!516, !517, !518, !519, !520}
!516 = !DILocalVariable(name: "msgid", arg: 1, scope: !512, file: !446, line: 197, type: !72)
!517 = !DILocalVariable(name: "s", arg: 2, scope: !512, file: !446, line: 197, type: !472)
!518 = !DILocalVariable(name: "translation", scope: !512, file: !446, line: 199, type: !72)
!519 = !DILocalVariable(name: "w", scope: !512, file: !446, line: 229, type: !426)
!520 = !DILocalVariable(name: "mbs", scope: !512, file: !446, line: 230, type: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !432, line: 6, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !434, line: 21, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 13, size: 64, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !523, file: !434, line: 15, baseType: !108, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !523, file: !434, line: 20, baseType: !527, size: 32, offset: 32)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !523, file: !434, line: 16, size: 32, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !527, file: !434, line: 18, baseType: !78, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !527, file: !434, line: 19, baseType: !124, size: 32)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !532)
!532 = !{!136, !126}
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "slotvec", scope: !470, file: !446, line: 834, type: !535, isLocal: true, isDefinition: true)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !446, line: 823, size: 128, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !536, file: !446, line: 825, baseType: !110, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !536, file: !446, line: 826, baseType: !255, size: 64, offset: 64)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "nslots", scope: !470, file: !446, line: 832, type: !108, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "slotvec0", scope: !470, file: !446, line: 833, type: !536, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 704, elements: !546)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!546 = !{!547}
!547 = !DISubrange(count: 11)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !550, line: 67, type: !224, isLocal: true, isDefinition: true)
!550 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !550, line: 69, type: !19, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !550, line: 83, type: !19, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !550, line: 83, type: !124, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !550, line: 85, type: !134, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !550, line: 88, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 171)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !550, line: 88, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 34)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !550, line: 105, type: !56, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !550, line: 109, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 23)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !550, line: 113, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 28)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !550, line: 120, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 32)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !550, line: 127, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 36)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !550, line: 134, type: !175, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !550, line: 142, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 44)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !550, line: 150, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 48)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !550, line: 159, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 52)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !550, line: 170, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 60)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !550, line: 248, type: !297, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !550, line: 248, type: !200, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !550, line: 254, type: !297, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !550, line: 254, type: !49, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !550, line: 254, type: !175, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !550, line: 259, type: !3, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !550, line: 259, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 29)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !632, file: !633, line: 26, type: !635, isLocal: false, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C11, file: !633, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !634, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!634 = !{!630}
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 47)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "exit_failure", scope: !640, file: !641, line: 24, type: !643, isLocal: false, isDefinition: true)
!640 = distinct !DICompileUnit(language: DW_LANG_C11, file: !641, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !642, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!642 = !{!638}
!643 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !646, line: 34, type: !143, isLocal: true, isDefinition: true)
!646 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !646, line: 34, type: !19, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !646, line: 34, type: !61, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !653, line: 108, type: !34, isLocal: true, isDefinition: true)
!653 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "internal_state", scope: !656, file: !653, line: 97, type: !659, isLocal: true, isDefinition: true)
!656 = distinct !DICompileUnit(language: DW_LANG_C11, file: !653, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!657 = !{!107, !110, !113}
!658 = !{!651, !654}
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !432, line: 6, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !434, line: 21, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 13, size: 64, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !661, file: !434, line: 15, baseType: !108, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !661, file: !434, line: 20, baseType: !665, size: 32, offset: 32)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !434, line: 16, size: 32, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !665, file: !434, line: 18, baseType: !78, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !665, file: !434, line: 19, baseType: !124, size: 32)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !671, line: 35, type: !129, isLocal: true, isDefinition: true)
!671 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!672 = distinct !DICompileUnit(language: DW_LANG_C11, file: !673, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!674 = distinct !DICompileUnit(language: DW_LANG_C11, file: !550, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !675, retainedTypes: !385, globals: !679, splitDebugInlining: false, nameTableKind: None)
!675 = !{!676}
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !550, line: 40, baseType: !78, size: 32, elements: !677)
!677 = !{!678}
!678 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!679 = !{!548, !551, !553, !555, !557, !559, !564, !569, !571, !576, !581, !586, !591, !593, !598, !603, !608, !613, !615, !617, !619, !621, !623, !625}
!680 = distinct !DICompileUnit(language: DW_LANG_C11, file: !681, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !714, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!682 = !{!683, !695}
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !684, file: !681, line: 188, baseType: !78, size: 32, elements: !693)
!684 = distinct !DISubprogram(name: "x2nrealloc", scope: !681, file: !681, line: 176, type: !685, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !688)
!685 = !DISubroutineType(types: !686)
!686 = !{!107, !107, !687, !110}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!688 = !{!689, !690, !691, !692}
!689 = !DILocalVariable(name: "p", arg: 1, scope: !684, file: !681, line: 176, type: !107)
!690 = !DILocalVariable(name: "pn", arg: 2, scope: !684, file: !681, line: 176, type: !687)
!691 = !DILocalVariable(name: "s", arg: 3, scope: !684, file: !681, line: 176, type: !110)
!692 = !DILocalVariable(name: "n", scope: !684, file: !681, line: 178, type: !110)
!693 = !{!694}
!694 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !696, file: !681, line: 228, baseType: !78, size: 32, elements: !693)
!696 = distinct !DISubprogram(name: "xpalloc", scope: !681, file: !681, line: 223, type: !697, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !704)
!697 = !DISubroutineType(types: !698)
!698 = !{!107, !107, !699, !700, !702, !700}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !701, line: 130, baseType: !702)
!701 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !703, line: 18, baseType: !276)
!703 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713}
!705 = !DILocalVariable(name: "pa", arg: 1, scope: !696, file: !681, line: 223, type: !107)
!706 = !DILocalVariable(name: "pn", arg: 2, scope: !696, file: !681, line: 223, type: !699)
!707 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !696, file: !681, line: 223, type: !700)
!708 = !DILocalVariable(name: "n_max", arg: 4, scope: !696, file: !681, line: 223, type: !702)
!709 = !DILocalVariable(name: "s", arg: 5, scope: !696, file: !681, line: 223, type: !700)
!710 = !DILocalVariable(name: "n0", scope: !696, file: !681, line: 230, type: !700)
!711 = !DILocalVariable(name: "n", scope: !696, file: !681, line: 237, type: !700)
!712 = !DILocalVariable(name: "nbytes", scope: !696, file: !681, line: 248, type: !700)
!713 = !DILocalVariable(name: "adjusted_nbytes", scope: !696, file: !681, line: 252, type: !700)
!714 = !{!255, !107}
!715 = distinct !DICompileUnit(language: DW_LANG_C11, file: !646, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !716, splitDebugInlining: false, nameTableKind: None)
!716 = !{!644, !647, !649}
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !718, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !722, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !385, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !385, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !385, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !671, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !728, splitDebugInlining: false, nameTableKind: None)
!728 = !{!729, !669}
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !671, line: 35, type: !134, isLocal: true, isDefinition: true)
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !732, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!733 = distinct !DICompileUnit(language: DW_LANG_C11, file: !734, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !385, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!735 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!736 = !{i32 7, !"Dwarf Version", i32 5}
!737 = !{i32 2, !"Debug Info Version", i32 3}
!738 = !{i32 1, !"wchar_size", i32 4}
!739 = !{i32 8, !"PIC Level", i32 2}
!740 = !{i32 7, !"PIE Level", i32 2}
!741 = !{i32 7, !"uwtable", i32 2}
!742 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!743 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !744, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !108}
!746 = !{!747}
!747 = !DILocalVariable(name: "status", arg: 1, scope: !743, file: !2, line: 37, type: !108)
!748 = !DILocation(line: 0, scope: !743)
!749 = !DILocation(line: 39, column: 14, scope: !750)
!750 = distinct !DILexicalBlock(scope: !743, file: !2, line: 39, column: 7)
!751 = !DILocation(line: 39, column: 7, scope: !743)
!752 = !DILocation(line: 40, column: 5, scope: !753)
!753 = distinct !DILexicalBlock(scope: !750, file: !2, line: 40, column: 5)
!754 = !{!755, !755, i64 0}
!755 = !{!"any pointer", !756, i64 0}
!756 = !{!"omnipotent char", !757, i64 0}
!757 = !{!"Simple C/C++ TBAA"}
!758 = !DILocation(line: 43, column: 7, scope: !759)
!759 = distinct !DILexicalBlock(scope: !750, file: !2, line: 42, column: 5)
!760 = !DILocation(line: 46, column: 7, scope: !759)
!761 = !DILocation(line: 48, column: 7, scope: !759)
!762 = !DILocation(line: 49, column: 7, scope: !759)
!763 = !DILocalVariable(name: "program", arg: 1, scope: !764, file: !69, line: 836, type: !72)
!764 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !765, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !72}
!767 = !{!763, !768, !775, !776, !778, !779}
!768 = !DILocalVariable(name: "infomap", scope: !764, file: !69, line: 838, type: !769)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 896, elements: !20)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !764, file: !69, line: 838, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !771, file: !69, line: 838, baseType: !72, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !771, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!775 = !DILocalVariable(name: "node", scope: !764, file: !69, line: 848, type: !72)
!776 = !DILocalVariable(name: "map_prog", scope: !764, file: !69, line: 849, type: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!778 = !DILocalVariable(name: "lc_messages", scope: !764, file: !69, line: 861, type: !72)
!779 = !DILocalVariable(name: "url_program", scope: !764, file: !69, line: 874, type: !72)
!780 = !DILocation(line: 0, scope: !764, inlinedAt: !781)
!781 = distinct !DILocation(line: 50, column: 7, scope: !759)
!782 = !{}
!783 = !DILocation(line: 857, column: 3, scope: !764, inlinedAt: !781)
!784 = !DILocation(line: 861, column: 29, scope: !764, inlinedAt: !781)
!785 = !DILocation(line: 862, column: 7, scope: !786, inlinedAt: !781)
!786 = distinct !DILexicalBlock(scope: !764, file: !69, line: 862, column: 7)
!787 = !DILocation(line: 862, column: 19, scope: !786, inlinedAt: !781)
!788 = !DILocation(line: 862, column: 22, scope: !786, inlinedAt: !781)
!789 = !DILocation(line: 862, column: 7, scope: !764, inlinedAt: !781)
!790 = !DILocation(line: 868, column: 7, scope: !791, inlinedAt: !781)
!791 = distinct !DILexicalBlock(scope: !786, file: !69, line: 863, column: 5)
!792 = !DILocation(line: 870, column: 5, scope: !791, inlinedAt: !781)
!793 = !DILocation(line: 875, column: 3, scope: !764, inlinedAt: !781)
!794 = !DILocation(line: 877, column: 3, scope: !764, inlinedAt: !781)
!795 = !DILocation(line: 52, column: 3, scope: !743)
!796 = !DISubprogram(name: "dcgettext", scope: !797, file: !797, line: 51, type: !798, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!798 = !DISubroutineType(types: !799)
!799 = !{!255, !72, !72, !108}
!800 = !DISubprogram(name: "__fprintf_chk", scope: !801, file: !801, line: 93, type: !802, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!802 = !DISubroutineType(types: !803)
!803 = !{!108, !804, !108, !805, null}
!804 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !247)
!805 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!806 = !DISubprogram(name: "__printf_chk", scope: !801, file: !801, line: 95, type: !807, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DISubroutineType(types: !808)
!808 = !{!108, !108, !805, null}
!809 = !DISubprogram(name: "fputs_unlocked", scope: !810, file: !810, line: 691, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!811 = !DISubroutineType(types: !812)
!812 = !{!108, !805, !804}
!813 = !DILocation(line: 0, scope: !68)
!814 = !DILocation(line: 581, column: 7, scope: !232)
!815 = !{!816, !816, i64 0}
!816 = !{!"int", !756, i64 0}
!817 = !DILocation(line: 581, column: 19, scope: !232)
!818 = !DILocation(line: 581, column: 7, scope: !68)
!819 = !DILocation(line: 585, column: 26, scope: !231)
!820 = !DILocation(line: 0, scope: !231)
!821 = !DILocation(line: 586, column: 23, scope: !231)
!822 = !DILocation(line: 586, column: 28, scope: !231)
!823 = !DILocation(line: 586, column: 32, scope: !231)
!824 = !{!756, !756, i64 0}
!825 = !DILocation(line: 586, column: 38, scope: !231)
!826 = !DILocalVariable(name: "__s1", arg: 1, scope: !827, file: !828, line: 1359, type: !72)
!827 = distinct !DISubprogram(name: "streq", scope: !828, file: !828, line: 1359, type: !829, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !831)
!828 = !DIFile(filename: "./lib/string.h", directory: "/src")
!829 = !DISubroutineType(types: !830)
!830 = !{!234, !72, !72}
!831 = !{!826, !832}
!832 = !DILocalVariable(name: "__s2", arg: 2, scope: !827, file: !828, line: 1359, type: !72)
!833 = !DILocation(line: 0, scope: !827, inlinedAt: !834)
!834 = distinct !DILocation(line: 586, column: 41, scope: !231)
!835 = !DILocation(line: 1361, column: 11, scope: !827, inlinedAt: !834)
!836 = !DILocation(line: 1361, column: 10, scope: !827, inlinedAt: !834)
!837 = !DILocation(line: 586, column: 19, scope: !231)
!838 = !DILocation(line: 587, column: 5, scope: !231)
!839 = !DILocation(line: 588, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!841 = !DILocation(line: 588, column: 7, scope: !68)
!842 = !DILocation(line: 590, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !840, file: !69, line: 589, column: 5)
!844 = !DILocation(line: 591, column: 7, scope: !843)
!845 = !DILocation(line: 595, column: 37, scope: !68)
!846 = !DILocation(line: 595, column: 35, scope: !68)
!847 = !DILocation(line: 596, column: 29, scope: !68)
!848 = !DILocation(line: 597, column: 8, scope: !240)
!849 = !DILocation(line: 597, column: 7, scope: !68)
!850 = !DILocation(line: 604, column: 24, scope: !239)
!851 = !DILocation(line: 604, column: 12, scope: !240)
!852 = !DILocation(line: 0, scope: !238)
!853 = !DILocation(line: 610, column: 16, scope: !238)
!854 = !DILocation(line: 610, column: 7, scope: !238)
!855 = !DILocation(line: 611, column: 21, scope: !238)
!856 = !{!857, !857, i64 0}
!857 = !{!"short", !756, i64 0}
!858 = !DILocation(line: 611, column: 19, scope: !238)
!859 = !DILocation(line: 611, column: 16, scope: !238)
!860 = !DILocation(line: 610, column: 30, scope: !238)
!861 = distinct !{!861, !854, !855, !862}
!862 = !{!"llvm.loop.mustprogress"}
!863 = !DILocation(line: 612, column: 18, scope: !864)
!864 = distinct !DILexicalBlock(scope: !238, file: !69, line: 612, column: 11)
!865 = !DILocation(line: 612, column: 11, scope: !238)
!866 = !DILocation(line: 620, column: 23, scope: !68)
!867 = !DILocation(line: 625, column: 39, scope: !68)
!868 = !DILocation(line: 626, column: 3, scope: !68)
!869 = !DILocation(line: 626, column: 10, scope: !68)
!870 = !DILocation(line: 626, column: 21, scope: !68)
!871 = !DILocation(line: 628, column: 44, scope: !872)
!872 = distinct !DILexicalBlock(scope: !873, file: !69, line: 628, column: 11)
!873 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!874 = !DILocation(line: 628, column: 32, scope: !872)
!875 = !DILocation(line: 628, column: 49, scope: !872)
!876 = !DILocation(line: 628, column: 11, scope: !873)
!877 = !DILocation(line: 630, column: 11, scope: !878)
!878 = distinct !DILexicalBlock(scope: !873, file: !69, line: 630, column: 11)
!879 = !DILocation(line: 630, column: 11, scope: !873)
!880 = !DILocation(line: 632, column: 26, scope: !881)
!881 = distinct !DILexicalBlock(scope: !882, file: !69, line: 632, column: 15)
!882 = distinct !DILexicalBlock(scope: !878, file: !69, line: 631, column: 9)
!883 = !DILocation(line: 632, column: 34, scope: !881)
!884 = !DILocation(line: 632, column: 37, scope: !881)
!885 = !DILocation(line: 632, column: 15, scope: !882)
!886 = !DILocation(line: 636, column: 16, scope: !887)
!887 = distinct !DILexicalBlock(scope: !882, file: !69, line: 636, column: 15)
!888 = !DILocation(line: 636, column: 29, scope: !887)
!889 = !DILocation(line: 640, column: 16, scope: !873)
!890 = distinct !{!890, !868, !891, !862}
!891 = !DILocation(line: 641, column: 5, scope: !68)
!892 = !DILocation(line: 644, column: 3, scope: !68)
!893 = !DILocation(line: 0, scope: !827, inlinedAt: !894)
!894 = distinct !DILocation(line: 648, column: 31, scope: !68)
!895 = !DILocation(line: 0, scope: !827, inlinedAt: !896)
!896 = distinct !DILocation(line: 649, column: 31, scope: !68)
!897 = !DILocation(line: 0, scope: !827, inlinedAt: !898)
!898 = distinct !DILocation(line: 650, column: 31, scope: !68)
!899 = !DILocation(line: 0, scope: !827, inlinedAt: !900)
!900 = distinct !DILocation(line: 651, column: 31, scope: !68)
!901 = !DILocation(line: 0, scope: !827, inlinedAt: !902)
!902 = distinct !DILocation(line: 652, column: 31, scope: !68)
!903 = !DILocation(line: 0, scope: !827, inlinedAt: !904)
!904 = distinct !DILocation(line: 653, column: 31, scope: !68)
!905 = !DILocation(line: 0, scope: !827, inlinedAt: !906)
!906 = distinct !DILocation(line: 654, column: 31, scope: !68)
!907 = !DILocation(line: 0, scope: !827, inlinedAt: !908)
!908 = distinct !DILocation(line: 655, column: 31, scope: !68)
!909 = !DILocation(line: 0, scope: !827, inlinedAt: !910)
!910 = distinct !DILocation(line: 656, column: 31, scope: !68)
!911 = !DILocation(line: 0, scope: !827, inlinedAt: !912)
!912 = distinct !DILocation(line: 657, column: 31, scope: !68)
!913 = !DILocation(line: 663, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!915 = !DILocation(line: 664, column: 7, scope: !914)
!916 = !DILocation(line: 664, column: 10, scope: !914)
!917 = !DILocation(line: 663, column: 7, scope: !68)
!918 = !DILocation(line: 669, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !69, line: 665, column: 5)
!920 = !DILocation(line: 671, column: 5, scope: !919)
!921 = !DILocation(line: 676, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !914, file: !69, line: 673, column: 5)
!923 = !DILocation(line: 679, column: 3, scope: !68)
!924 = !DILocation(line: 683, column: 3, scope: !68)
!925 = !DILocation(line: 686, column: 3, scope: !68)
!926 = !DILocation(line: 688, column: 3, scope: !68)
!927 = !DILocation(line: 691, column: 3, scope: !68)
!928 = !DILocation(line: 695, column: 3, scope: !68)
!929 = !DILocation(line: 696, column: 1, scope: !68)
!930 = !DISubprogram(name: "setlocale", scope: !931, file: !931, line: 122, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!931 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!932 = !DISubroutineType(types: !933)
!933 = !{!255, !108, !72}
!934 = !DISubprogram(name: "strncmp", scope: !935, file: !935, line: 159, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!935 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!936 = !DISubroutineType(types: !937)
!937 = !{!108, !72, !72, !110}
!938 = !DISubprogram(name: "exit", scope: !939, file: !939, line: 624, type: !744, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!939 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!940 = !DISubprogram(name: "getenv", scope: !939, file: !939, line: 641, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!941 = !DISubroutineType(types: !942)
!942 = !{!255, !72}
!943 = !DISubprogram(name: "strcmp", scope: !935, file: !935, line: 156, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!944 = !DISubroutineType(types: !945)
!945 = !{!108, !72, !72}
!946 = !DISubprogram(name: "strspn", scope: !935, file: !935, line: 297, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!947 = !DISubroutineType(types: !948)
!948 = !{!112, !72, !72}
!949 = !DISubprogram(name: "strchr", scope: !935, file: !935, line: 246, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!950 = !DISubroutineType(types: !951)
!951 = !{!255, !72, !108}
!952 = !DISubprogram(name: "__ctype_b_loc", scope: !92, file: !92, line: 79, type: !953, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!953 = !DISubroutineType(types: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!958 = !DISubprogram(name: "strcspn", scope: !935, file: !935, line: 293, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!959 = !DISubprogram(name: "fwrite_unlocked", scope: !810, file: !810, line: 704, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!960 = !DISubroutineType(types: !961)
!961 = !{!110, !962, !110, !110, !804}
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!965 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 56, type: !966, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !969)
!966 = !DISubroutineType(types: !967)
!967 = !{!108, !108, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!969 = !{!970, !971}
!970 = !DILocalVariable(name: "argc", arg: 1, scope: !965, file: !2, line: 56, type: !108)
!971 = !DILocalVariable(name: "argv", arg: 2, scope: !965, file: !2, line: 56, type: !968)
!972 = !DILocation(line: 0, scope: !965)
!973 = !DILocation(line: 59, column: 21, scope: !965)
!974 = !DILocation(line: 59, column: 3, scope: !965)
!975 = !DILocation(line: 60, column: 3, scope: !965)
!976 = !DILocation(line: 61, column: 3, scope: !965)
!977 = !DILocation(line: 62, column: 3, scope: !965)
!978 = !DILocation(line: 64, column: 3, scope: !965)
!979 = !DILocation(line: 67, column: 36, scope: !965)
!980 = !DILocation(line: 67, column: 58, scope: !965)
!981 = !DILocation(line: 66, column: 3, scope: !965)
!982 = !DILocation(line: 70, column: 14, scope: !983)
!983 = distinct !DILexicalBlock(scope: !965, file: !2, line: 70, column: 7)
!984 = !DILocation(line: 70, column: 12, scope: !983)
!985 = !DILocation(line: 70, column: 7, scope: !965)
!986 = !DILocation(line: 72, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !983, file: !2, line: 71, column: 5)
!988 = !DILocation(line: 73, column: 7, scope: !987)
!989 = !DILocation(line: 70, column: 21, scope: !983)
!990 = !DILocation(line: 76, column: 18, scope: !991)
!991 = distinct !DILexicalBlock(scope: !965, file: !2, line: 76, column: 7)
!992 = !DILocation(line: 76, column: 7, scope: !965)
!993 = !DILocation(line: 78, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !2, line: 77, column: 5)
!995 = !DILocation(line: 79, column: 7, scope: !994)
!996 = !DILocation(line: 82, column: 15, scope: !997)
!997 = distinct !DILexicalBlock(scope: !965, file: !2, line: 82, column: 7)
!998 = !DILocation(line: 82, column: 7, scope: !997)
!999 = !DILocation(line: 82, column: 29, scope: !997)
!1000 = !DILocation(line: 82, column: 7, scope: !965)
!1001 = !DILocation(line: 83, column: 5, scope: !997)
!1002 = !DILocation(line: 85, column: 3, scope: !965)
!1003 = !DISubprogram(name: "bindtextdomain", scope: !797, file: !797, line: 86, type: !1004, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!255, !72, !72}
!1006 = !DISubprogram(name: "textdomain", scope: !797, file: !797, line: 82, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1007 = !DISubprogram(name: "atexit", scope: !939, file: !939, line: 602, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!108, !376}
!1010 = !DISubprogram(name: "unlink", scope: !1011, file: !1011, line: 858, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1011 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!108, !72}
!1014 = !DISubprogram(name: "__errno_location", scope: !1015, file: !1015, line: 37, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1015 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!401}
!1018 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !316, file: !316, line: 50, type: !765, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1019)
!1019 = !{!1020}
!1020 = !DILocalVariable(name: "file", arg: 1, scope: !1018, file: !316, line: 50, type: !72)
!1021 = !DILocation(line: 0, scope: !1018)
!1022 = !DILocation(line: 52, column: 13, scope: !1018)
!1023 = !DILocation(line: 53, column: 1, scope: !1018)
!1024 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !316, file: !316, line: 87, type: !1025, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !234}
!1027 = !{!1028}
!1028 = !DILocalVariable(name: "ignore", arg: 1, scope: !1024, file: !316, line: 87, type: !234)
!1029 = !DILocation(line: 0, scope: !1024)
!1030 = !DILocation(line: 89, column: 16, scope: !1024)
!1031 = !{!1032, !1032, i64 0}
!1032 = !{!"_Bool", !756, i64 0}
!1033 = !DILocation(line: 90, column: 1, scope: !1024)
!1034 = distinct !DISubprogram(name: "close_stdout", scope: !316, file: !316, line: 116, type: !377, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1035)
!1035 = !{!1036}
!1036 = !DILocalVariable(name: "write_error", scope: !1037, file: !316, line: 121, type: !72)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !316, line: 120, column: 5)
!1038 = distinct !DILexicalBlock(scope: !1034, file: !316, line: 118, column: 7)
!1039 = !DILocation(line: 118, column: 21, scope: !1038)
!1040 = !DILocation(line: 118, column: 7, scope: !1038)
!1041 = !DILocation(line: 118, column: 29, scope: !1038)
!1042 = !DILocation(line: 119, column: 7, scope: !1038)
!1043 = !DILocation(line: 119, column: 12, scope: !1038)
!1044 = !{i8 0, i8 2}
!1045 = !DILocation(line: 119, column: 25, scope: !1038)
!1046 = !DILocation(line: 119, column: 28, scope: !1038)
!1047 = !DILocation(line: 119, column: 34, scope: !1038)
!1048 = !DILocation(line: 118, column: 7, scope: !1034)
!1049 = !DILocation(line: 121, column: 33, scope: !1037)
!1050 = !DILocation(line: 0, scope: !1037)
!1051 = !DILocation(line: 122, column: 11, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1037, file: !316, line: 122, column: 11)
!1053 = !DILocation(line: 0, scope: !1052)
!1054 = !DILocation(line: 122, column: 11, scope: !1037)
!1055 = !DILocation(line: 123, column: 9, scope: !1052)
!1056 = !DILocation(line: 126, column: 9, scope: !1052)
!1057 = !DILocation(line: 128, column: 14, scope: !1037)
!1058 = !DILocation(line: 128, column: 7, scope: !1037)
!1059 = !DILocation(line: 133, column: 42, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1034, file: !316, line: 133, column: 7)
!1061 = !DILocation(line: 133, column: 28, scope: !1060)
!1062 = !DILocation(line: 133, column: 50, scope: !1060)
!1063 = !DILocation(line: 133, column: 7, scope: !1034)
!1064 = !DILocation(line: 134, column: 12, scope: !1060)
!1065 = !DILocation(line: 134, column: 5, scope: !1060)
!1066 = !DILocation(line: 135, column: 1, scope: !1034)
!1067 = !DISubprogram(name: "_exit", scope: !1011, file: !1011, line: 624, type: !744, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1068 = distinct !DISubprogram(name: "verror", scope: !331, file: !331, line: 251, type: !1069, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1071)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !108, !108, !72, !341}
!1071 = !{!1072, !1073, !1074, !1075}
!1072 = !DILocalVariable(name: "status", arg: 1, scope: !1068, file: !331, line: 251, type: !108)
!1073 = !DILocalVariable(name: "errnum", arg: 2, scope: !1068, file: !331, line: 251, type: !108)
!1074 = !DILocalVariable(name: "message", arg: 3, scope: !1068, file: !331, line: 251, type: !72)
!1075 = !DILocalVariable(name: "args", arg: 4, scope: !1068, file: !331, line: 251, type: !341)
!1076 = !DILocation(line: 0, scope: !1068)
!1077 = !DILocation(line: 261, column: 3, scope: !1068)
!1078 = !DILocation(line: 265, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1068, file: !331, line: 265, column: 7)
!1080 = !DILocation(line: 265, column: 7, scope: !1068)
!1081 = !DILocation(line: 266, column: 5, scope: !1079)
!1082 = !DILocation(line: 272, column: 7, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !331, line: 268, column: 5)
!1084 = !DILocation(line: 276, column: 3, scope: !1068)
!1085 = !DILocation(line: 282, column: 1, scope: !1068)
!1086 = distinct !DISubprogram(name: "flush_stdout", scope: !331, file: !331, line: 163, type: !377, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1087)
!1087 = !{!1088}
!1088 = !DILocalVariable(name: "stdout_fd", scope: !1086, file: !331, line: 166, type: !108)
!1089 = !DILocation(line: 0, scope: !1086)
!1090 = !DILocalVariable(name: "fd", arg: 1, scope: !1091, file: !331, line: 145, type: !108)
!1091 = distinct !DISubprogram(name: "is_open", scope: !331, file: !331, line: 145, type: !1092, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1094)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!108, !108}
!1094 = !{!1090}
!1095 = !DILocation(line: 0, scope: !1091, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 182, column: 25, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1086, file: !331, line: 182, column: 7)
!1098 = !DILocation(line: 157, column: 15, scope: !1091, inlinedAt: !1096)
!1099 = !DILocation(line: 157, column: 12, scope: !1091, inlinedAt: !1096)
!1100 = !DILocation(line: 182, column: 7, scope: !1086)
!1101 = !DILocation(line: 184, column: 5, scope: !1097)
!1102 = !DILocation(line: 185, column: 1, scope: !1086)
!1103 = distinct !DISubprogram(name: "error_tail", scope: !331, file: !331, line: 219, type: !1069, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1104)
!1104 = !{!1105, !1106, !1107, !1108}
!1105 = !DILocalVariable(name: "status", arg: 1, scope: !1103, file: !331, line: 219, type: !108)
!1106 = !DILocalVariable(name: "errnum", arg: 2, scope: !1103, file: !331, line: 219, type: !108)
!1107 = !DILocalVariable(name: "message", arg: 3, scope: !1103, file: !331, line: 219, type: !72)
!1108 = !DILocalVariable(name: "args", arg: 4, scope: !1103, file: !331, line: 219, type: !341)
!1109 = distinct !DIAssignID()
!1110 = !DILocation(line: 0, scope: !1103)
!1111 = !DILocation(line: 229, column: 13, scope: !1103)
!1112 = !DILocalVariable(name: "__stream", arg: 1, scope: !1113, file: !801, line: 132, type: !1116)
!1113 = distinct !DISubprogram(name: "vfprintf", scope: !801, file: !801, line: 132, type: !1114, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1151)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!108, !1116, !805, !341}
!1116 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1119, file: !251, line: 51, baseType: !108, size: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1119, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1119, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1119, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1119, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1119, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1119, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1119, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1119, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1119, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1119, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1119, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1119, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1119, file: !251, line: 70, baseType: !1135, size: 64, offset: 832)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1119, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1119, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1119, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1119, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1119, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1119, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1119, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1119, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1119, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1119, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1119, file: !251, line: 93, baseType: !1135, size: 64, offset: 1344)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1119, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1119, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1119, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1119, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!1151 = !{!1112, !1152, !1153}
!1152 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1113, file: !801, line: 133, type: !805)
!1153 = !DILocalVariable(name: "__ap", arg: 3, scope: !1113, file: !801, line: 133, type: !341)
!1154 = !DILocation(line: 0, scope: !1113, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 229, column: 3, scope: !1103)
!1156 = !DILocation(line: 135, column: 10, scope: !1113, inlinedAt: !1155)
!1157 = !DILocation(line: 232, column: 3, scope: !1103)
!1158 = !DILocation(line: 233, column: 7, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1103, file: !331, line: 233, column: 7)
!1160 = !DILocation(line: 233, column: 7, scope: !1103)
!1161 = !DILocalVariable(name: "errbuf", scope: !1162, file: !331, line: 193, type: !1166)
!1162 = distinct !DISubprogram(name: "print_errno_message", scope: !331, file: !331, line: 188, type: !744, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1163)
!1163 = !{!1164, !1165, !1161}
