; ModuleID = 'src/users.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !71, line: 676, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 61)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !71, line: 679, type: !151, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !71, line: 683, type: !128, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !71, line: 688, type: !128, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !71, line: 691, type: !167, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !71, line: 839, type: !63, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !71, line: 840, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 22)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !71, line: 841, type: !191, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !71, line: 862, type: !135, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !71, line: 868, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 71)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !71, line: 875, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 27)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 51)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 12)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !151, isLocal: true, isDefinition: true)
!240 = !{!241, !242, !243, !246, !248, !249, !250, !254, !255, !256, !257, !259, !312, !313, !314, !316, !317}
!241 = !DILocalVariable(name: "program", arg: 1, scope: !70, file: !71, line: 573, type: !74)
!242 = !DILocalVariable(name: "option", arg: 2, scope: !70, file: !71, line: 573, type: !74)
!243 = !DILocalVariable(name: "term", scope: !244, file: !71, line: 585, type: !74)
!244 = distinct !DILexicalBlock(scope: !245, file: !71, line: 582, column: 5)
!245 = distinct !DILexicalBlock(scope: !70, file: !71, line: 581, column: 7)
!246 = !DILocalVariable(name: "double_space", scope: !70, file: !71, line: 594, type: !247)
!247 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!248 = !DILocalVariable(name: "first_word", scope: !70, file: !71, line: 595, type: !74)
!249 = !DILocalVariable(name: "option_text", scope: !70, file: !71, line: 596, type: !74)
!250 = !DILocalVariable(name: "s", scope: !251, file: !71, line: 608, type: !74)
!251 = distinct !DILexicalBlock(scope: !252, file: !71, line: 605, column: 5)
!252 = distinct !DILexicalBlock(scope: !253, file: !71, line: 604, column: 12)
!253 = distinct !DILexicalBlock(scope: !70, file: !71, line: 597, column: 7)
!254 = !DILocalVariable(name: "spaces", scope: !251, file: !71, line: 609, type: !119)
!255 = !DILocalVariable(name: "anchor_len", scope: !70, file: !71, line: 620, type: !119)
!256 = !DILocalVariable(name: "desc_text", scope: !70, file: !71, line: 625, type: !74)
!257 = !DILocalVariable(name: "__ptr", scope: !258, file: !71, line: 644, type: !74)
!258 = distinct !DILexicalBlock(scope: !70, file: !71, line: 644, column: 3)
!259 = !DILocalVariable(name: "__stream", scope: !258, file: !71, line: 644, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !262, line: 7, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !264, line: 49, size: 1728, elements: !265)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !281, !283, !284, !285, !289, !290, !292, !293, !296, !298, !301, !304, !305, !306, !307, !308}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !264, line: 51, baseType: !117, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !264, line: 54, baseType: !124, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !264, line: 55, baseType: !124, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !264, line: 56, baseType: !124, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !264, line: 57, baseType: !124, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !264, line: 58, baseType: !124, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !264, line: 59, baseType: !124, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !264, line: 60, baseType: !124, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !264, line: 61, baseType: !124, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !264, line: 64, baseType: !124, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !264, line: 65, baseType: !124, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !264, line: 66, baseType: !124, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !264, line: 68, baseType: !279, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !264, line: 36, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !264, line: 70, baseType: !282, size: 64, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !264, line: 72, baseType: !117, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !264, line: 73, baseType: !117, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !264, line: 74, baseType: !286, size: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !287, line: 152, baseType: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!288 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !264, line: 77, baseType: !118, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !264, line: 78, baseType: !291, size: 8, offset: 1040)
!291 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !264, line: 79, baseType: !41, size: 8, offset: 1048)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !264, line: 81, baseType: !294, size: 64, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !264, line: 43, baseType: null)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !264, line: 89, baseType: !297, size: 64, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !287, line: 153, baseType: !288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !264, line: 91, baseType: !299, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !264, line: 37, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !264, line: 92, baseType: !302, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !264, line: 38, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !264, line: 93, baseType: !282, size: 64, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !264, line: 94, baseType: !116, size: 64, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !264, line: 95, baseType: !119, size: 64, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !264, line: 96, baseType: !117, size: 32, offset: 1536)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !264, line: 98, baseType: !309, size: 160, offset: 1568)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 20)
!312 = !DILocalVariable(name: "__cnt", scope: !258, file: !71, line: 644, type: !119)
!313 = !DILocalVariable(name: "url_program", scope: !70, file: !71, line: 648, type: !74)
!314 = !DILocalVariable(name: "__ptr", scope: !315, file: !71, line: 686, type: !74)
!315 = distinct !DILexicalBlock(scope: !70, file: !71, line: 686, column: 3)
!316 = !DILocalVariable(name: "__stream", scope: !315, file: !71, line: 686, type: !260)
!317 = !DILocalVariable(name: "__cnt", scope: !315, file: !71, line: 686, type: !119)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !320, line: 3, type: !191, isLocal: true, isDefinition: true)
!320 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "Version", scope: !323, file: !320, line: 3, type: !74, isLocal: false, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C11, file: !320, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!324 = !{!318, !321}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "file_name", scope: !327, file: !328, line: 45, type: !74, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C11, file: !328, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!329 = !{!330, !332, !334, !336, !325, !338}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !162, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !235, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !328, line: 123, type: !162, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !328, line: 126, type: !151, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !327, file: !328, line: 55, type: !247, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !342, file: !343, line: 66, type: !388, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C11, file: !343, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, globals: !345, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!344 = !{!116, !122}
!345 = !{!346, !348, !367, !369, !371, !373, !340, !375, !377, !379, !381, !386}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !343, line: 272, type: !128, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "old_file_name", scope: !350, file: !343, line: 304, type: !74, isLocal: true, isDefinition: true)
!350 = distinct !DISubprogram(name: "verror_at_line", scope: !343, file: !343, line: 298, type: !351, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !360)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !117, !117, !74, !80, !74, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !354, file: !343, baseType: !80, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !354, file: !343, baseType: !80, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !354, file: !343, baseType: !116, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !354, file: !343, baseType: !116, size: 64, offset: 128)
!360 = !{!361, !362, !363, !364, !365, !366}
!361 = !DILocalVariable(name: "status", arg: 1, scope: !350, file: !343, line: 298, type: !117)
!362 = !DILocalVariable(name: "errnum", arg: 2, scope: !350, file: !343, line: 298, type: !117)
!363 = !DILocalVariable(name: "file_name", arg: 3, scope: !350, file: !343, line: 298, type: !74)
!364 = !DILocalVariable(name: "line_number", arg: 4, scope: !350, file: !343, line: 298, type: !80)
!365 = !DILocalVariable(name: "message", arg: 5, scope: !350, file: !343, line: 298, type: !74)
!366 = !DILocalVariable(name: "args", arg: 6, scope: !350, file: !343, line: 298, type: !353)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "old_line_number", scope: !350, file: !343, line: 305, type: !80, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !343, line: 338, type: !135, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !167, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !142, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "error_message_count", scope: !342, file: !343, line: 69, type: !80, isLocal: false, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !342, file: !343, line: 295, type: !117, isLocal: false, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !162, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 21)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !343, line: 214, type: !128, isLocal: true, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !393, line: 60, type: !142, isLocal: true, isDefinition: true)
!393 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "long_options", scope: !396, file: !393, line: 34, type: !405, isLocal: true, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C11, file: !393, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !397, globals: !398, splitDebugInlining: false, nameTableKind: None)
!397 = !{!116}
!398 = !{!391, !399, !401, !403, !394}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !393, line: 112, type: !41, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !393, line: 36, type: !128, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !393, line: 37, type: !167, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 768, elements: !152)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !408, line: 50, size: 256, elements: !409)
!408 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!409 = !{!410, !411, !412, !414}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !407, file: !408, line: 52, baseType: !74, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !407, file: !408, line: 55, baseType: !117, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !407, file: !408, line: 56, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !407, file: !408, line: 57, baseType: !117, size: 32, offset: 192)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "program_name", scope: !417, file: !418, line: 31, type: !74, isLocal: false, isDefinition: true)
!417 = distinct !DICompileUnit(language: DW_LANG_C11, file: !418, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !419, globals: !420, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!419 = !{!116, !124}
!420 = !{!415, !421, !423}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !418, line: 46, type: !167, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !418, line: 49, type: !135, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "utf07FF", scope: !427, file: !428, line: 46, type: !455, isLocal: true, isDefinition: true)
!427 = distinct !DISubprogram(name: "proper_name_lite", scope: !428, file: !428, line: 38, type: !429, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !431, retainedNodes: !433)
!428 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!429 = !DISubroutineType(types: !430)
!430 = !{!74, !74, !74}
!431 = distinct !DICompileUnit(language: DW_LANG_C11, file: !428, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !432, splitDebugInlining: false, nameTableKind: None)
!432 = !{!425}
!433 = !{!434, !435, !436, !437, !442}
!434 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !427, file: !428, line: 38, type: !74)
!435 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !427, file: !428, line: 38, type: !74)
!436 = !DILocalVariable(name: "translation", scope: !427, file: !428, line: 40, type: !74)
!437 = !DILocalVariable(name: "w", scope: !427, file: !428, line: 47, type: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !439, line: 37, baseType: !440)
!439 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !287, line: 57, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !287, line: 42, baseType: !80)
!442 = !DILocalVariable(name: "mbs", scope: !427, file: !428, line: 48, type: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !444, line: 6, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !446, line: 21, baseType: !447)
!446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 13, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !447, file: !446, line: 15, baseType: !117, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !447, file: !446, line: 20, baseType: !451, size: 32, offset: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !447, file: !446, line: 16, size: 32, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !451, file: !446, line: 18, baseType: !80, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !451, file: !446, line: 19, baseType: !135, size: 32)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16, elements: !143)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !458, line: 78, type: !167, isLocal: true, isDefinition: true)
!458 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !458, line: 79, type: !26, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !458, line: 80, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 13)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !458, line: 81, type: !463, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !458, line: 82, type: !309, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !458, line: 83, type: !142, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !458, line: 84, type: !167, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !458, line: 85, type: !162, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !458, line: 86, type: !162, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !458, line: 87, type: !167, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !482, file: !458, line: 76, type: !556, isLocal: false, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C11, file: !458, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !491, globals: !492, splitDebugInlining: false, nameTableKind: None)
!483 = !{!484, !486, !86}
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !485, line: 42, baseType: !80, size: 32, elements: !103)
!485 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !485, line: 254, baseType: !80, size: 32, elements: !487)
!487 = !{!488, !489, !490}
!488 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!489 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!490 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!491 = !{!116, !117, !118, !119}
!492 = !{!456, !459, !461, !466, !468, !470, !472, !474, !476, !478, !480, !493, !497, !507, !509, !514, !516, !518, !520, !522, !545, !552, !554}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !482, file: !458, line: 92, type: !495, isLocal: false, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 320, elements: !47)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !482, file: !458, line: 1040, type: !499, isLocal: false, isDefinition: true)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !458, line: 56, size: 448, elements: !500)
!500 = !{!501, !502, !503, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !499, file: !458, line: 59, baseType: !484, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !499, file: !458, line: 62, baseType: !117, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !499, file: !458, line: 66, baseType: !504, size: 256, offset: 64)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 256, elements: !168)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !499, file: !458, line: 69, baseType: !74, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !499, file: !458, line: 72, baseType: !74, size: 64, offset: 384)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !482, file: !458, line: 107, type: !499, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "slot0", scope: !482, file: !458, line: 831, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 256)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !458, line: 321, type: !142, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !458, line: 357, type: !142, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !458, line: 358, type: !142, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !458, line: 199, type: !162, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "quote", scope: !524, file: !458, line: 228, type: !543, isLocal: true, isDefinition: true)
!524 = distinct !DISubprogram(name: "gettext_quote", scope: !458, file: !458, line: 197, type: !525, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !482, retainedNodes: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{!74, !74, !484}
!527 = !{!528, !529, !530, !531, !532}
!528 = !DILocalVariable(name: "msgid", arg: 1, scope: !524, file: !458, line: 197, type: !74)
!529 = !DILocalVariable(name: "s", arg: 2, scope: !524, file: !458, line: 197, type: !484)
!530 = !DILocalVariable(name: "translation", scope: !524, file: !458, line: 199, type: !74)
!531 = !DILocalVariable(name: "w", scope: !524, file: !458, line: 229, type: !438)
!532 = !DILocalVariable(name: "mbs", scope: !524, file: !458, line: 230, type: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !444, line: 6, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !446, line: 21, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 13, size: 64, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !535, file: !446, line: 15, baseType: !117, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !535, file: !446, line: 20, baseType: !539, size: 32, offset: 32)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !535, file: !446, line: 16, size: 32, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !539, file: !446, line: 18, baseType: !80, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !539, file: !446, line: 19, baseType: !135, size: 32)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !544)
!544 = !{!144, !137}
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "slotvec", scope: !482, file: !458, line: 834, type: !547, isLocal: true, isDefinition: true)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !458, line: 823, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !548, file: !458, line: 825, baseType: !119, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !548, file: !458, line: 826, baseType: !124, size: 64, offset: 64)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "nslots", scope: !482, file: !458, line: 832, type: !117, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "slotvec0", scope: !482, file: !458, line: 833, type: !548, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 704, elements: !558)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!558 = !{!559}
!559 = !DISubrange(count: 11)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !562, line: 347, type: !19, isLocal: true, isDefinition: true)
!562 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !562, line: 398, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 9)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !562, line: 399, type: !142, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !562, line: 446, type: !162, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !562, line: 447, type: !41, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !576, line: 98, type: !577, isLocal: true, isDefinition: true)
!576 = !DIFile(filename: "lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 29)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !576, line: 99, type: !577, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !576, line: 100, type: !383, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !576, line: 40, type: !463, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !576, line: 40, type: !151, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !590, line: 67, type: !235, isLocal: true, isDefinition: true)
!590 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !590, line: 69, type: !162, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !590, line: 83, type: !162, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !590, line: 83, type: !135, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !590, line: 85, type: !142, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !590, line: 88, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 171)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !590, line: 88, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 34)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !590, line: 105, type: !63, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !590, line: 109, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 23)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !590, line: 113, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 28)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !590, line: 120, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 32)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !590, line: 127, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 36)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !590, line: 134, type: !186, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !590, line: 142, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 44)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !590, line: 150, type: !640, isLocal: true, isDefinition: true)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 48)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !590, line: 159, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 52)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !590, line: 170, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 60)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !590, line: 248, type: !309, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !590, line: 248, type: !211, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !590, line: 254, type: !309, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !590, line: 254, type: !19, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !590, line: 254, type: !186, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !590, line: 259, type: !3, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !590, line: 259, type: !577, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !669, file: !670, line: 26, type: !672, isLocal: false, isDefinition: true)
!669 = distinct !DICompileUnit(language: DW_LANG_C11, file: !670, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !671, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!671 = !{!667}
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 47)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "exit_failure", scope: !677, file: !678, line: 24, type: !680, isLocal: false, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C11, file: !678, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !679, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!679 = !{!675}
!680 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !683, line: 34, type: !151, isLocal: true, isDefinition: true)
!683 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !683, line: 34, type: !162, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !683, line: 34, type: !58, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !690, line: 108, type: !41, isLocal: true, isDefinition: true)
!690 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "internal_state", scope: !693, file: !690, line: 97, type: !696, isLocal: true, isDefinition: true)
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !694, globals: !695, splitDebugInlining: false, nameTableKind: None)
!694 = !{!116, !119, !122}
!695 = !{!688, !691}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !444, line: 6, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !446, line: 21, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 13, size: 64, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !698, file: !446, line: 15, baseType: !117, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !698, file: !446, line: 20, baseType: !702, size: 32, offset: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !698, file: !446, line: 16, size: 32, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !702, file: !446, line: 18, baseType: !80, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !702, file: !446, line: 19, baseType: !135, size: 32)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !708, line: 35, type: !26, isLocal: true, isDefinition: true)
!708 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!709 = distinct !DICompileUnit(language: DW_LANG_C11, file: !710, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!710 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!711 = distinct !DICompileUnit(language: DW_LANG_C11, file: !562, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-readutmp.o -MD -MP -MF lib/.deps/libcoreutils_a-readutmp.Tpo -c lib/readutmp.c -o lib/.libcoreutils_a-readutmp.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !712, retainedTypes: !715, globals: !746, splitDebugInlining: false, nameTableKind: None)
!712 = !{!713}
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 305, baseType: !80, size: 32, elements: !81)
!714 = !DIFile(filename: "lib/readutmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "dbf57f6f8baa17fafca98ee518780aad")
!715 = !{!116, !124, !716, !744, !119}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !719, line: 55, size: 3072, elements: !720)
!719 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!720 = !{!721, !723, !725, !726, !727, !728, !729, !734, !736, !741, !743}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !718, file: !719, line: 57, baseType: !722, size: 16)
!722 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !718, file: !719, line: 58, baseType: !724, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !287, line: 154, baseType: !117)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !718, file: !719, line: 59, baseType: !623, size: 256, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !718, file: !719, line: 61, baseType: !135, size: 32, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !718, file: !719, line: 63, baseType: !623, size: 256, offset: 352)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !718, file: !719, line: 65, baseType: !511, size: 2048, offset: 608)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !718, file: !719, line: 67, baseType: !730, size: 32, offset: 2656)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !719, line: 42, size: 32, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !730, file: !719, line: 45, baseType: !722, size: 16)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !730, file: !719, line: 46, baseType: !722, size: 16, offset: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !718, file: !719, line: 74, baseType: !735, size: 32, offset: 2688)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !287, line: 41, baseType: !117)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !718, file: !719, line: 79, baseType: !737, size: 64, offset: 2720)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !719, line: 75, size: 64, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !737, file: !719, line: 77, baseType: !735, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !737, file: !719, line: 78, baseType: !735, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !718, file: !719, line: 84, baseType: !742, size: 128, offset: 2784)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 128, elements: !136)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !718, file: !719, line: 85, baseType: !309, size: 160, offset: 2912)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !745, line: 87, baseType: !288)
!745 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!746 = !{!560, !563, !568, !570, !572, !574, !580, !582, !584, !586}
!747 = distinct !DICompileUnit(language: DW_LANG_C11, file: !590, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !748, retainedTypes: !397, globals: !752, splitDebugInlining: false, nameTableKind: None)
!748 = !{!749}
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !590, line: 40, baseType: !80, size: 32, elements: !750)
!750 = !{!751}
!751 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!752 = !{!588, !591, !593, !595, !597, !599, !604, !609, !611, !616, !621, !626, !631, !633, !638, !643, !648, !653, !655, !657, !659, !661, !663, !665}
!753 = distinct !DICompileUnit(language: DW_LANG_C11, file: !754, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !755, retainedTypes: !787, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!755 = !{!756, !768}
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !757, file: !754, line: 188, baseType: !80, size: 32, elements: !766)
!757 = distinct !DISubprogram(name: "x2nrealloc", scope: !754, file: !754, line: 176, type: !758, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !753, retainedNodes: !761)
!758 = !DISubroutineType(types: !759)
!759 = !{!116, !116, !760, !119}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!761 = !{!762, !763, !764, !765}
!762 = !DILocalVariable(name: "p", arg: 1, scope: !757, file: !754, line: 176, type: !116)
!763 = !DILocalVariable(name: "pn", arg: 2, scope: !757, file: !754, line: 176, type: !760)
!764 = !DILocalVariable(name: "s", arg: 3, scope: !757, file: !754, line: 176, type: !119)
!765 = !DILocalVariable(name: "n", scope: !757, file: !754, line: 178, type: !119)
!766 = !{!767}
!767 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!768 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !769, file: !754, line: 228, baseType: !80, size: 32, elements: !766)
!769 = distinct !DISubprogram(name: "xpalloc", scope: !754, file: !754, line: 223, type: !770, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !753, retainedNodes: !777)
!770 = !DISubroutineType(types: !771)
!771 = !{!116, !116, !772, !773, !775, !773}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !774, line: 130, baseType: !775)
!774 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !776, line: 18, baseType: !288)
!776 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786}
!778 = !DILocalVariable(name: "pa", arg: 1, scope: !769, file: !754, line: 223, type: !116)
!779 = !DILocalVariable(name: "pn", arg: 2, scope: !769, file: !754, line: 223, type: !772)
!780 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !769, file: !754, line: 223, type: !773)
!781 = !DILocalVariable(name: "n_max", arg: 4, scope: !769, file: !754, line: 223, type: !775)
!782 = !DILocalVariable(name: "s", arg: 5, scope: !769, file: !754, line: 223, type: !773)
!783 = !DILocalVariable(name: "n0", scope: !769, file: !754, line: 230, type: !773)
!784 = !DILocalVariable(name: "n", scope: !769, file: !754, line: 237, type: !773)
!785 = !DILocalVariable(name: "nbytes", scope: !769, file: !754, line: 248, type: !773)
!786 = !DILocalVariable(name: "adjusted_nbytes", scope: !769, file: !754, line: 252, type: !773)
!787 = !{!124, !116}
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !683, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !789, splitDebugInlining: false, nameTableKind: None)
!789 = !{!681, !684, !686}
!790 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fopen.o -MD -MP -MF lib/.deps/libcoreutils_a-fopen.Tpo -c lib/fopen.c -o lib/.libcoreutils_a-fopen.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !397, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!792 = distinct !DICompileUnit(language: DW_LANG_C11, file: !793, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!793 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !795, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!795 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !397, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !397, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!800 = distinct !DICompileUnit(language: DW_LANG_C11, file: !801, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !397, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!802 = distinct !DICompileUnit(language: DW_LANG_C11, file: !708, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !803, splitDebugInlining: false, nameTableKind: None)
!803 = !{!804, !706}
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !708, line: 35, type: !142, isLocal: true, isDefinition: true)
!806 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!808 = distinct !DICompileUnit(language: DW_LANG_C11, file: !809, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !397, splitDebugInlining: false, nameTableKind: None)
!809 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!810 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!811 = !{i32 7, !"Dwarf Version", i32 5}
!812 = !{i32 2, !"Debug Info Version", i32 3}
!813 = !{i32 1, !"wchar_size", i32 4}
!814 = !{i32 8, !"PIC Level", i32 2}
!815 = !{i32 7, !"PIE Level", i32 2}
!816 = !{i32 7, !"uwtable", i32 2}
!817 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!818 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 96, type: !819, scopeLine: 97, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !117}
!821 = !{!822}
!822 = !DILocalVariable(name: "status", arg: 1, scope: !818, file: !2, line: 96, type: !117)
!823 = !DILocation(line: 0, scope: !818)
!824 = !DILocation(line: 98, column: 14, scope: !825)
!825 = distinct !DILexicalBlock(scope: !818, file: !2, line: 98, column: 7)
!826 = !DILocation(line: 98, column: 7, scope: !818)
!827 = !DILocation(line: 99, column: 5, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !2, line: 99, column: 5)
!829 = !{!830, !830, i64 0}
!830 = !{!"any pointer", !831, i64 0}
!831 = !{!"omnipotent char", !832, i64 0}
!832 = !{!"Simple C/C++ TBAA"}
!833 = !DILocation(line: 102, column: 7, scope: !834)
!834 = distinct !DILexicalBlock(scope: !825, file: !2, line: 101, column: 5)
!835 = !DILocation(line: 103, column: 7, scope: !834)
!836 = !DILocation(line: 109, column: 7, scope: !834)
!837 = !DILocation(line: 110, column: 7, scope: !834)
!838 = !DILocalVariable(name: "program", arg: 1, scope: !839, file: !71, line: 836, type: !74)
!839 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !71, file: !71, line: 836, type: !840, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !74}
!842 = !{!838, !843, !850, !851, !853, !854}
!843 = !DILocalVariable(name: "infomap", scope: !839, file: !71, line: 838, type: !844)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 896, elements: !163)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !839, file: !71, line: 838, size: 128, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !846, file: !71, line: 838, baseType: !74, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !846, file: !71, line: 838, baseType: !74, size: 64, offset: 64)
!850 = !DILocalVariable(name: "node", scope: !839, file: !71, line: 848, type: !74)
!851 = !DILocalVariable(name: "map_prog", scope: !839, file: !71, line: 849, type: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!853 = !DILocalVariable(name: "lc_messages", scope: !839, file: !71, line: 861, type: !74)
!854 = !DILocalVariable(name: "url_program", scope: !839, file: !71, line: 874, type: !74)
!855 = !DILocation(line: 0, scope: !839, inlinedAt: !856)
!856 = distinct !DILocation(line: 111, column: 7, scope: !834)
!857 = !{}
!858 = !DILocation(line: 857, column: 3, scope: !839, inlinedAt: !856)
!859 = !DILocation(line: 861, column: 29, scope: !839, inlinedAt: !856)
!860 = !DILocation(line: 862, column: 7, scope: !861, inlinedAt: !856)
!861 = distinct !DILexicalBlock(scope: !839, file: !71, line: 862, column: 7)
!862 = !DILocation(line: 862, column: 19, scope: !861, inlinedAt: !856)
!863 = !DILocation(line: 862, column: 22, scope: !861, inlinedAt: !856)
!864 = !DILocation(line: 862, column: 7, scope: !839, inlinedAt: !856)
!865 = !DILocation(line: 868, column: 7, scope: !866, inlinedAt: !856)
!866 = distinct !DILexicalBlock(scope: !861, file: !71, line: 863, column: 5)
!867 = !DILocation(line: 870, column: 5, scope: !866, inlinedAt: !856)
!868 = !DILocation(line: 875, column: 3, scope: !839, inlinedAt: !856)
!869 = !DILocation(line: 877, column: 3, scope: !839, inlinedAt: !856)
!870 = !DILocation(line: 113, column: 3, scope: !818)
!871 = !DISubprogram(name: "dcgettext", scope: !872, file: !872, line: 51, type: !873, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!872 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!873 = !DISubroutineType(types: !874)
!874 = !{!124, !74, !74, !117}
!875 = !DISubprogram(name: "__fprintf_chk", scope: !876, file: !876, line: 93, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!876 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!877 = !DISubroutineType(types: !878)
!878 = !{!117, !879, !117, !880, null}
!879 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !260)
!880 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!881 = !DISubprogram(name: "__printf_chk", scope: !876, file: !876, line: 95, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!882 = !DISubroutineType(types: !883)
!883 = !{!117, !117, !880, null}
!884 = !DILocation(line: 0, scope: !70)
!885 = !DILocation(line: 581, column: 7, scope: !245)
!886 = !{!887, !887, i64 0}
!887 = !{!"int", !831, i64 0}
!888 = !DILocation(line: 581, column: 19, scope: !245)
!889 = !DILocation(line: 581, column: 7, scope: !70)
!890 = !DILocation(line: 585, column: 26, scope: !244)
!891 = !DILocation(line: 0, scope: !244)
!892 = !DILocation(line: 586, column: 23, scope: !244)
!893 = !DILocation(line: 586, column: 28, scope: !244)
!894 = !DILocation(line: 586, column: 32, scope: !244)
!895 = !{!831, !831, i64 0}
!896 = !DILocation(line: 586, column: 38, scope: !244)
!897 = !DILocalVariable(name: "__s1", arg: 1, scope: !898, file: !899, line: 1359, type: !74)
!898 = distinct !DISubprogram(name: "streq", scope: !899, file: !899, line: 1359, type: !900, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !902)
!899 = !DIFile(filename: "./lib/string.h", directory: "/src")
!900 = !DISubroutineType(types: !901)
!901 = !{!247, !74, !74}
!902 = !{!897, !903}
!903 = !DILocalVariable(name: "__s2", arg: 2, scope: !898, file: !899, line: 1359, type: !74)
!904 = !DILocation(line: 0, scope: !898, inlinedAt: !905)
!905 = distinct !DILocation(line: 586, column: 41, scope: !244)
!906 = !DILocation(line: 1361, column: 11, scope: !898, inlinedAt: !905)
!907 = !DILocation(line: 1361, column: 10, scope: !898, inlinedAt: !905)
!908 = !DILocation(line: 586, column: 19, scope: !244)
!909 = !DILocation(line: 587, column: 5, scope: !244)
!910 = !DILocation(line: 588, column: 7, scope: !911)
!911 = distinct !DILexicalBlock(scope: !70, file: !71, line: 588, column: 7)
!912 = !DILocation(line: 588, column: 7, scope: !70)
!913 = !DILocation(line: 590, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !911, file: !71, line: 589, column: 5)
!915 = !DILocation(line: 591, column: 7, scope: !914)
!916 = !DILocation(line: 595, column: 37, scope: !70)
!917 = !DILocation(line: 595, column: 35, scope: !70)
!918 = !DILocation(line: 596, column: 29, scope: !70)
!919 = !DILocation(line: 597, column: 8, scope: !253)
!920 = !DILocation(line: 597, column: 7, scope: !70)
!921 = !DILocation(line: 604, column: 24, scope: !252)
!922 = !DILocation(line: 604, column: 12, scope: !253)
!923 = !DILocation(line: 0, scope: !251)
!924 = !DILocation(line: 610, column: 16, scope: !251)
!925 = !DILocation(line: 610, column: 7, scope: !251)
!926 = !DILocation(line: 611, column: 21, scope: !251)
!927 = !{!928, !928, i64 0}
!928 = !{!"short", !831, i64 0}
!929 = !DILocation(line: 611, column: 19, scope: !251)
!930 = !DILocation(line: 611, column: 16, scope: !251)
!931 = !DILocation(line: 610, column: 30, scope: !251)
!932 = distinct !{!932, !925, !926, !933}
!933 = !{!"llvm.loop.mustprogress"}
!934 = !DILocation(line: 612, column: 18, scope: !935)
!935 = distinct !DILexicalBlock(scope: !251, file: !71, line: 612, column: 11)
!936 = !DILocation(line: 612, column: 11, scope: !251)
!937 = !DILocation(line: 620, column: 23, scope: !70)
!938 = !DILocation(line: 625, column: 39, scope: !70)
!939 = !DILocation(line: 626, column: 3, scope: !70)
!940 = !DILocation(line: 626, column: 10, scope: !70)
!941 = !DILocation(line: 626, column: 21, scope: !70)
!942 = !DILocation(line: 628, column: 44, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !71, line: 628, column: 11)
!944 = distinct !DILexicalBlock(scope: !70, file: !71, line: 627, column: 5)
!945 = !DILocation(line: 628, column: 32, scope: !943)
!946 = !DILocation(line: 628, column: 49, scope: !943)
!947 = !DILocation(line: 628, column: 11, scope: !944)
!948 = !DILocation(line: 630, column: 11, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !71, line: 630, column: 11)
!950 = !DILocation(line: 630, column: 11, scope: !944)
!951 = !DILocation(line: 632, column: 26, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !71, line: 632, column: 15)
!953 = distinct !DILexicalBlock(scope: !949, file: !71, line: 631, column: 9)
!954 = !DILocation(line: 632, column: 34, scope: !952)
!955 = !DILocation(line: 632, column: 37, scope: !952)
!956 = !DILocation(line: 632, column: 15, scope: !953)
!957 = !DILocation(line: 636, column: 16, scope: !958)
!958 = distinct !DILexicalBlock(scope: !953, file: !71, line: 636, column: 15)
!959 = !DILocation(line: 636, column: 29, scope: !958)
!960 = !DILocation(line: 640, column: 16, scope: !944)
!961 = distinct !{!961, !939, !962, !933}
!962 = !DILocation(line: 641, column: 5, scope: !70)
!963 = !DILocation(line: 644, column: 3, scope: !70)
!964 = !DILocation(line: 0, scope: !898, inlinedAt: !965)
!965 = distinct !DILocation(line: 648, column: 31, scope: !70)
!966 = !DILocation(line: 0, scope: !898, inlinedAt: !967)
!967 = distinct !DILocation(line: 649, column: 31, scope: !70)
!968 = !DILocation(line: 0, scope: !898, inlinedAt: !969)
!969 = distinct !DILocation(line: 650, column: 31, scope: !70)
!970 = !DILocation(line: 0, scope: !898, inlinedAt: !971)
!971 = distinct !DILocation(line: 651, column: 31, scope: !70)
!972 = !DILocation(line: 0, scope: !898, inlinedAt: !973)
!973 = distinct !DILocation(line: 652, column: 31, scope: !70)
!974 = !DILocation(line: 0, scope: !898, inlinedAt: !975)
!975 = distinct !DILocation(line: 653, column: 31, scope: !70)
!976 = !DILocation(line: 0, scope: !898, inlinedAt: !977)
!977 = distinct !DILocation(line: 654, column: 31, scope: !70)
!978 = !DILocation(line: 0, scope: !898, inlinedAt: !979)
!979 = distinct !DILocation(line: 655, column: 31, scope: !70)
!980 = !DILocation(line: 0, scope: !898, inlinedAt: !981)
!981 = distinct !DILocation(line: 656, column: 31, scope: !70)
!982 = !DILocation(line: 0, scope: !898, inlinedAt: !983)
!983 = distinct !DILocation(line: 657, column: 31, scope: !70)
!984 = !DILocation(line: 663, column: 7, scope: !985)
!985 = distinct !DILexicalBlock(scope: !70, file: !71, line: 663, column: 7)
!986 = !DILocation(line: 664, column: 7, scope: !985)
!987 = !DILocation(line: 664, column: 10, scope: !985)
!988 = !DILocation(line: 663, column: 7, scope: !70)
!989 = !DILocation(line: 669, column: 7, scope: !990)
!990 = distinct !DILexicalBlock(scope: !985, file: !71, line: 665, column: 5)
!991 = !DILocation(line: 671, column: 5, scope: !990)
!992 = !DILocation(line: 676, column: 7, scope: !993)
!993 = distinct !DILexicalBlock(scope: !985, file: !71, line: 673, column: 5)
!994 = !DILocation(line: 679, column: 3, scope: !70)
!995 = !DILocation(line: 683, column: 3, scope: !70)
!996 = !DILocation(line: 686, column: 3, scope: !70)
!997 = !DILocation(line: 688, column: 3, scope: !70)
!998 = !DILocation(line: 691, column: 3, scope: !70)
!999 = !DILocation(line: 695, column: 3, scope: !70)
!1000 = !DILocation(line: 696, column: 1, scope: !70)
!1001 = !DISubprogram(name: "setlocale", scope: !1002, file: !1002, line: 122, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1002 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!124, !117, !74}
!1005 = !DISubprogram(name: "strncmp", scope: !1006, file: !1006, line: 159, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1006 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!117, !74, !74, !119}
!1009 = !DISubprogram(name: "fputs_unlocked", scope: !1010, file: !1010, line: 691, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1010 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!117, !880, !879}
!1013 = !DISubprogram(name: "exit", scope: !1014, file: !1014, line: 624, type: !819, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1014 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1015 = !DISubprogram(name: "getenv", scope: !1014, file: !1014, line: 641, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!124, !74}
!1018 = !DISubprogram(name: "strcmp", scope: !1006, file: !1006, line: 156, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!117, !74, !74}
!1021 = !DISubprogram(name: "strspn", scope: !1006, file: !1006, line: 297, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!121, !74, !74}
!1024 = !DISubprogram(name: "strchr", scope: !1006, file: !1006, line: 246, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!124, !74, !117}
!1027 = !DISubprogram(name: "__ctype_b_loc", scope: !87, file: !87, line: 79, type: !1028, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!1033 = !DISubprogram(name: "strcspn", scope: !1006, file: !1006, line: 293, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1034 = !DISubprogram(name: "fwrite_unlocked", scope: !1010, file: !1010, line: 704, type: !1035, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!119, !1037, !119, !119, !879}
!1037 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1040 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 117, type: !1041, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1043)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!117, !117, !123}
!1043 = !{!1044, !1045}
!1044 = !DILocalVariable(name: "argc", arg: 1, scope: !1040, file: !2, line: 117, type: !117)
!1045 = !DILocalVariable(name: "argv", arg: 2, scope: !1040, file: !2, line: 117, type: !123)
!1046 = !DILocation(line: 0, scope: !1040)
!1047 = !DILocation(line: 120, column: 21, scope: !1040)
!1048 = !DILocation(line: 120, column: 3, scope: !1040)
!1049 = !DILocation(line: 121, column: 3, scope: !1040)
!1050 = !DILocation(line: 122, column: 3, scope: !1040)
!1051 = !DILocation(line: 123, column: 3, scope: !1040)
!1052 = !DILocation(line: 125, column: 3, scope: !1040)
!1053 = !DILocation(line: 128, column: 36, scope: !1040)
!1054 = !DILocation(line: 128, column: 58, scope: !1040)
!1055 = !DILocation(line: 127, column: 3, scope: !1040)
!1056 = !DILocation(line: 131, column: 18, scope: !1040)
!1057 = !DILocation(line: 131, column: 16, scope: !1040)
!1058 = !DILocation(line: 131, column: 3, scope: !1040)
!1059 = !DILocation(line: 134, column: 7, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 132, column: 5)
!1061 = !DILocation(line: 135, column: 7, scope: !1060)
!1062 = !DILocation(line: 138, column: 14, scope: !1060)
!1063 = !DILocation(line: 138, column: 7, scope: !1060)
!1064 = !DILocation(line: 139, column: 7, scope: !1060)
!1065 = !DILocation(line: 142, column: 7, scope: !1060)
!1066 = !DILocation(line: 143, column: 7, scope: !1060)
!1067 = !DILocation(line: 146, column: 3, scope: !1040)
!1068 = !DISubprogram(name: "bindtextdomain", scope: !872, file: !872, line: 86, type: !1069, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!124, !74, !74}
!1071 = !DISubprogram(name: "textdomain", scope: !872, file: !872, line: 82, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1072 = !DISubprogram(name: "atexit", scope: !1014, file: !1014, line: 602, type: !1073, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!117, !388}
!1075 = distinct !DISubprogram(name: "users", scope: !2, file: !2, line: 82, type: !1076, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !74, !117}
!1078 = !{!1079, !1080, !1081, !1084}
!1079 = !DILocalVariable(name: "filename", arg: 1, scope: !1075, file: !2, line: 82, type: !74)
!1080 = !DILocalVariable(name: "options", arg: 2, scope: !1075, file: !2, line: 82, type: !117)
!1081 = !DILocalVariable(name: "n_users", scope: !1075, file: !2, line: 84, type: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1083, line: 130, baseType: !775)
!1083 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1084 = !DILocalVariable(name: "utmp_buf", scope: !1075, file: !2, line: 85, type: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !79, line: 92, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !79, line: 65, size: 576, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1101, !1104, !1105, !1106}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1087, file: !79, line: 69, baseType: !124, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1087, file: !79, line: 70, baseType: !124, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1087, file: !79, line: 71, baseType: !124, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1087, file: !79, line: 72, baseType: !124, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !1087, file: !79, line: 74, baseType: !1094, size: 128, offset: 256)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1095, line: 11, size: 128, elements: !1096)
!1095 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1096 = !{!1097, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1094, file: !1095, line: 16, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !287, line: 160, baseType: !288)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1094, file: !1095, line: 21, baseType: !1100, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !287, line: 197, baseType: !288)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1087, file: !79, line: 75, baseType: !1102, size: 32, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1103, line: 97, baseType: !724)
!1103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1087, file: !79, line: 76, baseType: !1102, size: 32, offset: 416)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1087, file: !79, line: 77, baseType: !722, size: 16, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1087, file: !79, line: 79, baseType: !1107, size: 64, offset: 480)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1087, file: !79, line: 79, size: 64, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1107, file: !79, line: 79, baseType: !117, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1107, file: !79, line: 79, baseType: !117, size: 32, offset: 32)
!1111 = distinct !DIAssignID()
!1112 = !DILocation(line: 0, scope: !1075)
!1113 = distinct !DIAssignID()
!1114 = !DILocation(line: 84, column: 3, scope: !1075)
!1115 = !DILocation(line: 85, column: 3, scope: !1075)
!1116 = !DILocation(line: 86, column: 11, scope: !1075)
!1117 = !DILocation(line: 87, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1075, file: !2, line: 87, column: 7)
!1119 = !DILocation(line: 87, column: 58, scope: !1118)
!1120 = !DILocation(line: 87, column: 7, scope: !1075)
!1121 = !DILocation(line: 88, column: 5, scope: !1118)
!1122 = !DILocation(line: 90, column: 23, scope: !1075)
!1123 = !{!1124, !1124, i64 0}
!1124 = !{!"long", !831, i64 0}
!1125 = !DILocation(line: 90, column: 32, scope: !1075)
!1126 = !DILocalVariable(name: "n", arg: 1, scope: !1127, file: !2, line: 45, type: !1082)
!1127 = distinct !DISubprogram(name: "list_entries_users", scope: !2, file: !2, line: 45, type: !1128, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1132)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !1082, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1132 = !{!1126, !1133, !1134, !1135, !1136, !1140, !1142, !1145}
!1133 = !DILocalVariable(name: "this", arg: 2, scope: !1127, file: !2, line: 45, type: !1130)
!1134 = !DILocalVariable(name: "u", scope: !1127, file: !2, line: 47, type: !123)
!1135 = !DILocalVariable(name: "n_entries", scope: !1127, file: !2, line: 48, type: !1082)
!1136 = !DILocalVariable(name: "trimmed_name", scope: !1137, file: !2, line: 54, type: !124)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !2, line: 53, column: 9)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !2, line: 52, column: 11)
!1139 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 51, column: 5)
!1140 = !DILocalVariable(name: "i", scope: !1141, file: !2, line: 66, type: !1082)
!1141 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 66, column: 3)
!1142 = !DILocalVariable(name: "c", scope: !1143, file: !2, line: 68, type: !4)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !2, line: 67, column: 5)
!1144 = distinct !DILexicalBlock(scope: !1141, file: !2, line: 66, column: 3)
!1145 = !DILocalVariable(name: "i", scope: !1146, file: !2, line: 73, type: !1082)
!1146 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 73, column: 3)
