; ModuleID = 'src/wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__mbstate_t = type { i32, %union.anon.2 }
%union.anon.2 = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.Tokens = type { i64, ptr, ptr, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, ptr, ptr, ptr, ptr, %union.anon, i64, %union.anon.0, %union.anon.0, ptr, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.fstatus = type { i32, %struct.stat }
%struct.wc_lines = type { i32, i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.argv_iterator = type { ptr, i64, ptr, i64, ptr, ptr }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct._obstack_chunk = type { ptr, ptr, [0 x i8] }


!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 814, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 16)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 6)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 848, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 11)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !175, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 880, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 17)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 4)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 52)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 886, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 890, type: !217, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 27)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 906, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 31)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "stdin_only", scope: !234, file: !2, line: 921, type: !424, isLocal: true, isDefinition: true)
!234 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 792, type: !235, scopeLine: 793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !238)
!235 = !DISubroutineType(types: !236)
!236 = !{!101, !101, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!238 = !{!239, !240, !241, !242, !248, !249, !250, !292, !352, !355, !358, !360, !363, !415, !416, !417, !418, !419, !421}
!239 = !DILocalVariable(name: "argc", arg: 1, scope: !234, file: !2, line: 792, type: !101)
!240 = !DILocalVariable(name: "argv", arg: 2, scope: !234, file: !2, line: 792, type: !237)
!241 = !DILocalVariable(name: "optc", scope: !234, file: !2, line: 794, type: !101)
!242 = !DILocalVariable(name: "nfiles", scope: !234, file: !2, line: 795, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !244, line: 130, baseType: !245)
!244 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !246, line: 18, baseType: !247)
!246 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!247 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!248 = !DILocalVariable(name: "files", scope: !234, file: !2, line: 796, type: !237)
!249 = !DILocalVariable(name: "files_from", scope: !234, file: !2, line: 797, type: !164)
!250 = !DILocalVariable(name: "fstatus", scope: !234, file: !2, line: 798, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !2, line: 85, size: 1216, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !252, file: !2, line: 89, baseType: !101, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !252, file: !2, line: 92, baseType: !256, size: 1152, offset: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !257, line: 26, size: 1152, elements: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!258 = !{!259, !262, !264, !266, !268, !270, !272, !273, !274, !276, !278, !280, !288, !289, !290}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !256, file: !257, line: 31, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !261, line: 145, baseType: !168)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !256, file: !257, line: 36, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !261, line: 148, baseType: !168)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !256, file: !257, line: 44, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !261, line: 151, baseType: !168)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !256, file: !257, line: 45, baseType: !267, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !261, line: 150, baseType: !94)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !256, file: !257, line: 47, baseType: !269, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !261, line: 146, baseType: !94)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !256, file: !257, line: 48, baseType: !271, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !261, line: 147, baseType: !94)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !256, file: !257, line: 50, baseType: !101, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !256, file: !257, line: 52, baseType: !260, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !256, file: !257, line: 57, baseType: !275, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !261, line: 152, baseType: !247)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !256, file: !257, line: 61, baseType: !277, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !261, line: 175, baseType: !247)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !256, file: !257, line: 63, baseType: !279, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !261, line: 180, baseType: !247)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !256, file: !257, line: 74, baseType: !281, size: 128, offset: 576)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !282, line: 11, size: 128, elements: !283)
!282 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!283 = !{!284, !286}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !281, file: !282, line: 16, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !261, line: 160, baseType: !247)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !281, file: !282, line: 21, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !261, line: 197, baseType: !247)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !256, file: !257, line: 75, baseType: !281, size: 128, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !256, file: !257, line: 76, baseType: !281, size: 128, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !256, file: !257, line: 89, baseType: !291, size: 192, offset: 960)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 192, elements: !25)
!292 = !DILocalVariable(name: "tok", scope: !234, file: !2, line: 799, type: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !294, line: 32, size: 2304, elements: !295)
!294 = !DIFile(filename: "./lib/readtokens0.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bcc2e7cb98b6844cbfd13d7bab31a60d")
!295 = !{!296, !297, !298, !300, !350, !351}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !293, file: !294, line: 34, baseType: !166, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !293, file: !294, line: 35, baseType: !237, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !293, file: !294, line: 36, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !293, file: !294, line: 37, baseType: !301, size: 704, offset: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !302, line: 210, size: 704, elements: !303)
!302 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!303 = !{!304, !305, !315, !316, !317, !318, !323, !324, !335, !346, !347, !348, !349}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !301, file: !302, line: 212, baseType: !166, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !301, file: !302, line: 213, baseType: !306, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !302, line: 203, size: 128, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !307, file: !302, line: 205, baseType: !164, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !302, line: 206, baseType: !306, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !307, file: !302, line: 207, baseType: !312, offset: 128)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: -1)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !301, file: !302, line: 214, baseType: !164, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !301, file: !302, line: 215, baseType: !164, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !301, file: !302, line: 216, baseType: !164, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !301, file: !302, line: 221, baseType: !319, size: 64, offset: 320)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !302, line: 217, size: 64, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !319, file: !302, line: 219, baseType: !166, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !319, file: !302, line: 220, baseType: !161, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !301, file: !302, line: 222, baseType: !166, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !301, file: !302, line: 229, baseType: !325, size: 64, offset: 448)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !302, line: 225, size: 64, elements: !326)
!326 = !{!327, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !325, file: !302, line: 227, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!161, !166}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !325, file: !302, line: 228, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!161, !161, !166}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !301, file: !302, line: 234, baseType: !336, size: 64, offset: 512)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !302, line: 230, size: 64, elements: !337)
!337 = !{!338, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !336, file: !302, line: 232, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !161}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !336, file: !302, line: 233, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !161, !161}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !301, file: !302, line: 236, baseType: !161, size: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !301, file: !302, line: 237, baseType: !94, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !301, file: !302, line: 238, baseType: !94, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !301, file: !302, line: 242, baseType: !94, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !293, file: !294, line: 38, baseType: !301, size: 704, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !293, file: !294, line: 39, baseType: !301, size: 704, offset: 1600)
!352 = !DILocalVariable(name: "i", scope: !353, file: !2, line: 864, type: !101)
!353 = distinct !DILexicalBlock(scope: !354, file: !2, line: 864, column: 5)
!354 = distinct !DILexicalBlock(scope: !234, file: !2, line: 863, column: 7)
!355 = !DILocalVariable(name: "i", scope: !356, file: !2, line: 867, type: !101)
!356 = distinct !DILexicalBlock(scope: !357, file: !2, line: 867, column: 5)
!357 = distinct !DILexicalBlock(scope: !234, file: !2, line: 866, column: 7)
!358 = !DILocalVariable(name: "read_tokens", scope: !234, file: !2, line: 870, type: !359)
!359 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!360 = !DILocalVariable(name: "ai", scope: !234, file: !2, line: 871, type: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !141, line: 32, flags: DIFlagFwdDecl)
!363 = !DILocalVariable(name: "stream", scope: !364, file: !2, line: 874, type: !366)
!364 = distinct !DILexicalBlock(scope: !365, file: !2, line: 873, column: 5)
!365 = distinct !DILexicalBlock(scope: !234, file: !2, line: 872, column: 7)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !368, line: 7, baseType: !369)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !370, line: 49, size: 1728, elements: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !387, !389, !390, !391, !392, !393, !395, !396, !399, !401, !404, !407, !408, !409, !410, !411}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !369, file: !370, line: 51, baseType: !101, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !369, file: !370, line: 54, baseType: !164, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !369, file: !370, line: 55, baseType: !164, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !369, file: !370, line: 56, baseType: !164, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !369, file: !370, line: 57, baseType: !164, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !369, file: !370, line: 58, baseType: !164, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !369, file: !370, line: 59, baseType: !164, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !369, file: !370, line: 60, baseType: !164, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !369, file: !370, line: 61, baseType: !164, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !369, file: !370, line: 64, baseType: !164, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !369, file: !370, line: 65, baseType: !164, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !369, file: !370, line: 66, baseType: !164, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !369, file: !370, line: 68, baseType: !385, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !370, line: 36, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !369, file: !370, line: 70, baseType: !388, size: 64, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !369, file: !370, line: 72, baseType: !101, size: 32, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !369, file: !370, line: 73, baseType: !101, size: 32, offset: 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !369, file: !370, line: 74, baseType: !275, size: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !369, file: !370, line: 77, baseType: !165, size: 16, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !369, file: !370, line: 78, baseType: !394, size: 8, offset: 1040)
!394 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !369, file: !370, line: 79, baseType: !76, size: 8, offset: 1048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !369, file: !370, line: 81, baseType: !397, size: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !370, line: 43, baseType: null)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !369, file: !370, line: 89, baseType: !400, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !261, line: 153, baseType: !247)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !369, file: !370, line: 91, baseType: !402, size: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !370, line: 37, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !369, file: !370, line: 92, baseType: !405, size: 64, offset: 1280)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !370, line: 38, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !369, file: !370, line: 93, baseType: !388, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !369, file: !370, line: 94, baseType: !161, size: 64, offset: 1408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !369, file: !370, line: 95, baseType: !166, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !369, file: !370, line: 96, baseType: !101, size: 32, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !369, file: !370, line: 98, baseType: !412, size: 160, offset: 1568)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 20)
!415 = !DILocalVariable(name: "st", scope: !364, file: !2, line: 898, type: !256)
!416 = !DILocalVariable(name: "ok", scope: !234, file: !2, line: 936, type: !359)
!417 = !DILocalVariable(name: "ai_err", scope: !234, file: !2, line: 937, type: !140)
!418 = !DILocalVariable(name: "file_name", scope: !234, file: !2, line: 938, type: !164)
!419 = !DILocalVariable(name: "i", scope: !420, file: !2, line: 939, type: !101)
!420 = distinct !DILexicalBlock(scope: !234, file: !2, line: 939, column: 3)
!421 = !DILocalVariable(name: "skip_file", scope: !422, file: !2, line: 941, type: !359)
!422 = distinct !DILexicalBlock(scope: !423, file: !2, line: 940, column: 5)
!423 = distinct !DILexicalBlock(scope: !420, file: !2, line: 939, column: 3)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !77)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 946, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 72)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !24, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 30)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !195, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 985, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 15)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 12)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1017, type: !446, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1023, type: !202, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1029, type: !446, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !180, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "wc_isprint", scope: !91, file: !2, line: 51, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 2048, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 256)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "wc_isspace", scope: !91, file: !2, line: 52, type: !459, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "debug", scope: !91, file: !2, line: 54, type: !359, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "total_lines", scope: !91, file: !2, line: 58, type: !468, isLocal: true, isDefinition: true)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !469, line: 102, baseType: !470)
!469 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !261, line: 73, baseType: !168)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "total_words", scope: !91, file: !2, line: 59, type: !468, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "total_chars", scope: !91, file: !2, line: 60, type: !468, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "total_bytes", scope: !91, file: !2, line: 61, type: !468, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "total_lines_overflow", scope: !91, file: !2, line: 62, type: !359, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "total_words_overflow", scope: !91, file: !2, line: 63, type: !359, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "total_chars_overflow", scope: !91, file: !2, line: 64, type: !359, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "total_bytes_overflow", scope: !91, file: !2, line: 65, type: !359, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "max_line_length", scope: !91, file: !2, line: 66, type: !487, isLocal: true, isDefinition: true)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !469, line: 101, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !261, line: 72, baseType: !247)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "print_lines", scope: !91, file: !2, line: 69, type: !359, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "print_words", scope: !91, file: !2, line: 69, type: !359, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "print_chars", scope: !91, file: !2, line: 69, type: !359, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "print_bytes", scope: !91, file: !2, line: 69, type: !359, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "print_linelength", scope: !91, file: !2, line: 70, type: !359, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "number_width", scope: !91, file: !2, line: 73, type: !101, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !91, file: !2, line: 76, type: !359, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !91, file: !2, line: 82, type: !359, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !100, line: 729, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 56)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !512, file: !100, line: 575, type: !101, isLocal: true, isDefinition: true)
!512 = distinct !DISubprogram(name: "oputs_", scope: !100, file: !100, line: 573, type: !513, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !515)
!513 = !DISubroutineType(cc: DW_CC_nocall, types: !514)
!514 = !{null, !169, !169}
!515 = !{!516, !517, !518, !521, !522, !523, !524, !528, !529, !530, !531, !533, !534, !535, !536, !538, !539}
!516 = !DILocalVariable(name: "program", arg: 1, scope: !512, file: !100, line: 573, type: !169)
!517 = !DILocalVariable(name: "option", arg: 2, scope: !512, file: !100, line: 573, type: !169)
!518 = !DILocalVariable(name: "term", scope: !519, file: !100, line: 585, type: !169)
!519 = distinct !DILexicalBlock(scope: !520, file: !100, line: 582, column: 5)
!520 = distinct !DILexicalBlock(scope: !512, file: !100, line: 581, column: 7)
!521 = !DILocalVariable(name: "double_space", scope: !512, file: !100, line: 594, type: !359)
!522 = !DILocalVariable(name: "first_word", scope: !512, file: !100, line: 595, type: !169)
!523 = !DILocalVariable(name: "option_text", scope: !512, file: !100, line: 596, type: !169)
!524 = !DILocalVariable(name: "s", scope: !525, file: !100, line: 608, type: !169)
!525 = distinct !DILexicalBlock(scope: !526, file: !100, line: 605, column: 5)
!526 = distinct !DILexicalBlock(scope: !527, file: !100, line: 604, column: 12)
!527 = distinct !DILexicalBlock(scope: !512, file: !100, line: 597, column: 7)
!528 = !DILocalVariable(name: "spaces", scope: !525, file: !100, line: 609, type: !166)
!529 = !DILocalVariable(name: "anchor_len", scope: !512, file: !100, line: 620, type: !166)
!530 = !DILocalVariable(name: "desc_text", scope: !512, file: !100, line: 625, type: !169)
!531 = !DILocalVariable(name: "__ptr", scope: !532, file: !100, line: 644, type: !169)
!532 = distinct !DILexicalBlock(scope: !512, file: !100, line: 644, column: 3)
!533 = !DILocalVariable(name: "__stream", scope: !532, file: !100, line: 644, type: !366)
!534 = !DILocalVariable(name: "__cnt", scope: !532, file: !100, line: 644, type: !166)
!535 = !DILocalVariable(name: "url_program", scope: !512, file: !100, line: 648, type: !169)
!536 = !DILocalVariable(name: "__ptr", scope: !537, file: !100, line: 686, type: !169)
!537 = distinct !DILexicalBlock(scope: !512, file: !100, line: 686, column: 3)
!538 = !DILocalVariable(name: "__stream", scope: !537, file: !100, line: 686, type: !366)
!539 = !DILocalVariable(name: "__cnt", scope: !537, file: !100, line: 686, type: !166)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !100, line: 585, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 5)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !100, line: 586, type: !542, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !100, line: 595, type: !207, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !100, line: 620, type: !180, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !217, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !542, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !207, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !24, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !100, line: 650, type: !542, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !180, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !180, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !100, line: 652, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 7)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !100, line: 653, type: !185, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !100, line: 654, type: !81, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !100, line: 655, type: !81, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !100, line: 656, type: !81, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !100, line: 657, type: !81, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !100, line: 663, type: !567, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !100, line: 664, type: !81, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !202, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 40)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !441, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 61)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !100, line: 679, type: !24, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !100, line: 683, type: !542, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !100, line: 688, type: !542, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !100, line: 691, type: !185, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !100, line: 839, type: !175, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !100, line: 840, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 22)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !100, line: 841, type: !441, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !100, line: 862, type: !207, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !100, line: 868, type: !9, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !100, line: 875, type: !224, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !34, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !446, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !180, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !180, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !180, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !180, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !180, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !446, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !175, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !542, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !185, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "longopts", scope: !91, file: !2, line: 104, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 2816, elements: !196)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !648, line: 50, size: 256, elements: !649)
!648 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!649 = !{!650, !651, !652, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !648, line: 52, baseType: !169, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !647, file: !648, line: 55, baseType: !101, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !648, line: 56, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !647, file: !648, line: 57, baseType: !101, size: 32, offset: 192)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "total_types", scope: !91, file: !2, line: 130, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 128, elements: !208)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !542, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !567, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !542, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !180, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "total_args", scope: !91, file: !2, line: 126, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 320, elements: !543)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "total_mode", scope: !91, file: !2, line: 135, type: !134, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 378, type: !441, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "use_avx512", scope: !677, file: !2, line: 308, type: !394, isLocal: true, isDefinition: true)
!677 = distinct !DISubprogram(name: "wc_lines", scope: !2, file: !2, line: 305, type: !678, scopeLine: 306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !686)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !101}
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wc_lines", file: !681, line: 2, size: 192, elements: !682)
!681 = !DIFile(filename: "src/wc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f73f6c91eb8849cde32b7f2c7fc10330")
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !680, file: !681, line: 2, baseType: !101, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !680, file: !681, line: 2, baseType: !487, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !680, file: !681, line: 2, baseType: !487, size: 64, offset: 128)
!686 = !{!687, !688, !689, !690, !691, !696, !700, !701, !702, !706}
!687 = !DILocalVariable(name: "fd", arg: 1, scope: !677, file: !2, line: 305, type: !101)
!688 = !DILocalVariable(name: "lines", scope: !677, file: !2, line: 329, type: !487)
!689 = !DILocalVariable(name: "bytes", scope: !677, file: !2, line: 329, type: !487)
!690 = !DILocalVariable(name: "long_lines", scope: !677, file: !2, line: 330, type: !359)
!691 = !DILocalVariable(name: "buf", scope: !692, file: !2, line: 334, type: !693)
!692 = distinct !DILexicalBlock(scope: !677, file: !2, line: 333, column: 5)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097160, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 262145)
!696 = !DILocalVariable(name: "bytes_read", scope: !692, file: !2, line: 335, type: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !698, line: 77, baseType: !699)
!698 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !261, line: 194, baseType: !247)
!700 = !DILocalVariable(name: "end", scope: !692, file: !2, line: 340, type: !164)
!701 = !DILocalVariable(name: "buflines", scope: !692, file: !2, line: 341, type: !243)
!702 = !DILocalVariable(name: "p", scope: !703, file: !2, line: 346, type: !164)
!703 = distinct !DILexicalBlock(scope: !704, file: !2, line: 346, column: 11)
!704 = distinct !DILexicalBlock(scope: !705, file: !2, line: 344, column: 9)
!705 = distinct !DILexicalBlock(scope: !692, file: !2, line: 343, column: 11)
!706 = !DILocalVariable(name: "p", scope: !707, file: !2, line: 353, type: !164)
!707 = distinct !DILexicalBlock(scope: !708, file: !2, line: 353, column: 11)
!708 = distinct !DILexicalBlock(scope: !705, file: !2, line: 350, column: 9)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "use_avx2", scope: !677, file: !2, line: 315, type: !394, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !2, line: 155, type: !185, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 9)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !434, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !722, isLocal: true, isDefinition: true)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 28)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !727, line: 68, type: !207, isLocal: true, isDefinition: true)
!727 = !DIFile(filename: "./lib/cpu-supports.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9be339edc1bd703a3f96b2a763524c18")
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !727, line: 68, type: !542, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !727, line: 69, type: !542, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !727, line: 69, type: !180, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !727, line: 70, type: !81, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !727, line: 71, type: !715, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !727, line: 72, type: !567, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !727, line: 72, type: !195, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !727, line: 73, type: !195, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !727, line: 73, type: !446, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !727, line: 75, type: !180, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !727, line: 75, type: !567, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !727, line: 76, type: !180, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !727, line: 76, type: !567, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !722, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !758, isLocal: true, isDefinition: true)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 26)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !763, file: !2, line: 268, type: !778, isLocal: true, isDefinition: true)
!763 = distinct !DISubprogram(name: "write_counts", scope: !2, file: !2, line: 261, type: !764, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !468, !468, !468, !468, !487, !169}
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774}
!767 = !DILocalVariable(name: "lines", arg: 1, scope: !763, file: !2, line: 261, type: !468)
!768 = !DILocalVariable(name: "words", arg: 2, scope: !763, file: !2, line: 262, type: !468)
!769 = !DILocalVariable(name: "chars", arg: 3, scope: !763, file: !2, line: 263, type: !468)
!770 = !DILocalVariable(name: "bytes", arg: 4, scope: !763, file: !2, line: 264, type: !468)
!771 = !DILocalVariable(name: "linelength", arg: 5, scope: !763, file: !2, line: 265, type: !487)
!772 = !DILocalVariable(name: "file", arg: 6, scope: !763, file: !2, line: 266, type: !169)
!773 = !DILocalVariable(name: "format_int", scope: !763, file: !2, line: 269, type: !169)
!774 = !DILocalVariable(name: "buf", scope: !763, file: !2, line: 270, type: !775)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 21)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 40, elements: !543)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !207, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !100, line: 952, type: !446, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!784 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!785 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!786 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!787 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!789 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3, type: !441, isLocal: true, isDefinition: true)
!792 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "Version", scope: !795, file: !792, line: 3, type: !169, isLocal: false, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C11, file: !792, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !796, splitDebugInlining: false, nameTableKind: None)
!796 = !{!790, !793}
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !799, file: !800, line: 65, type: !821, isLocal: false, isDefinition: true)
!799 = distinct !DICompileUnit(language: DW_LANG_C11, file: !800, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !801, retainedTypes: !804, globals: !805, splitDebugInlining: false, nameTableKind: None)
!800 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!801 = !{!802}
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !803, line: 42, baseType: !94, size: 32, elements: !122)
!803 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!804 = !{!161, !169, !171}
!805 = !{!797, !806, !808, !810, !815, !817, !819}
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !800, line: 141, type: !567, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !800, line: 141, type: !224, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !800, line: 142, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 29)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !800, line: 160, type: !775, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !800, line: 165, type: !185, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !800, line: 170, type: !542, isLocal: true, isDefinition: true)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !822, line: 69, baseType: !823)
!822 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{null}
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "file_name", scope: !828, file: !829, line: 45, type: !169, isLocal: true, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C11, file: !829, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !830, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!830 = !{!831, !833, !835, !837, !826, !839}
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !829, line: 121, type: !567, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !829, line: 121, type: !446, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !829, line: 123, type: !567, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !829, line: 126, type: !24, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !828, file: !829, line: 55, type: !359, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !843, file: !844, line: 25, type: !359, isLocal: false, isDefinition: true)
!843 = distinct !DICompileUnit(language: DW_LANG_C11, file: !844, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-cpu-supports.o -MD -MP -MF lib/.deps/libcoreutils_a-cpu-supports.Tpo -c lib/cpu-supports.c -o lib/.libcoreutils_a-cpu-supports.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !845, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!845 = !{!841, !846, !861, !863, !868}
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "hwcaps", scope: !848, file: !844, line: 45, type: !169, isLocal: true, isDefinition: true)
!848 = distinct !DISubprogram(name: "hwcap_allowed", scope: !844, file: !844, line: 28, type: !849, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !843, retainedNodes: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{!359, !169}
!851 = !{!852, !853, !858, !859, !860}
!852 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !848, file: !844, line: 28, type: !169)
!853 = !DILocalVariable(name: "tunables_start", scope: !854, file: !844, line: 50, type: !169)
!854 = distinct !DILexicalBlock(scope: !855, file: !844, line: 49, column: 9)
!855 = distinct !DILexicalBlock(scope: !856, file: !844, line: 48, column: 11)
!856 = distinct !DILexicalBlock(scope: !857, file: !844, line: 47, column: 5)
!857 = distinct !DILexicalBlock(scope: !848, file: !844, line: 46, column: 7)
!858 = !DILocalVariable(name: "last_hwcaps", scope: !854, file: !844, line: 51, type: !169)
!859 = !DILocalVariable(name: "sentinel", scope: !848, file: !844, line: 67, type: !169)
!860 = !DILocalVariable(name: "cap", scope: !848, file: !844, line: 70, type: !169)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !844, line: 48, type: !441, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !844, line: 52, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 18)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !844, line: 55, type: !76, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !872, file: !873, line: 66, type: !823, isLocal: false, isDefinition: true)
!872 = distinct !DICompileUnit(language: DW_LANG_C11, file: !873, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !874, globals: !875, splitDebugInlining: false, nameTableKind: None)
!873 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!874 = !{!161, !171}
!875 = !{!876, !878, !897, !899, !901, !903, !870, !905, !907, !909, !911, !913}
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !873, line: 272, type: !542, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "old_file_name", scope: !880, file: !873, line: 304, type: !169, isLocal: true, isDefinition: true)
!880 = distinct !DISubprogram(name: "verror_at_line", scope: !873, file: !873, line: 298, type: !881, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !872, retainedNodes: !890)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !101, !101, !169, !94, !169, !883}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !884, file: !873, baseType: !94, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !884, file: !873, baseType: !94, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !884, file: !873, baseType: !161, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !884, file: !873, baseType: !161, size: 64, offset: 128)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DILocalVariable(name: "status", arg: 1, scope: !880, file: !873, line: 298, type: !101)
!892 = !DILocalVariable(name: "errnum", arg: 2, scope: !880, file: !873, line: 298, type: !101)
!893 = !DILocalVariable(name: "file_name", arg: 3, scope: !880, file: !873, line: 298, type: !169)
!894 = !DILocalVariable(name: "line_number", arg: 4, scope: !880, file: !873, line: 298, type: !94)
!895 = !DILocalVariable(name: "message", arg: 5, scope: !880, file: !873, line: 298, type: !169)
!896 = !DILocalVariable(name: "args", arg: 6, scope: !880, file: !873, line: 298, type: !883)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "old_line_number", scope: !880, file: !873, line: 305, type: !94, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !873, line: 338, type: !207, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !873, line: 346, type: !185, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !873, line: 346, type: !217, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "error_message_count", scope: !872, file: !873, line: 69, type: !94, isLocal: false, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !872, file: !873, line: 295, type: !101, isLocal: false, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !873, line: 208, type: !567, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !873, line: 208, type: !775, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !873, line: 214, type: !542, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !917, line: 108, type: !76, isLocal: true, isDefinition: true)
!917 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "internal_state", scope: !920, file: !917, line: 97, type: !923, isLocal: true, isDefinition: true)
!920 = distinct !DICompileUnit(language: DW_LANG_C11, file: !917, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !921, globals: !922, splitDebugInlining: false, nameTableKind: None)
!921 = !{!161, !166, !171}
!922 = !{!915, !918}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !924, line: 6, baseType: !925)
!924 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !926, line: 21, baseType: !927)
!926 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !926, line: 13, size: 64, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !927, file: !926, line: 15, baseType: !101, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !927, file: !926, line: 20, baseType: !931, size: 32, offset: 32)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !927, file: !926, line: 16, size: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !931, file: !926, line: 18, baseType: !94, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !931, file: !926, line: 19, baseType: !207, size: 32)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !937, line: 182, type: !190, isLocal: true, isDefinition: true)
!937 = !DIFile(filename: "lib/physmem.c", directory: "/src", checksumkind: CSK_MD5, checksum: "df355a32f7975afeeeba505b6287e039")
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !937, line: 205, type: !202, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !937, line: 209, type: !86, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "program_name", scope: !944, file: !945, line: 31, type: !169, isLocal: false, isDefinition: true)
!944 = distinct !DICompileUnit(language: DW_LANG_C11, file: !945, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !946, globals: !947, splitDebugInlining: false, nameTableKind: None)
!945 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!946 = !{!161, !164}
!947 = !{!942, !948, !950}
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !945, line: 46, type: !185, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !945, line: 49, type: !207, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "utf07FF", scope: !954, file: !955, line: 46, type: !980, isLocal: true, isDefinition: true)
!954 = distinct !DISubprogram(name: "proper_name_lite", scope: !955, file: !955, line: 38, type: !956, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !958, retainedNodes: !960)
!955 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!956 = !DISubroutineType(types: !957)
!957 = !{!169, !169, !169}
!958 = distinct !DICompileUnit(language: DW_LANG_C11, file: !955, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !959, splitDebugInlining: false, nameTableKind: None)
!959 = !{!952}
!960 = !{!961, !962, !963, !964, !969}
!961 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !954, file: !955, line: 38, type: !169)
!962 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !954, file: !955, line: 38, type: !169)
!963 = !DILocalVariable(name: "translation", scope: !954, file: !955, line: 40, type: !169)
!964 = !DILocalVariable(name: "w", scope: !954, file: !955, line: 47, type: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !966, line: 37, baseType: !967)
!966 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !261, line: 57, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !261, line: 42, baseType: !94)
!969 = !DILocalVariable(name: "mbs", scope: !954, file: !955, line: 48, type: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !924, line: 6, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !926, line: 21, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !926, line: 13, size: 64, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !972, file: !926, line: 15, baseType: !101, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !972, file: !926, line: 20, baseType: !976, size: 32, offset: 32)
!976 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !972, file: !926, line: 16, size: 32, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !976, file: !926, line: 18, baseType: !94, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !976, file: !926, line: 19, baseType: !207, size: 32)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 16, elements: !218)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !983, line: 78, type: !185, isLocal: true, isDefinition: true)
!983 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !983, line: 79, type: !180, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !983, line: 80, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 13)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !983, line: 81, type: !988, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !983, line: 82, type: !412, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !983, line: 83, type: !217, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !983, line: 84, type: !185, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !983, line: 85, type: !567, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !983, line: 86, type: !567, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !983, line: 87, type: !185, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1007, file: !983, line: 76, type: !1077, isLocal: false, isDefinition: true)
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !983, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1008, retainedTypes: !1014, globals: !1015, splitDebugInlining: false, nameTableKind: None)
!1008 = !{!802, !1009, !105}
!1009 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !803, line: 254, baseType: !94, size: 32, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1012 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1013 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1014 = !{!161, !101, !165, !166}
!1015 = !{!981, !984, !986, !991, !993, !995, !997, !999, !1001, !1003, !1005, !1016, !1020, !1030, !1032, !1035, !1037, !1039, !1041, !1043, !1066, !1073, !1075}
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1007, file: !983, line: 92, type: !1018, isLocal: false, isDefinition: true)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 320, elements: !82)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1007, file: !983, line: 1040, type: !1022, isLocal: false, isDefinition: true)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !983, line: 56, size: 448, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1028, !1029}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1022, file: !983, line: 59, baseType: !802, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1022, file: !983, line: 62, baseType: !101, size: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1022, file: !983, line: 66, baseType: !1027, size: 256, offset: 64)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !186)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1022, file: !983, line: 69, baseType: !169, size: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1022, file: !983, line: 72, baseType: !169, size: 64, offset: 384)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1007, file: !983, line: 107, type: !1022, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "slot0", scope: !1007, file: !983, line: 831, type: !1034, isLocal: true, isDefinition: true)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !460)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !983, line: 321, type: !217, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !983, line: 357, type: !217, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !983, line: 358, type: !217, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !983, line: 199, type: !567, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "quote", scope: !1045, file: !983, line: 228, type: !1064, isLocal: true, isDefinition: true)
!1045 = distinct !DISubprogram(name: "gettext_quote", scope: !983, file: !983, line: 197, type: !1046, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1007, retainedNodes: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!169, !169, !802}
!1048 = !{!1049, !1050, !1051, !1052, !1053}
!1049 = !DILocalVariable(name: "msgid", arg: 1, scope: !1045, file: !983, line: 197, type: !169)
!1050 = !DILocalVariable(name: "s", arg: 2, scope: !1045, file: !983, line: 197, type: !802)
!1051 = !DILocalVariable(name: "translation", scope: !1045, file: !983, line: 199, type: !169)
!1052 = !DILocalVariable(name: "w", scope: !1045, file: !983, line: 229, type: !965)
!1053 = !DILocalVariable(name: "mbs", scope: !1045, file: !983, line: 230, type: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !924, line: 6, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !926, line: 21, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !926, line: 13, size: 64, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1056, file: !926, line: 15, baseType: !101, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1056, file: !926, line: 20, baseType: !1060, size: 32, offset: 32)
!1060 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1056, file: !926, line: 16, size: 32, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1060, file: !926, line: 18, baseType: !94, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1060, file: !926, line: 19, baseType: !207, size: 32)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !1065)
!1065 = !{!219, !209}
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(name: "slotvec", scope: !1007, file: !983, line: 834, type: !1068, isLocal: true, isDefinition: true)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !983, line: 823, size: 128, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1069, file: !983, line: 825, baseType: !166, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1069, file: !983, line: 826, baseType: !164, size: 64, offset: 64)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "nslots", scope: !1007, file: !983, line: 832, type: !101, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1007, file: !983, line: 833, type: !1069, isLocal: true, isDefinition: true)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 704, elements: !196)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 67, type: !446, isLocal: true, isDefinition: true)
!1080 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 69, type: !567, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 83, type: !567, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 83, type: !207, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 85, type: !217, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 88, type: !1091, isLocal: true, isDefinition: true)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 171)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 88, type: !1096, isLocal: true, isDefinition: true)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: 34)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 105, type: !175, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 109, type: !1103, isLocal: true, isDefinition: true)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 23)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 113, type: !722, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 120, type: !1110, isLocal: true, isDefinition: true)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1111)
!1111 = !{!1112}
!1112 = !DISubrange(count: 32)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 127, type: !1115, isLocal: true, isDefinition: true)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 36)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 134, type: !588, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 142, type: !1122, isLocal: true, isDefinition: true)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 44)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 150, type: !1127, isLocal: true, isDefinition: true)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1128)
!1128 = !{!1129}
!1129 = !DISubrange(count: 48)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 159, type: !212, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 170, type: !1134, isLocal: true, isDefinition: true)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1135)
!1135 = !{!1136}
!1136 = !DISubrange(count: 60)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 248, type: !412, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 248, type: !610, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 254, type: !412, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 254, type: !190, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 254, type: !588, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 259, type: !3, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !1080, line: 259, type: !812, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1153, file: !1154, line: 26, type: !1156, isLocal: false, isDefinition: true)
!1153 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1154, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1155, splitDebugInlining: false, nameTableKind: None)
!1154 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1155 = !{!1151}
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 376, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 47)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !1161, line: 34, type: !24, isLocal: true, isDefinition: true)
!1161 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !1161, line: 34, type: !567, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(scope: null, file: !1161, line: 34, type: !202, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(scope: null, file: !1168, line: 35, type: !180, isLocal: true, isDefinition: true)
