; ModuleID = 'src/cat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"cat\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [47 x i8] c"  -A, --show-all           equivalent to -vET\0A\00", align 1, !dbg !22

!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 19)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 647, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 20)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 657, type: !155, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 2)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 699, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 3)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 736, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 30)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 821, type: !233, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 826, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 23)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "infile", scope: !89, file: !2, line: 50, type: !149, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "input_desc", scope: !89, file: !2, line: 53, type: !86, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !92, line: 729, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 56)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !264, file: !92, line: 575, type: !86, isLocal: true, isDefinition: true)
!264 = distinct !DISubprogram(name: "oputs_", scope: !92, file: !92, line: 573, type: !265, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !267)
!265 = !DISubroutineType(cc: DW_CC_nocall, types: !266)
!266 = !{null, !149, !149}
!267 = !{!268, !269, !270, !273, !275, !276, !277, !281, !282, !283, !284, !286, !336, !337, !338, !340, !341}
!268 = !DILocalVariable(name: "program", arg: 1, scope: !264, file: !92, line: 573, type: !149)
!269 = !DILocalVariable(name: "option", arg: 2, scope: !264, file: !92, line: 573, type: !149)
!270 = !DILocalVariable(name: "term", scope: !271, file: !92, line: 585, type: !149)
!271 = distinct !DILexicalBlock(scope: !272, file: !92, line: 582, column: 5)
!272 = distinct !DILexicalBlock(scope: !264, file: !92, line: 581, column: 7)
!273 = !DILocalVariable(name: "double_space", scope: !264, file: !92, line: 594, type: !274)
!274 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!275 = !DILocalVariable(name: "first_word", scope: !264, file: !92, line: 595, type: !149)
!276 = !DILocalVariable(name: "option_text", scope: !264, file: !92, line: 596, type: !149)
!277 = !DILocalVariable(name: "s", scope: !278, file: !92, line: 608, type: !149)
!278 = distinct !DILexicalBlock(scope: !279, file: !92, line: 605, column: 5)
!279 = distinct !DILexicalBlock(scope: !280, file: !92, line: 604, column: 12)
!280 = distinct !DILexicalBlock(scope: !264, file: !92, line: 597, column: 7)
!281 = !DILocalVariable(name: "spaces", scope: !278, file: !92, line: 609, type: !146)
!282 = !DILocalVariable(name: "anchor_len", scope: !264, file: !92, line: 620, type: !146)
!283 = !DILocalVariable(name: "desc_text", scope: !264, file: !92, line: 625, type: !149)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !92, line: 644, type: !149)
!285 = distinct !DILexicalBlock(scope: !264, file: !92, line: 644, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !92, line: 644, type: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !289, line: 7, baseType: !290)
!289 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !291, line: 49, size: 1728, elements: !292)
!291 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !308, !310, !311, !312, !316, !317, !319, !320, !323, !325, !328, !331, !332, !333, !334, !335}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !290, file: !291, line: 51, baseType: !86, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !290, file: !291, line: 54, baseType: !88, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !290, file: !291, line: 55, baseType: !88, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !290, file: !291, line: 56, baseType: !88, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !290, file: !291, line: 57, baseType: !88, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !290, file: !291, line: 58, baseType: !88, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !290, file: !291, line: 59, baseType: !88, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !290, file: !291, line: 60, baseType: !88, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !290, file: !291, line: 61, baseType: !88, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !290, file: !291, line: 64, baseType: !88, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !290, file: !291, line: 65, baseType: !88, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !290, file: !291, line: 66, baseType: !88, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !290, file: !291, line: 68, baseType: !306, size: 64, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !291, line: 36, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !290, file: !291, line: 70, baseType: !309, size: 64, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !290, file: !291, line: 72, baseType: !86, size: 32, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !290, file: !291, line: 73, baseType: !86, size: 32, offset: 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !290, file: !291, line: 74, baseType: !313, size: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !314, line: 152, baseType: !315)
!314 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!315 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !290, file: !291, line: 77, baseType: !145, size: 16, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !290, file: !291, line: 78, baseType: !318, size: 8, offset: 1040)
!318 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !290, file: !291, line: 79, baseType: !197, size: 8, offset: 1048)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !290, file: !291, line: 81, baseType: !321, size: 64, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !291, line: 43, baseType: null)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !290, file: !291, line: 89, baseType: !324, size: 64, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !314, line: 153, baseType: !315)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !290, file: !291, line: 91, baseType: !326, size: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !291, line: 37, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !290, file: !291, line: 92, baseType: !329, size: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !291, line: 38, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !290, file: !291, line: 93, baseType: !309, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !290, file: !291, line: 94, baseType: !144, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !290, file: !291, line: 95, baseType: !146, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !290, file: !291, line: 96, baseType: !86, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !290, file: !291, line: 98, baseType: !226, size: 160, offset: 1568)
!336 = !DILocalVariable(name: "__cnt", scope: !285, file: !92, line: 644, type: !146)
!337 = !DILocalVariable(name: "url_program", scope: !264, file: !92, line: 648, type: !149)
!338 = !DILocalVariable(name: "__ptr", scope: !339, file: !92, line: 686, type: !149)
!339 = distinct !DILexicalBlock(scope: !264, file: !92, line: 686, column: 3)
!340 = !DILocalVariable(name: "__stream", scope: !339, file: !92, line: 686, type: !287)
!341 = !DILocalVariable(name: "__cnt", scope: !339, file: !92, line: 686, type: !146)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !92, line: 585, type: !187, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !92, line: 586, type: !187, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !92, line: 595, type: !19, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !92, line: 620, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 6)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !233, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !187, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !19, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !238, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !92, line: 650, type: !187, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !92, line: 652, type: !160, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !92, line: 653, type: !192, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !92, line: 654, type: !175, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !92, line: 655, type: !175, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !92, line: 656, type: !175, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !92, line: 657, type: !175, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !92, line: 663, type: !160, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !92, line: 664, type: !175, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !170, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 40)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 15)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 61)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !92, line: 679, type: !238, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !92, line: 683, type: !187, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !92, line: 688, type: !187, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !92, line: 691, type: !192, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !92, line: 839, type: !155, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !92, line: 840, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 22)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !92, line: 841, type: !392, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !92, line: 862, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !92, line: 868, type: !29, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !92, line: 875, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 27)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 51)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 12)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 312, type: !412, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "newlines2", scope: !89, file: !2, line: 77, type: !86, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "line_num_end", scope: !89, file: !2, line: 74, type: !88, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "line_num_start", scope: !89, file: !2, line: 71, type: !88, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "line_buf", scope: !89, file: !2, line: 59, type: !226, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "line_num_print", scope: !89, file: !2, line: 68, type: !88, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "pending_cr", scope: !89, file: !2, line: 80, type: !274, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !92, line: 952, type: !433, isLocal: true, isDefinition: true)
!452 = !{!453, !454, !455, !456, !492, !493, !494, !495, !496, !497, !498, !499, !500, !505, !506, !507, !508, !509, !510, !512, !513, !514, !519, !522, !523, !526, !528, !529}
!453 = !DILocalVariable(name: "argc", arg: 1, scope: !83, file: !2, line: 550, type: !86)
!454 = !DILocalVariable(name: "argv", arg: 2, scope: !83, file: !2, line: 550, type: !87)
!455 = !DILocalVariable(name: "have_read_stdin", scope: !83, file: !2, line: 553, type: !274)
!456 = !DILocalVariable(name: "ostat_buf", scope: !83, file: !2, line: 555, type: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !458, line: 44, size: 1024, elements: !459)
!458 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!459 = !{!460, !462, !464, !466, !468, !470, !472, !473, !474, !475, !477, !478, !480, !488, !489, !490}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !457, file: !458, line: 46, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !314, line: 145, baseType: !148)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !457, file: !458, line: 47, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !314, line: 148, baseType: !148)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !457, file: !458, line: 48, baseType: !465, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !314, line: 150, baseType: !98)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !457, file: !458, line: 49, baseType: !467, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !314, line: 151, baseType: !98)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !457, file: !458, line: 50, baseType: !469, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !314, line: 146, baseType: !98)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !457, file: !458, line: 51, baseType: !471, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !314, line: 147, baseType: !98)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !457, file: !458, line: 52, baseType: !461, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !457, file: !458, line: 53, baseType: !461, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !457, file: !458, line: 54, baseType: !313, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !457, file: !458, line: 55, baseType: !476, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !314, line: 175, baseType: !86)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !457, file: !458, line: 56, baseType: !86, size: 32, offset: 480)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !457, file: !458, line: 57, baseType: !479, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !314, line: 180, baseType: !315)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !457, file: !458, line: 65, baseType: !481, size: 128, offset: 576)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !482, line: 11, size: 128, elements: !483)
!482 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!483 = !{!484, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !481, file: !482, line: 16, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !314, line: 160, baseType: !315)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !481, file: !482, line: 21, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !314, line: 197, baseType: !315)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !457, file: !458, line: 66, baseType: !481, size: 128, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !457, file: !458, line: 67, baseType: !481, size: 128, offset: 832)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !457, file: !458, line: 79, baseType: !491, size: 64, offset: 960)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 64, elements: !234)
!492 = !DILocalVariable(name: "number", scope: !83, file: !2, line: 558, type: !274)
!493 = !DILocalVariable(name: "number_nonblank", scope: !83, file: !2, line: 559, type: !274)
!494 = !DILocalVariable(name: "squeeze_blank", scope: !83, file: !2, line: 560, type: !274)
!495 = !DILocalVariable(name: "show_ends", scope: !83, file: !2, line: 561, type: !274)
!496 = !DILocalVariable(name: "show_nonprinting", scope: !83, file: !2, line: 562, type: !274)
!497 = !DILocalVariable(name: "show_tabs", scope: !83, file: !2, line: 563, type: !274)
!498 = !DILocalVariable(name: "file_open_mode", scope: !83, file: !2, line: 564, type: !86)
!499 = !DILocalVariable(name: "c", scope: !83, file: !2, line: 594, type: !86)
!500 = !DILocalVariable(name: "outsize", scope: !83, file: !2, line: 660, type: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !502, line: 130, baseType: !503)
!502 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !504, line: 18, baseType: !315)
!504 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!505 = !DILocalVariable(name: "out_flags", scope: !83, file: !2, line: 663, type: !86)
!506 = !DILocalVariable(name: "out_isreg", scope: !83, file: !2, line: 666, type: !274)
!507 = !DILocalVariable(name: "argind", scope: !83, file: !2, line: 677, type: !86)
!508 = !DILocalVariable(name: "ok", scope: !83, file: !2, line: 678, type: !274)
!509 = !DILocalVariable(name: "page_size", scope: !83, file: !2, line: 679, type: !501)
!510 = !DILocalVariable(name: "reading_stdin", scope: !511, file: !2, line: 686, type: !274)
!511 = distinct !DILexicalBlock(scope: !83, file: !2, line: 682, column: 5)
!512 = !DILocalVariable(name: "istat_buf", scope: !511, file: !2, line: 705, type: !457)
!513 = !DILocalVariable(name: "insize", scope: !511, file: !2, line: 714, type: !501)
!514 = !DILocalVariable(name: "in_pos", scope: !515, file: !2, line: 727, type: !517)
!515 = distinct !DILexicalBlock(scope: !516, file: !2, line: 726, column: 9)
!516 = distinct !DILexicalBlock(scope: !511, file: !2, line: 722, column: 11)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !518, line: 63, baseType: !313)
!518 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!519 = !DILocalVariable(name: "whence", scope: !520, file: !2, line: 732, type: !86)
!520 = distinct !DILexicalBlock(scope: !521, file: !2, line: 729, column: 13)
!521 = distinct !DILexicalBlock(scope: !515, file: !2, line: 728, column: 15)
!522 = !DILocalVariable(name: "inbuf", scope: !511, file: !2, line: 745, type: !88)
!523 = !DILocalVariable(name: "copy_cat_status", scope: !524, file: !2, line: 754, type: !86)
!524 = distinct !DILexicalBlock(scope: !525, file: !2, line: 753, column: 9)
!525 = distinct !DILexicalBlock(scope: !511, file: !2, line: 751, column: 11)
!526 = !DILocalVariable(name: "bufsize", scope: !527, file: !2, line: 794, type: !501)
!527 = distinct !DILexicalBlock(scope: !525, file: !2, line: 769, column: 9)
!528 = !DILocalVariable(name: "outbuf", scope: !527, file: !2, line: 799, type: !88)
!529 = !DILabel(scope: !511, name: "contin", file: !2, line: 810)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 2560, elements: !176)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !533, line: 50, size: 256, elements: !534)
!533 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!534 = !{!535, !536, !537, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !532, file: !533, line: 52, baseType: !149, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !532, file: !533, line: 55, baseType: !86, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !533, line: 56, baseType: !538, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !532, file: !533, line: 57, baseType: !86, size: 32, offset: 192)
!540 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !543, line: 3, type: !392, isLocal: true, isDefinition: true)
!543 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "Version", scope: !546, file: !543, line: 3, type: !149, isLocal: false, isDefinition: true)
!546 = distinct !DICompileUnit(language: DW_LANG_C11, file: !543, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !547, splitDebugInlining: false, nameTableKind: None)
!547 = !{!541, !544}
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "file_name", scope: !550, file: !551, line: 45, type: !149, isLocal: true, isDefinition: true)
!550 = distinct !DICompileUnit(language: DW_LANG_C11, file: !551, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !552, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!552 = !{!553, !555, !557, !559, !548, !561}
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !551, line: 121, type: !160, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !551, line: 121, type: !433, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !551, line: 123, type: !160, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !551, line: 126, type: !238, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !550, file: !551, line: 55, type: !274, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !565, file: !566, line: 66, type: !615, isLocal: false, isDefinition: true)
!565 = distinct !DICompileUnit(language: DW_LANG_C11, file: !566, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !567, globals: !568, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!567 = !{!144, !151}
!568 = !{!569, !571, !594, !596, !598, !600, !563, !602, !604, !606, !608, !613}
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !566, line: 272, type: !187, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "old_file_name", scope: !573, file: !566, line: 304, type: !149, isLocal: true, isDefinition: true)
!573 = distinct !DISubprogram(name: "verror_at_line", scope: !566, file: !566, line: 298, type: !574, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !565, retainedNodes: !587)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !86, !86, !149, !98, !149, !576}
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !518, line: 52, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !578, line: 12, baseType: !579)
!578 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !566, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !581)
!581 = !{!582, !583, !584, !585, !586}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !580, file: !566, baseType: !144, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !580, file: !566, baseType: !144, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !580, file: !566, baseType: !144, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !580, file: !566, baseType: !86, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !580, file: !566, baseType: !86, size: 32, offset: 224)
!587 = !{!588, !589, !590, !591, !592, !593}
!588 = !DILocalVariable(name: "status", arg: 1, scope: !573, file: !566, line: 298, type: !86)
!589 = !DILocalVariable(name: "errnum", arg: 2, scope: !573, file: !566, line: 298, type: !86)
!590 = !DILocalVariable(name: "file_name", arg: 3, scope: !573, file: !566, line: 298, type: !149)
!591 = !DILocalVariable(name: "line_number", arg: 4, scope: !573, file: !566, line: 298, type: !98)
!592 = !DILocalVariable(name: "message", arg: 5, scope: !573, file: !566, line: 298, type: !149)
!593 = !DILocalVariable(name: "args", arg: 6, scope: !573, file: !566, line: 298, type: !576)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "old_line_number", scope: !573, file: !566, line: 305, type: !98, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !566, line: 338, type: !19, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !566, line: 346, type: !192, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !566, line: 346, type: !233, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "error_message_count", scope: !565, file: !566, line: 69, type: !98, isLocal: false, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !565, file: !566, line: 295, type: !86, isLocal: false, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !566, line: 208, type: !160, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !566, line: 208, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 21)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !566, line: 214, type: !187, isLocal: true, isDefinition: true)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null}
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !620, file: !621, line: 506, type: !86, isLocal: true, isDefinition: true)
!620 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !621, file: !621, line: 485, type: !622, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !624, retainedNodes: !626)
!621 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!622 = !DISubroutineType(types: !623)
!623 = !{!86, !86, !86}
!624 = distinct !DICompileUnit(language: DW_LANG_C11, file: !621, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !625, splitDebugInlining: false, nameTableKind: None)
!625 = !{!618}
!626 = !{!627, !628, !629, !630, !633}
!627 = !DILocalVariable(name: "fd", arg: 1, scope: !620, file: !621, line: 485, type: !86)
!628 = !DILocalVariable(name: "target", arg: 2, scope: !620, file: !621, line: 485, type: !86)
!629 = !DILocalVariable(name: "result", scope: !620, file: !621, line: 487, type: !86)
!630 = !DILocalVariable(name: "flags", scope: !631, file: !621, line: 530, type: !86)
!631 = distinct !DILexicalBlock(scope: !632, file: !621, line: 529, column: 5)
!632 = distinct !DILexicalBlock(scope: !620, file: !621, line: 528, column: 7)
!633 = !DILocalVariable(name: "saved_errno", scope: !634, file: !621, line: 533, type: !86)
!634 = distinct !DILexicalBlock(scope: !635, file: !621, line: 532, column: 9)
!635 = distinct !DILexicalBlock(scope: !631, file: !621, line: 531, column: 11)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "program_name", scope: !638, file: !639, line: 31, type: !149, isLocal: false, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !640, globals: !641, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!640 = !{!144, !88}
!641 = !{!636, !642, !644}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !639, line: 46, type: !192, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !639, line: 49, type: !19, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "utf07FF", scope: !648, file: !649, line: 46, type: !676, isLocal: true, isDefinition: true)
!648 = distinct !DISubprogram(name: "proper_name_lite", scope: !649, file: !649, line: 38, type: !650, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !652, retainedNodes: !654)
!649 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!650 = !DISubroutineType(types: !651)
!651 = !{!149, !149, !149}
!652 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !653, splitDebugInlining: false, nameTableKind: None)
!653 = !{!646}
!654 = !{!655, !656, !657, !658, !663}
!655 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !648, file: !649, line: 38, type: !149)
!656 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !648, file: !649, line: 38, type: !149)
!657 = !DILocalVariable(name: "translation", scope: !648, file: !649, line: 40, type: !149)
!658 = !DILocalVariable(name: "w", scope: !648, file: !649, line: 47, type: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !660, line: 37, baseType: !661)
!660 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !314, line: 57, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !314, line: 42, baseType: !98)
!663 = !DILocalVariable(name: "mbs", scope: !648, file: !649, line: 48, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !665, line: 6, baseType: !666)
!665 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !667, line: 21, baseType: !668)
!667 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 13, size: 64, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !668, file: !667, line: 15, baseType: !86, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !668, file: !667, line: 20, baseType: !672, size: 32, offset: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !668, file: !667, line: 16, size: 32, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !672, file: !667, line: 18, baseType: !98, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !672, file: !667, line: 19, baseType: !19, size: 32)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 16, elements: !234)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !679, line: 78, type: !192, isLocal: true, isDefinition: true)
!679 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !679, line: 79, type: !350, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !679, line: 80, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 13)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !679, line: 81, type: !684, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !679, line: 82, type: !226, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !679, line: 83, type: !233, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !679, line: 84, type: !192, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !679, line: 85, type: !160, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !679, line: 86, type: !160, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !679, line: 87, type: !192, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !703, file: !679, line: 76, type: !777, isLocal: false, isDefinition: true)
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !679, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !704, retainedTypes: !712, globals: !713, splitDebugInlining: false, nameTableKind: None)
!704 = !{!705, !707, !120}
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !706, line: 42, baseType: !98, size: 32, elements: !99)
!706 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !706, line: 254, baseType: !98, size: 32, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!710 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!711 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!712 = !{!144, !86, !145, !146}
!713 = !{!677, !680, !682, !687, !689, !691, !693, !695, !697, !699, !701, !714, !718, !728, !730, !735, !737, !739, !741, !743, !766, !773, !775}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !703, file: !679, line: 92, type: !716, isLocal: false, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 320, elements: !176)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !703, file: !679, line: 1040, type: !720, isLocal: false, isDefinition: true)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !679, line: 56, size: 448, elements: !721)
!721 = !{!722, !723, !724, !726, !727}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !720, file: !679, line: 59, baseType: !705, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !720, file: !679, line: 62, baseType: !86, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !720, file: !679, line: 66, baseType: !725, size: 256, offset: 64)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !193)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !720, file: !679, line: 69, baseType: !149, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !720, file: !679, line: 72, baseType: !149, size: 64, offset: 384)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !703, file: !679, line: 107, type: !720, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "slot0", scope: !703, file: !679, line: 831, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 256)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !679, line: 321, type: !233, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !679, line: 357, type: !233, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !679, line: 358, type: !233, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !679, line: 199, type: !160, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "quote", scope: !745, file: !679, line: 228, type: !764, isLocal: true, isDefinition: true)
!745 = distinct !DISubprogram(name: "gettext_quote", scope: !679, file: !679, line: 197, type: !746, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !703, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{!149, !149, !705}
!748 = !{!749, !750, !751, !752, !753}
!749 = !DILocalVariable(name: "msgid", arg: 1, scope: !745, file: !679, line: 197, type: !149)
!750 = !DILocalVariable(name: "s", arg: 2, scope: !745, file: !679, line: 197, type: !705)
!751 = !DILocalVariable(name: "translation", scope: !745, file: !679, line: 199, type: !149)
!752 = !DILocalVariable(name: "w", scope: !745, file: !679, line: 229, type: !659)
!753 = !DILocalVariable(name: "mbs", scope: !745, file: !679, line: 230, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !665, line: 6, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !667, line: 21, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 13, size: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !756, file: !667, line: 15, baseType: !86, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !756, file: !667, line: 20, baseType: !760, size: 32, offset: 32)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !756, file: !667, line: 16, size: 32, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !760, file: !667, line: 18, baseType: !98, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !760, file: !667, line: 19, baseType: !19, size: 32)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !765)
!765 = !{!235, !21}
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "slotvec", scope: !703, file: !679, line: 834, type: !768, isLocal: true, isDefinition: true)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !679, line: 823, size: 128, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !769, file: !679, line: 825, baseType: !146, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !769, file: !679, line: 826, baseType: !88, size: 64, offset: 64)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "nslots", scope: !703, file: !679, line: 832, type: !86, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "slotvec0", scope: !703, file: !679, line: 833, type: !769, isLocal: true, isDefinition: true)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 704, elements: !210)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !781, line: 67, type: !433, isLocal: true, isDefinition: true)
!781 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !781, line: 69, type: !160, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !781, line: 83, type: !160, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !781, line: 83, type: !19, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !781, line: 85, type: !233, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !781, line: 88, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 171)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !781, line: 88, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 34)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !781, line: 105, type: !155, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !781, line: 109, type: !250, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !781, line: 113, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 28)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !781, line: 120, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 32)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !781, line: 127, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 36)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !781, line: 134, type: !387, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !781, line: 142, type: !823, isLocal: true, isDefinition: true)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 44)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !781, line: 150, type: !828, isLocal: true, isDefinition: true)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 48)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !781, line: 159, type: !44, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !781, line: 170, type: !835, isLocal: true, isDefinition: true)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 60)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !781, line: 248, type: !226, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !781, line: 248, type: !412, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !781, line: 254, type: !226, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !781, line: 254, type: !165, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !781, line: 254, type: !387, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !781, line: 259, type: !3, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !781, line: 259, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 29)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !857, file: !858, line: 26, type: !860, isLocal: false, isDefinition: true)
!857 = distinct !DICompileUnit(language: DW_LANG_C11, file: !858, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !859, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!859 = !{!855}
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 376, elements: !25)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "exit_failure", scope: !863, file: !864, line: 24, type: !866, isLocal: false, isDefinition: true)
!863 = distinct !DICompileUnit(language: DW_LANG_C11, file: !864, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !865, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!865 = !{!861}
!866 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !869, line: 34, type: !238, isLocal: true, isDefinition: true)
!869 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !869, line: 34, type: !160, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !869, line: 34, type: !170, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !876, line: 108, type: !197, isLocal: true, isDefinition: true)
!876 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "internal_state", scope: !879, file: !876, line: 97, type: !882, isLocal: true, isDefinition: true)
!879 = distinct !DICompileUnit(language: DW_LANG_C11, file: !876, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !880, globals: !881, splitDebugInlining: false, nameTableKind: None)
!880 = !{!144, !146, !151}
!881 = !{!874, !877}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !665, line: 6, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !667, line: 21, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 13, size: 64, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !884, file: !667, line: 15, baseType: !86, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !884, file: !667, line: 20, baseType: !888, size: 32, offset: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !884, file: !667, line: 16, size: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !888, file: !667, line: 18, baseType: !98, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !888, file: !667, line: 19, baseType: !19, size: 32)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !894, line: 35, type: !233, isLocal: true, isDefinition: true)
!894 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !894, line: 35, type: !350, isLocal: true, isDefinition: true)
!897 = distinct !DICompileUnit(language: DW_LANG_C11, file: !898, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-copy-file-range.o -MD -MP -MF lib/.deps/libcoreutils_a-copy-file-range.Tpo -c lib/copy-file-range.c -o lib/.libcoreutils_a-copy-file-range.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !899, splitDebugInlining: false, nameTableKind: None)
!898 = !DIFile(filename: "lib/copy-file-range.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6733a97916f50c6b003a01ea6f4c9f0a")
!899 = !{!900}
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !901, line: 36, baseType: !98, size: 32, elements: !141)
!901 = !DIFile(filename: "lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!902 = distinct !DICompileUnit(language: DW_LANG_C11, file: !903, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !904, splitDebugInlining: false, nameTableKind: None)
!903 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!904 = !{!905}
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !906, line: 44, baseType: !98, size: 32, elements: !113)
!906 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!907 = distinct !DICompileUnit(language: DW_LANG_C11, file: !908, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!909 = distinct !DICompileUnit(language: DW_LANG_C11, file: !910, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-full-write.o -MD -MP -MF lib/.deps/libcoreutils_a-full-write.Tpo -c lib/full-write.c -o lib/.libcoreutils_a-full-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !911, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!911 = !{!149}
!912 = distinct !DICompileUnit(language: DW_LANG_C11, file: !913, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!914 = distinct !DICompileUnit(language: DW_LANG_C11, file: !915, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-safe-write.o -MD -MP -MF lib/.deps/libcoreutils_a-safe-write.Tpo -c lib/safe-write.c -o lib/.libcoreutils_a-safe-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !899, retainedTypes: !916, splitDebugInlining: false, nameTableKind: None)
!915 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!916 = !{!146}
!917 = distinct !DICompileUnit(language: DW_LANG_C11, file: !781, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !918, retainedTypes: !922, globals: !923, splitDebugInlining: false, nameTableKind: None)
!918 = !{!919}
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !781, line: 40, baseType: !98, size: 32, elements: !920)
!920 = !{!921}
!921 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!922 = !{!144}
!923 = !{!779, !782, !784, !786, !788, !790, !795, !800, !802, !804, !809, !814, !819, !821, !826, !831, !833, !838, !840, !842, !844, !846, !848, !850}
!924 = distinct !DICompileUnit(language: DW_LANG_C11, file: !925, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalignalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xalignalloc.Tpo -c lib/xalignalloc.c -o lib/.libcoreutils_a-xalignalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !916, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "lib/xalignalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3b950fafb945919ba44141bc7f11141c")
!926 = distinct !DICompileUnit(language: DW_LANG_C11, file: !927, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !928, retainedTypes: !958, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!928 = !{!929, !941}
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !930, file: !927, line: 188, baseType: !98, size: 32, elements: !939)
!930 = distinct !DISubprogram(name: "x2nrealloc", scope: !927, file: !927, line: 176, type: !931, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !926, retainedNodes: !934)
!931 = !DISubroutineType(types: !932)
!932 = !{!144, !144, !933, !146}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!934 = !{!935, !936, !937, !938}
!935 = !DILocalVariable(name: "p", arg: 1, scope: !930, file: !927, line: 176, type: !144)
!936 = !DILocalVariable(name: "pn", arg: 2, scope: !930, file: !927, line: 176, type: !933)
!937 = !DILocalVariable(name: "s", arg: 3, scope: !930, file: !927, line: 176, type: !146)
!938 = !DILocalVariable(name: "n", scope: !930, file: !927, line: 178, type: !146)
!939 = !{!940}
!940 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!941 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !942, file: !927, line: 228, baseType: !98, size: 32, elements: !939)
!942 = distinct !DISubprogram(name: "xpalloc", scope: !927, file: !927, line: 223, type: !943, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !926, retainedNodes: !948)
!943 = !DISubroutineType(types: !944)
!944 = !{!144, !144, !945, !946, !503, !946}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !947, line: 130, baseType: !503)
!947 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956, !957}
!949 = !DILocalVariable(name: "pa", arg: 1, scope: !942, file: !927, line: 223, type: !144)
!950 = !DILocalVariable(name: "pn", arg: 2, scope: !942, file: !927, line: 223, type: !945)
!951 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !942, file: !927, line: 223, type: !946)
!952 = !DILocalVariable(name: "n_max", arg: 4, scope: !942, file: !927, line: 223, type: !503)
!953 = !DILocalVariable(name: "s", arg: 5, scope: !942, file: !927, line: 223, type: !946)
!954 = !DILocalVariable(name: "n0", scope: !942, file: !927, line: 230, type: !946)
!955 = !DILocalVariable(name: "n", scope: !942, file: !927, line: 237, type: !946)
!956 = !DILocalVariable(name: "nbytes", scope: !942, file: !927, line: 248, type: !946)
!957 = !DILocalVariable(name: "adjusted_nbytes", scope: !942, file: !927, line: 252, type: !946)
!958 = !{!88, !144}
!959 = distinct !DICompileUnit(language: DW_LANG_C11, file: !869, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !960, splitDebugInlining: false, nameTableKind: None)
!960 = !{!867, !870, !872}
!961 = distinct !DICompileUnit(language: DW_LANG_C11, file: !962, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!963 = distinct !DICompileUnit(language: DW_LANG_C11, file: !964, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!964 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!965 = distinct !DICompileUnit(language: DW_LANG_C11, file: !966, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !922, splitDebugInlining: false, nameTableKind: None)
!966 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!967 = distinct !DICompileUnit(language: DW_LANG_C11, file: !968, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !922, splitDebugInlining: false, nameTableKind: None)
!968 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!969 = distinct !DICompileUnit(language: DW_LANG_C11, file: !970, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !922, splitDebugInlining: false, nameTableKind: None)
!970 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!971 = distinct !DICompileUnit(language: DW_LANG_C11, file: !894, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !972, splitDebugInlining: false, nameTableKind: None)
!972 = !{!892, !895}
!973 = distinct !DICompileUnit(language: DW_LANG_C11, file: !974, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!975 = distinct !DICompileUnit(language: DW_LANG_C11, file: !976, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !922, splitDebugInlining: false, nameTableKind: None)
!976 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!977 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!978 = !{i32 7, !"Dwarf Version", i32 5}
!979 = !{i32 2, !"Debug Info Version", i32 3}
!980 = !{i32 1, !"wchar_size", i32 4}
!981 = !{i32 8, !"PIC Level", i32 2}
!982 = !{i32 7, !"PIE Level", i32 2}
!983 = !{i32 7, !"uwtable", i32 2}
!984 = !{i32 7, !"frame-pointer", i32 1}
!985 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!986 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 83, type: !987, scopeLine: 84, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !989)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !86}
!989 = !{!990}
!990 = !DILocalVariable(name: "status", arg: 1, scope: !986, file: !2, line: 83, type: !86)
!991 = !DILocation(line: 0, scope: !986)
!992 = !DILocation(line: 85, column: 14, scope: !993)
!993 = distinct !DILexicalBlock(scope: !986, file: !2, line: 85, column: 7)
!994 = !DILocation(line: 85, column: 7, scope: !986)
!995 = !DILocation(line: 86, column: 5, scope: !996)
!996 = distinct !DILexicalBlock(scope: !993, file: !2, line: 86, column: 5)
!997 = !{!998, !998, i64 0}
!998 = !{!"any pointer", !999, i64 0}
!999 = !{!"omnipotent char", !1000, i64 0}
!1000 = !{!"Simple C/C++ TBAA"}
!1001 = !DILocation(line: 89, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !993, file: !2, line: 88, column: 5)
!1003 = !DILocation(line: 93, column: 7, scope: !1002)
!1004 = !DILocation(line: 729, column: 3, scope: !1005, inlinedAt: !1006)
!1005 = distinct !DISubprogram(name: "emit_stdin_note", scope: !92, file: !92, line: 727, type: !616, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89)
!1006 = distinct !DILocation(line: 97, column: 7, scope: !1002)
!1007 = !DILocation(line: 99, column: 7, scope: !1002)
!1008 = !DILocation(line: 102, column: 7, scope: !1002)
!1009 = !DILocation(line: 105, column: 7, scope: !1002)
!1010 = !DILocation(line: 108, column: 7, scope: !1002)
!1011 = !DILocation(line: 111, column: 7, scope: !1002)
!1012 = !DILocation(line: 114, column: 7, scope: !1002)
!1013 = !DILocation(line: 117, column: 7, scope: !1002)
!1014 = !DILocation(line: 120, column: 7, scope: !1002)
!1015 = !DILocation(line: 123, column: 7, scope: !1002)
!1016 = !DILocation(line: 126, column: 7, scope: !1002)
!1017 = !DILocation(line: 129, column: 7, scope: !1002)
!1018 = !DILocation(line: 130, column: 7, scope: !1002)
!1019 = !DILocation(line: 131, column: 7, scope: !1002)
!1020 = !DILocalVariable(name: "program", arg: 1, scope: !1021, file: !92, line: 836, type: !149)
!1021 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !92, file: !92, line: 836, type: !1022, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1024)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !149}
!1024 = !{!1020, !1025, !1032, !1033, !1035, !1036}
!1025 = !DILocalVariable(name: "infomap", scope: !1021, file: !92, line: 838, type: !1026)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 896, elements: !161)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1021, file: !92, line: 838, size: 128, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1028, file: !92, line: 838, baseType: !149, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1028, file: !92, line: 838, baseType: !149, size: 64, offset: 64)
!1032 = !DILocalVariable(name: "node", scope: !1021, file: !92, line: 848, type: !149)
!1033 = !DILocalVariable(name: "map_prog", scope: !1021, file: !92, line: 849, type: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1035 = !DILocalVariable(name: "lc_messages", scope: !1021, file: !92, line: 861, type: !149)
!1036 = !DILocalVariable(name: "url_program", scope: !1021, file: !92, line: 874, type: !149)
!1037 = !DILocation(line: 0, scope: !1021, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 138, column: 7, scope: !1002)
!1039 = !{}
!1040 = !DILocation(line: 857, column: 3, scope: !1021, inlinedAt: !1038)
!1041 = !DILocation(line: 861, column: 29, scope: !1021, inlinedAt: !1038)
!1042 = !DILocation(line: 862, column: 7, scope: !1043, inlinedAt: !1038)
!1043 = distinct !DILexicalBlock(scope: !1021, file: !92, line: 862, column: 7)
!1044 = !DILocation(line: 862, column: 19, scope: !1043, inlinedAt: !1038)
!1045 = !DILocation(line: 862, column: 22, scope: !1043, inlinedAt: !1038)
!1046 = !DILocation(line: 862, column: 7, scope: !1021, inlinedAt: !1038)
!1047 = !DILocation(line: 868, column: 7, scope: !1048, inlinedAt: !1038)
!1048 = distinct !DILexicalBlock(scope: !1043, file: !92, line: 863, column: 5)
!1049 = !DILocation(line: 870, column: 5, scope: !1048, inlinedAt: !1038)
!1050 = !DILocation(line: 875, column: 3, scope: !1021, inlinedAt: !1038)
!1051 = !DILocation(line: 877, column: 3, scope: !1021, inlinedAt: !1038)
!1052 = !DILocation(line: 140, column: 3, scope: !986)
!1053 = !DISubprogram(name: "dcgettext", scope: !1054, file: !1054, line: 51, type: !1055, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1054 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!88, !149, !149, !86}
!1057 = !DISubprogram(name: "__fprintf_chk", scope: !1058, file: !1058, line: 93, type: !1059, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1058 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!86, !1061, !86, !1062, null}
!1061 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !287)
!1062 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !149)
!1063 = !DISubprogram(name: "__printf_chk", scope: !1058, file: !1058, line: 95, type: !1064, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!86, !86, !1062, null}
!1066 = !DISubprogram(name: "fputs_unlocked", scope: !518, file: !518, line: 691, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!86, !1062, !1061}
!1069 = !DILocation(line: 0, scope: !264)
!1070 = !DILocation(line: 581, column: 7, scope: !272)
!1071 = !{!1072, !1072, i64 0}
!1072 = !{!"int", !999, i64 0}
!1073 = !DILocation(line: 581, column: 19, scope: !272)
!1074 = !DILocation(line: 581, column: 7, scope: !264)
!1075 = !DILocation(line: 585, column: 26, scope: !271)
!1076 = !DILocation(line: 0, scope: !271)
!1077 = !DILocation(line: 586, column: 23, scope: !271)
!1078 = !DILocation(line: 586, column: 28, scope: !271)
!1079 = !DILocation(line: 586, column: 32, scope: !271)
!1080 = !{!999, !999, i64 0}
!1081 = !DILocation(line: 586, column: 38, scope: !271)
!1082 = !DILocalVariable(name: "__s1", arg: 1, scope: !1083, file: !1084, line: 1359, type: !149)
!1083 = distinct !DISubprogram(name: "streq", scope: !1084, file: !1084, line: 1359, type: !1085, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1087)
!1084 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!274, !149, !149}
!1087 = !{!1082, !1088}
!1088 = !DILocalVariable(name: "__s2", arg: 2, scope: !1083, file: !1084, line: 1359, type: !149)
!1089 = !DILocation(line: 0, scope: !1083, inlinedAt: !1090)
