; ModuleID = 'src/chown.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.11 }
%union.anon.11 = type { i32 }
%struct.Chown_option = type { i32, i8, ptr, i8, i8, ptr, ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!200 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!201 = !{!0, !7, !12, !17, !22, !27, !32, !34, !36, !41, !46, !51, !56, !61, !66, !71, !76, !78, !83, !88, !93, !98, !103, !108, !113, !118, !123, !128, !202, !207, !212, !217, !222, !227, !229, !234, !239, !244, !341, !343, !345, !424, !429, !431, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !459, !461, !463, !465, !467, !469, !471, !476, !481, !486, !491, !493, !495, !497, !499, !504, !509, !511, !516, !518, !523, !525, !527, !529, !534, !536, !541, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !565, !133}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 7)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 14)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 16)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 13)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 42)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 298, type: !214, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 300, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 25)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 31)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !246, file: !2, line: 353, type: !272, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 178, type: !247, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !135, retainedNodes: !250)
!247 = !DISubroutineType(types: !248)
!248 = !{!158, !158, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!250 = !{!251, !252, !253, !255, !260, !263, !264, !265, !285, !286, !290, !291, !295, !296, !297, !333, !335, !336, !337, !340}
!251 = !DILocalVariable(name: "argc", arg: 1, scope: !246, file: !2, line: 178, type: !158)
!252 = !DILocalVariable(name: "argv", arg: 2, scope: !246, file: !2, line: 178, type: !249)
!253 = !DILocalVariable(name: "preserve_root", scope: !246, file: !2, line: 180, type: !254)
!254 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!255 = !DILocalVariable(name: "required_uid", scope: !246, file: !2, line: 184, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !257, line: 79, baseType: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !259, line: 146, baseType: !139)
!259 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!260 = !DILocalVariable(name: "required_gid", scope: !246, file: !2, line: 185, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !257, line: 64, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !259, line: 147, baseType: !139)
!263 = !DILocalVariable(name: "bit_flags", scope: !246, file: !2, line: 188, type: !158)
!264 = !DILocalVariable(name: "dereference", scope: !246, file: !2, line: 192, type: !158)
!265 = !DILocalVariable(name: "chopt", scope: !246, file: !2, line: 194, type: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !144, line: 44, size: 320, elements: !267)
!267 = !{!268, !269, !270, !281, !282, !283, !284}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !266, file: !144, line: 47, baseType: !143, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !266, file: !144, line: 50, baseType: !254, size: 8, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !266, file: !144, line: 54, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !273, line: 30, size: 128, elements: !274)
!273 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!274 = !{!275, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !272, file: !273, line: 32, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !257, line: 47, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !259, line: 148, baseType: !197)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !272, file: !273, line: 33, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !257, line: 59, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !259, line: 145, baseType: !197)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !266, file: !144, line: 57, baseType: !254, size: 8, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !266, file: !144, line: 60, baseType: !254, size: 8, offset: 136)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !266, file: !144, line: 63, baseType: !192, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !266, file: !144, line: 66, baseType: !192, size: 64, offset: 256)
!285 = !DILocalVariable(name: "optc", scope: !246, file: !2, line: 206, type: !158)
!286 = !DILocalVariable(name: "warn", scope: !287, file: !2, line: 247, type: !254)
!287 = distinct !DILexicalBlock(scope: !288, file: !2, line: 246, column: 11)
!288 = distinct !DILexicalBlock(scope: !289, file: !2, line: 211, column: 9)
!289 = distinct !DILexicalBlock(scope: !246, file: !2, line: 209, column: 5)
!290 = !DILocalVariable(name: "e", scope: !287, file: !2, line: 248, type: !198)
!291 = !DILocalVariable(name: "__errstatus", scope: !292, file: !2, line: 252, type: !294)
!292 = distinct !DILexicalBlock(scope: !293, file: !2, line: 252, column: 15)
!293 = distinct !DILexicalBlock(scope: !287, file: !2, line: 251, column: 17)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!295 = !DILocalVariable(name: "uid", scope: !246, file: !2, line: 304, type: !256)
!296 = !DILocalVariable(name: "gid", scope: !246, file: !2, line: 305, type: !261)
!297 = !DILocalVariable(name: "ref_stats", scope: !298, file: !2, line: 309, type: !300)
!298 = distinct !DILexicalBlock(scope: !299, file: !2, line: 308, column: 5)
!299 = distinct !DILexicalBlock(scope: !246, file: !2, line: 307, column: 7)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !301, line: 44, size: 1024, elements: !302)
!301 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!302 = !{!303, !304, !305, !307, !309, !310, !311, !312, !313, !316, !318, !319, !321, !329, !330, !331}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !300, file: !301, line: 46, baseType: !280, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !300, file: !301, line: 47, baseType: !277, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !300, file: !301, line: 48, baseType: !306, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !259, line: 150, baseType: !139)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !300, file: !301, line: 49, baseType: !308, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !259, line: 151, baseType: !139)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !300, file: !301, line: 50, baseType: !258, size: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !300, file: !301, line: 51, baseType: !262, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !300, file: !301, line: 52, baseType: !280, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !300, file: !301, line: 53, baseType: !280, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !300, file: !301, line: 54, baseType: !314, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !259, line: 152, baseType: !315)
!315 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !300, file: !301, line: 55, baseType: !317, size: 32, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !259, line: 175, baseType: !158)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !300, file: !301, line: 56, baseType: !158, size: 32, offset: 480)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !300, file: !301, line: 57, baseType: !320, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !259, line: 180, baseType: !315)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !300, file: !301, line: 65, baseType: !322, size: 128, offset: 576)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !323, line: 11, size: 128, elements: !324)
!323 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !322, file: !323, line: 16, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !259, line: 160, baseType: !315)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !322, file: !323, line: 21, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !259, line: 197, baseType: !315)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !300, file: !301, line: 66, baseType: !322, size: 128, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !300, file: !301, line: 67, baseType: !322, size: 128, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !300, file: !301, line: 79, baseType: !332, size: 64, offset: 960)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !242)
!333 = !DILocalVariable(name: "ug", scope: !334, file: !2, line: 324, type: !192)
!334 = distinct !DILexicalBlock(scope: !299, file: !2, line: 323, column: 5)
!335 = !DILocalVariable(name: "warn", scope: !334, file: !2, line: 331, type: !254)
!336 = !DILocalVariable(name: "e", scope: !334, file: !2, line: 332, type: !198)
!337 = !DILocalVariable(name: "__errstatus", scope: !338, file: !2, line: 340, type: !294)
!338 = distinct !DILexicalBlock(scope: !339, file: !2, line: 340, column: 9)
!339 = distinct !DILexicalBlock(scope: !334, file: !2, line: 339, column: 11)
!340 = !DILocalVariable(name: "ok", scope: !246, file: !2, line: 361, type: !254)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !241, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "reference_file", scope: !135, file: !2, line: 41, type: !192, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !347, file: !157, line: 575, type: !158, isLocal: true, isDefinition: true)
!347 = distinct !DISubprogram(name: "oputs_", scope: !157, file: !157, line: 573, type: !348, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !135, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !198, !198}
!350 = !{!351, !352, !353, !356, !357, !358, !359, !363, !364, !365, !366, !368, !418, !419, !420, !422, !423}
!351 = !DILocalVariable(name: "program", arg: 1, scope: !347, file: !157, line: 573, type: !198)
!352 = !DILocalVariable(name: "option", arg: 2, scope: !347, file: !157, line: 573, type: !198)
!353 = !DILocalVariable(name: "term", scope: !354, file: !157, line: 585, type: !198)
!354 = distinct !DILexicalBlock(scope: !355, file: !157, line: 582, column: 5)
!355 = distinct !DILexicalBlock(scope: !347, file: !157, line: 581, column: 7)
!356 = !DILocalVariable(name: "double_space", scope: !347, file: !157, line: 594, type: !254)
!357 = !DILocalVariable(name: "first_word", scope: !347, file: !157, line: 595, type: !198)
!358 = !DILocalVariable(name: "option_text", scope: !347, file: !157, line: 596, type: !198)
!359 = !DILocalVariable(name: "s", scope: !360, file: !157, line: 608, type: !198)
!360 = distinct !DILexicalBlock(scope: !361, file: !157, line: 605, column: 5)
!361 = distinct !DILexicalBlock(scope: !362, file: !157, line: 604, column: 12)
!362 = distinct !DILexicalBlock(scope: !347, file: !157, line: 597, column: 7)
!363 = !DILocalVariable(name: "spaces", scope: !360, file: !157, line: 609, type: !195)
!364 = !DILocalVariable(name: "anchor_len", scope: !347, file: !157, line: 620, type: !195)
!365 = !DILocalVariable(name: "desc_text", scope: !347, file: !157, line: 625, type: !198)
!366 = !DILocalVariable(name: "__ptr", scope: !367, file: !157, line: 644, type: !198)
!367 = distinct !DILexicalBlock(scope: !347, file: !157, line: 644, column: 3)
!368 = !DILocalVariable(name: "__stream", scope: !367, file: !157, line: 644, type: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !371, line: 7, baseType: !372)
!371 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !373, line: 49, size: 1728, elements: !374)
!373 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !390, !392, !393, !394, !395, !396, !398, !399, !402, !404, !407, !410, !411, !412, !413, !414}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !372, file: !373, line: 51, baseType: !158, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !372, file: !373, line: 54, baseType: !192, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !372, file: !373, line: 55, baseType: !192, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !372, file: !373, line: 56, baseType: !192, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !372, file: !373, line: 57, baseType: !192, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !372, file: !373, line: 58, baseType: !192, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !372, file: !373, line: 59, baseType: !192, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !372, file: !373, line: 60, baseType: !192, size: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !372, file: !373, line: 61, baseType: !192, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !372, file: !373, line: 64, baseType: !192, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !372, file: !373, line: 65, baseType: !192, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !372, file: !373, line: 66, baseType: !192, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !372, file: !373, line: 68, baseType: !388, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !373, line: 36, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !372, file: !373, line: 70, baseType: !391, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !372, file: !373, line: 72, baseType: !158, size: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !372, file: !373, line: 73, baseType: !158, size: 32, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !372, file: !373, line: 74, baseType: !314, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !372, file: !373, line: 77, baseType: !194, size: 16, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !372, file: !373, line: 78, baseType: !397, size: 8, offset: 1040)
!397 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !372, file: !373, line: 79, baseType: !115, size: 8, offset: 1048)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !372, file: !373, line: 81, baseType: !400, size: 64, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !373, line: 43, baseType: null)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !372, file: !373, line: 89, baseType: !403, size: 64, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !259, line: 153, baseType: !315)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !372, file: !373, line: 91, baseType: !405, size: 64, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !373, line: 37, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !372, file: !373, line: 92, baseType: !408, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !373, line: 38, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !372, file: !373, line: 93, baseType: !391, size: 64, offset: 1344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !372, file: !373, line: 94, baseType: !193, size: 64, offset: 1408)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !372, file: !373, line: 95, baseType: !195, size: 64, offset: 1472)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !372, file: !373, line: 96, baseType: !158, size: 32, offset: 1536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !372, file: !373, line: 98, baseType: !415, size: 160, offset: 1568)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 20)
!418 = !DILocalVariable(name: "__cnt", scope: !367, file: !157, line: 644, type: !195)
!419 = !DILocalVariable(name: "url_program", scope: !347, file: !157, line: 648, type: !198)
!420 = !DILocalVariable(name: "__ptr", scope: !421, file: !157, line: 686, type: !198)
!421 = distinct !DILexicalBlock(scope: !347, file: !157, line: 686, column: 3)
!422 = !DILocalVariable(name: "__stream", scope: !421, file: !157, line: 686, type: !369)
!423 = !DILocalVariable(name: "__cnt", scope: !421, file: !157, line: 686, type: !195)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !157, line: 585, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 5)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !157, line: 586, type: !426, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !157, line: 595, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 4)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !157, line: 620, type: !19, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !241, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !426, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !433, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !85, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !157, line: 650, type: !426, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !19, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !19, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !157, line: 652, type: !204, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !157, line: 653, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 8)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !157, line: 654, type: !120, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !157, line: 655, type: !120, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !157, line: 656, type: !120, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !157, line: 657, type: !120, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !157, line: 663, type: !204, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !157, line: 664, type: !120, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 17)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 40)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 15)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 61)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !157, line: 679, type: !85, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !157, line: 683, type: !426, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !157, line: 688, type: !426, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !157, line: 691, type: !456, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !157, line: 801, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1464, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 183)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !157, line: 808, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 83)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !157, line: 812, type: !48, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !157, line: 816, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 51)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !157, line: 839, type: !214, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !157, line: 840, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 22)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !157, line: 841, type: !483, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !157, line: 862, type: !433, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !157, line: 868, type: !48, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !157, line: 875, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 27)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !513, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 12)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !120, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !456, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !538, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !426, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !483, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !473, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !209, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !19, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !204, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !120, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !456, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !426, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !456, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 3584, elements: !210)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !570, line: 50, size: 256, elements: !571)
!570 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!571 = !{!572, !573, !574, !576}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !569, file: !570, line: 52, baseType: !198, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !569, file: !570, line: 55, baseType: !158, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !570, line: 56, baseType: !575, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !569, file: !570, line: 57, baseType: !158, size: 32, offset: 192)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !579, line: 557, type: !214, isLocal: true, isDefinition: true)
!579 = !DIFile(filename: "src/chown-core.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0cc937f337309996c839dc01ee932e6")
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !579, line: 569, type: !473, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !579, line: 297, type: !241, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !579, line: 297, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 45)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !579, line: 297, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 58)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !579, line: 297, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 49)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !579, line: 328, type: !473, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !579, line: 335, type: !85, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !579, line: 341, type: !231, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !579, line: 349, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 186)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !579, line: 385, type: !520, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !579, line: 473, type: !231, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !579, line: 473, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 21)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !579, line: 158, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 56)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !579, line: 171, type: !3, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !579, line: 172, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 35)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !579, line: 173, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 30)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !579, line: 178, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 48)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !579, line: 179, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 44)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !579, line: 180, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 34)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !579, line: 184, type: !478, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !579, line: 185, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 36)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !579, line: 193, type: !660, isLocal: true, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 32)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !579, line: 194, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 28)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !579, line: 195, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 26)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "chown_mode", scope: !675, file: !676, line: 2, type: !137, isLocal: false, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C11, file: !676, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/chown-chown.o -MD -MP -MF src/.deps/chown-chown.Tpo -c src/chown-chown.c -o src/.chown-chown.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !677, globals: !678, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "src/chown-chown.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3a1b210c35e4963aa8514922b01ea0b2")
!677 = !{!137}
!678 = !{!673}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !681, line: 3, type: !483, isLocal: true, isDefinition: true)
!681 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "Version", scope: !684, file: !681, line: 3, type: !198, isLocal: false, isDefinition: true)
!684 = distinct !DICompileUnit(language: DW_LANG_C11, file: !681, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !685, splitDebugInlining: false, nameTableKind: None)
!685 = !{!679, !682}
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "file_name", scope: !688, file: !689, line: 45, type: !198, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !690, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!690 = !{!691, !693, !695, !697, !686, !699}
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !689, line: 121, type: !204, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !689, line: 121, type: !538, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !689, line: 123, type: !204, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !689, line: 126, type: !85, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !688, file: !689, line: 55, type: !254, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !703, file: !704, line: 66, type: !751, isLocal: false, isDefinition: true)
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !704, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !705, globals: !706, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!705 = !{!193, !200}
!706 = !{!707, !709, !733, !735, !737, !739, !701, !741, !743, !745, !747, !749}
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !704, line: 272, type: !426, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "old_file_name", scope: !711, file: !704, line: 304, type: !198, isLocal: true, isDefinition: true)
!711 = distinct !DISubprogram(name: "verror_at_line", scope: !704, file: !704, line: 298, type: !712, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !703, retainedNodes: !726)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !158, !158, !198, !139, !198, !714}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !715, line: 52, baseType: !716)
!715 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !717, line: 12, baseType: !718)
!717 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !704, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !720)
!720 = !{!721, !722, !723, !724, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !719, file: !704, baseType: !193, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !719, file: !704, baseType: !193, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !719, file: !704, baseType: !193, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !719, file: !704, baseType: !158, size: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !719, file: !704, baseType: !158, size: 32, offset: 224)
!726 = !{!727, !728, !729, !730, !731, !732}
!727 = !DILocalVariable(name: "status", arg: 1, scope: !711, file: !704, line: 298, type: !158)
!728 = !DILocalVariable(name: "errnum", arg: 2, scope: !711, file: !704, line: 298, type: !158)
!729 = !DILocalVariable(name: "file_name", arg: 3, scope: !711, file: !704, line: 298, type: !198)
!730 = !DILocalVariable(name: "line_number", arg: 4, scope: !711, file: !704, line: 298, type: !139)
!731 = !DILocalVariable(name: "message", arg: 5, scope: !711, file: !704, line: 298, type: !198)
!732 = !DILocalVariable(name: "args", arg: 6, scope: !711, file: !704, line: 298, type: !714)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "old_line_number", scope: !711, file: !704, line: 305, type: !139, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !704, line: 338, type: !433, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !704, line: 346, type: !456, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !704, line: 346, type: !241, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "error_message_count", scope: !703, file: !704, line: 69, type: !139, isLocal: false, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !703, file: !704, line: 295, type: !158, isLocal: false, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !704, line: 208, type: !204, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !704, line: 208, type: !616, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !704, line: 214, type: !426, isLocal: true, isDefinition: true)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !756, line: 399, type: !241, isLocal: true, isDefinition: true)
!756 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !756, line: 441, type: !115, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !756, line: 1080, type: !85, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !763, line: 226, type: !125, isLocal: true, isDefinition: true)
!763 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !763, line: 227, type: !125, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !763, line: 228, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 33)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !763, line: 231, type: !125, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "default_tuning", scope: !775, file: !763, line: 134, type: !779, isLocal: true, isDefinition: true)
!775 = distinct !DICompileUnit(language: DW_LANG_C11, file: !763, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !776, globals: !778, splitDebugInlining: false, nameTableKind: None)
!776 = !{!197, !193, !777, !195}
!777 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!778 = !{!761, !764, !766, !771, !773}
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !781, line: 52, baseType: !782)
!781 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !781, line: 40, size: 160, elements: !783)
!783 = !{!784, !785, !786, !787, !788}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !782, file: !781, line: 45, baseType: !777, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !782, file: !781, line: 46, baseType: !777, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !782, file: !781, line: 47, baseType: !777, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !782, file: !781, line: 48, baseType: !777, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !782, file: !781, line: 49, baseType: !254, size: 8, offset: 128)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "program_name", scope: !791, file: !792, line: 31, type: !198, isLocal: false, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C11, file: !792, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !793, globals: !794, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!793 = !{!193, !192}
!794 = !{!789, !795, !797}
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !792, line: 46, type: !456, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !792, line: 49, type: !433, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "utf07FF", scope: !801, file: !802, line: 46, type: !829, isLocal: true, isDefinition: true)
!801 = distinct !DISubprogram(name: "proper_name_lite", scope: !802, file: !802, line: 38, type: !803, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !805, retainedNodes: !807)
!802 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!803 = !DISubroutineType(types: !804)
!804 = !{!198, !198, !198}
!805 = distinct !DICompileUnit(language: DW_LANG_C11, file: !802, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !806, splitDebugInlining: false, nameTableKind: None)
!806 = !{!799}
!807 = !{!808, !809, !810, !811, !816}
!808 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !801, file: !802, line: 38, type: !198)
!809 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !801, file: !802, line: 38, type: !198)
!810 = !DILocalVariable(name: "translation", scope: !801, file: !802, line: 40, type: !198)
!811 = !DILocalVariable(name: "w", scope: !801, file: !802, line: 47, type: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !813, line: 37, baseType: !814)
!813 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !259, line: 57, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !259, line: 42, baseType: !139)
!816 = !DILocalVariable(name: "mbs", scope: !801, file: !802, line: 48, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !818, line: 6, baseType: !819)
!818 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !820, line: 21, baseType: !821)
!820 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 13, size: 64, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !821, file: !820, line: 15, baseType: !158, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !821, file: !820, line: 20, baseType: !825, size: 32, offset: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !821, file: !820, line: 16, size: 32, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !825, file: !820, line: 18, baseType: !139, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !825, file: !820, line: 19, baseType: !433, size: 32)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 16, elements: !242)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !832, line: 78, type: !456, isLocal: true, isDefinition: true)
!832 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !832, line: 79, type: !19, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !832, line: 80, type: !219, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !832, line: 81, type: !219, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !832, line: 82, type: !415, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !832, line: 83, type: !241, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !832, line: 84, type: !456, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !832, line: 85, type: !204, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !832, line: 86, type: !204, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !832, line: 87, type: !456, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !853, file: !832, line: 76, type: !927, isLocal: false, isDefinition: true)
!853 = distinct !DICompileUnit(language: DW_LANG_C11, file: !832, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !854, retainedTypes: !862, globals: !863, splitDebugInlining: false, nameTableKind: None)
!854 = !{!855, !857, !176}
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !856, line: 42, baseType: !139, size: 32, elements: !164)
!856 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !856, line: 254, baseType: !139, size: 32, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!860 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!861 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!862 = !{!193, !158, !194, !195}
!863 = !{!830, !833, !835, !837, !839, !841, !843, !845, !847, !849, !851, !864, !868, !878, !880, !885, !887, !889, !891, !893, !916, !923, !925}
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !853, file: !832, line: 92, type: !866, isLocal: false, isDefinition: true)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 320, elements: !121)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !853, file: !832, line: 1040, type: !870, isLocal: false, isDefinition: true)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !832, line: 56, size: 448, elements: !871)
!871 = !{!872, !873, !874, !876, !877}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !870, file: !832, line: 59, baseType: !855, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !870, file: !832, line: 62, baseType: !158, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !870, file: !832, line: 66, baseType: !875, size: 256, offset: 64)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !457)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !870, file: !832, line: 69, baseType: !198, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !870, file: !832, line: 72, baseType: !198, size: 64, offset: 384)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !853, file: !832, line: 107, type: !870, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "slot0", scope: !853, file: !832, line: 831, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 256)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !832, line: 321, type: !241, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !832, line: 357, type: !241, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !832, line: 358, type: !241, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !832, line: 199, type: !204, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "quote", scope: !895, file: !832, line: 228, type: !914, isLocal: true, isDefinition: true)
!895 = distinct !DISubprogram(name: "gettext_quote", scope: !832, file: !832, line: 197, type: !896, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !853, retainedNodes: !898)
!896 = !DISubroutineType(types: !897)
!897 = !{!198, !198, !855}
!898 = !{!899, !900, !901, !902, !903}
!899 = !DILocalVariable(name: "msgid", arg: 1, scope: !895, file: !832, line: 197, type: !198)
!900 = !DILocalVariable(name: "s", arg: 2, scope: !895, file: !832, line: 197, type: !855)
!901 = !DILocalVariable(name: "translation", scope: !895, file: !832, line: 199, type: !198)
!902 = !DILocalVariable(name: "w", scope: !895, file: !832, line: 229, type: !812)
!903 = !DILocalVariable(name: "mbs", scope: !895, file: !832, line: 230, type: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !818, line: 6, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !820, line: 21, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 13, size: 64, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !906, file: !820, line: 15, baseType: !158, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !906, file: !820, line: 20, baseType: !910, size: 32, offset: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !906, file: !820, line: 16, size: 32, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !910, file: !820, line: 18, baseType: !139, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !910, file: !820, line: 19, baseType: !433, size: 32)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 64, elements: !915)
!915 = !{!243, !435}
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "slotvec", scope: !853, file: !832, line: 834, type: !918, isLocal: true, isDefinition: true)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !832, line: 823, size: 128, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !919, file: !832, line: 825, baseType: !195, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !919, file: !832, line: 826, baseType: !192, size: 64, offset: 64)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "nslots", scope: !853, file: !832, line: 832, type: !158, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "slotvec0", scope: !853, file: !832, line: 833, type: !919, isLocal: true, isDefinition: true)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 704, elements: !929)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!929 = !{!930}
!930 = !DISubrange(count: 11)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !933, line: 32, type: !241, isLocal: true, isDefinition: true)
!933 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !936, line: 274, type: !531, isLocal: true, isDefinition: true)
!936 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !936, line: 160, type: !219, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !936, line: 165, type: !115, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !936, line: 169, type: !219, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !936, line: 202, type: !209, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !936, line: 229, type: !204, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !949, line: 67, type: !538, isLocal: true, isDefinition: true)
!949 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !949, line: 69, type: !204, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !949, line: 83, type: !204, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !949, line: 83, type: !433, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !949, line: 85, type: !241, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !949, line: 88, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 171)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !949, line: 88, type: !648, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !949, line: 105, type: !214, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !949, line: 109, type: !969, isLocal: true, isDefinition: true)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 23)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !949, line: 113, type: !665, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !949, line: 120, type: !660, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !949, line: 127, type: !655, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !949, line: 134, type: !478, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !949, line: 142, type: !643, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !949, line: 150, type: !638, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !949, line: 159, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 52)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !949, line: 170, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 60)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !949, line: 248, type: !415, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !949, line: 248, type: !520, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !949, line: 254, type: !415, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !949, line: 254, type: !209, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !949, line: 254, type: !478, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !949, line: 259, type: !3, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !949, line: 259, type: !1008, isLocal: true, isDefinition: true)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 29)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1013, file: !1014, line: 26, type: !1016, isLocal: false, isDefinition: true)
!1013 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1014, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1015, splitDebugInlining: false, nameTableKind: None)
!1014 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1015 = !{!1011}
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 376, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 47)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1021, file: !1022, line: 24, type: !1024, isLocal: false, isDefinition: true)
!1021 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1022, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1023, splitDebugInlining: false, nameTableKind: None)
!1022 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1023 = !{!1019}
!1024 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1027, line: 34, type: !85, isLocal: true, isDefinition: true)
!1027 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(scope: null, file: !1027, line: 34, type: !204, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !1027, line: 34, type: !473, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 40, type: !1008, isLocal: true, isDefinition: true)
!1034 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 40, type: !1037, isLocal: true, isDefinition: true)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !929)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 40, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 624, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 78)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1045, line: 59, type: !125, isLocal: true, isDefinition: true)
!1045 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1045, line: 59, type: !14, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1045, line: 59, type: !1050, isLocal: true, isDefinition: true)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 536, elements: !74)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1053, file: !1054, line: 506, type: !158, isLocal: true, isDefinition: true)
!1053 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1054, file: !1054, line: 485, type: !1055, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1057, retainedNodes: !1059)
!1054 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!158, !158, !158}
!1057 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1054, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1058, splitDebugInlining: false, nameTableKind: None)
!1058 = !{!1051}
!1059 = !{!1060, !1061, !1062, !1063, !1066}
!1060 = !DILocalVariable(name: "fd", arg: 1, scope: !1053, file: !1054, line: 485, type: !158)
!1061 = !DILocalVariable(name: "target", arg: 2, scope: !1053, file: !1054, line: 485, type: !158)
!1062 = !DILocalVariable(name: "result", scope: !1053, file: !1054, line: 487, type: !158)
!1063 = !DILocalVariable(name: "flags", scope: !1064, file: !1054, line: 530, type: !158)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !1054, line: 529, column: 5)
!1065 = distinct !DILexicalBlock(scope: !1053, file: !1054, line: 528, column: 7)
!1066 = !DILocalVariable(name: "saved_errno", scope: !1067, file: !1054, line: 533, type: !158)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !1054, line: 532, column: 9)
!1068 = distinct !DILexicalBlock(scope: !1064, file: !1054, line: 531, column: 11)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !1071, line: 108, type: !115, isLocal: true, isDefinition: true)
!1071 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "internal_state", scope: !1074, file: !1071, line: 97, type: !1077, isLocal: true, isDefinition: true)
!1074 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1071, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1075, globals: !1076, splitDebugInlining: false, nameTableKind: None)
!1075 = !{!193, !195, !200}
!1076 = !{!1069, !1072}
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !818, line: 6, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !820, line: 21, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 13, size: 64, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1079, file: !820, line: 15, baseType: !158, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1079, file: !820, line: 20, baseType: !1083, size: 32, offset: 32)
!1083 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1079, file: !820, line: 16, size: 32, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1083, file: !820, line: 18, baseType: !139, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1083, file: !820, line: 19, baseType: !433, size: 32)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1089, line: 35, type: !241, isLocal: true, isDefinition: true)
!1089 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !1089, line: 35, type: !19, isLocal: true, isDefinition: true)
!1092 = distinct !DICompileUnit(language: DW_LANG_C11, file: !579, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/chown-core.o -MD -MP -MF src/.deps/chown-core.Tpo -c src/chown-core.c -o src/.chown-core.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1093, retainedTypes: !1107, globals: !1108, splitDebugInlining: false, nameTableKind: None)
!1093 = !{!143, !162, !1094, !1101}
!1094 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !579, line: 38, baseType: !139, size: 32, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DIEnumerator(name: "RC_ok", value: 2)
!1097 = !DIEnumerator(name: "RC_excluded", value: 3)
!1098 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!1099 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!1100 = !DIEnumerator(name: "RC_error", value: 6)
!1101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !144, line: 24, baseType: !139, size: 32, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106}
!1103 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!1104 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!1105 = !DIEnumerator(name: "CH_FAILED", value: 3)
!1106 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!1107 = !{!256, !261, !193}
!1108 = !{!577, !580, !582, !584, !589, !594, !599, !601, !603, !605, !610, !612, !614, !619, !624, !626, !631, !636, !641, !646, !651, !653, !658, !663, !668, !1109, !1111, !1113, !1118}
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(scope: null, file: !579, line: 199, type: !241, isLocal: true, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(scope: null, file: !579, line: 199, type: !473, isLocal: true, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !579, line: 199, type: !1115, isLocal: true, isDefinition: true)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 888, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 111)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !579, line: 132, type: !241, isLocal: true, isDefinition: true)
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fts.o -MD -MP -MF lib/.deps/libcoreutils_a-fts.Tpo -c lib/fts.c -o lib/.libcoreutils_a-fts.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1121, retainedTypes: !1270, globals: !1281, splitDebugInlining: false, nameTableKind: None)
!1121 = !{!1122, !1126, !1246, !1249, !1253, !1264, !1267}
!1122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !756, line: 159, baseType: !139, size: 32, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1125 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1126 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1128, file: !1127, line: 54, baseType: !139, size: 32, elements: !1244)
!1127 = !DIFile(filename: "lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1128 = distinct !DISubprogram(name: "setup_dir", scope: !1127, file: !1127, line: 50, type: !1129, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1120, retainedNodes: !1242)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!254, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1133, line: 233, baseType: !1134)
!1133 = !DIFile(filename: "lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1133, line: 115, size: 1024, elements: !1135)
!1135 = !{!1136, !1191, !1192, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1207, !1208, !1211, !1231}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1134, file: !1133, line: 116, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1133, line: 235, size: 1920, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1159, !1160, !1161, !1162, !1163, !1187}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1138, file: !1133, line: 236, baseType: !1137, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1138, file: !1133, line: 237, baseType: !1137, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1138, file: !1133, line: 238, baseType: !1137, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1138, file: !1133, line: 239, baseType: !1144, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1146, line: 127, baseType: !1147)
!1146 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1146, line: 127, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1138, file: !1133, line: 242, baseType: !315, size: 64, offset: 256)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1138, file: !1133, line: 243, baseType: !193, size: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1138, file: !1133, line: 244, baseType: !192, size: 64, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1138, file: !1133, line: 245, baseType: !192, size: 64, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1138, file: !1133, line: 246, baseType: !158, size: 32, offset: 512)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1138, file: !1133, line: 247, baseType: !158, size: 32, offset: 544)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1138, file: !1133, line: 248, baseType: !195, size: 64, offset: 576)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1138, file: !1133, line: 250, baseType: !1131, size: 64, offset: 640)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1138, file: !1133, line: 254, baseType: !1157, size: 64, offset: 704)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1158, line: 18, baseType: !315)
!1158 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1138, file: !1133, line: 256, baseType: !195, size: 64, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1138, file: !1133, line: 272, baseType: !194, size: 16, offset: 832)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1138, file: !1133, line: 276, baseType: !194, size: 16, offset: 848)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1138, file: !1133, line: 282, baseType: !194, size: 16, offset: 864)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1138, file: !1133, line: 284, baseType: !1164, size: 1024, offset: 896)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 1024, elements: !116)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !301, line: 44, size: 1024, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1184, !1185, !1186}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1165, file: !301, line: 46, baseType: !280, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1165, file: !301, line: 47, baseType: !277, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1165, file: !301, line: 48, baseType: !306, size: 32, offset: 128)
