; ModuleID = 'src/chroot.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct.group = type { ptr, ptr, i32, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [50 x i8] c"Usage: %s [OPTION]... NEWROOT [COMMAND [ARG]...]\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [50 x i8] c"Run COMMAND with root directory set to NEWROOT.\0A\0A\00", align 1, !dbg !12

!73 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!74 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!76 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!77 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!78 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!79 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!80 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!81 = !DIEnumerator(name: "c_quoting_style", value: 5)
!82 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!83 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!84 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!85 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!86 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 90, baseType: !74, size: 32, elements: !89)
!88 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!89 = !{!90, !91, !92, !93}
!90 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124)
!91 = !DIEnumerator(name: "EXIT_CANCELED", value: 125)
!92 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126)
!93 = !DIEnumerator(name: "EXIT_ENOENT", value: 127)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 48, baseType: !74, size: 32, elements: !95)
!95 = !{!96, !97, !98}
!96 = !DIEnumerator(name: "GROUPS", value: 256)
!97 = !DIEnumerator(name: "USERSPEC", value: 257)
!98 = !DIEnumerator(name: "SKIP_CHDIR", value: 258)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 337, baseType: !100, size: 32, elements: !101)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !{!102, !103}
!102 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!103 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 46, baseType: !74, size: 32, elements: !106)
!105 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!107 = !DIEnumerator(name: "_ISupper", value: 256)
!108 = !DIEnumerator(name: "_ISlower", value: 512)
!109 = !DIEnumerator(name: "_ISalpha", value: 1024)
!110 = !DIEnumerator(name: "_ISdigit", value: 2048)
!111 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!112 = !DIEnumerator(name: "_ISspace", value: 8192)
!113 = !DIEnumerator(name: "_ISprint", value: 16384)
!114 = !DIEnumerator(name: "_ISgraph", value: 32768)
!115 = !DIEnumerator(name: "_ISblank", value: 1)
!116 = !DIEnumerator(name: "_IScntrl", value: 2)
!117 = !DIEnumerator(name: "_ISpunct", value: 4)
!118 = !DIEnumerator(name: "_ISalnum", value: 8)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !120, line: 30, baseType: !74, size: 32, elements: !121)
!120 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!121 = !{!122, !123, !124, !125, !126}
!122 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!123 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!124 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!125 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!126 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!127 = !{!128, !129, !130, !100, !135, !136, !138, !140, !141, !144, !146, !155}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !131, line: 102, baseType: !132)
!131 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !133, line: 73, baseType: !134)
!133 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !137, line: 18, baseType: !134)
!137 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !142, line: 79, baseType: !143)
!142 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !133, line: 146, baseType: !74)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !142, line: 64, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !133, line: 147, baseType: !74)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !148, line: 42, size: 256, elements: !149)
!148 = !DIFile(filename: "/usr/include/grp.h", directory: "", checksumkind: CSK_MD5, checksum: "17838c4acd24e08e5bed6821e9e2c084")
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !147, file: !148, line: 44, baseType: !128, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !147, file: !148, line: 45, baseType: !128, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !147, file: !148, line: 46, baseType: !145, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !147, file: !148, line: 47, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !131, line: 87, baseType: !156)
!156 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!157 = !{!0, !7, !12, !14, !19, !24, !29, !34, !39, !41, !46, !51, !56, !61, !66, !158, !163, !168, !173, !178, !183, !188, !193, !198, !203, !205, !210, !215, !217, !222, !227, !232, !313, !318, !320, !325, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !347, !349, !351, !353, !355, !357, !362, !364, !366, !371, !373, !375, !377, !379, !384, !386, !388, !390, !392, !397, !402, !407, !412, !414, !419, !424, !426, !68, !428, !430, !432}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 14)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 15)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 279, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 16)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 288, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 56)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 331, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 35)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 335, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 31)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 6)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 8)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !2, line: 344, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 3)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !200, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 40)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 34)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 416, type: !212, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 422, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 23)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 425, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 22)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 431, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 25)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !234, file: !88, line: 575, type: !100, isLocal: true, isDefinition: true)
!234 = distinct !DISubprogram(name: "oputs_", scope: !88, file: !88, line: 573, type: !235, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !237)
!235 = !DISubroutineType(cc: DW_CC_nocall, types: !236)
!236 = !{null, !138, !138}
!237 = !{!238, !239, !240, !243, !245, !246, !247, !251, !252, !253, !254, !256, !307, !308, !309, !311, !312}
!238 = !DILocalVariable(name: "program", arg: 1, scope: !234, file: !88, line: 573, type: !138)
!239 = !DILocalVariable(name: "option", arg: 2, scope: !234, file: !88, line: 573, type: !138)
!240 = !DILocalVariable(name: "term", scope: !241, file: !88, line: 585, type: !138)
!241 = distinct !DILexicalBlock(scope: !242, file: !88, line: 582, column: 5)
!242 = distinct !DILexicalBlock(scope: !234, file: !88, line: 581, column: 7)
!243 = !DILocalVariable(name: "double_space", scope: !234, file: !88, line: 594, type: !244)
!244 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!245 = !DILocalVariable(name: "first_word", scope: !234, file: !88, line: 595, type: !138)
!246 = !DILocalVariable(name: "option_text", scope: !234, file: !88, line: 596, type: !138)
!247 = !DILocalVariable(name: "s", scope: !248, file: !88, line: 608, type: !138)
!248 = distinct !DILexicalBlock(scope: !249, file: !88, line: 605, column: 5)
!249 = distinct !DILexicalBlock(scope: !250, file: !88, line: 604, column: 12)
!250 = distinct !DILexicalBlock(scope: !234, file: !88, line: 597, column: 7)
!251 = !DILocalVariable(name: "spaces", scope: !248, file: !88, line: 609, type: !136)
!252 = !DILocalVariable(name: "anchor_len", scope: !234, file: !88, line: 620, type: !136)
!253 = !DILocalVariable(name: "desc_text", scope: !234, file: !88, line: 625, type: !138)
!254 = !DILocalVariable(name: "__ptr", scope: !255, file: !88, line: 644, type: !138)
!255 = distinct !DILexicalBlock(scope: !234, file: !88, line: 644, column: 3)
!256 = !DILocalVariable(name: "__stream", scope: !255, file: !88, line: 644, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !259, line: 7, baseType: !260)
!259 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !261, line: 49, size: 1728, elements: !262)
!261 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !278, !280, !281, !282, !284, !285, !287, !288, !291, !293, !296, !299, !300, !301, !302, !303}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !260, file: !261, line: 51, baseType: !100, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !260, file: !261, line: 54, baseType: !128, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !260, file: !261, line: 55, baseType: !128, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !260, file: !261, line: 56, baseType: !128, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !260, file: !261, line: 57, baseType: !128, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !260, file: !261, line: 58, baseType: !128, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !260, file: !261, line: 59, baseType: !128, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !260, file: !261, line: 60, baseType: !128, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !260, file: !261, line: 61, baseType: !128, size: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !260, file: !261, line: 64, baseType: !128, size: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !260, file: !261, line: 65, baseType: !128, size: 64, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !260, file: !261, line: 66, baseType: !128, size: 64, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !260, file: !261, line: 68, baseType: !276, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !261, line: 36, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !260, file: !261, line: 70, baseType: !279, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !260, file: !261, line: 72, baseType: !100, size: 32, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !260, file: !261, line: 73, baseType: !100, size: 32, offset: 928)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !260, file: !261, line: 74, baseType: !283, size: 64, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !133, line: 152, baseType: !156)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !260, file: !261, line: 77, baseType: !135, size: 16, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !260, file: !261, line: 78, baseType: !286, size: 8, offset: 1040)
!286 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !260, file: !261, line: 79, baseType: !53, size: 8, offset: 1048)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !260, file: !261, line: 81, baseType: !289, size: 64, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !261, line: 43, baseType: null)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !260, file: !261, line: 89, baseType: !292, size: 64, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !133, line: 153, baseType: !156)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !260, file: !261, line: 91, baseType: !294, size: 64, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !261, line: 37, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !260, file: !261, line: 92, baseType: !297, size: 64, offset: 1280)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !261, line: 38, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !260, file: !261, line: 93, baseType: !279, size: 64, offset: 1344)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !260, file: !261, line: 94, baseType: !129, size: 64, offset: 1408)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !260, file: !261, line: 95, baseType: !136, size: 64, offset: 1472)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !260, file: !261, line: 96, baseType: !100, size: 32, offset: 1536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !260, file: !261, line: 98, baseType: !304, size: 160, offset: 1568)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 20)
!307 = !DILocalVariable(name: "__cnt", scope: !255, file: !88, line: 644, type: !136)
!308 = !DILocalVariable(name: "url_program", scope: !234, file: !88, line: 648, type: !138)
!309 = !DILocalVariable(name: "__ptr", scope: !310, file: !88, line: 686, type: !138)
!310 = distinct !DILexicalBlock(scope: !234, file: !88, line: 686, column: 3)
!311 = !DILocalVariable(name: "__stream", scope: !310, file: !88, line: 686, type: !257)
!312 = !DILocalVariable(name: "__cnt", scope: !310, file: !88, line: 686, type: !136)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !88, line: 585, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 5)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !88, line: 586, type: !315, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !88, line: 595, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 4)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !88, line: 620, type: !190, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !88, line: 648, type: !36, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !88, line: 648, type: !315, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !88, line: 649, type: !322, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !88, line: 649, type: !200, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !88, line: 650, type: !315, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !88, line: 651, type: !190, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !88, line: 651, type: !190, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !88, line: 652, type: !16, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !88, line: 653, type: !195, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !88, line: 654, type: !58, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !88, line: 655, type: !58, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !88, line: 656, type: !58, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !88, line: 657, type: !58, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !88, line: 663, type: !16, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !88, line: 664, type: !58, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !88, line: 669, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 17)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !88, line: 669, type: !207, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !88, line: 676, type: !165, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !88, line: 676, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 61)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !88, line: 679, type: !200, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !88, line: 683, type: !315, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !88, line: 688, type: !315, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !88, line: 691, type: !195, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !88, line: 826, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1440, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 180)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !88, line: 839, type: !170, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !88, line: 840, type: !224, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !88, line: 841, type: !165, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !88, line: 862, type: !322, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !88, line: 868, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 71)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !88, line: 875, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 27)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !88, line: 877, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 51)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !88, line: 877, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 12)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !16, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 9)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 11)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !315, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !195, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !36, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 137, type: !359, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !224, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 1536, elements: !191)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !437, line: 50, size: 256, elements: !438)
!437 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!438 = !{!439, !440, !441, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !437, line: 52, baseType: !138, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !436, file: !437, line: 55, baseType: !100, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !437, line: 56, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !436, file: !437, line: 57, baseType: !100, size: 32, offset: 192)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !446, line: 3, type: !165, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "Version", scope: !449, file: !446, line: 3, type: !138, isLocal: false, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C11, file: !446, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !450, splitDebugInlining: false, nameTableKind: None)
!450 = !{!444, !447}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "file_name", scope: !453, file: !454, line: 45, type: !138, isLocal: true, isDefinition: true)
!453 = distinct !DICompileUnit(language: DW_LANG_C11, file: !454, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !455, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!455 = !{!456, !458, !460, !462, !451, !464}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !454, line: 121, type: !16, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !454, line: 121, type: !409, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !454, line: 123, type: !16, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !454, line: 126, type: !200, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !453, file: !454, line: 55, type: !244, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !468, file: !469, line: 66, type: !519, isLocal: false, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C11, file: !469, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !470, globals: !471, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!470 = !{!129, !140}
!471 = !{!472, !474, !498, !500, !502, !504, !466, !506, !508, !510, !512, !517}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !469, line: 272, type: !315, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "old_file_name", scope: !476, file: !469, line: 304, type: !138, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "verror_at_line", scope: !469, file: !469, line: 298, type: !477, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !491)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !100, !100, !138, !74, !138, !479}
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !480, line: 52, baseType: !481)
!480 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !482, line: 12, baseType: !483)
!482 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !469, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !485)
!485 = !{!486, !487, !488, !489, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !484, file: !469, baseType: !129, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !484, file: !469, baseType: !129, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !484, file: !469, baseType: !129, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !484, file: !469, baseType: !100, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !484, file: !469, baseType: !100, size: 32, offset: 224)
!491 = !{!492, !493, !494, !495, !496, !497}
!492 = !DILocalVariable(name: "status", arg: 1, scope: !476, file: !469, line: 298, type: !100)
!493 = !DILocalVariable(name: "errnum", arg: 2, scope: !476, file: !469, line: 298, type: !100)
!494 = !DILocalVariable(name: "file_name", arg: 3, scope: !476, file: !469, line: 298, type: !138)
!495 = !DILocalVariable(name: "line_number", arg: 4, scope: !476, file: !469, line: 298, type: !74)
!496 = !DILocalVariable(name: "message", arg: 5, scope: !476, file: !469, line: 298, type: !138)
!497 = !DILocalVariable(name: "args", arg: 6, scope: !476, file: !469, line: 298, type: !479)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "old_line_number", scope: !476, file: !469, line: 305, type: !74, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !469, line: 338, type: !322, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !469, line: 346, type: !195, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !469, line: 346, type: !36, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "error_message_count", scope: !468, file: !469, line: 69, type: !74, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !468, file: !469, line: 295, type: !100, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !469, line: 208, type: !16, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !469, line: 208, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 21)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !469, line: 214, type: !315, isLocal: true, isDefinition: true)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null}
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "program_name", scope: !524, file: !525, line: 31, type: !138, isLocal: false, isDefinition: true)
!524 = distinct !DICompileUnit(language: DW_LANG_C11, file: !525, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !526, globals: !527, splitDebugInlining: false, nameTableKind: None)
!525 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!526 = !{!129, !128}
!527 = !{!522, !528, !530}
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !525, line: 46, type: !195, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !525, line: 49, type: !322, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "utf07FF", scope: !534, file: !535, line: 46, type: !562, isLocal: true, isDefinition: true)
!534 = distinct !DISubprogram(name: "proper_name_lite", scope: !535, file: !535, line: 38, type: !536, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !538, retainedNodes: !540)
!535 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!536 = !DISubroutineType(types: !537)
!537 = !{!138, !138, !138}
!538 = distinct !DICompileUnit(language: DW_LANG_C11, file: !535, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !539, splitDebugInlining: false, nameTableKind: None)
!539 = !{!532}
!540 = !{!541, !542, !543, !544, !549}
!541 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !534, file: !535, line: 38, type: !138)
!542 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !534, file: !535, line: 38, type: !138)
!543 = !DILocalVariable(name: "translation", scope: !534, file: !535, line: 40, type: !138)
!544 = !DILocalVariable(name: "w", scope: !534, file: !535, line: 47, type: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !546, line: 37, baseType: !547)
!546 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !133, line: 57, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !133, line: 42, baseType: !74)
!549 = !DILocalVariable(name: "mbs", scope: !534, file: !535, line: 48, type: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !551, line: 6, baseType: !552)
!551 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !553, line: 21, baseType: !554)
!553 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 13, size: 64, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !554, file: !553, line: 15, baseType: !100, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !554, file: !553, line: 20, baseType: !558, size: 32, offset: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !554, file: !553, line: 16, size: 32, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !558, file: !553, line: 18, baseType: !74, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !558, file: !553, line: 19, baseType: !322, size: 32)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 16, elements: !37)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !565, line: 78, type: !195, isLocal: true, isDefinition: true)
!565 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !565, line: 79, type: !190, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !565, line: 80, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 13)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !565, line: 81, type: !570, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !565, line: 82, type: !304, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !565, line: 83, type: !36, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !565, line: 84, type: !195, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !565, line: 85, type: !16, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !565, line: 86, type: !16, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !565, line: 87, type: !195, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !589, file: !565, line: 76, type: !663, isLocal: false, isDefinition: true)
!589 = distinct !DICompileUnit(language: DW_LANG_C11, file: !565, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !590, retainedTypes: !598, globals: !599, splitDebugInlining: false, nameTableKind: None)
!590 = !{!591, !593, !104}
!591 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !592, line: 42, baseType: !74, size: 32, elements: !75)
!592 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!593 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !592, line: 254, baseType: !74, size: 32, elements: !594)
!594 = !{!595, !596, !597}
!595 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!596 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!597 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!598 = !{!129, !100, !135, !136}
!599 = !{!563, !566, !568, !573, !575, !577, !579, !581, !583, !585, !587, !600, !604, !614, !616, !621, !623, !625, !627, !629, !652, !659, !661}
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !589, file: !565, line: 92, type: !602, isLocal: false, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 320, elements: !59)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !589, file: !565, line: 1040, type: !606, isLocal: false, isDefinition: true)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !565, line: 56, size: 448, elements: !607)
!607 = !{!608, !609, !610, !612, !613}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !606, file: !565, line: 59, baseType: !591, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !606, file: !565, line: 62, baseType: !100, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !606, file: !565, line: 66, baseType: !611, size: 256, offset: 64)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !196)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !606, file: !565, line: 69, baseType: !138, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !606, file: !565, line: 72, baseType: !138, size: 64, offset: 384)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !589, file: !565, line: 107, type: !606, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "slot0", scope: !589, file: !565, line: 831, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 256)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !565, line: 321, type: !36, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !565, line: 357, type: !36, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !565, line: 358, type: !36, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !565, line: 199, type: !16, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "quote", scope: !631, file: !565, line: 228, type: !650, isLocal: true, isDefinition: true)
!631 = distinct !DISubprogram(name: "gettext_quote", scope: !565, file: !565, line: 197, type: !632, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !589, retainedNodes: !634)
!632 = !DISubroutineType(types: !633)
!633 = !{!138, !138, !591}
!634 = !{!635, !636, !637, !638, !639}
!635 = !DILocalVariable(name: "msgid", arg: 1, scope: !631, file: !565, line: 197, type: !138)
!636 = !DILocalVariable(name: "s", arg: 2, scope: !631, file: !565, line: 197, type: !591)
!637 = !DILocalVariable(name: "translation", scope: !631, file: !565, line: 199, type: !138)
!638 = !DILocalVariable(name: "w", scope: !631, file: !565, line: 229, type: !545)
!639 = !DILocalVariable(name: "mbs", scope: !631, file: !565, line: 230, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !551, line: 6, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !553, line: 21, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 13, size: 64, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !642, file: !553, line: 15, baseType: !100, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !642, file: !553, line: 20, baseType: !646, size: 32, offset: 32)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !642, file: !553, line: 16, size: 32, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !646, file: !553, line: 18, baseType: !74, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !646, file: !553, line: 19, baseType: !322, size: 32)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !651)
!651 = !{!38, !324}
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "slotvec", scope: !589, file: !565, line: 834, type: !654, isLocal: true, isDefinition: true)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !565, line: 823, size: 128, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !655, file: !565, line: 825, baseType: !136, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !655, file: !565, line: 826, baseType: !128, size: 64, offset: 64)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "nslots", scope: !589, file: !565, line: 832, type: !100, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "slotvec0", scope: !589, file: !565, line: 833, type: !655, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 704, elements: !422)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !667, line: 274, type: !399, isLocal: true, isDefinition: true)
!667 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !667, line: 160, type: !570, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !667, line: 165, type: !53, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !667, line: 169, type: !570, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !667, line: 202, type: !160, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !667, line: 229, type: !16, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !680, line: 67, type: !409, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !680, line: 69, type: !16, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !680, line: 83, type: !16, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !680, line: 83, type: !322, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !680, line: 85, type: !36, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !680, line: 88, type: !691, isLocal: true, isDefinition: true)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 171)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !680, line: 88, type: !212, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !680, line: 105, type: !170, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !680, line: 109, type: !219, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !680, line: 113, type: !702, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 28)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !680, line: 120, type: !707, isLocal: true, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 32)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !680, line: 127, type: !712, isLocal: true, isDefinition: true)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 36)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !680, line: 134, type: !207, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !680, line: 142, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 44)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !680, line: 150, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 48)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !680, line: 159, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 52)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !680, line: 170, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 60)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !680, line: 248, type: !304, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !680, line: 248, type: !224, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !680, line: 254, type: !304, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !680, line: 254, type: !160, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !680, line: 254, type: !207, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !680, line: 259, type: !3, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !680, line: 259, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 29)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !756, file: !757, line: 26, type: !759, isLocal: false, isDefinition: true)
!756 = distinct !DICompileUnit(language: DW_LANG_C11, file: !757, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !758, splitDebugInlining: false, nameTableKind: None)
!757 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!758 = !{!754}
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 376, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 47)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "exit_failure", scope: !764, file: !765, line: 24, type: !767, isLocal: false, isDefinition: true)
!764 = distinct !DICompileUnit(language: DW_LANG_C11, file: !765, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !766, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!766 = !{!762}
!767 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !100)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !770, line: 34, type: !200, isLocal: true, isDefinition: true)
!770 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !770, line: 34, type: !16, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !770, line: 34, type: !359, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !777, line: 108, type: !53, isLocal: true, isDefinition: true)
!777 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "internal_state", scope: !780, file: !777, line: 97, type: !783, isLocal: true, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !781, globals: !782, splitDebugInlining: false, nameTableKind: None)
!781 = !{!129, !136, !140}
!782 = !{!775, !778}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !551, line: 6, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !553, line: 21, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 13, size: 64, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !785, file: !553, line: 15, baseType: !100, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !785, file: !553, line: 20, baseType: !789, size: 32, offset: 32)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !785, file: !553, line: 16, size: 32, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !789, file: !553, line: 18, baseType: !74, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !789, file: !553, line: 19, baseType: !322, size: 32)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !795, line: 35, type: !36, isLocal: true, isDefinition: true)
!795 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !795, line: 35, type: !190, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !800, line: 202, type: !16, isLocal: true, isDefinition: true)
!800 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !803, file: !800, line: 211, type: !988, isLocal: true, isDefinition: true)
!803 = distinct !DISubprogram(name: "printf_fetchargs", scope: !800, file: !800, line: 42, type: !804, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !979, retainedNodes: !983)
!804 = !DISubroutineType(types: !805)
!805 = !{!100, !806, !816}
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !807, line: 12, baseType: !808)
!807 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "7bd78a282b99fcfe41a9e3c566d14f7d")
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !800, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !810)
!810 = !{!811, !812, !813, !814, !815}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !809, file: !800, baseType: !129, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !809, file: !800, baseType: !129, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !809, file: !800, baseType: !129, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !809, file: !800, baseType: !100, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !809, file: !800, baseType: !100, size: 32, offset: 224)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !818, line: 185, baseType: !819)
!818 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !818, line: 179, size: 1920, elements: !820)
!820 = !{!821, !822, !977}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !819, file: !818, line: 181, baseType: !136, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !819, file: !818, line: 182, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !818, line: 174, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !818, line: 111, size: 256, elements: !826)
!826 = !{!827, !878}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !825, file: !818, line: 113, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !818, line: 108, baseType: !829)
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !818, line: 47, baseType: !74, size: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!831 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!832 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!833 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!834 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!835 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!836 = !DIEnumerator(name: "TYPE_INT", value: 5)
!837 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!838 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!839 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!840 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!841 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!842 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!843 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!844 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!845 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!846 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!847 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!848 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!849 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!850 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!851 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!852 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!853 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!854 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!855 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!856 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!857 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!858 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!859 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!860 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!861 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!862 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!863 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!864 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!865 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!866 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!867 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!868 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!869 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!870 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!871 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!872 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!873 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!874 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!875 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!876 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!877 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !825, file: !818, line: 172, baseType: !879, size: 128, offset: 128)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !825, file: !818, line: 114, size: 128, elements: !880)
!880 = !{!881, !882, !883, !885, !886, !887, !888, !889, !890, !892, !894, !898, !902, !905, !908, !911, !913, !916, !919, !921, !923, !925, !927, !929, !931, !933, !935, !937, !939, !941, !942, !945, !946, !951, !952, !954, !956, !957, !959, !961, !963, !965, !967, !969, !971, !973, !975}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !879, file: !818, line: 116, baseType: !286, size: 8)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !879, file: !818, line: 117, baseType: !140, size: 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !879, file: !818, line: 118, baseType: !884, size: 16)
!884 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !879, file: !818, line: 119, baseType: !135, size: 16)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !879, file: !818, line: 120, baseType: !100, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !879, file: !818, line: 121, baseType: !74, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !879, file: !818, line: 122, baseType: !156, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !879, file: !818, line: 123, baseType: !134, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !879, file: !818, line: 124, baseType: !891, size: 64)
!891 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !879, file: !818, line: 125, baseType: !893, size: 64)
!893 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !879, file: !818, line: 126, baseType: !895, size: 8)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !896, line: 24, baseType: !897)
!896 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !133, line: 37, baseType: !286)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !879, file: !818, line: 127, baseType: !899, size: 8)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !900, line: 24, baseType: !901)
!900 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !133, line: 38, baseType: !140)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !879, file: !818, line: 128, baseType: !903, size: 16)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !896, line: 25, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !133, line: 39, baseType: !884)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !879, file: !818, line: 129, baseType: !906, size: 16)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !900, line: 25, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !133, line: 40, baseType: !135)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !879, file: !818, line: 130, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !896, line: 26, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !133, line: 41, baseType: !100)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !879, file: !818, line: 131, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !900, line: 26, baseType: !548)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !879, file: !818, line: 132, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !896, line: 27, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !133, line: 44, baseType: !156)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !879, file: !818, line: 133, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !900, line: 27, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !133, line: 45, baseType: !134)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !879, file: !818, line: 134, baseType: !920, size: 8)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !131, line: 58, baseType: !286)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !879, file: !818, line: 135, baseType: !922, size: 8)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !131, line: 71, baseType: !140)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !879, file: !818, line: 136, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !131, line: 60, baseType: !156)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !879, file: !818, line: 137, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !131, line: 73, baseType: !134)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !879, file: !818, line: 138, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !131, line: 61, baseType: !156)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !879, file: !818, line: 139, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !131, line: 74, baseType: !134)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !879, file: !818, line: 140, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !131, line: 62, baseType: !156)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !879, file: !818, line: 141, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !131, line: 75, baseType: !134)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !879, file: !818, line: 142, baseType: !936, size: 32)
!936 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !879, file: !818, line: 143, baseType: !938, size: 64)
!938 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !879, file: !818, line: 144, baseType: !940, size: 128)
!940 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !879, file: !818, line: 145, baseType: !100, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !879, file: !818, line: 147, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !944, line: 20, baseType: !74)
!944 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!945 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !879, file: !818, line: 149, baseType: !138, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !879, file: !818, line: 150, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !950, line: 24, baseType: !74)
!950 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1bf0c51e90dd5eb05cdcc01afdea587a")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !879, file: !818, line: 151, baseType: !129, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !879, file: !818, line: 152, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !879, file: !818, line: 153, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !879, file: !818, line: 154, baseType: !442, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !879, file: !818, line: 155, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !879, file: !818, line: 156, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !879, file: !818, line: 157, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !879, file: !818, line: 158, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !879, file: !818, line: 159, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !879, file: !818, line: 160, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !879, file: !818, line: 161, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !879, file: !818, line: 162, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !879, file: !818, line: 163, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !879, file: !818, line: 164, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !819, file: !818, line: 183, baseType: !978, size: 1792, offset: 128)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 1792, elements: !17)
!979 = distinct !DICompileUnit(language: DW_LANG_C11, file: !800, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-printf-args.o -MD -MP -MF lib/.deps/libcoreutils_a-printf-args.Tpo -c lib/printf-args.c -o lib/.libcoreutils_a-printf-args.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !980, retainedTypes: !981, globals: !982, splitDebugInlining: false, nameTableKind: None)
!980 = !{!829}
!981 = !{!129, !949}
!982 = !{!798, !801}
!983 = !{!984, !985, !986, !987}
!984 = !DILocalVariable(name: "args", arg: 1, scope: !803, file: !800, line: 42, type: !806)
!985 = !DILocalVariable(name: "a", arg: 2, scope: !803, file: !800, line: 42, type: !816)
!986 = !DILocalVariable(name: "i", scope: !803, file: !800, line: 44, type: !136)
!987 = !DILocalVariable(name: "ap", scope: !803, file: !800, line: 45, type: !823)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 224, elements: !17)
!989 = distinct !DICompileUnit(language: DW_LANG_C11, file: !990, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!990 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!991 = distinct !DICompileUnit(language: DW_LANG_C11, file: !667, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-userspec.o -MD -MP -MF lib/.deps/libcoreutils_a-userspec.Tpo -c lib/userspec.c -o lib/.libcoreutils_a-userspec.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !992, retainedTypes: !995, globals: !996, splitDebugInlining: false, nameTableKind: None)
!992 = !{!993}
!993 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !994, line: 30, baseType: !74, size: 32, elements: !121)
!994 = !DIFile(filename: "lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!995 = !{!129, !141, !144}
!996 = !{!665, !668, !670, !672, !674, !676}
!997 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !998, retainedTypes: !1002, globals: !1003, splitDebugInlining: false, nameTableKind: None)
!998 = !{!999}
!999 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !680, line: 40, baseType: !74, size: 32, elements: !1000)
!1000 = !{!1001}
!1001 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1002 = !{!129}
!1003 = !{!678, !681, !683, !685, !687, !689, !694, !696, !698, !700, !705, !710, !715, !717, !722, !727, !732, !737, !739, !741, !743, !745, !747, !749}
!1004 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1005, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1006, retainedTypes: !1038, splitDebugInlining: false, nameTableKind: None)
!1005 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1006 = !{!1007, !1019}
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1008, file: !1005, line: 188, baseType: !74, size: 32, elements: !1017)
!1008 = distinct !DISubprogram(name: "x2nrealloc", scope: !1005, file: !1005, line: 176, type: !1009, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1004, retainedNodes: !1012)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!129, !129, !1011, !136}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!1012 = !{!1013, !1014, !1015, !1016}
!1013 = !DILocalVariable(name: "p", arg: 1, scope: !1008, file: !1005, line: 176, type: !129)
!1014 = !DILocalVariable(name: "pn", arg: 2, scope: !1008, file: !1005, line: 176, type: !1011)
!1015 = !DILocalVariable(name: "s", arg: 3, scope: !1008, file: !1005, line: 176, type: !136)
!1016 = !DILocalVariable(name: "n", scope: !1008, file: !1005, line: 178, type: !136)
!1017 = !{!1018}
!1018 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1019 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1020, file: !1005, line: 228, baseType: !74, size: 32, elements: !1017)
!1020 = distinct !DISubprogram(name: "xpalloc", scope: !1005, file: !1005, line: 223, type: !1021, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1004, retainedNodes: !1028)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!129, !129, !1023, !1024, !1026, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1025, line: 130, baseType: !1026)
!1025 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1027, line: 18, baseType: !156)
!1027 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1029 = !DILocalVariable(name: "pa", arg: 1, scope: !1020, file: !1005, line: 223, type: !129)
!1030 = !DILocalVariable(name: "pn", arg: 2, scope: !1020, file: !1005, line: 223, type: !1023)
!1031 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1020, file: !1005, line: 223, type: !1024)
!1032 = !DILocalVariable(name: "n_max", arg: 4, scope: !1020, file: !1005, line: 223, type: !1026)
!1033 = !DILocalVariable(name: "s", arg: 5, scope: !1020, file: !1005, line: 223, type: !1024)
!1034 = !DILocalVariable(name: "n0", scope: !1020, file: !1005, line: 230, type: !1024)
!1035 = !DILocalVariable(name: "n", scope: !1020, file: !1005, line: 237, type: !1024)
!1036 = !DILocalVariable(name: "nbytes", scope: !1020, file: !1005, line: 248, type: !1024)
!1037 = !DILocalVariable(name: "adjusted_nbytes", scope: !1020, file: !1005, line: 252, type: !1024)
!1038 = !{!128, !129}
!1039 = distinct !DICompileUnit(language: DW_LANG_C11, file: !770, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1040, splitDebugInlining: false, nameTableKind: None)
!1040 = !{!768, !771, !773}
!1041 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1042, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xgetgroups.o -MD -MP -MF lib/.deps/libcoreutils_a-xgetgroups.Tpo -c lib/xgetgroups.c -o lib/.libcoreutils_a-xgetgroups.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1042 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
