; ModuleID = 'src/cksum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.base64_decode_context = type { i32, [4 x i8] }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha1_ctx = type { i32, i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha256_ctx = type { [8 x i32], [2 x i32], i64, [32 x i32] }
%struct.sha3_ctx = type { [25 x i64], [144 x i8], i64, i64, i64 }
%struct.sha512_ctx = type { [8 x i64], [2 x i64], i64, [32 x i64] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@cksum_algorithm = dso_local local_unnamed_addr global i32 2, align 4, !dbg !0
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !147

!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !179, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !429, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !434, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !434, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !434, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !184, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !429, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "algorithm_tags", scope: !2, file: !3, line: 360, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 960, elements: !317)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !42, line: 729, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 448, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 56)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !42, line: 736, type: !259, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !474, file: !42, line: 575, type: !43, isLocal: true, isDefinition: true)
!474 = distinct !DISubprogram(name: "oputs_", scope: !42, file: !42, line: 573, type: !475, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !477)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !142, !142}
!477 = !{!478, !479, !480, !483, !484, !485, !486, !490, !491, !492, !493, !495, !546, !547, !548, !550, !551}
!478 = !DILocalVariable(name: "program", arg: 1, scope: !474, file: !42, line: 573, type: !142)
!479 = !DILocalVariable(name: "option", arg: 2, scope: !474, file: !42, line: 573, type: !142)
!480 = !DILocalVariable(name: "term", scope: !481, file: !42, line: 585, type: !142)
!481 = distinct !DILexicalBlock(scope: !482, file: !42, line: 582, column: 5)
!482 = distinct !DILexicalBlock(scope: !474, file: !42, line: 581, column: 7)
!483 = !DILocalVariable(name: "double_space", scope: !474, file: !42, line: 594, type: !411)
!484 = !DILocalVariable(name: "first_word", scope: !474, file: !42, line: 595, type: !142)
!485 = !DILocalVariable(name: "option_text", scope: !474, file: !42, line: 596, type: !142)
!486 = !DILocalVariable(name: "s", scope: !487, file: !42, line: 608, type: !142)
!487 = distinct !DILexicalBlock(scope: !488, file: !42, line: 605, column: 5)
!488 = distinct !DILexicalBlock(scope: !489, file: !42, line: 604, column: 12)
!489 = distinct !DILexicalBlock(scope: !474, file: !42, line: 597, column: 7)
!490 = !DILocalVariable(name: "spaces", scope: !487, file: !42, line: 609, type: !140)
!491 = !DILocalVariable(name: "anchor_len", scope: !474, file: !42, line: 620, type: !140)
!492 = !DILocalVariable(name: "desc_text", scope: !474, file: !42, line: 625, type: !142)
!493 = !DILocalVariable(name: "__ptr", scope: !494, file: !42, line: 644, type: !142)
!494 = distinct !DILexicalBlock(scope: !474, file: !42, line: 644, column: 3)
!495 = !DILocalVariable(name: "__stream", scope: !494, file: !42, line: 644, type: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !498, line: 7, baseType: !499)
!498 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !500, line: 49, size: 1728, elements: !501)
!500 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !517, !519, !520, !521, !523, !524, !526, !527, !530, !532, !535, !538, !539, !540, !541, !542}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !499, file: !500, line: 51, baseType: !43, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !499, file: !500, line: 54, baseType: !136, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !499, file: !500, line: 55, baseType: !136, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !499, file: !500, line: 56, baseType: !136, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !499, file: !500, line: 57, baseType: !136, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !499, file: !500, line: 58, baseType: !136, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !499, file: !500, line: 59, baseType: !136, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !499, file: !500, line: 60, baseType: !136, size: 64, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !499, file: !500, line: 61, baseType: !136, size: 64, offset: 512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !499, file: !500, line: 64, baseType: !136, size: 64, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !499, file: !500, line: 65, baseType: !136, size: 64, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !499, file: !500, line: 66, baseType: !136, size: 64, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !499, file: !500, line: 68, baseType: !515, size: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !500, line: 36, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !499, file: !500, line: 70, baseType: !518, size: 64, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !499, file: !500, line: 72, baseType: !43, size: 32, offset: 896)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !499, file: !500, line: 73, baseType: !43, size: 32, offset: 928)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !499, file: !500, line: 74, baseType: !522, size: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !418)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !499, file: !500, line: 77, baseType: !139, size: 16, offset: 1024)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !499, file: !500, line: 78, baseType: !525, size: 8, offset: 1040)
!525 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !499, file: !500, line: 79, baseType: !295, size: 8, offset: 1048)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !499, file: !500, line: 81, baseType: !528, size: 64, offset: 1088)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !500, line: 43, baseType: null)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !499, file: !500, line: 89, baseType: !531, size: 64, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !418)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !499, file: !500, line: 91, baseType: !533, size: 64, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !500, line: 37, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !499, file: !500, line: 92, baseType: !536, size: 64, offset: 1280)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !500, line: 38, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !499, file: !500, line: 93, baseType: !518, size: 64, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !499, file: !500, line: 94, baseType: !138, size: 64, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !499, file: !500, line: 95, baseType: !140, size: 64, offset: 1472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !499, file: !500, line: 96, baseType: !43, size: 32, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !499, file: !500, line: 98, baseType: !543, size: 160, offset: 1568)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 20)
!546 = !DILocalVariable(name: "__cnt", scope: !494, file: !42, line: 644, type: !140)
!547 = !DILocalVariable(name: "url_program", scope: !474, file: !42, line: 648, type: !142)
!548 = !DILocalVariable(name: "__ptr", scope: !549, file: !42, line: 686, type: !142)
!549 = distinct !DILexicalBlock(scope: !474, file: !42, line: 686, column: 3)
!550 = !DILocalVariable(name: "__stream", scope: !549, file: !42, line: 686, type: !496)
!551 = !DILocalVariable(name: "__cnt", scope: !549, file: !42, line: 686, type: !140)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !42, line: 585, type: !434, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !42, line: 586, type: !434, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !42, line: 595, type: !429, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !42, line: 620, type: !174, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !42, line: 648, type: !399, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !42, line: 648, type: !434, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !42, line: 649, type: !429, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !42, line: 649, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 24, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 3)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !42, line: 650, type: !434, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !42, line: 651, type: !174, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !42, line: 663, type: !179, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !42, line: 664, type: !189, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !42, line: 669, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 136, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 17)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !42, line: 669, type: !164, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !42, line: 676, type: !316, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !42, line: 676, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 488, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 61)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !42, line: 679, type: !568, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !42, line: 683, type: !434, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !42, line: 688, type: !434, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !42, line: 691, type: !184, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !42, line: 839, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 16)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !42, line: 840, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 176, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 22)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !42, line: 841, type: !316, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !42, line: 862, type: !429, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !42, line: 868, type: !249, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !42, line: 875, type: !619, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 216, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 27)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !42, line: 877, type: !239, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !42, line: 877, type: !311, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !3, line: 456, type: !179, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !3, line: 460, type: !174, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !3, line: 461, type: !316, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !3, line: 462, type: !174, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !3, line: 463, type: !179, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !3, line: 464, type: !434, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !3, line: 465, type: !179, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !3, line: 466, type: !429, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !3, line: 467, type: !434, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !3, line: 470, type: !189, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !3, line: 471, type: !179, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !3, line: 472, type: !174, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !3, line: 473, type: !429, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !3, line: 474, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 72, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 9)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !3, line: 476, type: !179, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !3, line: 477, type: !434, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !3, line: 483, type: !434, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !3, line: 484, type: !184, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 453, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 4864, elements: !346)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !670, line: 50, size: 256, elements: !671)
!670 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!671 = !{!672, !673, !674, !676}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !669, file: !670, line: 52, baseType: !142, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !669, file: !670, line: 55, baseType: !43, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !670, line: 56, baseType: !675, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !669, file: !670, line: 57, baseType: !43, size: 32, offset: 192)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "algorithm_specified", scope: !2, file: !3, line: 375, type: !411, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "legacy_long_options", scope: !2, file: !3, line: 433, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 3328, elements: !331)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "algorithm_types", scope: !2, file: !3, line: 352, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 448, elements: !322)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !429, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !434, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !429, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !179, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !429, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !434, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !434, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !434, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !184, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !429, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "algorithm_args", scope: !2, file: !3, line: 346, type: !463, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 204, type: !411, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 208, type: !411, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 214, type: !411, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 211, type: !411, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 218, type: !411, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "base64_digest", scope: !2, file: !3, line: 228, type: !411, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "raw_digest", scope: !2, file: !3, line: 232, type: !411, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "digest_delim", scope: !2, file: !3, line: 224, type: !144, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "algorithm_bits", scope: !2, file: !3, line: 366, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 480, elements: !317)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1390, type: !399, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1393, type: !568, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1410, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 224, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 28)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1440, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 376, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 47)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1461, type: !184, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1461, type: !543, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1490, type: !174, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1490, type: !179, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1492, type: !568, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1512, type: !316, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1520, type: !747, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1528, type: !358, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1528, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 352, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 44)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1536, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 344, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 43)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1536, type: !768, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1544, type: !210, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1544, type: !394, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1552, type: !784, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 200, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 25)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "max_tag_len", scope: !789, file: !3, line: 872, type: !414, isLocal: true, isDefinition: true)
!789 = distinct !DISubprogram(name: "algorithm_from_tag", scope: !3, file: !3, line: 869, type: !790, scopeLine: 870, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{!416, !136}
!792 = !{!793, !794, !798, !800, !801, !802}
!793 = !DILocalVariable(name: "s", arg: 1, scope: !789, file: !3, line: 869, type: !136)
!794 = !DILocalVariable(name: "tag", scope: !795, file: !3, line: 875, type: !797)
!795 = distinct !DILexicalBlock(scope: !796, file: !3, line: 874, column: 5)
!796 = distinct !DILexicalBlock(scope: !789, file: !3, line: 873, column: 7)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!798 = !DILocalVariable(name: "tag_len", scope: !799, file: !3, line: 878, type: !414)
!799 = distinct !DILexicalBlock(scope: !795, file: !3, line: 877, column: 9)
!800 = !DILocalVariable(name: "i", scope: !789, file: !3, line: 883, type: !414)
!801 = !DILocalVariable(name: "sep", scope: !789, file: !3, line: 894, type: !137)
!802 = !DILocalVariable(name: "algo", scope: !789, file: !3, line: 896, type: !416)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 221, type: !43, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "bin2hex", scope: !807, file: !3, line: 1345, type: !817, isLocal: true, isDefinition: true)
!807 = distinct !DISubprogram(name: "hex_equal", scope: !3, file: !3, line: 1343, type: !808, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !812)
!808 = !DISubroutineType(types: !809)
!809 = !{!411, !810, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!812 = !{!813, !814, !815, !816}
!813 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !807, file: !3, line: 1343, type: !810)
!814 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !807, file: !3, line: 1343, type: !810)
!815 = !DILocalVariable(name: "digest_bin_bytes", scope: !807, file: !3, line: 1349, type: !414)
!816 = !DILocalVariable(name: "cnt", scope: !807, file: !3, line: 1353, type: !414)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !604)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !42, line: 952, type: !311, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "cksumfns", scope: !2, file: !3, line: 379, type: !822, isLocal: true, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 896, elements: !322)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !824, line: 7, baseType: !825)
!824 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!43, !496, !138, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !104, line: 101, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !106, line: 72, baseType: !418)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !399, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !311, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !837, isLocal: true, isDefinition: true)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 384, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 48)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !3, line: 332, type: !837, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "cksum_output_fns", scope: !2, file: !3, line: 396, type: !844, isLocal: true, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 896, elements: !322)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !3, line: 244, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !142, !43, !134, !411, !411, !144, !411, !829}
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1276, type: !174, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1285, type: !429, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1292, type: !568, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1294, type: !434, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1309, type: !434, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !3, line: 717, type: !429, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1152, type: !568, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1156, type: !568, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1160, type: !568, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!868 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!870 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!871 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!872 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!873 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!874 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!875 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!876 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!877 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!878 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 7, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !881, file: !882, line: 27, type: !919, isLocal: true, isDefinition: true)
!881 = distinct !DICompileUnit(language: DW_LANG_C11, file: !882, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -D HASH_ALGO_CKSUM=1 -D HAVE_CONFIG_H -I lib -I ./lib -I src -I ./src -g -O2 -MT src/blake2/cksum-blake2b-ref.o -MD -MP -MF src/blake2/.deps/cksum-blake2b-ref.Tpo -c src/blake2/blake2b-ref.c -o src/blake2/.cksum-blake2b-ref.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !883, retainedTypes: !892, globals: !900, splitDebugInlining: false, nameTableKind: None)
!882 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28d09caefc730ba5ec0593f4ff5ef776")
!883 = !{!884}
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !885, line: 42, baseType: !7, size: 32, elements: !886)
!885 = !DIFile(filename: "src/blake2/blake2.h", directory: "/src", checksumkind: CSK_MD5, checksum: "98dc573ce8fd1dd56441f8e485f7bd5e")
!886 = !{!887, !888, !889, !890, !891}
!887 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!888 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!889 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!890 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!891 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!892 = !{!893, !895, !810, !138, !898}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !896, line: 24, baseType: !897)
!896 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !106, line: 38, baseType: !144)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !896, line: 27, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !106, line: 45, baseType: !102)
!900 = !{!879, !901, !915}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "memset_v", scope: !903, file: !904, line: 161, type: !910, isLocal: true, isDefinition: true)
!903 = distinct !DISubprogram(name: "secure_zero_memory", scope: !904, file: !904, line: 159, type: !905, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !881, retainedNodes: !907)
!904 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8e1e523af54e01275d11e95a252b1371")
!905 = !DISubroutineType(types: !906)
!906 = !{null, !138, !140}
!907 = !{!908, !909}
!908 = !DILocalVariable(name: "v", arg: 1, scope: !903, file: !904, line: 159, type: !138)
!909 = !DILocalVariable(name: "n", arg: 2, scope: !903, file: !904, line: 159, type: !140)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!138, !138, !43, !140}
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !881, file: !882, line: 35, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 1536, elements: !918)
!918 = !{!313, !605}
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 512, elements: !185)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !923, line: 199, type: !654, isLocal: true, isDefinition: true)
!923 = !DIFile(filename: "src/sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "984061a05cf8100a66387ffa345dea00")
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !923, line: 202, type: !429, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !923, line: 224, type: !174, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "cksum_fp", scope: !930, file: !931, line: 287, type: !1032, isLocal: true, isDefinition: true)
!930 = distinct !DISubprogram(name: "crc_sum_stream", scope: !931, file: !931, line: 282, type: !932, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !968, retainedNodes: !1024)
!931 = !DIFile(filename: "src/cksum_crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6cd2e7250e6ce2490cff53f0738655c9")
!932 = !DISubroutineType(types: !933)
!933 = !{!43, !934, !138, !828}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !498, line: 7, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !500, line: 49, size: 1728, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !936, file: !500, line: 51, baseType: !43, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !936, file: !500, line: 54, baseType: !136, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !936, file: !500, line: 55, baseType: !136, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !936, file: !500, line: 56, baseType: !136, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !936, file: !500, line: 57, baseType: !136, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !936, file: !500, line: 58, baseType: !136, size: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !936, file: !500, line: 59, baseType: !136, size: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !936, file: !500, line: 60, baseType: !136, size: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !936, file: !500, line: 61, baseType: !136, size: 64, offset: 512)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !936, file: !500, line: 64, baseType: !136, size: 64, offset: 576)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !936, file: !500, line: 65, baseType: !136, size: 64, offset: 640)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !936, file: !500, line: 66, baseType: !136, size: 64, offset: 704)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !936, file: !500, line: 68, baseType: !515, size: 64, offset: 768)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !936, file: !500, line: 70, baseType: !952, size: 64, offset: 832)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !936, file: !500, line: 72, baseType: !43, size: 32, offset: 896)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !936, file: !500, line: 73, baseType: !43, size: 32, offset: 928)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !936, file: !500, line: 74, baseType: !522, size: 64, offset: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !936, file: !500, line: 77, baseType: !139, size: 16, offset: 1024)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !936, file: !500, line: 78, baseType: !525, size: 8, offset: 1040)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !936, file: !500, line: 79, baseType: !295, size: 8, offset: 1048)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !936, file: !500, line: 81, baseType: !528, size: 64, offset: 1088)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !936, file: !500, line: 89, baseType: !531, size: 64, offset: 1152)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !936, file: !500, line: 91, baseType: !533, size: 64, offset: 1216)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !936, file: !500, line: 92, baseType: !536, size: 64, offset: 1280)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !936, file: !500, line: 93, baseType: !952, size: 64, offset: 1344)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !936, file: !500, line: 94, baseType: !138, size: 64, offset: 1408)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !936, file: !500, line: 95, baseType: !140, size: 64, offset: 1472)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !936, file: !500, line: 96, baseType: !43, size: 32, offset: 1536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !936, file: !500, line: 98, baseType: !543, size: 160, offset: 1568)
!968 = distinct !DICompileUnit(language: DW_LANG_C11, file: !931, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -D HASH_ALGO_CKSUM=1 -D HAVE_CONFIG_H -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/cksum-cksum_crc.o -MD -MP -MF src/.deps/cksum-cksum_crc.Tpo -c src/cksum_crc.c -o src/.cksum-cksum_crc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !969, globals: !974, splitDebugInlining: false, nameTableKind: None)
!969 = !{!142, !970, !140, !973, !145, !144}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !896, line: 26, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !106, line: 42, baseType: !7)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!974 = !{!928, !975, !977, !979, !981, !983, !988, !990, !993, !995, !997, !999, !1001, !1003, !1005, !1007, !1009, !1014, !1016, !1018, !1020, !1022}
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !931, line: 371, type: !179, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !931, line: 373, type: !429, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !931, line: 211, type: !174, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !931, line: 214, type: !568, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !931, line: 214, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 232, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 29)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !931, line: 214, type: !619, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !992, line: 68, type: !429, isLocal: true, isDefinition: true)
!992 = !DIFile(filename: "./lib/cpu-supports.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9be339edc1bd703a3f96b2a763524c18")
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !992, line: 68, type: !434, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !992, line: 69, type: !434, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !992, line: 69, type: !174, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !992, line: 70, type: !654, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !992, line: 70, type: !189, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !992, line: 71, type: !184, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !992, line: 71, type: !654, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !992, line: 72, type: !179, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !992, line: 72, type: !1011, isLocal: true, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 88, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 11)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !992, line: 73, type: !1011, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !992, line: 73, type: !311, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !992, line: 75, type: !174, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !992, line: 75, type: !179, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !992, line: 76, type: !179, isLocal: true, isDefinition: true)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1031}
!1025 = !DILocalVariable(name: "stream", arg: 1, scope: !930, file: !931, line: 282, type: !934)
!1026 = !DILocalVariable(name: "resstream", arg: 2, scope: !930, file: !931, line: 282, type: !138)
!1027 = !DILocalVariable(name: "length", arg: 3, scope: !930, file: !931, line: 282, type: !828)
!1028 = !DILocalVariable(name: "total_bytes", scope: !930, file: !931, line: 284, type: !829)
!1029 = !DILocalVariable(name: "crc", scope: !930, file: !931, line: 285, type: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !104, line: 74, baseType: !102)
!1031 = !DILocalVariable(name: "crc_out", scope: !930, file: !931, line: 308, type: !7)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "cksum_fp_t", file: !931, line: 140, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!411, !934, !1036, !828}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 3, type: !316, isLocal: true, isDefinition: true)
!1039 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "Version", scope: !1042, file: !1039, line: 3, type: !142, isLocal: false, isDefinition: true)
!1042 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1039, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1043, splitDebugInlining: false, nameTableKind: None)
!1043 = !{!1037, !1040}
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1046, file: !1047, line: 65, type: !1068, isLocal: false, isDefinition: true)
!1046 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1047, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1048, retainedTypes: !1051, globals: !1052, splitDebugInlining: false, nameTableKind: None)
!1047 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1048 = !{!1049}
!1049 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1050, line: 42, baseType: !7, size: 32, elements: !78)
!1050 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1051 = !{!138, !142, !144}
!1052 = !{!1044, !1053, !1055, !1057, !1059, !1064, !1066}
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 141, type: !179, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 141, type: !619, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 142, type: !985, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 160, type: !1061, isLocal: true, isDefinition: true)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 168, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 21)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 165, type: !184, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !1047, line: 170, type: !434, isLocal: true, isDefinition: true)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1069, line: 69, baseType: !1070)
!1069 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null}
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "base64_to_int", scope: !1075, file: !1076, line: 243, type: !1082, isLocal: false, isDefinition: true)
!1075 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1076, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-base64.o -MD -MP -MF lib/.deps/libcoreutils_a-base64.Tpo -c lib/base64.c -o lib/.libcoreutils_a-base64.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1077, globals: !1078, splitDebugInlining: false, nameTableKind: None)
!1076 = !DIFile(filename: "lib/base64.c", directory: "/src", checksumkind: CSK_MD5, checksum: "de7b87ba8809e6c9b8f3253a3b932105")
!1077 = !{!138, !136}
!1078 = !{!1073, !1079}
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "b64c", scope: !1075, file: !1076, line: 62, type: !1081, isLocal: true, isDefinition: true)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 512, elements: !223)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 2048, elements: !1084)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!1084 = !{!1085}
!1085 = !DISubrange(count: 256)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(name: "file_name", scope: !1088, file: !1089, line: 45, type: !142, isLocal: true, isDefinition: true)
!1088 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1089, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1090, splitDebugInlining: false, nameTableKind: None)
!1089 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1090 = !{!1091, !1093, !1095, !1097, !1086, !1099}
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1089, line: 121, type: !179, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !1089, line: 121, type: !311, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !1089, line: 123, type: !179, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !1089, line: 126, type: !568, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1088, file: !1089, line: 55, type: !411, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !1103, file: !1104, line: 25, type: !411, isLocal: false, isDefinition: true)
!1103 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1104, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-cpu-supports.o -MD -MP -MF lib/.deps/libcoreutils_a-cpu-supports.Tpo -c lib/cpu-supports.c -o lib/.libcoreutils_a-cpu-supports.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1105, splitDebugInlining: false, nameTableKind: None)
!1104 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!1105 = !{!1101, !1106, !1121, !1123, !1128}
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "hwcaps", scope: !1108, file: !1104, line: 45, type: !142, isLocal: true, isDefinition: true)
!1108 = distinct !DISubprogram(name: "hwcap_allowed", scope: !1104, file: !1104, line: 28, type: !1109, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1103, retainedNodes: !1111)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!411, !142}
!1111 = !{!1112, !1113, !1118, !1119, !1120}
!1112 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !1108, file: !1104, line: 28, type: !142)
!1113 = !DILocalVariable(name: "tunables_start", scope: !1114, file: !1104, line: 50, type: !142)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !1104, line: 49, column: 9)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !1104, line: 48, column: 11)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !1104, line: 47, column: 5)
!1117 = distinct !DILexicalBlock(scope: !1108, file: !1104, line: 46, column: 7)
!1118 = !DILocalVariable(name: "last_hwcaps", scope: !1114, file: !1104, line: 51, type: !142)
!1119 = !DILocalVariable(name: "sentinel", scope: !1108, file: !1104, line: 67, type: !142)
!1120 = !DILocalVariable(name: "cap", scope: !1108, file: !1104, line: 70, type: !142)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !1104, line: 48, type: !316, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !1104, line: 52, type: !1125, isLocal: true, isDefinition: true)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 144, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 18)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !1104, line: 55, type: !295, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "crc32_sliceby8_table", scope: !1132, file: !1135, line: 19, type: !1136, isLocal: true, isDefinition: true)
!1132 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1133, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-crc.o -MD -MP -MF lib/.deps/libcoreutils_a-crc.Tpo -c lib/crc.c -o lib/.libcoreutils_a-crc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1134, splitDebugInlining: false, nameTableKind: None)
!1133 = !DIFile(filename: "lib/crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b660508727a09332fc61bae8755ce0d9")
!1134 = !{!1130}
!1135 = !DIFile(filename: "lib/crc-sliceby8.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75ea92a6339c8e06d620d2f884dd622b")
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 65536, elements: !1138)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1138 = !{!186, !1085}
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1141, file: !1142, line: 60, type: !1146, isLocal: true, isDefinition: true)
!1141 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1142, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-md5.o -MD -MP -MF lib/.deps/libcoreutils_a-md5.Tpo -c lib/md5.c -o lib/.libcoreutils_a-md5.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1143, globals: !1145, splitDebugInlining: false, nameTableKind: None)
!1142 = !DIFile(filename: "lib/md5.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9a1fce7e7c2db2e106b191e5deaa23a2")
!1143 = !{!136, !142, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !104, line: 90, baseType: !102)
!1145 = !{!1139}
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 512, elements: !223)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1149, file: !1150, line: 46, type: !1146, isLocal: true, isDefinition: true)
!1149 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1150, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-sha1.o -MD -MP -MF lib/.deps/libcoreutils_a-sha1.Tpo -c lib/sha1.c -o lib/.libcoreutils_a-sha1.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1151, globals: !1152, splitDebugInlining: false, nameTableKind: None)
!1150 = !DIFile(filename: "lib/sha1.c", directory: "/src", checksumkind: CSK_MD5, checksum: "15f6407463c5c629a55eef1090757600")
!1151 = !{!136, !142, !1144, !971}
!1152 = !{!1147}
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1155, file: !1156, line: 45, type: !1146, isLocal: true, isDefinition: true)
!1155 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1156, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-sha256.o -MD -MP -MF lib/.deps/libcoreutils_a-sha256.Tpo -c lib/sha256.c -o lib/.libcoreutils_a-sha256.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1143, globals: !1157, splitDebugInlining: false, nameTableKind: None)
!1156 = !DIFile(filename: "lib/sha256.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4bf00364acac5809a530ebfdf8076fa4")
!1157 = !{!1153, !1158}
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(name: "sha256_round_constants", scope: !1155, file: !1156, line: 268, type: !1160, isLocal: true, isDefinition: true)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 2048, elements: !223)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(name: "rc", scope: !1163, file: !1164, line: 37, type: !1187, isLocal: true, isDefinition: true)
!1163 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1164, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-sha3.o -MD -MP -MF lib/.deps/libcoreutils_a-sha3.Tpo -c lib/sha3.c -o lib/.libcoreutils_a-sha3.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1165, retainedTypes: !1183, globals: !1186, splitDebugInlining: false, nameTableKind: None)
!1164 = !DIFile(filename: "lib/sha3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1fc4d6dcd92fa883821ca1644332995f")
!1165 = !{!1166, !1168, !1171, !1172, !1175, !1176, !1179, !1180}
!1166 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 39, baseType: !7, size: 32, elements: !122)
!1167 = !DIFile(filename: "lib/sha3.h", directory: "/src", checksumkind: CSK_MD5, checksum: "16b15d0ed2c56a8b956136fe6252f1e9")
!1168 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 45, baseType: !7, size: 32, elements: !1169)
!1169 = !{!1170}
!1170 = !DIEnumerator(name: "SHA3_224_BLOCK_SIZE", value: 144)
!1171 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 40, baseType: !7, size: 32, elements: !125)
!1172 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 46, baseType: !7, size: 32, elements: !1173)
!1173 = !{!1174}
!1174 = !DIEnumerator(name: "SHA3_256_BLOCK_SIZE", value: 136)
!1175 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 41, baseType: !7, size: 32, elements: !128)
!1176 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 47, baseType: !7, size: 32, elements: !1177)
!1177 = !{!1178}
!1178 = !DIEnumerator(name: "SHA3_384_BLOCK_SIZE", value: 104)
!1179 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 42, baseType: !7, size: 32, elements: !131)
!1180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1167, line: 48, baseType: !7, size: 32, elements: !1181)
!1181 = !{!1182}
!1182 = !DIEnumerator(name: "SHA3_512_BLOCK_SIZE", value: 72)
!1183 = !{!971, !1184}
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !1185, line: 48, baseType: !898)
!1185 = !DIFile(filename: "lib/u64.h", directory: "/src", checksumkind: CSK_MD5, checksum: "748affdcb7c6d173090c334d88398f00")
!1186 = !{!1161}
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 1536, elements: !303)
!1188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1184)
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1191, file: !1192, line: 45, type: !1200, isLocal: true, isDefinition: true)
!1191 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1192, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-sha512.o -MD -MP -MF lib/.deps/libcoreutils_a-sha512.Tpo -c lib/sha512.c -o lib/.libcoreutils_a-sha512.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1193, globals: !1194, splitDebugInlining: false, nameTableKind: None)
!1192 = !DIFile(filename: "lib/sha512.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b40e2f4ee4a922821a4d571a1e99a94")
!1193 = !{!1184, !136, !142, !1144}
!1194 = !{!1189, !1195}
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(name: "sha512_round_constants", scope: !1191, file: !1192, line: 269, type: !1197, isLocal: true, isDefinition: true)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 5120, elements: !1198)
!1198 = !{!1199}
!1199 = !DISubrange(count: 80)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 1024, elements: !1201)
!1201 = !{!1202}
!1202 = !DISubrange(count: 128)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1205, file: !1206, line: 58, type: !1146, isLocal: true, isDefinition: true)
!1205 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1206, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-sm3.o -MD -MP -MF lib/.deps/libcoreutils_a-sm3.Tpo -c lib/sm3.c -o lib/.libcoreutils_a-sm3.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1143, globals: !1207, splitDebugInlining: false, nameTableKind: None)
!1206 = !DIFile(filename: "lib/sm3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1f78229a09b95249964fab4e8aefe8f9")
!1207 = !{!1203, !1208}
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(name: "sm3_round_constants", scope: !1205, file: !1206, line: 232, type: !1160, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1212, file: !1213, line: 66, type: !1070, isLocal: false, isDefinition: true)
!1212 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1213, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1214, globals: !1215, splitDebugInlining: false, nameTableKind: None)
!1213 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1214 = !{!138, !144}
!1215 = !{!1216, !1218, !1242, !1244, !1246, !1248, !1210, !1250, !1252, !1254, !1256, !1258}
!1216 = !DIGlobalVariableExpression(var: !1217, expr: !DIExpression())
!1217 = distinct !DIGlobalVariable(scope: null, file: !1213, line: 272, type: !434, isLocal: true, isDefinition: true)
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1220, file: !1213, line: 304, type: !142, isLocal: true, isDefinition: true)
!1220 = distinct !DISubprogram(name: "verror_at_line", scope: !1213, file: !1213, line: 298, type: !1221, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1212, retainedNodes: !1235)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null, !43, !43, !142, !7, !142, !1223}
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1224, line: 52, baseType: !1225)
!1224 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1226, line: 12, baseType: !1227)
!1226 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1213, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1228, file: !1213, baseType: !138, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1228, file: !1213, baseType: !138, size: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1228, file: !1213, baseType: !138, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1228, file: !1213, baseType: !43, size: 32, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1228, file: !1213, baseType: !43, size: 32, offset: 224)
!1235 = !{!1236, !1237, !1238, !1239, !1240, !1241}
!1236 = !DILocalVariable(name: "status", arg: 1, scope: !1220, file: !1213, line: 298, type: !43)
!1237 = !DILocalVariable(name: "errnum", arg: 2, scope: !1220, file: !1213, line: 298, type: !43)
!1238 = !DILocalVariable(name: "file_name", arg: 3, scope: !1220, file: !1213, line: 298, type: !142)
!1239 = !DILocalVariable(name: "line_number", arg: 4, scope: !1220, file: !1213, line: 298, type: !7)
!1240 = !DILocalVariable(name: "message", arg: 5, scope: !1220, file: !1213, line: 298, type: !142)
!1241 = !DILocalVariable(name: "args", arg: 6, scope: !1220, file: !1213, line: 298, type: !1223)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1220, file: !1213, line: 305, type: !7, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1213, line: 338, type: !429, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1213, line: 346, type: !184, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1213, line: 346, type: !399, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1212, file: !1213, line: 69, type: !7, isLocal: false, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1212, file: !1213, line: 295, type: !43, isLocal: false, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(scope: null, file: !1213, line: 208, type: !179, isLocal: true, isDefinition: true)
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(scope: null, file: !1213, line: 208, type: !1061, isLocal: true, isDefinition: true)
!1258 = !DIGlobalVariableExpression(var: !1259, expr: !DIExpression())
!1259 = distinct !DIGlobalVariable(scope: null, file: !1213, line: 214, type: !434, isLocal: true, isDefinition: true)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 161, type: !399, isLocal: true, isDefinition: true)
!1262 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 163, type: !295, isLocal: true, isDefinition: true)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 233, type: !174, isLocal: true, isDefinition: true)
!1267 = !DIGlobalVariableExpression(var: !1268, expr: !DIExpression())
!1268 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 251, type: !174, isLocal: true, isDefinition: true)
!1269 = !DIGlobalVariableExpression(var: !1270, expr: !DIExpression())
!1270 = distinct !DIGlobalVariable(name: "power_letter", scope: !1271, file: !1262, line: 36, type: !1306, isLocal: true, isDefinition: true)
!1271 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1262, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-human.o -MD -MP -MF lib/.deps/libcoreutils_a-human.Tpo -c lib/human.c -o lib/.libcoreutils_a-human.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1272, retainedTypes: !1286, globals: !1287, splitDebugInlining: false, nameTableKind: None)
!1272 = !{!1273, !90}
!1273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1274, line: 47, baseType: !7, size: 32, elements: !1275)
!1274 = !DIFile(filename: "lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285}
!1276 = !DIEnumerator(name: "human_ceiling", value: 0)
!1277 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!1278 = !DIEnumerator(name: "human_floor", value: 2)
!1279 = !DIEnumerator(name: "human_group_digits", value: 4)
!1280 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!1281 = !DIEnumerator(name: "human_autoscale", value: 16)
!1282 = !DIEnumerator(name: "human_base_1024", value: 32)
!1283 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!1284 = !DIEnumerator(name: "human_SI", value: 128)
!1285 = !DIEnumerator(name: "human_B", value: 256)
!1286 = !{!134, !138}
!1287 = !{!1260, !1263, !1265, !1267, !1269, !1288, !1290, !1292, !1294, !1296, !1298, !1301, !1304}
!1288 = !DIGlobalVariableExpression(var: !1289, expr: !DIExpression())
!1289 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 417, type: !1011, isLocal: true, isDefinition: true)
!1290 = !DIGlobalVariableExpression(var: !1291, expr: !DIExpression())
!1291 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 418, type: !189, isLocal: true, isDefinition: true)
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 438, type: !1125, isLocal: true, isDefinition: true)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 398, type: !316, isLocal: true, isDefinition: true)
!1296 = !DIGlobalVariableExpression(var: !1297, expr: !DIExpression())
!1297 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 398, type: !568, isLocal: true, isDefinition: true)
!1298 = !DIGlobalVariableExpression(var: !1299, expr: !DIExpression())
!1299 = distinct !DIGlobalVariable(name: "block_size_args", scope: !1271, file: !1262, line: 398, type: !1300, isLocal: true, isDefinition: true)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 192, elements: !569)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !1271, file: !1262, line: 399, type: !1303, isLocal: true, isDefinition: true)
!1303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 64, elements: !400)
!1304 = !DIGlobalVariableExpression(var: !1305, expr: !DIExpression())
!1305 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 408, type: !603, isLocal: true, isDefinition: true)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 88, elements: !1012)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(name: "program_name", scope: !1309, file: !1310, line: 31, type: !142, isLocal: false, isDefinition: true)
!1309 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1310, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1077, globals: !1311, splitDebugInlining: false, nameTableKind: None)
!1310 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1311 = !{!1307, !1312, !1314}
!1312 = !DIGlobalVariableExpression(var: !1313, expr: !DIExpression())
!1313 = distinct !DIGlobalVariable(scope: null, file: !1310, line: 46, type: !184, isLocal: true, isDefinition: true)
!1314 = !DIGlobalVariableExpression(var: !1315, expr: !DIExpression())
!1315 = distinct !DIGlobalVariable(scope: null, file: !1310, line: 49, type: !429, isLocal: true, isDefinition: true)
!1316 = !DIGlobalVariableExpression(var: !1317, expr: !DIExpression())
!1317 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1318, file: !1319, line: 46, type: !1345, isLocal: true, isDefinition: true)
!1318 = distinct !DISubprogram(name: "proper_name_lite", scope: !1319, file: !1319, line: 38, type: !1320, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1322, retainedNodes: !1324)
!1319 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!142, !142, !142}
!1322 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1319, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1323, splitDebugInlining: false, nameTableKind: None)
!1323 = !{!1316}
!1324 = !{!1325, !1326, !1327, !1328, !1332}
!1325 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1318, file: !1319, line: 38, type: !142)
!1326 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1318, file: !1319, line: 38, type: !142)
!1327 = !DILocalVariable(name: "translation", scope: !1318, file: !1319, line: 40, type: !142)
!1328 = !DILocalVariable(name: "w", scope: !1318, file: !1319, line: 47, type: !1329)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1330, line: 37, baseType: !1331)
!1330 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !106, line: 57, baseType: !972)
!1332 = !DILocalVariable(name: "mbs", scope: !1318, file: !1319, line: 48, type: !1333)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1334, line: 6, baseType: !1335)
!1334 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1336, line: 21, baseType: !1337)
!1336 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1336, line: 13, size: 64, elements: !1338)
!1338 = !{!1339, !1340}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1337, file: !1336, line: 15, baseType: !43, size: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1337, file: !1336, line: 20, baseType: !1341, size: 32, offset: 32)
!1341 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1337, file: !1336, line: 16, size: 32, elements: !1342)
!1342 = !{!1343, !1344}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1341, file: !1336, line: 18, baseType: !7, size: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1341, file: !1336, line: 19, baseType: !429, size: 32)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 16, elements: !400)
!1346 = !DIGlobalVariableExpression(var: !1347, expr: !DIExpression())
!1347 = distinct !DIGlobalVariable(scope: null, file: !1348, line: 78, type: !184, isLocal: true, isDefinition: true)
!1348 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1349 = !DIGlobalVariableExpression(var: !1350, expr: !DIExpression())
!1350 = distinct !DIGlobalVariable(scope: null, file: !1348, line: 79, type: !174, isLocal: true, isDefinition: true)
!1351 = !DIGlobalVariableExpression(var: !1352, expr: !DIExpression())
!1352 = distinct !DIGlobalVariable(scope: null, file: !1348, line: 80, type: !330, isLocal: true, isDefinition: true)
!1353 = !DIGlobalVariableExpression(var: !1354, expr: !DIExpression())
!1354 = distinct !DIGlobalVariable(scope: null, file: !1348, line: 81, type: !330, isLocal: true, isDefinition: true)
!1355 = !DIGlobalVariableExpression(var: !1356, expr: !DIExpression())
