; ModuleID = 'src/csplit.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.cstring = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, ptr }
%union.anon = type { ptr }
%struct.control = type { i64, i64, i64, i32, i8, i8, i8, %struct.re_pattern_buffer }
%struct.re_pattern_buffer = type { ptr, i64, i64, i64, ptr, ptr, i64, i8 }
%struct.buffer_record = type { i64, i64, i64, i64, i64, ptr, ptr, ptr, ptr }
%struct.line = type { i64, i64, i64, [80 x %struct.cstring], ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [17 x i8] c"memory exhausted\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !12
@.str.3 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !17

!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1289, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 10)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1289, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 24)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "global_argv", scope: !29, file: !2, line: 156, type: !45, isLocal: true, isDefinition: true)
!29 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/csplit.o -MD -MP -MF src/.deps/csplit.Tpo -c src/csplit.c -o src/.csplit.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !30, retainedTypes: !218, globals: !225, splitDebugInlining: false, nameTableKind: None)
!30 = !{!31, !35, !41, !177, !191, !195, !210}
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 182, baseType: !32, size: 32, elements: !33)
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34}
!34 = !DIEnumerator(name: "SUPPRESS_MATCHED_OPTION", value: 256)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 337, baseType: !37, size: 32, elements: !38)
!36 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{!39, !40}
!39 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!40 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !42, file: !2, line: 1362, baseType: !32, size: 32, elements: !175)
!42 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1282, type: !43, scopeLine: 1283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !47)
!43 = !DISubroutineType(types: !44)
!44 = !{!37, !37, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!47 = !{!48, !49, !50, !51, !57, !58, !59, !171, !173}
!48 = !DILocalVariable(name: "argc", arg: 1, scope: !42, file: !2, line: 1282, type: !37)
!49 = !DILocalVariable(name: "argv", arg: 2, scope: !42, file: !2, line: 1282, type: !45)
!50 = !DILocalVariable(name: "optc", scope: !42, file: !2, line: 1284, type: !37)
!51 = !DILocalVariable(name: "prefix_len", scope: !42, file: !2, line: 1347, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !53, line: 130, baseType: !54)
!53 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !55, line: 18, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DILocalVariable(name: "max_digit_string_len", scope: !42, file: !2, line: 1348, type: !52)
!58 = !DILocalVariable(name: "filename_size", scope: !42, file: !2, line: 1352, type: !52)
!59 = !DILocalVariable(name: "act", scope: !60, file: !2, line: 1364, type: !61)
!60 = distinct !DILexicalBlock(scope: !42, file: !2, line: 1361, column: 3)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !62, line: 27, size: 1216, elements: !63)
!62 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!63 = !{!64, !156, !166, !167}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !61, file: !62, line: 38, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !62, line: 31, size: 64, elements: !66)
!66 = !{!67, !73}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !65, file: !62, line: 34, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !69, line: 72, baseType: !70)
!69 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !37}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !65, file: !62, line: 36, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !37, !77, !113}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !79, line: 124, baseType: !80)
!79 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 36, size: 1024, elements: !81)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !80, file: !79, line: 38, baseType: !37, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !80, file: !79, line: 40, baseType: !37, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !80, file: !79, line: 42, baseType: !37, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !80, file: !79, line: 48, baseType: !37, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !80, file: !79, line: 123, baseType: !87, size: 896, offset: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !79, line: 51, size: 896, elements: !88)
!88 = !{!89, !93, !101, !114, !120, !129, !145, !150}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !87, file: !79, line: 53, baseType: !90, size: 896)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 896, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 28)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !87, file: !79, line: 60, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 56, size: 64, elements: !95)
!95 = !{!96, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !94, file: !79, line: 58, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !98, line: 154, baseType: !37)
!98 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!99 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !94, file: !79, line: 59, baseType: !100, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !98, line: 146, baseType: !32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !87, file: !79, line: 68, baseType: !102, size: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 63, size: 128, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !102, file: !79, line: 65, baseType: !37, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !102, file: !79, line: 66, baseType: !37, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !102, file: !79, line: 67, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !108, line: 30, baseType: !109)
!108 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !108, line: 24, size: 64, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !109, file: !108, line: 26, baseType: !37, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !109, file: !108, line: 27, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !87, file: !79, line: 76, baseType: !115, size: 128)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 71, size: 128, elements: !116)
!116 = !{!117, !118, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !115, file: !79, line: 73, baseType: !97, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !115, file: !79, line: 74, baseType: !100, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !115, file: !79, line: 75, baseType: !107, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !87, file: !79, line: 86, baseType: !121, size: 256)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 79, size: 256, elements: !122)
!122 = !{!123, !124, !125, !126, !128}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !121, file: !79, line: 81, baseType: !97, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !121, file: !79, line: 82, baseType: !100, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !121, file: !79, line: 83, baseType: !37, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !121, file: !79, line: 84, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !98, line: 156, baseType: !56)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !121, file: !79, line: 85, baseType: !127, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !87, file: !79, line: 105, baseType: !130, size: 256)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 89, size: 256, elements: !131)
!131 = !{!132, !133, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !130, file: !79, line: 91, baseType: !113, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !130, file: !79, line: 93, baseType: !134, size: 16, offset: 64)
!134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !130, file: !79, line: 104, baseType: !136, size: 128, offset: 128)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !79, line: 94, size: 128, elements: !137)
!137 = !{!138, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !136, file: !79, line: 101, baseType: !139, size: 128)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !79, line: 97, size: 128, elements: !140)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !139, file: !79, line: 99, baseType: !113, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !139, file: !79, line: 100, baseType: !113, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !136, file: !79, line: 103, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !98, line: 42, baseType: !32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !87, file: !79, line: 112, baseType: !146, size: 128)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 108, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !146, file: !79, line: 110, baseType: !56, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !146, file: !79, line: 111, baseType: !37, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !87, file: !79, line: 121, baseType: !151, size: 128)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !79, line: 116, size: 128, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !151, file: !79, line: 118, baseType: !113, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !151, file: !79, line: 119, baseType: !37, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !151, file: !79, line: 120, baseType: !32, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !61, file: !62, line: 46, baseType: !157, size: 1024, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !158, line: 8, baseType: !159)
!158 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 5, size: 1024, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !159, file: !158, line: 7, baseType: !162, size: 1024)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 1024, elements: !164)
!163 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!164 = !{!165}
!165 = !DISubrange(count: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !61, file: !62, line: 49, baseType: !37, size: 32, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !61, file: !62, line: 52, baseType: !168, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null}
!171 = !DILocalVariable(name: "i", scope: !172, file: !2, line: 1367, type: !37)
!172 = distinct !DILexicalBlock(scope: !60, file: !2, line: 1367, column: 5)
!173 = !DILocalVariable(name: "i", scope: !174, file: !2, line: 1378, type: !37)
!174 = distinct !DILexicalBlock(scope: !60, file: !2, line: 1378, column: 5)
!175 = !{!176}
!176 = !DIEnumerator(name: "nsigs", value: 22)
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !178, line: 42, baseType: !32, size: 32, elements: !179)
!178 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!180 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!181 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!182 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!183 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!184 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!185 = !DIEnumerator(name: "c_quoting_style", value: 5)
!186 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!187 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!188 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!189 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!190 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1171, baseType: !32, size: 32, elements: !192)
!192 = !{!193, !194}
!193 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 1)
!194 = !DIEnumerator(name: "FLAG_ALTERNATIVE", value: 2)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !196, line: 46, baseType: !32, size: 32, elements: !197)
!196 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!198 = !DIEnumerator(name: "_ISupper", value: 256)
!199 = !DIEnumerator(name: "_ISlower", value: 512)
!200 = !DIEnumerator(name: "_ISalpha", value: 1024)
!201 = !DIEnumerator(name: "_ISdigit", value: 2048)
!202 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!203 = !DIEnumerator(name: "_ISspace", value: 8192)
!204 = !DIEnumerator(name: "_ISprint", value: 16384)
!205 = !DIEnumerator(name: "_ISgraph", value: 32768)
!206 = !DIEnumerator(name: "_ISblank", value: 1)
!207 = !DIEnumerator(name: "_IScntrl", value: 2)
!208 = !DIEnumerator(name: "_ISpunct", value: 4)
!209 = !DIEnumerator(name: "_ISalnum", value: 8)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !211, line: 30, baseType: !32, size: 32, elements: !212)
!211 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!212 = !{!213, !214, !215, !216, !217}
!213 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!214 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!215 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!216 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!217 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!218 = !{!46, !113, !37, !68, !219, !220, !222, !224}
!219 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !221, line: 18, baseType: !163)
!221 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!224 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !{!0, !7, !12, !17, !22, !226, !231, !236, !241, !246, !251, !254, !256, !261, !263, !268, !270, !275, !280, !285, !290, !295, !300, !305, !310, !315, !320, !325, !27, !330, !333, !335, !337, !341, !346, !351, !403, !405, !410, !413, !415, !417, !422, !424, !426, !431, !433, !435, !437, !439, !444, !456, !458, !461, !464, !467, !469, !474, !479, !481, !486, !488, !490, !492, !497, !502, !554, !556, !561, !566, !571, !573, !575, !580, !587, !589, !591, !596, !598, !605, !607, !636, !638, !640, !642, !644, !646, !648, !650, !652, !661, !666, !671, !673, !675, !705, !707, !709, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !753, !755, !757, !759, !761, !763, !765, !767, !770, !772, !774, !776, !778, !783}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1296, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 11)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1314, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 15)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 7)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 14)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 12)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1332, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !164)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1341, type: !253, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1343, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 25)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1387, type: !228, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1398, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 39)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1401, type: !265, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1405, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1072, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 134)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 35)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1416, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 592, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 74)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1420, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 59)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1424, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 528, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 66)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1428, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 71)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1432, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 76)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1436, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 75)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1440, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 64)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1444, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 50)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1445, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 62)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1446, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3504, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 438)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "suppress_count", scope: !29, file: !2, line: 159, type: !332, isLocal: true, isDefinition: true)
!332 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !29, file: !2, line: 165, type: !332, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "suppress_matched", scope: !29, file: !2, line: 168, type: !332, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "caught_signals", scope: !29, file: !2, line: 178, type: !339, isLocal: true, isDefinition: true)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !340, line: 7, baseType: !157)
!340 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 956, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 19)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 985, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 5)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "output_stream", scope: !29, file: !2, line: 150, type: !353, isLocal: true, isDefinition: true)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !355, line: 7, baseType: !356)
!355 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !357, line: 49, size: 1728, elements: !358)
!357 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !374, !376, !377, !378, !380, !381, !383, !384, !387, !389, !392, !395, !396, !397, !398, !399}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !356, file: !357, line: 51, baseType: !37, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !356, file: !357, line: 54, baseType: !46, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !356, file: !357, line: 55, baseType: !46, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !356, file: !357, line: 56, baseType: !46, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !356, file: !357, line: 57, baseType: !46, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !356, file: !357, line: 58, baseType: !46, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !356, file: !357, line: 59, baseType: !46, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !356, file: !357, line: 60, baseType: !46, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !356, file: !357, line: 61, baseType: !46, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !356, file: !357, line: 64, baseType: !46, size: 64, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !356, file: !357, line: 65, baseType: !46, size: 64, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !356, file: !357, line: 66, baseType: !46, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !356, file: !357, line: 68, baseType: !372, size: 64, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !357, line: 36, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !356, file: !357, line: 70, baseType: !375, size: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !356, file: !357, line: 72, baseType: !37, size: 32, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !356, file: !357, line: 73, baseType: !37, size: 32, offset: 928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !356, file: !357, line: 74, baseType: !379, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 152, baseType: !56)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !356, file: !357, line: 77, baseType: !219, size: 16, offset: 1024)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !356, file: !357, line: 78, baseType: !382, size: 8, offset: 1040)
!382 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !356, file: !357, line: 79, baseType: !14, size: 8, offset: 1048)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !356, file: !357, line: 81, baseType: !385, size: 64, offset: 1088)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !357, line: 43, baseType: null)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !356, file: !357, line: 89, baseType: !388, size: 64, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 153, baseType: !56)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !356, file: !357, line: 91, baseType: !390, size: 64, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !357, line: 37, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !356, file: !357, line: 92, baseType: !393, size: 64, offset: 1280)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !357, line: 38, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !356, file: !357, line: 93, baseType: !375, size: 64, offset: 1344)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !356, file: !357, line: 94, baseType: !113, size: 64, offset: 1408)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !356, file: !357, line: 95, baseType: !220, size: 64, offset: 1472)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !356, file: !357, line: 96, baseType: !37, size: 32, offset: 1536)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !356, file: !357, line: 98, baseType: !400, size: 160, offset: 1568)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 20)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "output_filename", scope: !29, file: !2, line: 153, type: !46, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "bytes_written", scope: !29, file: !2, line: 147, type: !407, isLocal: true, isDefinition: true)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !408, line: 101, baseType: !409)
!408 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !98, line: 72, baseType: !56)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "files_created", scope: !29, file: !2, line: 144, type: !412, isLocal: true, isDefinition: true)
!412 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 887, type: !348, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 189, type: !238, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 6)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !238, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !228, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 18)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 194, type: !238, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !243, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !9, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !348, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 198, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 8)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "longopts", scope: !29, file: !2, line: 187, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 2816, elements: !229)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !449, line: 50, size: 256, elements: !450)
!449 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!450 = !{!451, !452, !453, !455}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !448, file: !449, line: 52, baseType: !222, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !448, file: !449, line: 55, baseType: !37, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !449, line: 56, baseType: !454, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !448, file: !449, line: 57, baseType: !37, size: 32, offset: 192)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !2, line: 135, type: !3, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "prefix", scope: !29, file: !2, line: 135, type: !460, isLocal: true, isDefinition: true)
!460 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !222)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "suffix", scope: !29, file: !2, line: 138, type: !463, isLocal: true, isDefinition: true)
!463 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "remove_files", scope: !29, file: !2, line: 162, type: !466, isLocal: true, isDefinition: true)
!466 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !332)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "digits", scope: !29, file: !2, line: 141, type: !412, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1258, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 48)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1272, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 46)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1229, type: !265, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1233, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 43)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1236, type: !476, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1241, type: !317, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "filename_space", scope: !29, file: !2, line: 132, type: !463, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 608, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 2)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !2, line: 609, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 27)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "last_val", scope: !504, file: !2, line: 1124, type: !407, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "parse_patterns", scope: !2, file: !2, line: 1121, type: !505, scopeLine: 1122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !37, !37, !45}
!507 = !{!508, !509, !510, !511, !545, !547}
!508 = !DILocalVariable(name: "argc", arg: 1, scope: !504, file: !2, line: 1121, type: !37)
!509 = !DILocalVariable(name: "start", arg: 2, scope: !504, file: !2, line: 1121, type: !37)
!510 = !DILocalVariable(name: "argv", arg: 3, scope: !504, file: !2, line: 1121, type: !45)
!511 = !DILocalVariable(name: "p", scope: !504, file: !2, line: 1123, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control", file: !2, line: 50, size: 768, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !513, file: !2, line: 52, baseType: !407, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lines_required", scope: !513, file: !2, line: 53, baseType: !407, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !513, file: !2, line: 54, baseType: !407, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "argnum", scope: !513, file: !2, line: 55, baseType: !37, size: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_forever", scope: !513, file: !2, line: 56, baseType: !332, size: 8, offset: 224)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !513, file: !2, line: 57, baseType: !332, size: 8, offset: 232)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "regexpr", scope: !513, file: !2, line: 58, baseType: !332, size: 8, offset: 240)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "re_compiled", scope: !513, file: !2, line: 59, baseType: !523, size: 512, offset: 256)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !524, line: 413, size: 512, elements: !525)
!524 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!525 = !{!526, !529, !531, !532, !534, !535, !537, !538, !539, !540, !541, !542, !543, !544}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !523, file: !524, line: 417, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !524, line: 417, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !523, file: !524, line: 420, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !524, line: 56, baseType: !163)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !523, file: !524, line: 423, baseType: !530, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !523, file: !524, line: 426, baseType: !533, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !524, line: 71, baseType: !163)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !523, file: !524, line: 431, baseType: !46, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !523, file: !524, line: 437, baseType: !536, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !523, file: !524, line: 440, baseType: !220, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !523, file: !524, line: 446, baseType: !32, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !523, file: !524, line: 457, baseType: !32, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !523, file: !524, line: 461, baseType: !32, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !523, file: !524, line: 465, baseType: !32, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !523, file: !524, line: 469, baseType: !32, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !523, file: !524, line: 472, baseType: !32, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !523, file: !524, line: 475, baseType: !32, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!545 = !DILocalVariable(name: "i", scope: !546, file: !2, line: 1126, type: !37)
!546 = distinct !DILexicalBlock(scope: !504, file: !2, line: 1126, column: 3)
!547 = !DILocalVariable(name: "val", scope: !548, file: !2, line: 1137, type: !552)
!548 = distinct !DILexicalBlock(scope: !549, file: !2, line: 1133, column: 9)
!549 = distinct !DILexicalBlock(scope: !550, file: !2, line: 1128, column: 11)
!550 = distinct !DILexicalBlock(scope: !551, file: !2, line: 1127, column: 5)
!551 = distinct !DILexicalBlock(scope: !546, file: !2, line: 1126, column: 3)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !408, line: 102, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !98, line: 73, baseType: !163)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1140, type: !400, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1142, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 42)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1145, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 58)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1150, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 61)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1089, type: !277, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1107, type: !277, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 37)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "control_allocated", scope: !582, file: !2, line: 1012, type: !52, isLocal: true, isDefinition: true)
!582 = distinct !DISubprogram(name: "new_control_record", scope: !2, file: !2, line: 1010, type: !583, scopeLine: 1011, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{!512}
!585 = !{!586}
!586 = !DILocalVariable(name: "p", scope: !582, file: !2, line: 1013, type: !512)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "control_used", scope: !29, file: !2, line: 175, type: !52, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "controls", scope: !29, file: !2, line: 172, type: !512, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1051, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 36)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1063, type: !558, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "term_sig", scope: !29, file: !600, line: 6, type: !601, isLocal: true, isDefinition: true)
!600 = !DIFile(filename: "src/term-sig.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d5de988e1d621d74adbec0ff67a5bdb7")
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 704, elements: !603)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!603 = !{!604}
!604 = !DISubrange(count: 22)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 784, type: !277, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "head", scope: !29, file: !2, line: 114, type: !609, isLocal: true, isDefinition: true)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_record", file: !2, line: 95, size: 576, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !634, !635}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloc", scope: !610, file: !2, line: 97, baseType: !52, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !610, file: !2, line: 98, baseType: !52, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !610, file: !2, line: 99, baseType: !407, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !610, file: !2, line: 100, baseType: !407, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "num_lines", scope: !610, file: !2, line: 101, baseType: !52, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !610, file: !2, line: 102, baseType: !46, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !610, file: !2, line: 103, baseType: !619, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !2, line: 83, size: 10496, elements: !621)
!621 = !{!622, !623, !624, !625, !633}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !620, file: !2, line: 85, baseType: !52, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "insert_index", scope: !620, file: !2, line: 86, baseType: !52, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_index", scope: !620, file: !2, line: 87, baseType: !52, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !620, file: !2, line: 88, baseType: !626, size: 10240, offset: 192)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 10240, elements: !631)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cstring", file: !2, line: 75, size: 128, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !627, file: !2, line: 77, baseType: !52, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !627, file: !2, line: 78, baseType: !46, size: 64, offset: 64)
!631 = !{!632}
!632 = !DISubrange(count: 80)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !2, line: 89, baseType: !619, size: 64, offset: 10432)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "curr_line", scope: !610, file: !2, line: 104, baseType: !619, size: 64, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !2, line: 105, baseType: !609, size: 64, offset: 512)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "have_read_eof", scope: !29, file: !2, line: 129, type: !332, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "hold_count", scope: !29, file: !2, line: 120, type: !52, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "last_line_number", scope: !29, file: !2, line: 123, type: !407, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "hold_area", scope: !29, file: !2, line: 117, type: !46, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "current_line", scope: !29, file: !2, line: 126, type: !407, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 723, type: !24, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 727, type: !400, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !2, line: 729, type: !494, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "prev_buf", scope: !654, file: !2, line: 518, type: !609, isLocal: true, isDefinition: true)
!654 = distinct !DISubprogram(name: "remove_line", scope: !2, file: !2, line: 513, type: !655, scopeLine: 514, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !658)
!655 = !DISubroutineType(types: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!658 = !{!659, !660}
!659 = !DILocalVariable(name: "line", scope: !654, file: !2, line: 520, type: !657)
!660 = !DILocalVariable(name: "l", scope: !654, file: !2, line: 521, type: !619)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 629, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 29)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !2, line: 669, type: !668, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 33)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !2, line: 912, type: !494, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !36, line: 736, type: !307, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !677, file: !36, line: 575, type: !37, isLocal: true, isDefinition: true)
!677 = distinct !DISubprogram(name: "oputs_", scope: !36, file: !36, line: 573, type: !678, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !29, retainedNodes: !680)
!678 = !DISubroutineType(cc: DW_CC_nocall, types: !679)
!679 = !{null, !222, !222}
!680 = !{!681, !682, !683, !686, !687, !688, !689, !693, !694, !695, !696, !698, !699, !700, !701, !703, !704}
!681 = !DILocalVariable(name: "program", arg: 1, scope: !677, file: !36, line: 573, type: !222)
!682 = !DILocalVariable(name: "option", arg: 2, scope: !677, file: !36, line: 573, type: !222)
!683 = !DILocalVariable(name: "term", scope: !684, file: !36, line: 585, type: !222)
!684 = distinct !DILexicalBlock(scope: !685, file: !36, line: 582, column: 5)
!685 = distinct !DILexicalBlock(scope: !677, file: !36, line: 581, column: 7)
!686 = !DILocalVariable(name: "double_space", scope: !677, file: !36, line: 594, type: !332)
!687 = !DILocalVariable(name: "first_word", scope: !677, file: !36, line: 595, type: !222)
!688 = !DILocalVariable(name: "option_text", scope: !677, file: !36, line: 596, type: !222)
!689 = !DILocalVariable(name: "s", scope: !690, file: !36, line: 608, type: !222)
!690 = distinct !DILexicalBlock(scope: !691, file: !36, line: 605, column: 5)
!691 = distinct !DILexicalBlock(scope: !692, file: !36, line: 604, column: 12)
!692 = distinct !DILexicalBlock(scope: !677, file: !36, line: 597, column: 7)
!693 = !DILocalVariable(name: "spaces", scope: !690, file: !36, line: 609, type: !220)
!694 = !DILocalVariable(name: "anchor_len", scope: !677, file: !36, line: 620, type: !220)
!695 = !DILocalVariable(name: "desc_text", scope: !677, file: !36, line: 625, type: !222)
!696 = !DILocalVariable(name: "__ptr", scope: !697, file: !36, line: 644, type: !222)
!697 = distinct !DILexicalBlock(scope: !677, file: !36, line: 644, column: 3)
!698 = !DILocalVariable(name: "__stream", scope: !697, file: !36, line: 644, type: !353)
!699 = !DILocalVariable(name: "__cnt", scope: !697, file: !36, line: 644, type: !220)
!700 = !DILocalVariable(name: "url_program", scope: !677, file: !36, line: 648, type: !222)
!701 = !DILocalVariable(name: "__ptr", scope: !702, file: !36, line: 686, type: !222)
!702 = distinct !DILexicalBlock(scope: !677, file: !36, line: 686, column: 3)
!703 = !DILocalVariable(name: "__stream", scope: !702, file: !36, line: 686, type: !353)
!704 = !DILocalVariable(name: "__cnt", scope: !702, file: !36, line: 686, type: !220)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !36, line: 585, type: !348, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !36, line: 586, type: !348, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !36, line: 595, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 4)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !36, line: 620, type: !419, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !36, line: 648, type: !494, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !36, line: 648, type: !348, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !36, line: 649, type: !711, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !36, line: 649, type: !3, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !36, line: 650, type: !348, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !36, line: 651, type: !419, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !36, line: 651, type: !419, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !36, line: 652, type: !238, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !36, line: 653, type: !441, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !36, line: 654, type: !19, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !36, line: 655, type: !19, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !36, line: 656, type: !19, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !36, line: 657, type: !19, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !36, line: 663, type: !238, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !36, line: 664, type: !19, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !36, line: 669, type: !9, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !36, line: 669, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 40)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !36, line: 676, type: !233, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !36, line: 676, type: !568, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !36, line: 679, type: !3, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !36, line: 683, type: !348, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !36, line: 688, type: !348, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !36, line: 691, type: !441, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !36, line: 839, type: !253, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !36, line: 840, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !603)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !36, line: 841, type: !233, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !36, line: 862, type: !711, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !36, line: 868, type: !297, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !36, line: 875, type: !499, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !36, line: 877, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 51)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !36, line: 877, type: !248, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!786 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!787 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !791, line: 3, type: !233, isLocal: true, isDefinition: true)
!791 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "Version", scope: !794, file: !791, line: 3, type: !222, isLocal: false, isDefinition: true)
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !795, splitDebugInlining: false, nameTableKind: None)
!795 = !{!789, !792}
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "file_name", scope: !798, file: !799, line: 45, type: !222, isLocal: true, isDefinition: true)
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !800, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!800 = !{!801, !803, !805, !807, !796, !809}
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !799, line: 121, type: !238, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !799, line: 121, type: !248, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !799, line: 123, type: !238, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !799, line: 126, type: !3, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !798, file: !799, line: 55, type: !332, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !813, file: !814, line: 66, type: !168, isLocal: false, isDefinition: true)
!813 = distinct !DICompileUnit(language: DW_LANG_C11, file: !814, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !815, globals: !816, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!815 = !{!113, !224}
!816 = !{!817, !819, !843, !845, !847, !849, !811, !851, !853, !855, !857, !862}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !814, line: 272, type: !348, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "old_file_name", scope: !821, file: !814, line: 304, type: !222, isLocal: true, isDefinition: true)
!821 = distinct !DISubprogram(name: "verror_at_line", scope: !814, file: !814, line: 298, type: !822, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !813, retainedNodes: !836)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !37, !37, !222, !32, !222, !824}
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !825, line: 52, baseType: !826)
!825 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !827, line: 12, baseType: !828)
!827 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !814, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !830)
!830 = !{!831, !832, !833, !834, !835}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !829, file: !814, baseType: !113, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !829, file: !814, baseType: !113, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !829, file: !814, baseType: !113, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !829, file: !814, baseType: !37, size: 32, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !829, file: !814, baseType: !37, size: 32, offset: 224)
!836 = !{!837, !838, !839, !840, !841, !842}
!837 = !DILocalVariable(name: "status", arg: 1, scope: !821, file: !814, line: 298, type: !37)
!838 = !DILocalVariable(name: "errnum", arg: 2, scope: !821, file: !814, line: 298, type: !37)
!839 = !DILocalVariable(name: "file_name", arg: 3, scope: !821, file: !814, line: 298, type: !222)
!840 = !DILocalVariable(name: "line_number", arg: 4, scope: !821, file: !814, line: 298, type: !32)
!841 = !DILocalVariable(name: "message", arg: 5, scope: !821, file: !814, line: 298, type: !222)
!842 = !DILocalVariable(name: "args", arg: 6, scope: !821, file: !814, line: 298, type: !824)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "old_line_number", scope: !821, file: !814, line: 305, type: !32, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !814, line: 338, type: !711, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !814, line: 346, type: !441, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !814, line: 346, type: !494, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "error_message_count", scope: !813, file: !814, line: 69, type: !32, isLocal: false, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !813, file: !814, line: 295, type: !37, isLocal: false, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !814, line: 208, type: !238, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !814, line: 208, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 21)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !814, line: 214, type: !348, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "exit_failure", scope: !866, file: !867, line: 24, type: !412, isLocal: false, isDefinition: true)
!866 = distinct !DICompileUnit(language: DW_LANG_C11, file: !867, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !868, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!868 = !{!864}
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "program_name", scope: !871, file: !872, line: 31, type: !222, isLocal: false, isDefinition: true)
!871 = distinct !DICompileUnit(language: DW_LANG_C11, file: !872, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !873, globals: !874, splitDebugInlining: false, nameTableKind: None)
!872 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!873 = !{!113, !46}
!874 = !{!869, !875, !877}
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !872, line: 46, type: !441, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !872, line: 49, type: !711, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "utf07FF", scope: !881, file: !882, line: 46, type: !908, isLocal: true, isDefinition: true)
!881 = distinct !DISubprogram(name: "proper_name_lite", scope: !882, file: !882, line: 38, type: !883, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !885, retainedNodes: !887)
!882 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!883 = !DISubroutineType(types: !884)
!884 = !{!222, !222, !222}
!885 = distinct !DICompileUnit(language: DW_LANG_C11, file: !882, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !886, splitDebugInlining: false, nameTableKind: None)
!886 = !{!879}
!887 = !{!888, !889, !890, !891, !895}
!888 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !881, file: !882, line: 38, type: !222)
!889 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !881, file: !882, line: 38, type: !222)
!890 = !DILocalVariable(name: "translation", scope: !881, file: !882, line: 40, type: !222)
!891 = !DILocalVariable(name: "w", scope: !881, file: !882, line: 47, type: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !893, line: 37, baseType: !894)
!893 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !98, line: 57, baseType: !144)
!895 = !DILocalVariable(name: "mbs", scope: !881, file: !882, line: 48, type: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !897, line: 6, baseType: !898)
!897 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !899, line: 21, baseType: !900)
!899 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !899, line: 13, size: 64, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !900, file: !899, line: 15, baseType: !37, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !900, file: !899, line: 20, baseType: !904, size: 32, offset: 32)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !900, file: !899, line: 16, size: 32, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !904, file: !899, line: 18, baseType: !32, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !904, file: !899, line: 19, baseType: !711, size: 32)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 16, elements: !495)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !911, line: 78, type: !441, isLocal: true, isDefinition: true)
!911 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !911, line: 79, type: !419, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !911, line: 80, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 13)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !911, line: 81, type: !916, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !911, line: 82, type: !400, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !911, line: 83, type: !494, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !911, line: 84, type: !441, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !911, line: 85, type: !238, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !911, line: 86, type: !238, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !911, line: 87, type: !441, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !935, file: !911, line: 76, type: !1009, isLocal: false, isDefinition: true)
!935 = distinct !DICompileUnit(language: DW_LANG_C11, file: !911, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !936, retainedTypes: !944, globals: !945, splitDebugInlining: false, nameTableKind: None)
!936 = !{!937, !939, !195}
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !938, line: 42, baseType: !32, size: 32, elements: !179)
!938 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !938, line: 254, baseType: !32, size: 32, elements: !940)
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!942 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!943 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!944 = !{!113, !37, !219, !220}
!945 = !{!909, !912, !914, !919, !921, !923, !925, !927, !929, !931, !933, !946, !950, !960, !962, !967, !969, !971, !973, !975, !998, !1005, !1007}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !935, file: !911, line: 92, type: !948, isLocal: false, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 320, elements: !20)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !935, file: !911, line: 1040, type: !952, isLocal: false, isDefinition: true)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !911, line: 56, size: 448, elements: !953)
!953 = !{!954, !955, !956, !958, !959}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !952, file: !911, line: 59, baseType: !937, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !911, line: 62, baseType: !37, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !952, file: !911, line: 66, baseType: !957, size: 256, offset: 64)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, elements: !442)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !952, file: !911, line: 69, baseType: !222, size: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !952, file: !911, line: 72, baseType: !222, size: 64, offset: 384)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !935, file: !911, line: 107, type: !952, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "slot0", scope: !935, file: !911, line: 831, type: !964, isLocal: true, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 256)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !911, line: 321, type: !494, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !911, line: 357, type: !494, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !911, line: 358, type: !494, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !911, line: 199, type: !238, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "quote", scope: !977, file: !911, line: 228, type: !996, isLocal: true, isDefinition: true)
!977 = distinct !DISubprogram(name: "gettext_quote", scope: !911, file: !911, line: 197, type: !978, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !935, retainedNodes: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{!222, !222, !937}
!980 = !{!981, !982, !983, !984, !985}
!981 = !DILocalVariable(name: "msgid", arg: 1, scope: !977, file: !911, line: 197, type: !222)
!982 = !DILocalVariable(name: "s", arg: 2, scope: !977, file: !911, line: 197, type: !937)
!983 = !DILocalVariable(name: "translation", scope: !977, file: !911, line: 199, type: !222)
!984 = !DILocalVariable(name: "w", scope: !977, file: !911, line: 229, type: !892)
!985 = !DILocalVariable(name: "mbs", scope: !977, file: !911, line: 230, type: !986)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !897, line: 6, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !899, line: 21, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !899, line: 13, size: 64, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !988, file: !899, line: 15, baseType: !37, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !988, file: !899, line: 20, baseType: !992, size: 32, offset: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !899, line: 16, size: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !992, file: !899, line: 18, baseType: !32, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !992, file: !899, line: 19, baseType: !711, size: 32)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 64, elements: !997)
!997 = !{!496, !713}
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "slotvec", scope: !935, file: !911, line: 834, type: !1000, isLocal: true, isDefinition: true)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !911, line: 823, size: 128, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1001, file: !911, line: 825, baseType: !220, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1001, file: !911, line: 826, baseType: !46, size: 64, offset: 64)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "nslots", scope: !935, file: !911, line: 832, type: !37, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "slotvec0", scope: !935, file: !911, line: 833, type: !1001, isLocal: true, isDefinition: true)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 704, elements: !229)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 67, type: !248, isLocal: true, isDefinition: true)
!1013 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 69, type: !238, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 83, type: !238, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 83, type: !711, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 85, type: !494, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 88, type: !1024, isLocal: true, isDefinition: true)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 171)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 88, type: !1029, isLocal: true, isDefinition: true)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 34)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 105, type: !253, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 109, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 23)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 113, type: !1041, isLocal: true, isDefinition: true)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !91)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 120, type: !1044, isLocal: true, isDefinition: true)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 32)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !1013, line: 127, type: !593, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
