; ModuleID = 'src/date.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.calendar_month_name = type { ptr, ptr }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.table = type { ptr, i32, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.calendar_date = type { i32, i32, i32, ptr }
%struct.parser_control = type { ptr, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }

!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!613 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !615, line: 18, baseType: !616)
!615 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!616 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!619 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!620 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !102, !107, !112, !117, !122, !124, !129, !131, !136, !141, !146, !151, !156, !161, !621, !714, !719, !723, !725, !730, !735, !740, !745, !750, !752, !754, !759, !764, !769, !774, !776, !780, !782, !784, !786, !788, !793, !872, !874, !876, !881, !883, !886, !888, !890, !892, !894, !896, !898, !903, !905, !907, !909, !911, !913, !915, !917, !919, !924, !929, !934, !936, !938, !940, !942, !944, !949, !951, !953, !958, !963, !968, !166, !973, !975, !977, !982, !984, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1018, !1022, !1024, !1026, !1028, !1030, !1034, !1039, !1041, !1043, !1045, !1047, !1049, !1054, !1056, !1058, !1060, !1062, !1064}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !623, file: !2, line: 517, type: !710, isLocal: true, isDefinition: true)
!623 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 474, type: !624, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !627)
!624 = !DISubroutineType(types: !625)
!625 = !{!185, !185, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!627 = !{!628, !629, !630, !631, !632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !646, !648, !649, !650, !651, !652, !657, !658, !661, !671, !707}
!628 = !DILocalVariable(name: "argc", arg: 1, scope: !623, file: !2, line: 474, type: !185)
!629 = !DILocalVariable(name: "argv", arg: 2, scope: !623, file: !2, line: 474, type: !626)
!630 = !DILocalVariable(name: "datestr", scope: !623, file: !2, line: 476, type: !617)
!631 = !DILocalVariable(name: "set_datestr", scope: !623, file: !2, line: 477, type: !617)
!632 = !DILocalVariable(name: "set_date", scope: !623, file: !2, line: 478, type: !633)
!633 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!634 = !DILocalVariable(name: "format", scope: !623, file: !2, line: 479, type: !617)
!635 = !DILocalVariable(name: "format_in_c_locale", scope: !623, file: !2, line: 480, type: !633)
!636 = !DILocalVariable(name: "get_resolution", scope: !623, file: !2, line: 481, type: !633)
!637 = !DILocalVariable(name: "batch_file", scope: !623, file: !2, line: 482, type: !611)
!638 = !DILocalVariable(name: "reference", scope: !623, file: !2, line: 483, type: !611)
!639 = !DILocalVariable(name: "discarded_datestr", scope: !623, file: !2, line: 484, type: !633)
!640 = !DILocalVariable(name: "discarded_set_datestr", scope: !623, file: !2, line: 485, type: !633)
!641 = !DILocalVariable(name: "optc", scope: !623, file: !2, line: 495, type: !185)
!642 = !DILocalVariable(name: "i", scope: !643, file: !2, line: 523, type: !176)
!643 = distinct !DILexicalBlock(scope: !644, file: !2, line: 516, column: 11)
!644 = distinct !DILexicalBlock(scope: !645, file: !2, line: 500, column: 9)
!645 = distinct !DILexicalBlock(scope: !623, file: !2, line: 498, column: 5)
!646 = !DILocalVariable(name: "i", scope: !647, file: !2, line: 540, type: !176)
!647 = distinct !DILexicalBlock(scope: !644, file: !2, line: 531, column: 11)
!648 = !DILocalVariable(name: "option_specified_date", scope: !623, file: !2, line: 576, type: !185)
!649 = !DILocalVariable(name: "format_copy", scope: !623, file: !2, line: 644, type: !611)
!650 = !DILocalVariable(name: "format_res", scope: !623, file: !2, line: 645, type: !617)
!651 = !DILocalVariable(name: "tzstring", scope: !623, file: !2, line: 646, type: !617)
!652 = !DILocalVariable(name: "tz", scope: !623, file: !2, line: 647, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !654, line: 1039, baseType: !655)
!654 = !DIFile(filename: "./lib/time.h", directory: "/src")
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !654, line: 1039, flags: DIFlagFwdDecl)
!657 = !DILocalVariable(name: "ok", scope: !623, file: !2, line: 649, type: !633)
!658 = !DILocalVariable(name: "valid_date", scope: !659, file: !2, line: 655, type: !633)
!659 = distinct !DILexicalBlock(scope: !660, file: !2, line: 654, column: 5)
!660 = distinct !DILexicalBlock(scope: !623, file: !2, line: 650, column: 7)
!661 = !DILocalVariable(name: "when", scope: !659, file: !2, line: 656, type: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !663, line: 11, size: 128, elements: !664)
!663 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!664 = !{!665, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !662, file: !663, line: 16, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !667, line: 160, baseType: !668)
!667 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!668 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !662, file: !663, line: 21, baseType: !670, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !667, line: 197, baseType: !668)
!671 = !DILocalVariable(name: "refstats", scope: !672, file: !2, line: 683, type: !676)
!672 = distinct !DILexicalBlock(scope: !673, file: !2, line: 682, column: 13)
!673 = distinct !DILexicalBlock(scope: !674, file: !2, line: 681, column: 15)
!674 = distinct !DILexicalBlock(scope: !675, file: !2, line: 679, column: 9)
!675 = distinct !DILexicalBlock(scope: !659, file: !2, line: 658, column: 11)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !677, line: 44, size: 1024, elements: !678)
!677 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!678 = !{!679, !681, !683, !685, !687, !689, !691, !692, !693, !695, !697, !698, !700, !701, !702, !703}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !676, file: !677, line: 46, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !667, line: 145, baseType: !616)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !676, file: !677, line: 47, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !667, line: 148, baseType: !616)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !676, file: !677, line: 48, baseType: !684, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !667, line: 150, baseType: !171)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !676, file: !677, line: 49, baseType: !686, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !667, line: 151, baseType: !171)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !676, file: !677, line: 50, baseType: !688, size: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !667, line: 146, baseType: !171)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !676, file: !677, line: 51, baseType: !690, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !667, line: 147, baseType: !171)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !676, file: !677, line: 52, baseType: !680, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !676, file: !677, line: 53, baseType: !680, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !676, file: !677, line: 54, baseType: !694, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !667, line: 152, baseType: !668)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !676, file: !677, line: 55, baseType: !696, size: 32, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !667, line: 175, baseType: !185)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !676, file: !677, line: 56, baseType: !185, size: 32, offset: 480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !676, file: !677, line: 57, baseType: !699, size: 64, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !667, line: 180, baseType: !668)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !676, file: !677, line: 65, baseType: !662, size: 128, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !676, file: !677, line: 66, baseType: !662, size: 128, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !676, file: !677, line: 67, baseType: !662, size: 128, offset: 832)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !676, file: !677, line: 79, baseType: !704, size: 64, offset: 960)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 2)
!707 = !DILocalVariable(name: "res", scope: !708, file: !2, line: 690, type: !668)
!708 = distinct !DILexicalBlock(scope: !709, file: !2, line: 689, column: 13)
!709 = distinct !DILexicalBlock(scope: !673, file: !2, line: 688, column: 20)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 768, elements: !711)
!711 = !{!712, !713}
!712 = !DISubrange(count: 3)
!713 = !DISubrange(count: 32)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !2, line: 524, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 11)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !623, file: !2, line: 532, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 1280, elements: !722)
!722 = !{!21, !713}
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 542, type: !716, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !2, line: 565, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 8)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 14)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 16)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 65)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 63)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !3, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !3, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 603, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 17)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 610, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 34)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !2, line: 615, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1160, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 145)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 6)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 640, type: !163, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !2, line: 646, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !779)
!779 = !{!712}
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !2, line: 685, type: !778, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !2, line: 705, type: !737, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !2, line: 713, type: !737, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !168, file: !2, line: 108, type: !171, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !184, line: 736, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 75)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !795, file: !184, line: 575, type: !185, isLocal: true, isDefinition: true)
!795 = distinct !DISubprogram(name: "oputs_", scope: !184, file: !184, line: 573, type: !796, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !798)
!796 = !DISubroutineType(cc: DW_CC_nocall, types: !797)
!797 = !{null, !617, !617}
!798 = !{!799, !800, !801, !804, !805, !806, !807, !811, !812, !813, !814, !816, !866, !867, !868, !870, !871}
!799 = !DILocalVariable(name: "program", arg: 1, scope: !795, file: !184, line: 573, type: !617)
!800 = !DILocalVariable(name: "option", arg: 2, scope: !795, file: !184, line: 573, type: !617)
!801 = !DILocalVariable(name: "term", scope: !802, file: !184, line: 585, type: !617)
!802 = distinct !DILexicalBlock(scope: !803, file: !184, line: 582, column: 5)
!803 = distinct !DILexicalBlock(scope: !795, file: !184, line: 581, column: 7)
!804 = !DILocalVariable(name: "double_space", scope: !795, file: !184, line: 594, type: !633)
!805 = !DILocalVariable(name: "first_word", scope: !795, file: !184, line: 595, type: !617)
!806 = !DILocalVariable(name: "option_text", scope: !795, file: !184, line: 596, type: !617)
!807 = !DILocalVariable(name: "s", scope: !808, file: !184, line: 608, type: !617)
!808 = distinct !DILexicalBlock(scope: !809, file: !184, line: 605, column: 5)
!809 = distinct !DILexicalBlock(scope: !810, file: !184, line: 604, column: 12)
!810 = distinct !DILexicalBlock(scope: !795, file: !184, line: 597, column: 7)
!811 = !DILocalVariable(name: "spaces", scope: !808, file: !184, line: 609, type: !614)
!812 = !DILocalVariable(name: "anchor_len", scope: !795, file: !184, line: 620, type: !614)
!813 = !DILocalVariable(name: "desc_text", scope: !795, file: !184, line: 625, type: !617)
!814 = !DILocalVariable(name: "__ptr", scope: !815, file: !184, line: 644, type: !617)
!815 = distinct !DILexicalBlock(scope: !795, file: !184, line: 644, column: 3)
!816 = !DILocalVariable(name: "__stream", scope: !815, file: !184, line: 644, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !819, line: 7, baseType: !820)
!819 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !821, line: 49, size: 1728, elements: !822)
!821 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !838, !840, !841, !842, !843, !844, !846, !847, !850, !852, !855, !858, !859, !860, !861, !862}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !820, file: !821, line: 51, baseType: !185, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !820, file: !821, line: 54, baseType: !611, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !820, file: !821, line: 55, baseType: !611, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !820, file: !821, line: 56, baseType: !611, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !820, file: !821, line: 57, baseType: !611, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !820, file: !821, line: 58, baseType: !611, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !820, file: !821, line: 59, baseType: !611, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !820, file: !821, line: 60, baseType: !611, size: 64, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !820, file: !821, line: 61, baseType: !611, size: 64, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !820, file: !821, line: 64, baseType: !611, size: 64, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !820, file: !821, line: 65, baseType: !611, size: 64, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !820, file: !821, line: 66, baseType: !611, size: 64, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !820, file: !821, line: 68, baseType: !836, size: 64, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !821, line: 36, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !820, file: !821, line: 70, baseType: !839, size: 64, offset: 832)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !820, file: !821, line: 72, baseType: !185, size: 32, offset: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !820, file: !821, line: 73, baseType: !185, size: 32, offset: 928)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !820, file: !821, line: 74, baseType: !694, size: 64, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !820, file: !821, line: 77, baseType: !613, size: 16, offset: 1024)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !820, file: !821, line: 78, baseType: !845, size: 8, offset: 1040)
!845 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !820, file: !821, line: 79, baseType: !153, size: 8, offset: 1048)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !820, file: !821, line: 81, baseType: !848, size: 64, offset: 1088)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !821, line: 43, baseType: null)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !820, file: !821, line: 89, baseType: !851, size: 64, offset: 1152)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !667, line: 153, baseType: !668)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !820, file: !821, line: 91, baseType: !853, size: 64, offset: 1216)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !821, line: 37, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !820, file: !821, line: 92, baseType: !856, size: 64, offset: 1280)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !821, line: 38, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !820, file: !821, line: 93, baseType: !839, size: 64, offset: 1344)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !820, file: !821, line: 94, baseType: !612, size: 64, offset: 1408)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !820, file: !821, line: 95, baseType: !614, size: 64, offset: 1472)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !820, file: !821, line: 96, baseType: !185, size: 32, offset: 1536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !820, file: !821, line: 98, baseType: !863, size: 160, offset: 1568)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 20)
!866 = !DILocalVariable(name: "__cnt", scope: !815, file: !184, line: 644, type: !614)
!867 = !DILocalVariable(name: "url_program", scope: !795, file: !184, line: 648, type: !617)
!868 = !DILocalVariable(name: "__ptr", scope: !869, file: !184, line: 686, type: !617)
!869 = distinct !DILexicalBlock(scope: !795, file: !184, line: 686, column: 3)
!870 = !DILocalVariable(name: "__stream", scope: !869, file: !184, line: 686, type: !817)
!871 = !DILocalVariable(name: "__cnt", scope: !869, file: !184, line: 686, type: !614)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !184, line: 585, type: !19, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !184, line: 586, type: !19, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !184, line: 595, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 4)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !184, line: 620, type: !771, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !184, line: 648, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !705)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !184, line: 648, type: !19, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !184, line: 649, type: !878, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !184, line: 649, type: !778, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !184, line: 650, type: !19, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !184, line: 651, type: !771, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !184, line: 651, type: !771, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !184, line: 652, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 7)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !184, line: 653, type: !727, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !184, line: 654, type: !158, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !184, line: 655, type: !158, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !184, line: 656, type: !158, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !184, line: 657, type: !158, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !184, line: 663, type: !900, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !184, line: 664, type: !158, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !184, line: 669, type: !756, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !184, line: 669, type: !921, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 40)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !184, line: 676, type: !926, isLocal: true, isDefinition: true)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 15)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !184, line: 676, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 61)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !184, line: 679, type: !778, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !184, line: 683, type: !19, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !184, line: 688, type: !19, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !184, line: 691, type: !727, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !184, line: 839, type: !737, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !184, line: 840, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 22)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !184, line: 841, type: !926, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !184, line: 862, type: !878, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !184, line: 868, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 71)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !184, line: 875, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 27)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !184, line: 877, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 51)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !184, line: 877, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 12)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !771, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !19, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !2, line: 91, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 9)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !158, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !716, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !158, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !727, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !979, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !979, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !878, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !878, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 100, type: !878, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !158, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !19, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !727, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "long_options", scope: !168, file: !2, line: 86, type: !1008, isLocal: true, isDefinition: true)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 4352, elements: !757)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !1011, line: 50, size: 256, elements: !1012)
!1011 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!1012 = !{!1013, !1014, !1015, !1017}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !1011, line: 52, baseType: !617, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1010, file: !1011, line: 55, baseType: !185, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1010, file: !1011, line: 56, baseType: !1016, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1010, file: !1011, line: 57, baseType: !185, size: 32, offset: 192)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "time_spec", scope: !168, file: !2, line: 65, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 160, elements: !20)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !771, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !727, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !727, isLocal: true, isDefinition: true)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !778, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !168, file: !2, line: 58, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 384, elements: !772)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !168, file: !2, line: 73, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 200, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 25)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !2, line: 421, type: !885, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !926, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !2, line: 428, type: !885, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !2, line: 442, type: !926, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !184, line: 952, type: !970, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 18)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !2, line: 396, type: !885, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !2, line: 357, type: !900, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !2, line: 363, type: !979, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !727, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !2, line: 365, type: !970, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !2, line: 366, type: !716, isLocal: true, isDefinition: true)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 112, elements: !733)
!1067 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !1070, line: 27, type: !163, isLocal: true, isDefinition: true)
!1070 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1070, line: 35, type: !1051, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !1075, line: 3, type: !926, isLocal: true, isDefinition: true)
!1075 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "Version", scope: !1078, file: !1075, line: 3, type: !617, isLocal: false, isDefinition: true)
!1078 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1075, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1079, splitDebugInlining: false, nameTableKind: None)
!1079 = !{!1073, !1076}
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1082, file: !1083, line: 65, type: !1107, isLocal: false, isDefinition: true)
!1082 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1083, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1084, retainedTypes: !1087, globals: !1088, splitDebugInlining: false, nameTableKind: None)
!1083 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1084 = !{!1085}
!1085 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1086, line: 42, baseType: !171, size: 32, elements: !577)
!1086 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1087 = !{!612, !617, !619}
!1088 = !{!1080, !1089, !1091, !1093, !1098, !1103, !1105}
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 141, type: !900, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 141, type: !960, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 142, type: !1095, isLocal: true, isDefinition: true)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 29)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 160, type: !1100, isLocal: true, isDefinition: true)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 21)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 165, type: !727, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 170, type: !19, isLocal: true, isDefinition: true)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1108, line: 69, baseType: !1109)
!1108 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null}
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(name: "file_name", scope: !1114, file: !1115, line: 45, type: !617, isLocal: true, isDefinition: true)
!1114 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1115, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1116, splitDebugInlining: false, nameTableKind: None)
!1115 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1116 = !{!1117, !1119, !1121, !1123, !1112, !1125}
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !1115, line: 121, type: !900, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !1115, line: 121, type: !970, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !1115, line: 123, type: !900, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !1115, line: 126, type: !778, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1114, file: !1115, line: 55, type: !633, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1129, file: !1130, line: 66, type: !1109, isLocal: false, isDefinition: true)
!1129 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1130, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1131, globals: !1132, splitDebugInlining: false, nameTableKind: None)
!1130 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1131 = !{!612, !619}
!1132 = !{!1133, !1135, !1159, !1161, !1163, !1165, !1127, !1167, !1169, !1171, !1173, !1175}
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 272, type: !19, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1137, file: !1130, line: 304, type: !617, isLocal: true, isDefinition: true)
!1137 = distinct !DISubprogram(name: "verror_at_line", scope: !1130, file: !1130, line: 298, type: !1138, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1129, retainedNodes: !1152)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null, !185, !185, !617, !171, !617, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1141, line: 52, baseType: !1142)
!1141 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1143, line: 12, baseType: !1144)
!1143 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1130, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1145, file: !1130, baseType: !612, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1145, file: !1130, baseType: !612, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1145, file: !1130, baseType: !612, size: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1145, file: !1130, baseType: !185, size: 32, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1145, file: !1130, baseType: !185, size: 32, offset: 224)
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1158}
!1153 = !DILocalVariable(name: "status", arg: 1, scope: !1137, file: !1130, line: 298, type: !185)
!1154 = !DILocalVariable(name: "errnum", arg: 2, scope: !1137, file: !1130, line: 298, type: !185)
!1155 = !DILocalVariable(name: "file_name", arg: 3, scope: !1137, file: !1130, line: 298, type: !617)
!1156 = !DILocalVariable(name: "line_number", arg: 4, scope: !1137, file: !1130, line: 298, type: !171)
!1157 = !DILocalVariable(name: "message", arg: 5, scope: !1137, file: !1130, line: 298, type: !617)
!1158 = !DILocalVariable(name: "args", arg: 6, scope: !1137, file: !1130, line: 298, type: !1140)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1137, file: !1130, line: 305, type: !171, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 338, type: !878, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 346, type: !727, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 346, type: !885, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1129, file: !1130, line: 69, type: !171, isLocal: false, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1129, file: !1130, line: 295, type: !185, isLocal: false, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 208, type: !900, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 208, type: !1100, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !1130, line: 214, type: !19, isLocal: true, isDefinition: true)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 1143, type: !771, isLocal: true, isDefinition: true)
!1179 = !DIFile(filename: "lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 1146, type: !727, isLocal: true, isDefinition: true)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 1149, type: !771, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !1186, file: !1215, line: 75, type: !1288, isLocal: true, isDefinition: true)
!1186 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1187, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fprintftime.o -MD -MP -MF lib/.deps/libcoreutils_a-fprintftime.Tpo -c lib/fprintftime.c -o lib/.libcoreutils_a-fprintftime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1188, retainedTypes: !1196, globals: !1208, splitDebugInlining: false, nameTableKind: None)
!1187 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!1188 = !{!1189}
!1189 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !1179, line: 163, baseType: !171, size: 32, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195}
!1191 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!1192 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!1193 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!1194 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!1195 = !DIEnumerator(name: "NO_PAD", value: 4)
!1196 = !{!612, !171, !185, !619, !1197}
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !654, line: 1039, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1200, line: 24, size: 128, elements: !1201)
!1200 = !DIFile(filename: "lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!1201 = !{!1202, !1203, !1204}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1199, file: !1200, line: 28, baseType: !1198, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1199, file: !1200, line: 33, baseType: !4, size: 8, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1199, file: !1200, line: 45, baseType: !1205, offset: 72)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1206)
!1206 = !{!1207}
!1207 = !DISubrange(count: -1)
!1208 = !{!1177, !1180, !1182, !1209, !1211, !1213, !1184, !1216, !1221, !1223, !1228, !1230, !1232, !1234, !1236, !1238, !1240, !1242, !1245, !1247, !1249, !1251, !1253, !1255, !1257, !1259, !1261, !1263, !1268, !1270, !1272, !1274, !1283, !1286, !1305, !1307, !1309, !1311, !1313, !1315, !1320, !1322, !1324, !1326, !1328, !1330, !1332, !1335, !1338, !1340, !1342, !1344, !1346, !1348, !1350, !1352, !1354, !1356, !1358, !1360, !1362, !1364, !1366, !1368, !1370, !1372, !1374, !1376, !1378, !1380, !1382, !1384, !1386, !1389, !1391, !1393, !1395}
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 1151, type: !771, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 1153, type: !771, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 78, type: !979, isLocal: true, isDefinition: true)
!1215 = !DIFile(filename: "lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!1216 = !DIGlobalVariableExpression(var: !1217, expr: !DIExpression())
!1217 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 26, type: !1218, isLocal: true, isDefinition: true)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !1219)
!1219 = !{!1220}
!1220 = !DISubrange(count: 19)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 26, type: !979, isLocal: true, isDefinition: true)
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 27, type: !1225, isLocal: true, isDefinition: true)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1226)
!1226 = !{!1227}
!1227 = !DISubrange(count: 31)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 27, type: !979, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 28, type: !1218, isLocal: true, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 28, type: !970, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 29, type: !1218, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 29, type: !970, isLocal: true, isDefinition: true)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 30, type: !946, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 30, type: !979, isLocal: true, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 31, type: !1244, isLocal: true, isDefinition: true)
!1244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !1037)
!1245 = !DIGlobalVariableExpression(var: !1246, expr: !DIExpression())
!1246 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 31, type: !970, isLocal: true, isDefinition: true)
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 32, type: !946, isLocal: true, isDefinition: true)
!1249 = !DIGlobalVariableExpression(var: !1250, expr: !DIExpression())
!1250 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 32, type: !979, isLocal: true, isDefinition: true)
!1251 = !DIGlobalVariableExpression(var: !1252, expr: !DIExpression())
!1252 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 33, type: !946, isLocal: true, isDefinition: true)
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 33, type: !979, isLocal: true, isDefinition: true)
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 34, type: !946, isLocal: true, isDefinition: true)
!1257 = !DIGlobalVariableExpression(var: !1258, expr: !DIExpression())
!1258 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 34, type: !979, isLocal: true, isDefinition: true)
!1259 = !DIGlobalVariableExpression(var: !1260, expr: !DIExpression())
!1260 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 35, type: !1218, isLocal: true, isDefinition: true)
!1261 = !DIGlobalVariableExpression(var: !1262, expr: !DIExpression())
!1262 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 35, type: !979, isLocal: true, isDefinition: true)
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 36, type: !1265, isLocal: true, isDefinition: true)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1266)
!1266 = !{!1267}
!1267 = !DISubrange(count: 28)
!1268 = !DIGlobalVariableExpression(var: !1269, expr: !DIExpression())
!1269 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 36, type: !979, isLocal: true, isDefinition: true)
!1270 = !DIGlobalVariableExpression(var: !1271, expr: !DIExpression())
!1271 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 37, type: !946, isLocal: true, isDefinition: true)
!1272 = !DIGlobalVariableExpression(var: !1273, expr: !DIExpression())
!1273 = distinct !DIGlobalVariable(scope: null, file: !1215, line: 37, type: !979, isLocal: true, isDefinition: true)
!1274 = !DIGlobalVariableExpression(var: !1275, expr: !DIExpression())
!1275 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !1186, file: !1215, line: 21, type: !1276, isLocal: true, isDefinition: true)
!1276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1277, size: 1920, elements: !927)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !1279, line: 19, size: 128, elements: !1280)
!1279 = !DIFile(filename: "lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!1280 = !{!1281, !1282}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1278, file: !1279, line: 21, baseType: !617, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !1278, file: !1279, line: 22, baseType: !617, size: 64, offset: 64)
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 134, type: !970, isLocal: true, isDefinition: true)
!1285 = !DIFile(filename: "lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !1186, file: !1285, line: 131, type: !1288, isLocal: true, isDefinition: true)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !1279, line: 33, size: 192, elements: !1290)
!1290 = !{!1291, !1303, !1304}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !1289, file: !1279, line: 39, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!185, !1295, !185, !185, !185}
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !1279, line: 25, size: 192, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1301}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1296, file: !1279, line: 27, baseType: !185, size: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1296, file: !1279, line: 28, baseType: !185, size: 32, offset: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1296, file: !1279, line: 29, baseType: !185, size: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !1296, file: !1279, line: 30, baseType: !1302, size: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !1289, file: !1279, line: 42, baseType: !617, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !1289, file: !1279, line: 44, baseType: !171, size: 32, offset: 128)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 39, type: !926, isLocal: true, isDefinition: true)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 40, type: !756, isLocal: true, isDefinition: true)
!1309 = !DIGlobalVariableExpression(var: !1310, expr: !DIExpression())
!1310 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 41, type: !716, isLocal: true, isDefinition: true)
!1311 = !DIGlobalVariableExpression(var: !1312, expr: !DIExpression())
!1312 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 42, type: !900, isLocal: true, isDefinition: true)
!1313 = !DIGlobalVariableExpression(var: !1314, expr: !DIExpression())
!1314 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 43, type: !716, isLocal: true, isDefinition: true)
!1315 = !DIGlobalVariableExpression(var: !1316, expr: !DIExpression())
!1316 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 44, type: !1317, isLocal: true, isDefinition: true)
!1317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1318)
!1318 = !{!1319}
!1319 = !DISubrange(count: 13)
!1320 = !DIGlobalVariableExpression(var: !1321, expr: !DIExpression())
!1321 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 45, type: !900, isLocal: true, isDefinition: true)
!1322 = !DIGlobalVariableExpression(var: !1323, expr: !DIExpression())
!1323 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 46, type: !979, isLocal: true, isDefinition: true)
!1324 = !DIGlobalVariableExpression(var: !1325, expr: !DIExpression())
!1325 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 47, type: !900, isLocal: true, isDefinition: true)
!1326 = !DIGlobalVariableExpression(var: !1327, expr: !DIExpression())
!1327 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 48, type: !19, isLocal: true, isDefinition: true)
!1328 = !DIGlobalVariableExpression(var: !1329, expr: !DIExpression())
!1329 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 49, type: !979, isLocal: true, isDefinition: true)
!1330 = !DIGlobalVariableExpression(var: !1331, expr: !DIExpression())
!1331 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 50, type: !716, isLocal: true, isDefinition: true)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !1186, file: !1285, line: 37, type: !1334, isLocal: true, isDefinition: true)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1277, size: 1536, elements: !971)
!1335 = !DIGlobalVariableExpression(var: !1336, expr: !DIExpression())
!1336 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !1186, file: !1337, line: 76, type: !1288, isLocal: true, isDefinition: true)
!1337 = !DIFile(filename: "lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!1338 = !DIGlobalVariableExpression(var: !1339, expr: !DIExpression())
!1339 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 23, type: !737, isLocal: true, isDefinition: true)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 23, type: !900, isLocal: true, isDefinition: true)
!1342 = !DIGlobalVariableExpression(var: !1343, expr: !DIExpression())
!1343 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 24, type: !1317, isLocal: true, isDefinition: true)
!1344 = !DIGlobalVariableExpression(var: !1345, expr: !DIExpression())
!1345 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 24, type: !900, isLocal: true, isDefinition: true)
!1346 = !DIGlobalVariableExpression(var: !1347, expr: !DIExpression())
!1347 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 25, type: !158, isLocal: true, isDefinition: true)
!1348 = !DIGlobalVariableExpression(var: !1349, expr: !DIExpression())
!1349 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 25, type: !900, isLocal: true, isDefinition: true)
!1350 = !DIGlobalVariableExpression(var: !1351, expr: !DIExpression())
!1351 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 26, type: !1317, isLocal: true, isDefinition: true)
!1352 = !DIGlobalVariableExpression(var: !1353, expr: !DIExpression())
!1353 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 26, type: !900, isLocal: true, isDefinition: true)
!1354 = !DIGlobalVariableExpression(var: !1355, expr: !DIExpression())
!1355 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 27, type: !900, isLocal: true, isDefinition: true)
!1356 = !DIGlobalVariableExpression(var: !1357, expr: !DIExpression())
!1357 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 28, type: !1317, isLocal: true, isDefinition: true)
!1358 = !DIGlobalVariableExpression(var: !1359, expr: !DIExpression())
!1359 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 28, type: !900, isLocal: true, isDefinition: true)
!1360 = !DIGlobalVariableExpression(var: !1361, expr: !DIExpression())
!1361 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 29, type: !1317, isLocal: true, isDefinition: true)
!1362 = !DIGlobalVariableExpression(var: !1363, expr: !DIExpression())
!1363 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 29, type: !900, isLocal: true, isDefinition: true)
!1364 = !DIGlobalVariableExpression(var: !1365, expr: !DIExpression())
!1365 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 30, type: !1317, isLocal: true, isDefinition: true)
!1366 = !DIGlobalVariableExpression(var: !1367, expr: !DIExpression())
!1367 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 30, type: !900, isLocal: true, isDefinition: true)
!1368 = !DIGlobalVariableExpression(var: !1369, expr: !DIExpression())
!1369 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 31, type: !1317, isLocal: true, isDefinition: true)
!1370 = !DIGlobalVariableExpression(var: !1371, expr: !DIExpression())
!1371 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 31, type: !900, isLocal: true, isDefinition: true)
!1372 = !DIGlobalVariableExpression(var: !1373, expr: !DIExpression())
!1373 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 32, type: !900, isLocal: true, isDefinition: true)
!1374 = !DIGlobalVariableExpression(var: !1375, expr: !DIExpression())
!1375 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 33, type: !158, isLocal: true, isDefinition: true)
!1376 = !DIGlobalVariableExpression(var: !1377, expr: !DIExpression())
!1377 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 33, type: !900, isLocal: true, isDefinition: true)
!1378 = !DIGlobalVariableExpression(var: !1379, expr: !DIExpression())
!1379 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 34, type: !158, isLocal: true, isDefinition: true)
!1380 = !DIGlobalVariableExpression(var: !1381, expr: !DIExpression())
!1381 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 34, type: !900, isLocal: true, isDefinition: true)
!1382 = !DIGlobalVariableExpression(var: !1383, expr: !DIExpression())
!1383 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 35, type: !1317, isLocal: true, isDefinition: true)
!1384 = !DIGlobalVariableExpression(var: !1385, expr: !DIExpression())
!1385 = distinct !DIGlobalVariable(scope: null, file: !1337, line: 35, type: !900, isLocal: true, isDefinition: true)
!1386 = !DIGlobalVariableExpression(var: !1387, expr: !DIExpression())
!1387 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !1186, file: !1337, line: 21, type: !1388, isLocal: true, isDefinition: true)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1277, size: 1664, elements: !1318)
!1389 = !DIGlobalVariableExpression(var: !1390, expr: !DIExpression())
!1390 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 1802, type: !979, isLocal: true, isDefinition: true)
!1391 = !DIGlobalVariableExpression(var: !1392, expr: !DIExpression())
!1392 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 1961, type: !979, isLocal: true, isDefinition: true)
!1393 = !DIGlobalVariableExpression(var: !1394, expr: !DIExpression())
!1394 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 2058, type: !771, isLocal: true, isDefinition: true)
!1395 = !DIGlobalVariableExpression(var: !1396, expr: !DIExpression())
!1396 = distinct !DIGlobalVariable(scope: null, file: !1179, line: 2134, type: !979, isLocal: true, isDefinition: true)
!1397 = !DIGlobalVariableExpression(var: !1398, expr: !DIExpression())
!1398 = distinct !DIGlobalVariable(scope: null, file: !1399, line: 873, type: !153, isLocal: true, isDefinition: true)
!1399 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!1400 = !DIGlobalVariableExpression(var: !1401, expr: !DIExpression())
!1401 = distinct !DIGlobalVariable(scope: null, file: !1399, line: 1032, type: !771, isLocal: true, isDefinition: true)
!1402 = !DIGlobalVariableExpression(var: !1403, expr: !DIExpression())
!1403 = distinct !DIGlobalVariable(scope: null, file: !1404, line: 2855, type: !885, isLocal: true, isDefinition: true)
!1404 = !DIFile(filename: "lib/localename-unsafe.c", directory: "/src", checksumkind: CSK_MD5, checksum: "45a37c67528fdbd78dc60a7c85e31bd5")
!1405 = !DIGlobalVariableExpression(var: !1406, expr: !DIExpression())
!1406 = distinct !DIGlobalVariable(name: "yyval_default", scope: !1407, file: !1408, line: 1600, type: !1733, isLocal: true, isDefinition: true)
!1407 = distinct !DISubprogram(name: "yyparse", scope: !1408, file: !1408, line: 1591, type: !1409, scopeLine: 1592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1483, retainedNodes: !2395)
!1408 = !DIFile(filename: "parse-datetime.c", directory: "/src")
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!185, !1411}
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !1413, line: 252, baseType: !1414)
!1413 = !DIFile(filename: "parse-datetime.y", directory: "/src")
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1413, line: 184, size: 2304, elements: !1415)
!1415 = !{!1416, !1417, !1421, !1422, !1423, !1424, !1425, !1436, !1437, !1438, !1439, !1440, !1445, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !1414, file: !1413, line: 187, baseType: !617, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !1414, file: !1413, line: 190, baseType: !1418, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !1419, line: 101, baseType: !1420)
!1419 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !667, line: 72, baseType: !668)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !1414, file: !1413, line: 193, baseType: !185, size: 32, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !1414, file: !1413, line: 196, baseType: !185, size: 32, offset: 160)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !1414, file: !1413, line: 199, baseType: !185, size: 32, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !1414, file: !1413, line: 202, baseType: !185, size: 32, offset: 224)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1414, file: !1413, line: 205, baseType: !1426, size: 192, offset: 256)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !1413, line: 143, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1413, line: 138, size: 192, elements: !1428)
!1428 = !{!1429, !1430, !1431}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !1427, file: !1413, line: 140, baseType: !633, size: 8)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1427, file: !1413, line: 141, baseType: !1418, size: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !1427, file: !1413, line: 142, baseType: !1432, size: 64, offset: 128)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1433, line: 130, baseType: !1434)
!1433 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1435, line: 18, baseType: !668)
!1435 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1414, file: !1413, line: 206, baseType: !1418, size: 64, offset: 448)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1414, file: !1413, line: 207, baseType: !1418, size: 64, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !1414, file: !1413, line: 208, baseType: !1418, size: 64, offset: 576)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1414, file: !1413, line: 209, baseType: !1418, size: 64, offset: 640)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1414, file: !1413, line: 210, baseType: !1441, size: 128, offset: 704)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !663, line: 11, size: 128, elements: !1442)
!1442 = !{!1443, !1444}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1441, file: !663, line: 16, baseType: !666, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1441, file: !663, line: 21, baseType: !670, size: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !1414, file: !1413, line: 213, baseType: !1446, size: 448, offset: 832)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !1413, line: 175, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1413, line: 165, size: 448, elements: !1448)
!1448 = !{!1449, !1450, !1451, !1452, !1453, !1454, !1455}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1447, file: !1413, line: 168, baseType: !1418, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1447, file: !1413, line: 169, baseType: !1418, size: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1447, file: !1413, line: 170, baseType: !1418, size: 64, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !1447, file: !1413, line: 171, baseType: !1418, size: 64, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1447, file: !1413, line: 172, baseType: !1418, size: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1447, file: !1413, line: 173, baseType: !1418, size: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1447, file: !1413, line: 174, baseType: !185, size: 32, offset: 384)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !1414, file: !1413, line: 216, baseType: !633, size: 8, offset: 1280)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !1414, file: !1413, line: 217, baseType: !633, size: 8, offset: 1288)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !1414, file: !1413, line: 218, baseType: !1432, size: 64, offset: 1344)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !1414, file: !1413, line: 219, baseType: !1432, size: 64, offset: 1408)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "J_zones_seen", scope: !1414, file: !1413, line: 220, baseType: !1432, size: 64, offset: 1472)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !1414, file: !1413, line: 221, baseType: !1432, size: 64, offset: 1536)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !1414, file: !1413, line: 222, baseType: !1432, size: 64, offset: 1600)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !1414, file: !1413, line: 223, baseType: !1432, size: 64, offset: 1664)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !1414, file: !1413, line: 224, baseType: !1432, size: 64, offset: 1728)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !1414, file: !1413, line: 225, baseType: !633, size: 8, offset: 1792)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "not_decimal", scope: !1414, file: !1413, line: 227, baseType: !633, size: 8, offset: 1800)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !1414, file: !1413, line: 231, baseType: !633, size: 8, offset: 1808)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !1414, file: !1413, line: 235, baseType: !633, size: 8, offset: 1816)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !1414, file: !1413, line: 236, baseType: !633, size: 8, offset: 1824)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !1414, file: !1413, line: 237, baseType: !633, size: 8, offset: 1832)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !1414, file: !1413, line: 238, baseType: !633, size: 8, offset: 1840)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !1414, file: !1413, line: 239, baseType: !633, size: 8, offset: 1848)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !1414, file: !1413, line: 240, baseType: !633, size: 8, offset: 1856)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !1414, file: !1413, line: 243, baseType: !633, size: 8, offset: 1864)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !1414, file: !1413, line: 246, baseType: !1476, size: 384, offset: 1920)
!1476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1477, size: 384, elements: !779)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !1413, line: 151, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1413, line: 146, size: 128, elements: !1479)
!1479 = !{!1480, !1481, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1478, file: !1413, line: 148, baseType: !617, size: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1478, file: !1413, line: 149, baseType: !185, size: 32, offset: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1478, file: !1413, line: 150, baseType: !185, size: 32, offset: 96)
!1483 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1484, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-parse-datetime.o -MD -MP -MF lib/.deps/libcoreutils_a-parse-datetime.Tpo -c lib/parse-datetime.c -o lib/.libcoreutils_a-parse-datetime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1485, retainedTypes: !1725, globals: !1741, splitDebugInlining: false, nameTableKind: None)
!1484 = !DIFile(filename: "lib/parse-datetime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4ad0112e68fb719bedea01398b4b2919")
!1485 = !{!1486, !1546, !1573, !1578, !1582, !1722}
!1486 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yysymbol_kind_t", file: !1408, line: 734, baseType: !185, size: 32, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1488 = !DIEnumerator(name: "YYSYMBOL_YYEMPTY", value: -2)
!1489 = !DIEnumerator(name: "YYSYMBOL_YYEOF", value: 0)
!1490 = !DIEnumerator(name: "YYSYMBOL_YYerror", value: 1)
!1491 = !DIEnumerator(name: "YYSYMBOL_YYUNDEF", value: 2)
!1492 = !DIEnumerator(name: "YYSYMBOL_tAGO", value: 3)
!1493 = !DIEnumerator(name: "YYSYMBOL_tDST", value: 4)
!1494 = !DIEnumerator(name: "YYSYMBOL_tYEAR_UNIT", value: 5)
!1495 = !DIEnumerator(name: "YYSYMBOL_tMONTH_UNIT", value: 6)
!1496 = !DIEnumerator(name: "YYSYMBOL_tHOUR_UNIT", value: 7)
!1497 = !DIEnumerator(name: "YYSYMBOL_tMINUTE_UNIT", value: 8)
!1498 = !DIEnumerator(name: "YYSYMBOL_tSEC_UNIT", value: 9)
!1499 = !DIEnumerator(name: "YYSYMBOL_tDAY_UNIT", value: 10)
!1500 = !DIEnumerator(name: "YYSYMBOL_tDAY_SHIFT", value: 11)
!1501 = !DIEnumerator(name: "YYSYMBOL_tDAY", value: 12)
!1502 = !DIEnumerator(name: "YYSYMBOL_tDAYZONE", value: 13)
!1503 = !DIEnumerator(name: "YYSYMBOL_tLOCAL_ZONE", value: 14)
!1504 = !DIEnumerator(name: "YYSYMBOL_tMERIDIAN", value: 15)
!1505 = !DIEnumerator(name: "YYSYMBOL_tMONTH", value: 16)
!1506 = !DIEnumerator(name: "YYSYMBOL_tORDINAL", value: 17)
!1507 = !DIEnumerator(name: "YYSYMBOL_tZONE", value: 18)
!1508 = !DIEnumerator(name: "YYSYMBOL_tSNUMBER", value: 19)
!1509 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER", value: 20)
!1510 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER_DOTTED", value: 21)
!1511 = !DIEnumerator(name: "YYSYMBOL_tSDECIMAL_NUMBER", value: 22)
!1512 = !DIEnumerator(name: "YYSYMBOL_tUDECIMAL_NUMBER", value: 23)
!1513 = !DIEnumerator(name: "YYSYMBOL_24_", value: 24)
!1514 = !DIEnumerator(name: "YYSYMBOL_25_J_", value: 25)
!1515 = !DIEnumerator(name: "YYSYMBOL_26_T_", value: 26)
!1516 = !DIEnumerator(name: "YYSYMBOL_27_", value: 27)
!1517 = !DIEnumerator(name: "YYSYMBOL_28_", value: 28)
!1518 = !DIEnumerator(name: "YYSYMBOL_29_", value: 29)
!1519 = !DIEnumerator(name: "YYSYMBOL_30_", value: 30)
!1520 = !DIEnumerator(name: "YYSYMBOL_YYACCEPT", value: 31)
!1521 = !DIEnumerator(name: "YYSYMBOL_spec", value: 32)
!1522 = !DIEnumerator(name: "YYSYMBOL_timespec", value: 33)
!1523 = !DIEnumerator(name: "YYSYMBOL_items", value: 34)
!1524 = !DIEnumerator(name: "YYSYMBOL_item", value: 35)
!1525 = !DIEnumerator(name: "YYSYMBOL_datetime", value: 36)
!1526 = !DIEnumerator(name: "YYSYMBOL_iso_8601_datetime", value: 37)
!1527 = !DIEnumerator(name: "YYSYMBOL_time", value: 38)
!1528 = !DIEnumerator(name: "YYSYMBOL_iso_8601_time", value: 39)
!1529 = !DIEnumerator(name: "YYSYMBOL_o_zone_offset", value: 40)
!1530 = !DIEnumerator(name: "YYSYMBOL_zone_offset", value: 41)
!1531 = !DIEnumerator(name: "YYSYMBOL_local_zone", value: 42)
!1532 = !DIEnumerator(name: "YYSYMBOL_zone", value: 43)
!1533 = !DIEnumerator(name: "YYSYMBOL_day", value: 44)
!1534 = !DIEnumerator(name: "YYSYMBOL_date", value: 45)
!1535 = !DIEnumerator(name: "YYSYMBOL_iso_8601_date", value: 46)
!1536 = !DIEnumerator(name: "YYSYMBOL_rel", value: 47)
!1537 = !DIEnumerator(name: "YYSYMBOL_relunit", value: 48)
!1538 = !DIEnumerator(name: "YYSYMBOL_relunit_snumber", value: 49)
!1539 = !DIEnumerator(name: "YYSYMBOL_dayshift", value: 50)
!1540 = !DIEnumerator(name: "YYSYMBOL_seconds", value: 51)
!1541 = !DIEnumerator(name: "YYSYMBOL_signed_seconds", value: 52)
!1542 = !DIEnumerator(name: "YYSYMBOL_unsigned_seconds", value: 53)
!1543 = !DIEnumerator(name: "YYSYMBOL_number", value: 54)
!1544 = !DIEnumerator(name: "YYSYMBOL_hybrid", value: 55)
!1545 = !DIEnumerator(name: "YYSYMBOL_o_colon_minutes", value: 56)
!1546 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !1408, line: 676, baseType: !185, size: 32, elements: !1547)
!1547 = !{!1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!1548 = !DIEnumerator(name: "YYEMPTY", value: -2)
!1549 = !DIEnumerator(name: "YYEOF", value: 0)
!1550 = !DIEnumerator(name: "YYerror", value: 256)
!1551 = !DIEnumerator(name: "YYUNDEF", value: 257)
!1552 = !DIEnumerator(name: "tAGO", value: 258)
!1553 = !DIEnumerator(name: "tDST", value: 259)
!1554 = !DIEnumerator(name: "tYEAR_UNIT", value: 260)
!1555 = !DIEnumerator(name: "tMONTH_UNIT", value: 261)
!1556 = !DIEnumerator(name: "tHOUR_UNIT", value: 262)
!1557 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263)
!1558 = !DIEnumerator(name: "tSEC_UNIT", value: 264)
!1559 = !DIEnumerator(name: "tDAY_UNIT", value: 265)
!1560 = !DIEnumerator(name: "tDAY_SHIFT", value: 266)
!1561 = !DIEnumerator(name: "tDAY", value: 267)
!1562 = !DIEnumerator(name: "tDAYZONE", value: 268)
!1563 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269)
!1564 = !DIEnumerator(name: "tMERIDIAN", value: 270)
!1565 = !DIEnumerator(name: "tMONTH", value: 271)
!1566 = !DIEnumerator(name: "tORDINAL", value: 272)
!1567 = !DIEnumerator(name: "tZONE", value: 273)
!1568 = !DIEnumerator(name: "tSNUMBER", value: 274)
!1569 = !DIEnumerator(name: "tUNUMBER", value: 275)
!1570 = !DIEnumerator(name: "tUNUMBER_DOTTED", value: 276)
!1571 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 277)
!1572 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 278)
!1573 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1413, line: 154, baseType: !171, size: 32, elements: !1574)
!1574 = !{!1575, !1576, !1577}
!1575 = !DIEnumerator(name: "MERam", value: 0)
!1576 = !DIEnumerator(name: "MERpm", value: 1)
!1577 = !DIEnumerator(name: "MER24", value: 2)
!1578 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1413, line: 162, baseType: !171, size: 32, elements: !1579)
!1579 = !{!1580, !1581}
!1580 = !DIEnumerator(name: "BILLION", value: 1000000000)
!1581 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!1582 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1583, file: !1413, line: 1781, baseType: !171, size: 32, elements: !1720)
!1583 = distinct !DISubprogram(name: "parse_datetime_body", scope: !1413, file: !1413, line: 1767, type: !1584, scopeLine: 1770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1483, retainedNodes: !1589)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!633, !1586, !617, !1587, !171, !653, !617}
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1441)
!1589 = !{!1590, !1591, !1592, !1593, !1594, !1595, !1596, !1611, !1612, !1613, !1617, !1618, !1619, !1620, !1621, !1622, !1625, !1626, !1627, !1628, !1630, !1633, !1634, !1635, !1641, !1642, !1643, !1644, !1645, !1647, !1650, !1651, !1658, !1661, !1662, !1668, !1669, !1670, !1673, !1674, !1677, !1678, !1679, !1684, !1687, !1688, !1689, !1690, !1693, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1707, !1708, !1711, !1712, !1713, !1714, !1715, !1718, !1719}
!1590 = !DILocalVariable(name: "result", arg: 1, scope: !1583, file: !1413, line: 1767, type: !1586)
!1591 = !DILocalVariable(name: "p", arg: 2, scope: !1583, file: !1413, line: 1767, type: !617)
!1592 = !DILocalVariable(name: "now", arg: 3, scope: !1583, file: !1413, line: 1768, type: !1587)
!1593 = !DILocalVariable(name: "flags", arg: 4, scope: !1583, file: !1413, line: 1768, type: !171)
!1594 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !1583, file: !1413, line: 1769, type: !653)
!1595 = !DILocalVariable(name: "tzstring", arg: 6, scope: !1583, file: !1413, line: 1769, type: !617)
!1596 = !DILocalVariable(name: "tm", scope: !1583, file: !1413, line: 1771, type: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1598, line: 7, size: 448, elements: !1599)
!1598 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1597, file: !1598, line: 9, baseType: !185, size: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1597, file: !1598, line: 10, baseType: !185, size: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1597, file: !1598, line: 11, baseType: !185, size: 32, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1597, file: !1598, line: 12, baseType: !185, size: 32, offset: 96)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1597, file: !1598, line: 13, baseType: !185, size: 32, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1597, file: !1598, line: 14, baseType: !185, size: 32, offset: 160)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1597, file: !1598, line: 15, baseType: !185, size: 32, offset: 192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1597, file: !1598, line: 16, baseType: !185, size: 32, offset: 224)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1597, file: !1598, line: 17, baseType: !185, size: 32, offset: 256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1597, file: !1598, line: 20, baseType: !668, size: 64, offset: 320)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1597, file: !1598, line: 21, baseType: !617, size: 64, offset: 384)
!1611 = !DILocalVariable(name: "tm0", scope: !1583, file: !1413, line: 1772, type: !1597)
!1612 = !DILocalVariable(name: "time_zone_buf", scope: !1583, file: !1413, line: 1773, type: !960)
!1613 = !DILocalVariable(name: "dbg_tm", scope: !1583, file: !1413, line: 1774, type: !1614)
!1614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, elements: !1615)
!1615 = !{!1616}
!1616 = !DISubrange(count: 100)
!1617 = !DILocalVariable(name: "ok", scope: !1583, file: !1413, line: 1775, type: !633)
