; ModuleID = 'src/dir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.dev_ino = type { i64, i64 }
%struct.obstack = type { i64, ptr, ptr, ptr, ptr, %union.anon, i64, %union.anon.0, %union.anon.0, ptr, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { ptr }
%struct.bin_str = type { i64, ptr }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.__jmp_buf_tag = type { [22 x i64], i32, %struct.__sigset_t }
%struct.ignore_pattern = type { ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.__mbstate_t = type { i32, %union.anon.3 }
%union.anon.3 = type { i32 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.statx = type { i32, i32, i64, i32, i32, i32, i16, [1 x i16], i64, i64, i64, i64, %struct.statx_timestamp, %struct.statx_timestamp, %struct.statx_timestamp, %struct.statx_timestamp, i32, i32, i32, i32, i64, i64, [12 x i64] }
%struct.statx_timestamp = type { i64, i32, i32 }
%struct.winsize = type { i16, i16, i16, i16 }
%struct.color_ext_type = type { %struct.bin_str, %struct.bin_str, i8, ptr }
%struct.pending = type { ptr, ptr, i8, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

!81 = !DIEnumerator(name: "sort_version", value: 4)
!82 = !DIEnumerator(name: "sort_time", value: 5)
!83 = !DIEnumerator(name: "sort_none", value: 6)
!84 = !DIEnumerator(name: "sort_numtypes", value: 7)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !2, line: 157, baseType: !22, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!87 = !DIEnumerator(name: "unknown", value: 0)
!88 = !DIEnumerator(name: "fifo", value: 1)
!89 = !DIEnumerator(name: "chardev", value: 2)
!90 = !DIEnumerator(name: "directory", value: 3)
!91 = !DIEnumerator(name: "blockdev", value: 4)
!92 = !DIEnumerator(name: "normal", value: 5)
!93 = !DIEnumerator(name: "symbolic_link", value: 6)
!94 = !DIEnumerator(name: "sock", value: 7)
!95 = !DIEnumerator(name: "whiteout", value: 8)
!96 = !DIEnumerator(name: "arg_directory", value: 9)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 120, baseType: !22, size: 32, elements: !99)
!98 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!99 = !{!100}
!100 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !102, line: 42, baseType: !22, size: 32, elements: !103)
!102 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!104 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!105 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!106 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!107 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!108 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!109 = !DIEnumerator(name: "c_quoting_style", value: 5)
!110 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!111 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!112 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!113 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!114 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ls_modes", file: !116, line: 1, baseType: !22, size: 32, elements: !117)
!116 = !DIFile(filename: "src/ls.h", directory: "/src", checksumkind: CSK_MD5, checksum: "27cd4a1e8b13d28b26c3d722b22eff4d")
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "LS_LS", value: 0)
!119 = !DIEnumerator(name: "LS_MULTI_COL", value: 1)
!120 = !DIEnumerator(name: "LS_LONG_FORMAT", value: 2)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !2, line: 194, baseType: !22, size: 32, elements: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DIEnumerator(name: "ACL_T_NONE", value: 0)
!124 = !DIEnumerator(name: "ACL_T_UNKNOWN", value: 1)
!125 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 2)
!126 = !DIEnumerator(name: "ACL_T_YES", value: 3)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !128, file: !2, line: 1596, baseType: !22, size: 32, elements: !265)
!128 = distinct !DISubprogram(name: "signal_setup", scope: !2, file: !2, line: 1587, type: !129, scopeLine: 1588, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !132)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !{!133, !134, !249, !251, !254, !256, !259, !262}
!133 = !DILocalVariable(name: "init", arg: 1, scope: !128, file: !2, line: 1587, type: !131)
!134 = !DILocalVariable(name: "act", scope: !135, file: !2, line: 1600, type: !137)
!135 = distinct !DILexicalBlock(scope: !136, file: !2, line: 1599, column: 5)
!136 = distinct !DILexicalBlock(scope: !128, file: !2, line: 1598, column: 7)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !138, line: 27, size: 1216, elements: !139)
!138 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!139 = !{!140, !234, !244, !245}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !137, file: !138, line: 38, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !138, line: 31, size: 64, elements: !142)
!142 = !{!143, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !141, file: !138, line: 34, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !145, line: 72, baseType: !146)
!145 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149}
!149 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !141, file: !138, line: 36, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !149, !154, !190}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !156, line: 124, baseType: !157)
!156 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !156, line: 36, size: 1024, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !157, file: !156, line: 38, baseType: !149, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !157, file: !156, line: 40, baseType: !149, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !157, file: !156, line: 42, baseType: !149, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !157, file: !156, line: 48, baseType: !149, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !157, file: !156, line: 123, baseType: !164, size: 896, offset: 128)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !157, file: !156, line: 51, size: 896, elements: !165)
!165 = !{!166, !170, !178, !191, !197, !207, !223, !228}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !164, file: !156, line: 53, baseType: !167, size: 896)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 896, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 28)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !164, file: !156, line: 60, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !156, line: 56, size: 64, elements: !172)
!172 = !{!173, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !171, file: !156, line: 58, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !175, line: 154, baseType: !149)
!175 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !171, file: !156, line: 59, baseType: !177, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !175, line: 146, baseType: !22)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !164, file: !156, line: 68, baseType: !179, size: 128)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !156, line: 63, size: 128, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !179, file: !156, line: 65, baseType: !149, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !179, file: !156, line: 66, baseType: !149, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !179, file: !156, line: 67, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !185, line: 30, baseType: !186)
!185 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !185, line: 24, size: 64, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !186, file: !185, line: 26, baseType: !149, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !186, file: !185, line: 27, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !164, file: !156, line: 76, baseType: !192, size: 128)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !156, line: 71, size: 128, elements: !193)
!193 = !{!194, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !192, file: !156, line: 73, baseType: !174, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !192, file: !156, line: 74, baseType: !177, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !192, file: !156, line: 75, baseType: !184, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !164, file: !156, line: 86, baseType: !198, size: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !156, line: 79, size: 256, elements: !199)
!199 = !{!200, !201, !202, !203, !206}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !198, file: !156, line: 81, baseType: !174, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !198, file: !156, line: 82, baseType: !177, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !198, file: !156, line: 83, baseType: !149, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !198, file: !156, line: 84, baseType: !204, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !175, line: 156, baseType: !205)
!205 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !198, file: !156, line: 85, baseType: !204, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !164, file: !156, line: 105, baseType: !208, size: 256)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !156, line: 89, size: 256, elements: !209)
!209 = !{!210, !211, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !208, file: !156, line: 91, baseType: !190, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !208, file: !156, line: 93, baseType: !212, size: 16, offset: 64)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !208, file: !156, line: 104, baseType: !214, size: 128, offset: 128)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !156, line: 94, size: 128, elements: !215)
!215 = !{!216, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !214, file: !156, line: 101, baseType: !217, size: 128)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !156, line: 97, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !217, file: !156, line: 99, baseType: !190, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !217, file: !156, line: 100, baseType: !190, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !214, file: !156, line: 103, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !175, line: 42, baseType: !22)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !164, file: !156, line: 112, baseType: !224, size: 128)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !156, line: 108, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !224, file: !156, line: 110, baseType: !205, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !224, file: !156, line: 111, baseType: !149, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !164, file: !156, line: 121, baseType: !229, size: 128)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !156, line: 116, size: 128, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !229, file: !156, line: 118, baseType: !190, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !229, file: !156, line: 119, baseType: !149, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !229, file: !156, line: 120, baseType: !22, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !137, file: !138, line: 46, baseType: !235, size: 1024, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !236, line: 8, baseType: !237)
!236 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 5, size: 1024, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !237, file: !236, line: 7, baseType: !240, size: 1024)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 1024, elements: !242)
!241 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!242 = !{!243}
!243 = !DISubrange(count: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !137, file: !138, line: 49, baseType: !149, size: 32, offset: 1088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !137, file: !138, line: 52, baseType: !246, size: 64, offset: 1152)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null}
!249 = !DILocalVariable(name: "j", scope: !250, file: !2, line: 1603, type: !149)
!250 = distinct !DILexicalBlock(scope: !135, file: !2, line: 1603, column: 7)
!251 = !DILocalVariable(name: "sig", scope: !252, file: !2, line: 1605, type: !149)
!252 = distinct !DILexicalBlock(scope: !253, file: !2, line: 1604, column: 9)
!253 = distinct !DILexicalBlock(scope: !250, file: !2, line: 1603, column: 7)
!254 = !DILocalVariable(name: "j", scope: !255, file: !2, line: 1614, type: !149)
!255 = distinct !DILexicalBlock(scope: !135, file: !2, line: 1614, column: 7)
!256 = !DILocalVariable(name: "sig", scope: !257, file: !2, line: 1616, type: !149)
!257 = distinct !DILexicalBlock(scope: !258, file: !2, line: 1615, column: 9)
!258 = distinct !DILexicalBlock(scope: !255, file: !2, line: 1614, column: 7)
!259 = !DILocalVariable(name: "j", scope: !260, file: !2, line: 1626, type: !149)
!260 = distinct !DILexicalBlock(scope: !261, file: !2, line: 1626, column: 7)
!261 = distinct !DILexicalBlock(scope: !136, file: !2, line: 1625, column: 5)
!262 = !DILocalVariable(name: "sig", scope: !263, file: !2, line: 1628, type: !149)
!263 = distinct !DILexicalBlock(scope: !264, file: !2, line: 1627, column: 9)
!264 = distinct !DILexicalBlock(scope: !260, file: !2, line: 1626, column: 7)
!265 = !{!266, !267}
!266 = !DIEnumerator(name: "nsigs", value: 22)
!267 = !DIEnumerator(name: "nstop", value: 1)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 703, baseType: !22, size: 32, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0)
!271 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1)
!272 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !2, line: 466, baseType: !22, size: 32, elements: !274)
!274 = !{!275, !276, !277, !278, !279}
!275 = !DIEnumerator(name: "time_mtime", value: 0)
!276 = !DIEnumerator(name: "time_ctime", value: 1)
!277 = !DIEnumerator(name: "time_atime", value: 2)
!278 = !DIEnumerator(name: "time_btime", value: 3)
!279 = !DIEnumerator(name: "time_numtypes", value: 4)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 853, baseType: !22, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!282 = !DIEnumerator(name: "AUTHOR_OPTION", value: 256)
!283 = !DIEnumerator(name: "BLOCK_SIZE_OPTION", value: 257)
!284 = !DIEnumerator(name: "COLOR_OPTION", value: 258)
!285 = !DIEnumerator(name: "DEREFERENCE_COMMAND_LINE_SYMLINK_TO_DIR_OPTION", value: 259)
!286 = !DIEnumerator(name: "FILE_TYPE_INDICATOR_OPTION", value: 260)
!287 = !DIEnumerator(name: "FORMAT_OPTION", value: 261)
!288 = !DIEnumerator(name: "FULL_TIME_OPTION", value: 262)
!289 = !DIEnumerator(name: "GROUP_DIRECTORIES_FIRST_OPTION", value: 263)
!290 = !DIEnumerator(name: "HIDE_OPTION", value: 264)
!291 = !DIEnumerator(name: "HYPERLINK_OPTION", value: 265)
!292 = !DIEnumerator(name: "INDICATOR_STYLE_OPTION", value: 266)
!293 = !DIEnumerator(name: "QUOTING_STYLE_OPTION", value: 267)
!294 = !DIEnumerator(name: "SHOW_CONTROL_CHARS_OPTION", value: 268)
!295 = !DIEnumerator(name: "SI_OPTION", value: 269)
!296 = !DIEnumerator(name: "SORT_OPTION", value: 270)
!297 = !DIEnumerator(name: "TIME_OPTION", value: 271)
!298 = !DIEnumerator(name: "TIME_STYLE_OPTION", value: 272)
!299 = !DIEnumerator(name: "ZERO_OPTION", value: 273)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 47, baseType: !22, size: 32, elements: !302)
!301 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!303 = !DIEnumerator(name: "human_ceiling", value: 0)
!304 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!305 = !DIEnumerator(name: "human_floor", value: 2)
!306 = !DIEnumerator(name: "human_group_digits", value: 4)
!307 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!308 = !DIEnumerator(name: "human_autoscale", value: 16)
!309 = !DIEnumerator(name: "human_base_1024", value: 32)
!310 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!311 = !DIEnumerator(name: "human_SI", value: 128)
!312 = !DIEnumerator(name: "human_B", value: 256)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "when_type", file: !2, line: 582, baseType: !22, size: 32, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIEnumerator(name: "when_never", value: 0)
!316 = !DIEnumerator(name: "when_always", value: 1)
!317 = !DIEnumerator(name: "when_if_tty", value: 2)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !319, line: 30, baseType: !22, size: 32, elements: !320)
!319 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!320 = !{!321, !322, !323, !324, !325}
!321 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!322 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!323 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!324 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!325 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 337, baseType: !149, size: 32, elements: !327)
!327 = !{!328, !329}
!328 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!329 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 998, baseType: !22, size: 32, elements: !331)
!331 = !{!332}
!332 = !DIEnumerator(name: "MIN_COLUMN_WIDTH", value: 3)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !2, line: 443, baseType: !22, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIEnumerator(name: "full_iso_time_style", value: 0)
!336 = !DIEnumerator(name: "long_iso_time_style", value: 1)
!337 = !DIEnumerator(name: "iso_time_style", value: 2)
!338 = !DIEnumerator(name: "locale_time_style", value: 3)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1326, baseType: !22, size: 32, elements: !340)
!340 = !{!341}
!341 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !343, line: 41, baseType: !22, size: 32, elements: !344)
!343 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!345 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!346 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!347 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!348 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!349 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!350 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!351 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!352 = !DIEnumerator(name: "DAY_1", value: 131079)
!353 = !DIEnumerator(name: "DAY_2", value: 131080)
!354 = !DIEnumerator(name: "DAY_3", value: 131081)
!355 = !DIEnumerator(name: "DAY_4", value: 131082)
!356 = !DIEnumerator(name: "DAY_5", value: 131083)
!357 = !DIEnumerator(name: "DAY_6", value: 131084)
!358 = !DIEnumerator(name: "DAY_7", value: 131085)
!359 = !DIEnumerator(name: "ABMON_1", value: 131086)
!360 = !DIEnumerator(name: "ABMON_2", value: 131087)
!361 = !DIEnumerator(name: "ABMON_3", value: 131088)
!362 = !DIEnumerator(name: "ABMON_4", value: 131089)
!363 = !DIEnumerator(name: "ABMON_5", value: 131090)
!364 = !DIEnumerator(name: "ABMON_6", value: 131091)
!365 = !DIEnumerator(name: "ABMON_7", value: 131092)
!366 = !DIEnumerator(name: "ABMON_8", value: 131093)
!367 = !DIEnumerator(name: "ABMON_9", value: 131094)
!368 = !DIEnumerator(name: "ABMON_10", value: 131095)
!369 = !DIEnumerator(name: "ABMON_11", value: 131096)
!370 = !DIEnumerator(name: "ABMON_12", value: 131097)
!371 = !DIEnumerator(name: "MON_1", value: 131098)
!372 = !DIEnumerator(name: "MON_2", value: 131099)
!373 = !DIEnumerator(name: "MON_3", value: 131100)
!374 = !DIEnumerator(name: "MON_4", value: 131101)
!375 = !DIEnumerator(name: "MON_5", value: 131102)
!376 = !DIEnumerator(name: "MON_6", value: 131103)
!377 = !DIEnumerator(name: "MON_7", value: 131104)
!378 = !DIEnumerator(name: "MON_8", value: 131105)
!379 = !DIEnumerator(name: "MON_9", value: 131106)
!380 = !DIEnumerator(name: "MON_10", value: 131107)
!381 = !DIEnumerator(name: "MON_11", value: 131108)
!382 = !DIEnumerator(name: "MON_12", value: 131109)
!383 = !DIEnumerator(name: "AM_STR", value: 131110)
!384 = !DIEnumerator(name: "PM_STR", value: 131111)
!385 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!386 = !DIEnumerator(name: "D_FMT", value: 131113)
!387 = !DIEnumerator(name: "T_FMT", value: 131114)
!388 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!389 = !DIEnumerator(name: "ERA", value: 131116)
!390 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!391 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!392 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!393 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!394 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!395 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!396 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!397 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!398 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!399 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!400 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!401 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!402 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!403 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!404 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!405 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!406 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!407 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!408 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!409 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!410 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!411 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!412 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!413 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!414 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!415 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!416 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!417 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!418 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!419 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!420 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!421 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!422 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!423 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!424 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!425 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!426 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!427 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!428 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!429 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!430 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!431 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!432 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!433 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!434 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!435 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!436 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!437 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!438 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!439 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!440 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!441 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!442 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!443 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!444 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!445 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!446 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!447 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!448 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!449 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!450 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!451 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!452 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!453 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!454 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!455 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!456 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!457 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!458 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!459 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!460 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!461 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!462 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!463 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!464 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!465 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!466 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!467 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!468 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!469 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!470 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!471 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!472 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!473 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!474 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!475 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!476 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!477 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!478 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!479 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!480 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!481 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!482 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!483 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!484 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!485 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!486 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!487 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!488 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!489 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!490 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!491 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!492 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!493 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!494 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!495 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!496 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!497 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!498 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!499 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!500 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!501 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!502 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!503 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!504 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!505 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!506 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!507 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!508 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!509 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!510 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!511 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!512 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!513 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!514 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!515 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!516 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!517 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!518 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!519 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!520 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!521 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!522 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!523 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!524 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!525 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!526 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!527 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!528 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!529 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!530 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!531 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!532 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!533 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!534 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!535 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!536 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!537 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!538 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!539 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!540 = !DIEnumerator(name: "CODESET", value: 14)
!541 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!542 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!543 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!544 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!545 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!546 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!547 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!548 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!549 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!550 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!551 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!552 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!553 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!554 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!555 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!556 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!557 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!558 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!559 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!560 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!561 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!562 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!563 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!564 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!565 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!567 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!568 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!569 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!570 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!571 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!572 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!573 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!574 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!575 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!576 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!577 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!578 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!579 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!580 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!581 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!582 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!583 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!584 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!585 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!586 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!587 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!588 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!589 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!590 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!591 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!592 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!593 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!594 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!595 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!596 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!597 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!598 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!599 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!600 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!601 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!602 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!603 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!604 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!605 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!606 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!607 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!608 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!609 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!610 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!611 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!612 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!613 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!614 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!615 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!616 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!617 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!618 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!619 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!620 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!621 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!622 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!623 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!624 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!625 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!626 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!627 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!628 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!629 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!630 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!631 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!632 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!633 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!634 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!635 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!636 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!637 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!638 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!639 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!640 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!641 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!642 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!643 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!644 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!645 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!646 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!647 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!648 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!649 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!650 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!651 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!652 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!653 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!654 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!655 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!656 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!657 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!658 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!659 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!660 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!661 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!662 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!663 = !DIEnumerator(name: "THOUSEP", value: 65537)
!664 = !DIEnumerator(name: "__GROUPING", value: 65538)
!665 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!666 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!667 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!668 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!669 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!670 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!671 = !DIEnumerator(name: "__YESSTR", value: 327682)
!672 = !DIEnumerator(name: "__NOSTR", value: 327683)
!673 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!674 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!675 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!676 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!677 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!678 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!679 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!680 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!681 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!682 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!683 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!684 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!685 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!686 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!687 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!688 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!689 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!690 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!691 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!692 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!693 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!694 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!695 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!696 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!697 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!698 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!699 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!700 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!701 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!702 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!703 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!704 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!705 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!706 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!707 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!708 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!709 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!710 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!711 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!712 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!713 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!714 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!715 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!716 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!717 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!718 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!719 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!720 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!721 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!722 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!723 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!724 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!725 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!726 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!727 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1314, baseType: !22, size: 32, elements: !729)
!729 = !{!730}
!730 = !DIEnumerator(name: "MBSWIDTH_FLAGS", value: 3)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !2, line: 2665, baseType: !22, size: 32, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738}
!733 = !DIEnumerator(name: "PS_START", value: 1)
!734 = !DIEnumerator(name: "PS_2", value: 2)
!735 = !DIEnumerator(name: "PS_3", value: 3)
!736 = !DIEnumerator(name: "PS_4", value: 4)
!737 = !DIEnumerator(name: "PS_DONE", value: 5)
!738 = !DIEnumerator(name: "PS_FAIL", value: 6)
!739 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !740, file: !2, line: 2476, baseType: !22, size: 32, elements: !761)
!740 = distinct !DISubprogram(name: "get_funky_string", scope: !2, file: !2, line: 2471, type: !741, scopeLine: 2473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !751)
!741 = !DISubroutineType(types: !742)
!742 = !{!131, !743, !745, !131, !748}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !750, line: 18, baseType: !241)
!750 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760}
!752 = !DILocalVariable(name: "dest", arg: 1, scope: !740, file: !2, line: 2471, type: !743)
!753 = !DILocalVariable(name: "src", arg: 2, scope: !740, file: !2, line: 2471, type: !745)
!754 = !DILocalVariable(name: "equals_end", arg: 3, scope: !740, file: !2, line: 2471, type: !131)
!755 = !DILocalVariable(name: "output_count", arg: 4, scope: !740, file: !2, line: 2472, type: !748)
!756 = !DILocalVariable(name: "num", scope: !740, file: !2, line: 2474, type: !4)
!757 = !DILocalVariable(name: "count", scope: !740, file: !2, line: 2475, type: !749)
!758 = !DILocalVariable(name: "state", scope: !740, file: !2, line: 2478, type: !739)
!759 = !DILocalVariable(name: "p", scope: !740, file: !2, line: 2479, type: !746)
!760 = !DILocalVariable(name: "q", scope: !740, file: !2, line: 2480, type: !744)
!761 = !{!762, !763, !764, !765, !766, !767, !768}
!762 = !DIEnumerator(name: "ST_GND", value: 0)
!763 = !DIEnumerator(name: "ST_BACKSLASH", value: 1)
!764 = !DIEnumerator(name: "ST_OCTAL", value: 2)
!765 = !DIEnumerator(name: "ST_HEX", value: 3)
!766 = !DIEnumerator(name: "ST_CARET", value: 4)
!767 = !DIEnumerator(name: "ST_END", value: 5)
!768 = !DIEnumerator(name: "ST_ERROR", value: 6)
!769 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !770, line: 33, baseType: !22, size: 32, elements: !771)
!770 = !DIFile(filename: "./lib/canonicalize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e78d7e061e2ee7b61b12ad7654b500f8")
!771 = !{!772, !773, !774, !775}
!772 = !DIEnumerator(name: "CAN_EXISTING", value: 0)
!773 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1)
!774 = !DIEnumerator(name: "CAN_MISSING", value: 2)
!775 = !DIEnumerator(name: "CAN_NOLINKS", value: 4)
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !777, line: 46, baseType: !22, size: 32, elements: !778)
!777 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!779 = !DIEnumerator(name: "_ISupper", value: 256)
!780 = !DIEnumerator(name: "_ISlower", value: 512)
!781 = !DIEnumerator(name: "_ISalpha", value: 1024)
!782 = !DIEnumerator(name: "_ISdigit", value: 2048)
!783 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!784 = !DIEnumerator(name: "_ISspace", value: 8192)
!785 = !DIEnumerator(name: "_ISprint", value: 16384)
!786 = !DIEnumerator(name: "_ISgraph", value: 32768)
!787 = !DIEnumerator(name: "_ISblank", value: 1)
!788 = !DIEnumerator(name: "_IScntrl", value: 2)
!789 = !DIEnumerator(name: "_ISpunct", value: 4)
!790 = !DIEnumerator(name: "_ISalnum", value: 8)
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !792, line: 37, baseType: !22, size: 32, elements: !793)
!792 = !DIFile(filename: "./lib/acl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54678fc5d4a46d3d69a5a47343d33a9d")
!793 = !{!794, !795}
!794 = !DIEnumerator(name: "ACL_GET_SCONTEXT", value: 65536)
!795 = !DIEnumerator(name: "ACL_SYMLINK_FOLLOW", value: 131072)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 786, baseType: !22, size: 32, elements: !797)
!797 = !{!798}
!798 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000)
!799 = !{!800, !190, !803, !806, !749, !746, !144, !241, !807, !744, !809, !149, !810, !811, !814}
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !801, line: 10, baseType: !802)
!801 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !175, line: 160, baseType: !205)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !804, line: 102, baseType: !805)
!804 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !175, line: 73, baseType: !241)
!806 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !175, line: 145, baseType: !241)
!810 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !812, line: 85, baseType: !813)
!812 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !175, line: 152, baseType: !205)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!815 = !{!0, !7, !12, !816, !821, !826, !831, !836, !841, !843, !845, !850, !855, !860, !865, !870, !875, !877, !882, !887, !892, !897, !902, !907, !912, !917, !922, !924, !929, !934, !939, !944, !949, !954, !959, !961, !966, !968, !970, !975, !980, !985, !990, !995, !1000, !1005, !1007, !1012, !1017, !1019, !1024, !1029, !1034, !1036, !1038, !1043, !1048, !1053, !1058, !1063, !1068, !1070, !1075, !1080, !1085, !1090, !1095, !1097, !1099, !1104, !1109, !1111, !1113, !1118, !1120, !1122, !1124, !1126, !1131, !1133, !1138, !1140, !1145, !1150, !1156, !1207, !1213, !1215, !1217, !1219, !1228, !1230, !1232, !1234, !1236, !1238, !1240, !1242, !1244, !1246, !1248, !1250, !1252, !1254, !1256, !1261, !1263, !1265, !1271, !1273, !1275, !1277, !1283, !17, !1285, !1336, !1338, !1340, !1345, !1347, !1352, !1355, !1357, !1364, !1368, !1372, !1378, !1380, !1385, !1390, !1395, !1397, !1399, !1404, !1409, !1411, !1413, !1415, !1417, !1422, !1427, !1432, !1435, !1440, !1445, !1447, !1449, !1451, !1453, !1455, !1457, !1459, !1461, !1466, !1468, !1470, !1553, !1555, !1557, !1562, !1564, !1566, !1568, !1570, !1572, !1574, !1576, !1578, !1580, !1582, !1584, !1586, !1588, !1590, !1592, !1594, !1596, !1598, !1600, !1602, !1604, !1606, !1611, !1616, !1618, !1620, !1622, !1624, !1626, !1628, !1630, !1632, !1634, !1636, !1638, !1640, !1642, !1644, !1646, !1648, !1650, !1652, !1654, !1656, !1658, !1660, !1672, !1674, !1676, !1678, !1680, !1682, !1684, !1686, !1688, !1690, !1692, !1694, !1696, !1698, !1702, !1704, !1706, !1708, !1710, !1712, !1714, !1716, !1718, !1720, !1724, !1730, !1732, !1734, !1738, !1740, !1742, !1745, !1749, !1751, !1753, !1755, !1757, !1759, !1761, !1763, !1765, !1767, !1769, !1773, !1775, !1777, !1779, !1781, !1783, !1785, !1787, !1789, !1793, !1795, !1798, !1800, !1802, !1804, !1806, !1808, !1810, !1812, !1814, !1816, !1818, !1821, !1823, !1826, !1828, !1830, !1832, !1834, !1836, !1838, !1842, !1844, !1846, !1851, !1853, !1855, !1857, !1859, !1861, !1866, !1871, !1873, !1875, !1877, !1883, !1885, !1894, !1898, !1946, !1948, !1950, !1952, !1954, !1956, !1961, !1963, !1965, !1967, !1969, !1971, !1973, !1975, !1977, !1980, !1983, !1985, !1987, !1989, !1991, !1993, !1995, !1997, !1999, !2001, !2003, !2005, !2007, !2012, !2015, !2017, !2019, !2023, !2049, !2051, !2053, !2056, !2065, !2067, !2069, !2071, !2074, !2077, !2079, !2094, !2104, !2106, !2108, !2110, !2112, !2134, !2155, !2163, !2165, !2167, !2169, !2172, !2174, !2205, !2207, !2282, !2284, !2286, !2288, !2290, !2292, !2294, !2296, !2298, !2300, !2302, !2304, !2306, !2308, !2310, !2312, !2314, !2316, !2318, !2320, !2322, !2324, !2326, !2331, !2333, !2335, !2337, !2339, !2341, !2346, !2348}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1720, type: !818, isLocal: true, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 3)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1759, type: !823, isLocal: true, isDefinition: true)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 2)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1806, type: !828, isLocal: true, isDefinition: true)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 6)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1806, type: !833, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 9)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1806, type: !838, isLocal: true, isDefinition: true)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 184, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 23)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1826, type: !818, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1849, type: !9, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1850, type: !847, isLocal: true, isDefinition: true)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 13)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1851, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 38)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1857, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 41)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5340, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 39)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5343, type: !867, isLocal: true, isDefinition: true)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 33)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5344, type: !872, isLocal: true, isDefinition: true)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1152, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 144)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5351, type: !818, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5351, type: !879, isLocal: true, isDefinition: true)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 4)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5351, type: !884, isLocal: true, isDefinition: true)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 5)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5351, type: !889, isLocal: true, isDefinition: true)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 60)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5355, type: !894, isLocal: true, isDefinition: true)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 58)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5359, type: !899, isLocal: true, isDefinition: true)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 64)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5363, type: !904, isLocal: true, isDefinition: true)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 73)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5367, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1104, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 138)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5372, type: !914, isLocal: true, isDefinition: true)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 75)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5376, type: !919, isLocal: true, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1648, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 206)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5383, type: !862, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5387, type: !926, isLocal: true, isDefinition: true)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 70)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5391, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 76)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5395, type: !936, isLocal: true, isDefinition: true)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 71)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5399, type: !941, isLocal: true, isDefinition: true)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 29)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5403, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 83)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5407, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 62)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5411, type: !956, isLocal: true, isDefinition: true)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1080, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 135)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5416, type: !894, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5420, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 46)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5424, type: !904, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5428, type: !926, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5432, type: !972, isLocal: true, isDefinition: true)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 656, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 82)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5436, type: !977, isLocal: true, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 63)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5440, type: !982, isLocal: true, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 736, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 92)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5444, type: !987, isLocal: true, isDefinition: true)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 992, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 124)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5448, type: !992, isLocal: true, isDefinition: true)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 928, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 116)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5453, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 61)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5457, type: !1002, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1328, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 166)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5462, type: !889, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5466, type: !1009, isLocal: true, isDefinition: true)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 672, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 84)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5470, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 131)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5475, type: !857, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5479, type: !1021, isLocal: true, isDefinition: true)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1448, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 181)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5485, type: !1026, isLocal: true, isDefinition: true)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 65)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5489, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 632, elements: !1032)
!1032 = !{!1033}
!1033 = !DISubrange(count: 79)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5493, type: !889, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5497, type: !894, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5501, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 592, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 74)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5505, type: !1045, isLocal: true, isDefinition: true)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 624, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 78)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5509, type: !1050, isLocal: true, isDefinition: true)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1128, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 141)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5514, type: !1055, isLocal: true, isDefinition: true)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 528, elements: !1056)
!1056 = !{!1057}
!1057 = !DISubrange(count: 66)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5518, type: !1060, isLocal: true, isDefinition: true)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1904, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 238)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5525, type: !1065, isLocal: true, isDefinition: true)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 54)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5529, type: !889, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5533, type: !1072, isLocal: true, isDefinition: true)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 72)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5537, type: !1077, isLocal: true, isDefinition: true)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 48)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5541, type: !1082, isLocal: true, isDefinition: true)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1288, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 161)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5547, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3072, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 384)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5557, type: !1092, isLocal: true, isDefinition: true)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 696, elements: !1093)
!1093 = !{!1094}
!1094 = !DISubrange(count: 87)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5561, type: !1065, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5565, type: !1040, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5569, type: !1101, isLocal: true, isDefinition: true)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1312, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 164)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5575, type: !1106, isLocal: true, isDefinition: true)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 45)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5579, type: !997, isLocal: true, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5583, type: !904, isLocal: true, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5587, type: !1115, isLocal: true, isDefinition: true)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 59)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5591, type: !1065, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5595, type: !1055, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5599, type: !1055, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5603, type: !852, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5607, type: !1128, isLocal: true, isDefinition: true)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 50)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5608, type: !951, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5610, type: !1135, isLocal: true, isDefinition: true)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3008, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 376)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5618, type: !931, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5622, type: !1142, isLocal: true, isDefinition: true)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2312, elements: !1143)
!1143 = !{!1144}
!1144 = !DISubrange(count: 289)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5629, type: !1147, isLocal: true, isDefinition: true)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1216, elements: !1148)
!1148 = !{!1149}
!1149 = !DISubrange(count: 152)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !19, file: !2, line: 326, type: !1152, isLocal: true, isDefinition: true)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1154, line: 56, baseType: !1155)
!1154 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1154, line: 54, flags: DIFlagFwdDecl)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(name: "cwd_file", scope: !19, file: !2, line: 337, type: !1158, isLocal: true, isDefinition: true)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !2, line: 202, size: 1536, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1197, !1198, !1200, !1201, !1202, !1203, !1204, !1205, !1206}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1159, file: !2, line: 205, baseType: !744, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !1159, file: !2, line: 208, baseType: !744, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !1159, file: !2, line: 211, baseType: !744, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !1159, file: !2, line: 213, baseType: !1165, size: 1024, offset: 192)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1166, line: 44, size: 1024, elements: !1167)
!1166 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1167 = !{!1168, !1169, !1171, !1173, !1175, !1176, !1178, !1179, !1180, !1181, !1183, !1184, !1186, !1193, !1194, !1195}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1165, file: !1166, line: 46, baseType: !809, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1165, file: !1166, line: 47, baseType: !1170, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !175, line: 148, baseType: !241)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1165, file: !1166, line: 48, baseType: !1172, size: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !175, line: 150, baseType: !22)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1165, file: !1166, line: 49, baseType: !1174, size: 32, offset: 160)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !175, line: 151, baseType: !22)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1165, file: !1166, line: 50, baseType: !177, size: 32, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1165, file: !1166, line: 51, baseType: !1177, size: 32, offset: 224)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !175, line: 147, baseType: !22)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1165, file: !1166, line: 52, baseType: !809, size: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1165, file: !1166, line: 53, baseType: !809, size: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1165, file: !1166, line: 54, baseType: !813, size: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1165, file: !1166, line: 55, baseType: !1182, size: 32, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !175, line: 175, baseType: !149)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1165, file: !1166, line: 56, baseType: !149, size: 32, offset: 480)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1165, file: !1166, line: 57, baseType: !1185, size: 64, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !175, line: 180, baseType: !205)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1165, file: !1166, line: 65, baseType: !1187, size: 128, offset: 576)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1188, line: 11, size: 128, elements: !1189)
!1188 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1189 = !{!1190, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1187, file: !1188, line: 16, baseType: !802, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1187, file: !1188, line: 21, baseType: !1192, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !175, line: 197, baseType: !205)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1165, file: !1166, line: 66, baseType: !1187, size: 128, offset: 704)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1165, file: !1166, line: 67, baseType: !1187, size: 128, offset: 832)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1165, file: !1166, line: 79, baseType: !1196, size: 64, offset: 960)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !824)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !1159, file: !2, line: 215, baseType: !85, size: 32, offset: 1216)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !1159, file: !2, line: 219, baseType: !1199, size: 32, offset: 1248)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !812, line: 69, baseType: !1172)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !1159, file: !2, line: 222, baseType: !744, size: 64, offset: 1280)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !1159, file: !2, line: 224, baseType: !131, size: 8, offset: 1344)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !1159, file: !2, line: 228, baseType: !131, size: 8, offset: 1352)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !1159, file: !2, line: 232, baseType: !121, size: 32, offset: 1376)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !1159, file: !2, line: 235, baseType: !131, size: 8, offset: 1408)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !1159, file: !2, line: 238, baseType: !149, size: 32, offset: 1440)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1159, file: !2, line: 241, baseType: !749, size: 64, offset: 1472)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !19, file: !2, line: 340, type: !1209, isLocal: true, isDefinition: true)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1210, line: 130, baseType: !1211)
!1210 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1212, line: 18, baseType: !205)
!1212 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !19, file: !2, line: 343, type: !1209, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !19, file: !2, line: 362, type: !131, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(name: "hostname", scope: !19, file: !2, line: 364, type: !746, isLocal: true, isDefinition: true)
!1219 = !DIGlobalVariableExpression(var: !1220, expr: !DIExpression())
!1220 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !19, file: !2, line: 388, type: !1221, isLocal: true, isDefinition: true)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !2, line: 377, size: 256, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1222, file: !2, line: 379, baseType: !744, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !1222, file: !2, line: 383, baseType: !744, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !1222, file: !2, line: 384, baseType: !131, size: 8, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1222, file: !2, line: 385, baseType: !1221, size: 64, offset: 192)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(name: "current_time", scope: !19, file: !2, line: 393, type: !1187, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(name: "print_scontext", scope: !19, file: !2, line: 395, type: !131, isLocal: true, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(name: "format", scope: !19, file: !2, line: 438, type: !52, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(name: "sort_type", scope: !19, file: !2, line: 494, type: !75, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(name: "print_block_size", scope: !19, file: !2, line: 523, type: !131, isLocal: true, isDefinition: true)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(name: "dired", scope: !19, file: !2, line: 538, type: !131, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(name: "indicator_style", scope: !19, file: !2, line: 555, type: !66, isLocal: true, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(name: "print_with_color", scope: !19, file: !2, line: 572, type: !131, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !19, file: !2, line: 574, type: !131, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(name: "check_symlink_mode", scope: !19, file: !2, line: 676, type: !131, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(name: "dereference", scope: !19, file: !2, line: 685, type: !59, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(name: "recursive", scope: !19, file: !2, line: 690, type: !131, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !19, file: !2, line: 695, type: !131, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(name: "directories_first", scope: !19, file: !2, line: 699, type: !131, isLocal: true, isDefinition: true)
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !19, file: !2, line: 746, type: !1258, isLocal: true, isDefinition: true)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1260, line: 30, flags: DIFlagFwdDecl)
!1260 = !DIFile(filename: "./lib/quote.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4a0796caa167d9859d28846ccf7a0d92")
!1261 = !DIGlobalVariableExpression(var: !1262, expr: !DIExpression())
!1262 = distinct !DIGlobalVariable(name: "tabsize", scope: !19, file: !2, line: 751, type: !749, isLocal: true, isDefinition: true)
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !19, file: !2, line: 755, type: !131, isLocal: true, isDefinition: true)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(name: "localtz", scope: !19, file: !2, line: 764, type: !1267, isLocal: true, isDefinition: true)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !1268, line: 1039, baseType: !1269)
!1268 = !DIFile(filename: "./lib/time.h", directory: "/src")
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1268, line: 1039, flags: DIFlagFwdDecl)
!1271 = !DIGlobalVariableExpression(var: !1272, expr: !DIExpression())
!1272 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !19, file: !2, line: 769, type: !131, isLocal: true, isDefinition: true)
!1273 = !DIGlobalVariableExpression(var: !1274, expr: !DIExpression())
!1274 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !19, file: !2, line: 774, type: !131, isLocal: true, isDefinition: true)
!1275 = !DIGlobalVariableExpression(var: !1276, expr: !DIExpression())
!1276 = distinct !DIGlobalVariable(name: "format_needs_capability", scope: !19, file: !2, line: 778, type: !131, isLocal: true, isDefinition: true)
!1277 = !DIGlobalVariableExpression(var: !1278, expr: !DIExpression())
!1278 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !19, file: !2, line: 827, type: !1279, isLocal: true, isDefinition: true)
!1279 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1280)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !1281, line: 8, baseType: !1282)
!1281 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !175, line: 215, baseType: !149)
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !19, file: !2, line: 831, type: !1279, isLocal: true, isDefinition: true)
!1285 = !DIGlobalVariableExpression(var: !1286, expr: !DIExpression())
!1286 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !19, file: !2, line: 1037, type: !1287, isLocal: true, isDefinition: true)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1288, line: 210, size: 704, elements: !1289)
!1288 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!1289 = !{!1290, !1291, !1301, !1302, !1303, !1304, !1309, !1310, !1321, !1332, !1333, !1334, !1335}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1287, file: !1288, line: 212, baseType: !749, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1287, file: !1288, line: 213, baseType: !1292, size: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1288, line: 203, size: 128, elements: !1294)
!1294 = !{!1295, !1296, !1297}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1293, file: !1288, line: 205, baseType: !744, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1293, file: !1288, line: 206, baseType: !1292, size: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1293, file: !1288, line: 207, baseType: !1298, offset: 128)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1299)
!1299 = !{!1300}
!1300 = !DISubrange(count: -1)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1287, file: !1288, line: 214, baseType: !744, size: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1287, file: !1288, line: 215, baseType: !744, size: 64, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1287, file: !1288, line: 216, baseType: !744, size: 64, offset: 256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1287, file: !1288, line: 221, baseType: !1305, size: 64, offset: 320)
!1305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1287, file: !1288, line: 217, size: 64, elements: !1306)
!1306 = !{!1307, !1308}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !1305, file: !1288, line: 219, baseType: !749, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !1305, file: !1288, line: 220, baseType: !190, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1287, file: !1288, line: 222, baseType: !749, size: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1287, file: !1288, line: 229, baseType: !1311, size: 64, offset: 448)
!1311 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1287, file: !1288, line: 225, size: 64, elements: !1312)
!1312 = !{!1313, !1317}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !1311, file: !1288, line: 227, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DISubroutineType(types: !1316)
