; ModuleID = 'src/expand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert tabs in each FILE to spaces, writing to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"expand\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [63 x i8] c"  -i, --initial\0A         do not convert tabs after non blanks\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [61 x i8] c"  -t, --tabs=N\0A         have tabs N characters apart, not 8\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !32

!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 131, baseType: !69, size: 32, elements: !88)
!88 = !{!89}
!89 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 130, baseType: !69, size: 32, elements: !91)
!91 = !{!92}
!92 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!93 = !{!94, !95, !63, !96, !97, !100, !102}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !98, line: 18, baseType: !99)
!98 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!99 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !104, !109, !114, !119, !124, !207, !212, !214, !219, !224, !229, !231, !233, !238, !240, !242, !244, !246, !251, !253, !255, !257, !259, !261, !263, !268, !273, !278, !280, !282, !284, !286, !288, !290, !295, !297, !299, !304, !309, !314, !57, !319, !321, !323, !325, !327, !339, !397, !402}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 14)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 16)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(scope: null, file: !62, line: 729, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 56)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !62, line: 736, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 75)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !126, file: !62, line: 575, type: !63, isLocal: true, isDefinition: true)
!126 = distinct !DISubprogram(name: "oputs_", scope: !62, file: !62, line: 573, type: !127, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !129)
!127 = !DISubroutineType(cc: DW_CC_nocall, types: !128)
!128 = !{null, !100, !100}
!129 = !{!130, !131, !132, !135, !137, !138, !139, !143, !144, !145, !146, !148, !201, !202, !203, !205, !206}
!130 = !DILocalVariable(name: "program", arg: 1, scope: !126, file: !62, line: 573, type: !100)
!131 = !DILocalVariable(name: "option", arg: 2, scope: !126, file: !62, line: 573, type: !100)
!132 = !DILocalVariable(name: "term", scope: !133, file: !62, line: 585, type: !100)
!133 = distinct !DILexicalBlock(scope: !134, file: !62, line: 582, column: 5)
!134 = distinct !DILexicalBlock(scope: !126, file: !62, line: 581, column: 7)
!135 = !DILocalVariable(name: "double_space", scope: !126, file: !62, line: 594, type: !136)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DILocalVariable(name: "first_word", scope: !126, file: !62, line: 595, type: !100)
!138 = !DILocalVariable(name: "option_text", scope: !126, file: !62, line: 596, type: !100)
!139 = !DILocalVariable(name: "s", scope: !140, file: !62, line: 608, type: !100)
!140 = distinct !DILexicalBlock(scope: !141, file: !62, line: 605, column: 5)
!141 = distinct !DILexicalBlock(scope: !142, file: !62, line: 604, column: 12)
!142 = distinct !DILexicalBlock(scope: !126, file: !62, line: 597, column: 7)
!143 = !DILocalVariable(name: "spaces", scope: !140, file: !62, line: 609, type: !97)
!144 = !DILocalVariable(name: "anchor_len", scope: !126, file: !62, line: 620, type: !97)
!145 = !DILocalVariable(name: "desc_text", scope: !126, file: !62, line: 625, type: !100)
!146 = !DILocalVariable(name: "__ptr", scope: !147, file: !62, line: 644, type: !100)
!147 = distinct !DILexicalBlock(scope: !126, file: !62, line: 644, column: 3)
!148 = !DILocalVariable(name: "__stream", scope: !147, file: !62, line: 644, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !151, line: 7, baseType: !152)
!151 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !153, line: 49, size: 1728, elements: !154)
!153 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !170, !172, !173, !174, !178, !179, !181, !182, !185, !187, !190, !193, !194, !195, !196, !197}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !152, file: !153, line: 51, baseType: !63, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !152, file: !153, line: 54, baseType: !94, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !152, file: !153, line: 55, baseType: !94, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !152, file: !153, line: 56, baseType: !94, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !152, file: !153, line: 57, baseType: !94, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !152, file: !153, line: 58, baseType: !94, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !152, file: !153, line: 59, baseType: !94, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !152, file: !153, line: 60, baseType: !94, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !152, file: !153, line: 61, baseType: !94, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !152, file: !153, line: 64, baseType: !94, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !152, file: !153, line: 65, baseType: !94, size: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !152, file: !153, line: 66, baseType: !94, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !152, file: !153, line: 68, baseType: !168, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !153, line: 36, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !152, file: !153, line: 70, baseType: !171, size: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !152, file: !153, line: 72, baseType: !63, size: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !152, file: !153, line: 73, baseType: !63, size: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !152, file: !153, line: 74, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !176, line: 152, baseType: !177)
!176 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!177 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !152, file: !153, line: 77, baseType: !96, size: 16, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !152, file: !153, line: 78, baseType: !180, size: 8, offset: 1040)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !152, file: !153, line: 79, baseType: !44, size: 8, offset: 1048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !152, file: !153, line: 81, baseType: !183, size: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !153, line: 43, baseType: null)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !152, file: !153, line: 89, baseType: !186, size: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !176, line: 153, baseType: !177)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !152, file: !153, line: 91, baseType: !188, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !153, line: 37, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !152, file: !153, line: 92, baseType: !191, size: 64, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !153, line: 38, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !152, file: !153, line: 93, baseType: !171, size: 64, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !152, file: !153, line: 94, baseType: !95, size: 64, offset: 1408)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !152, file: !153, line: 95, baseType: !97, size: 64, offset: 1472)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !152, file: !153, line: 96, baseType: !63, size: 32, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !152, file: !153, line: 98, baseType: !198, size: 160, offset: 1568)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 20)
!201 = !DILocalVariable(name: "__cnt", scope: !147, file: !62, line: 644, type: !97)
!202 = !DILocalVariable(name: "url_program", scope: !126, file: !62, line: 648, type: !100)
!203 = !DILocalVariable(name: "__ptr", scope: !204, file: !62, line: 686, type: !100)
!204 = distinct !DILexicalBlock(scope: !126, file: !62, line: 686, column: 3)
!205 = !DILocalVariable(name: "__stream", scope: !204, file: !62, line: 686, type: !149)
!206 = !DILocalVariable(name: "__cnt", scope: !204, file: !62, line: 686, type: !97)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !62, line: 585, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 5)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !62, line: 586, type: !209, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !62, line: 595, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 4)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !62, line: 620, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 6)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 2)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !209, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !216, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 3)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !62, line: 650, type: !209, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !62, line: 652, type: !19, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !62, line: 653, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 8)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !62, line: 654, type: !49, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !62, line: 655, type: !49, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !62, line: 656, type: !49, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !62, line: 657, type: !49, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !62, line: 663, type: !19, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !62, line: 664, type: !49, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 17)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 40)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 15)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !29, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !62, line: 679, type: !235, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !62, line: 683, type: !209, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !62, line: 688, type: !209, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !62, line: 691, type: !248, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !62, line: 839, type: !111, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !62, line: 840, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 22)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !62, line: 841, type: !275, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !62, line: 862, type: !216, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !62, line: 868, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 71)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !62, line: 875, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 27)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !62, line: 877, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 51)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !62, line: 877, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 12)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !209, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !248, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !209, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !248, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "longopts", scope: !59, file: !2, line: 54, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 1280, elements: !210)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !332, line: 50, size: 256, elements: !333)
!332 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!333 = !{!334, !335, !336, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !332, line: 52, baseType: !100, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !331, file: !332, line: 55, baseType: !63, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !332, line: 56, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !331, file: !332, line: 57, baseType: !63, size: 32, offset: 192)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "line_in", scope: !341, file: !2, line: 110, type: !394, isLocal: true, isDefinition: true)
!341 = distinct !DISubprogram(name: "expand", scope: !2, file: !2, line: 102, type: !342, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !344)
!342 = !DISubroutineType(types: !343)
!343 = !{null}
!344 = !{!345, !346, !360, !372, !373, !379, !380, !386, !387, !390, !392, !393}
!345 = !DILocalVariable(name: "fp", scope: !341, file: !2, line: 105, type: !149)
!346 = !DILocalVariable(name: "mbbuf", scope: !341, file: !2, line: 111, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !348, line: 50, baseType: !349)
!348 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 43, size: 320, elements: !350)
!350 = !{!351, !352, !353, !358, !359}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !349, file: !348, line: 45, baseType: !94, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !349, file: !348, line: 46, baseType: !149, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !348, line: 47, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !355, line: 130, baseType: !356)
!355 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !357, line: 18, baseType: !177)
!357 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !349, file: !348, line: 48, baseType: !354, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !349, file: !348, line: 49, baseType: !354, size: 64, offset: 256)
!360 = !DILocalVariable(name: "g", scope: !361, file: !2, line: 117, type: !362)
!361 = distinct !DILexicalBlock(scope: !341, file: !2, line: 115, column: 5)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !84, line: 143, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 138, size: 64, elements: !364)
!364 = !{!365, !370, !371}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !363, file: !84, line: 140, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !367, line: 37, baseType: !368)
!367 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !176, line: 57, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !176, line: 42, baseType: !69)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !363, file: !84, line: 141, baseType: !102, size: 8, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !363, file: !84, line: 142, baseType: !102, size: 8, offset: 40)
!372 = !DILocalVariable(name: "convert", scope: !361, file: !2, line: 120, type: !136)
!373 = !DILocalVariable(name: "column", scope: !361, file: !2, line: 127, type: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "colno", file: !375, line: 20, baseType: !376)
!375 = !DIFile(filename: "src/expand-common.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a812a23c6054c0178c7555c3090cc098")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !377, line: 101, baseType: !378)
!377 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !176, line: 72, baseType: !177)
!379 = !DILocalVariable(name: "tab_index", scope: !361, file: !2, line: 130, type: !354)
!380 = !DILocalVariable(name: "last_tab", scope: !381, file: !2, line: 148, type: !136)
!381 = distinct !DILexicalBlock(scope: !382, file: !2, line: 146, column: 17)
!382 = distinct !DILexicalBlock(scope: !383, file: !2, line: 145, column: 19)
!383 = distinct !DILexicalBlock(scope: !384, file: !2, line: 142, column: 13)
!384 = distinct !DILexicalBlock(scope: !385, file: !2, line: 141, column: 15)
!385 = distinct !DILexicalBlock(scope: !361, file: !2, line: 136, column: 9)
!386 = !DILocalVariable(name: "next_tab_column", scope: !381, file: !2, line: 149, type: !374)
!387 = !DILocalVariable(name: "width", scope: !388, file: !2, line: 170, type: !63)
!388 = distinct !DILexicalBlock(scope: !389, file: !2, line: 169, column: 17)
!389 = distinct !DILexicalBlock(scope: !382, file: !2, line: 161, column: 24)
!390 = !DILocalVariable(name: "__ptr", scope: !391, file: !2, line: 180, type: !100)
!391 = distinct !DILexicalBlock(scope: !385, file: !2, line: 180, column: 11)
!392 = !DILocalVariable(name: "__stream", scope: !391, file: !2, line: 180, type: !149)
!393 = !DILocalVariable(name: "__cnt", scope: !391, file: !2, line: 180, type: !97)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 262144)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 172, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 23)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !62, line: 952, type: !316, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 272, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 34)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !409, file: !410, line: 30, type: !136, isLocal: false, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C11, file: !410, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/expand-common.o -MD -MP -MF src/.deps/expand-common.Tpo -c src/expand-common.c -o src/.expand-common.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !411, retainedTypes: !435, globals: !436, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "src/expand-common.c", directory: "/src", checksumkind: CSK_MD5, checksum: "942c25878b2cf9f4cd3ad8d127f8f292")
!411 = !{!67, !412, !426}
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !413, line: 42, baseType: !69, size: 32, elements: !414)
!413 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!415 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!416 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!417 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!418 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!419 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!420 = !DIEnumerator(name: "c_quoting_style", value: 5)
!421 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!422 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!423 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!424 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!425 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !427, line: 44, baseType: !69, size: 32, elements: !428)
!427 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!428 = !{!429, !430, !431, !432, !433, !434}
!429 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!430 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!431 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!432 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!433 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!434 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!435 = !{!63, !96, !95, !94, !97, !100, !102}
!436 = !{!407, !437, !439, !444, !446, !451, !456, !461, !463, !508, !510, !512, !514, !516, !521, !523, !525, !528, !530, !532, !537, !539, !544, !549, !554, !556, !558, !560, !562, !565, !568, !597, !599, !601, !603, !605, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647, !649}
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "exit_status", scope: !409, file: !410, line: 69, type: !63, isLocal: false, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !410, line: 177, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 41)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !410, line: 188, type: !441, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !410, line: 207, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 11)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !410, line: 209, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 25)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !410, line: 217, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 43)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !410, line: 326, type: !399, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "prev_file", scope: !465, file: !410, line: 351, type: !94, isLocal: true, isDefinition: true)
!465 = distinct !DISubprogram(name: "next_file", scope: !410, file: !410, line: 349, type: !466, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !409, retainedNodes: !502)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !151, line: 7, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !153, line: 49, size: 1728, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !470, file: !153, line: 51, baseType: !63, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !470, file: !153, line: 54, baseType: !94, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !470, file: !153, line: 55, baseType: !94, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !470, file: !153, line: 56, baseType: !94, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !470, file: !153, line: 57, baseType: !94, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !470, file: !153, line: 58, baseType: !94, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !470, file: !153, line: 59, baseType: !94, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !470, file: !153, line: 60, baseType: !94, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !470, file: !153, line: 61, baseType: !94, size: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !470, file: !153, line: 64, baseType: !94, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !470, file: !153, line: 65, baseType: !94, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !470, file: !153, line: 66, baseType: !94, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !470, file: !153, line: 68, baseType: !168, size: 64, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !470, file: !153, line: 70, baseType: !486, size: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !470, file: !153, line: 72, baseType: !63, size: 32, offset: 896)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !470, file: !153, line: 73, baseType: !63, size: 32, offset: 928)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !470, file: !153, line: 74, baseType: !175, size: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !470, file: !153, line: 77, baseType: !96, size: 16, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !470, file: !153, line: 78, baseType: !180, size: 8, offset: 1040)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !470, file: !153, line: 79, baseType: !44, size: 8, offset: 1048)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !470, file: !153, line: 81, baseType: !183, size: 64, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !470, file: !153, line: 89, baseType: !186, size: 64, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !470, file: !153, line: 91, baseType: !188, size: 64, offset: 1216)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !470, file: !153, line: 92, baseType: !191, size: 64, offset: 1280)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !470, file: !153, line: 93, baseType: !486, size: 64, offset: 1344)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !470, file: !153, line: 94, baseType: !95, size: 64, offset: 1408)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !470, file: !153, line: 95, baseType: !97, size: 64, offset: 1472)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !470, file: !153, line: 96, baseType: !63, size: 32, offset: 1536)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !470, file: !153, line: 98, baseType: !198, size: 160, offset: 1568)
!502 = !{!503, !504, !505}
!503 = !DILocalVariable(name: "fp", arg: 1, scope: !465, file: !410, line: 349, type: !468)
!504 = !DILocalVariable(name: "file", scope: !465, file: !410, line: 352, type: !94)
!505 = !DILocalVariable(name: "err", scope: !506, file: !410, line: 356, type: !63)
!506 = distinct !DILexicalBlock(scope: !507, file: !410, line: 355, column: 5)
!507 = distinct !DILexicalBlock(scope: !465, file: !410, line: 354, column: 7)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !410, line: 359, type: !226, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !410, line: 365, type: !235, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !410, line: 378, type: !226, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !410, line: 405, type: !301, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !410, line: 409, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2440, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 305)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "max_column_width", scope: !409, file: !410, line: 42, type: !354, isLocal: false, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !409, file: !410, line: 54, type: !354, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "tab_list", scope: !409, file: !410, line: 47, type: !527, isLocal: true, isDefinition: true)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !409, file: !410, line: 50, type: !354, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !410, line: 78, type: !399, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !410, line: 103, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 47)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !410, line: 122, type: !534, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !410, line: 249, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 21)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !410, line: 251, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 28)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !410, line: 256, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 45)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "extend_size", scope: !409, file: !410, line: 36, type: !374, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "increment_size", scope: !409, file: !410, line: 39, type: !374, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "tab_size", scope: !409, file: !410, line: 33, type: !374, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !409, file: !410, line: 66, type: !136, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !409, file: !410, line: 60, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !227)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "file_list", scope: !409, file: !410, line: 57, type: !567, isLocal: true, isDefinition: true)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !570, file: !62, line: 575, type: !63, isLocal: true, isDefinition: true)
!570 = distinct !DISubprogram(name: "oputs_", scope: !62, file: !62, line: 573, type: !571, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !409, retainedNodes: !572)
!571 = !DISubroutineType(types: !128)
!572 = !{!573, !574, !575, !578, !579, !580, !581, !585, !586, !587, !588, !590, !591, !592, !593, !595, !596}
!573 = !DILocalVariable(name: "program", arg: 1, scope: !570, file: !62, line: 573, type: !100)
!574 = !DILocalVariable(name: "option", arg: 2, scope: !570, file: !62, line: 573, type: !100)
!575 = !DILocalVariable(name: "term", scope: !576, file: !62, line: 585, type: !100)
!576 = distinct !DILexicalBlock(scope: !577, file: !62, line: 582, column: 5)
!577 = distinct !DILexicalBlock(scope: !570, file: !62, line: 581, column: 7)
!578 = !DILocalVariable(name: "double_space", scope: !570, file: !62, line: 594, type: !136)
!579 = !DILocalVariable(name: "first_word", scope: !570, file: !62, line: 595, type: !100)
!580 = !DILocalVariable(name: "option_text", scope: !570, file: !62, line: 596, type: !100)
!581 = !DILocalVariable(name: "s", scope: !582, file: !62, line: 608, type: !100)
!582 = distinct !DILexicalBlock(scope: !583, file: !62, line: 605, column: 5)
!583 = distinct !DILexicalBlock(scope: !584, file: !62, line: 604, column: 12)
!584 = distinct !DILexicalBlock(scope: !570, file: !62, line: 597, column: 7)
!585 = !DILocalVariable(name: "spaces", scope: !582, file: !62, line: 609, type: !97)
!586 = !DILocalVariable(name: "anchor_len", scope: !570, file: !62, line: 620, type: !97)
!587 = !DILocalVariable(name: "desc_text", scope: !570, file: !62, line: 625, type: !100)
!588 = !DILocalVariable(name: "__ptr", scope: !589, file: !62, line: 644, type: !100)
!589 = distinct !DILexicalBlock(scope: !570, file: !62, line: 644, column: 3)
!590 = !DILocalVariable(name: "__stream", scope: !589, file: !62, line: 644, type: !468)
!591 = !DILocalVariable(name: "__cnt", scope: !589, file: !62, line: 644, type: !97)
!592 = !DILocalVariable(name: "url_program", scope: !570, file: !62, line: 648, type: !100)
!593 = !DILocalVariable(name: "__ptr", scope: !594, file: !62, line: 686, type: !100)
!594 = distinct !DILexicalBlock(scope: !570, file: !62, line: 686, column: 3)
!595 = !DILocalVariable(name: "__stream", scope: !594, file: !62, line: 686, type: !468)
!596 = !DILocalVariable(name: "__cnt", scope: !594, file: !62, line: 686, type: !97)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !62, line: 585, type: !209, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !62, line: 586, type: !209, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !62, line: 595, type: !216, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !62, line: 620, type: !221, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !226, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !209, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !216, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !235, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !62, line: 650, type: !209, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !62, line: 652, type: !19, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !62, line: 653, type: !248, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !62, line: 654, type: !49, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !62, line: 655, type: !49, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !62, line: 656, type: !49, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !62, line: 657, type: !49, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !62, line: 663, type: !19, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !62, line: 664, type: !49, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !265, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !270, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !275, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !29, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !62, line: 679, type: !235, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !62, line: 683, type: !209, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !62, line: 688, type: !209, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !62, line: 691, type: !248, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !654, line: 3, type: !275, isLocal: true, isDefinition: true)
!654 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "Version", scope: !657, file: !654, line: 3, type: !100, isLocal: false, isDefinition: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C11, file: !654, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !658, splitDebugInlining: false, nameTableKind: None)
!658 = !{!652, !655}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "file_name", scope: !661, file: !662, line: 45, type: !100, isLocal: true, isDefinition: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C11, file: !662, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !663, splitDebugInlining: false, nameTableKind: None)
!662 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!663 = !{!664, !666, !668, !670, !659, !672}
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !662, line: 121, type: !19, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !662, line: 121, type: !316, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !662, line: 123, type: !19, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !662, line: 126, type: !235, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !661, file: !662, line: 55, type: !136, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !676, file: !677, line: 66, type: !724, isLocal: false, isDefinition: true)
!676 = distinct !DICompileUnit(language: DW_LANG_C11, file: !677, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !678, globals: !679, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!678 = !{!95, !102}
!679 = !{!680, !682, !706, !708, !710, !712, !674, !714, !716, !718, !720, !722}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !677, line: 272, type: !209, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "old_file_name", scope: !684, file: !677, line: 304, type: !100, isLocal: true, isDefinition: true)
!684 = distinct !DISubprogram(name: "verror_at_line", scope: !677, file: !677, line: 298, type: !685, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !676, retainedNodes: !699)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !63, !63, !100, !69, !100, !687}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !688, line: 52, baseType: !689)
!688 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !690, line: 12, baseType: !691)
!690 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !677, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !693)
!693 = !{!694, !695, !696, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !692, file: !677, baseType: !95, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !692, file: !677, baseType: !95, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !692, file: !677, baseType: !95, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !692, file: !677, baseType: !63, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !692, file: !677, baseType: !63, size: 32, offset: 224)
!699 = !{!700, !701, !702, !703, !704, !705}
!700 = !DILocalVariable(name: "status", arg: 1, scope: !684, file: !677, line: 298, type: !63)
!701 = !DILocalVariable(name: "errnum", arg: 2, scope: !684, file: !677, line: 298, type: !63)
!702 = !DILocalVariable(name: "file_name", arg: 3, scope: !684, file: !677, line: 298, type: !100)
!703 = !DILocalVariable(name: "line_number", arg: 4, scope: !684, file: !677, line: 298, type: !69)
!704 = !DILocalVariable(name: "message", arg: 5, scope: !684, file: !677, line: 298, type: !100)
!705 = !DILocalVariable(name: "args", arg: 6, scope: !684, file: !677, line: 298, type: !687)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "old_line_number", scope: !684, file: !677, line: 305, type: !69, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !677, line: 338, type: !216, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !677, line: 346, type: !248, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !677, line: 346, type: !226, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "error_message_count", scope: !676, file: !677, line: 69, type: !69, isLocal: false, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !676, file: !677, line: 295, type: !63, isLocal: false, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !677, line: 208, type: !19, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !677, line: 208, type: !541, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !677, line: 214, type: !209, isLocal: true, isDefinition: true)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "program_name", scope: !727, file: !728, line: 31, type: !100, isLocal: false, isDefinition: true)
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !729, globals: !730, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!729 = !{!95, !94}
!730 = !{!725, !731, !733}
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !728, line: 46, type: !248, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !728, line: 49, type: !216, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "utf07FF", scope: !737, file: !738, line: 46, type: !761, isLocal: true, isDefinition: true)
!737 = distinct !DISubprogram(name: "proper_name_lite", scope: !738, file: !738, line: 38, type: !739, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !741, retainedNodes: !743)
!738 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!739 = !DISubroutineType(types: !740)
!740 = !{!100, !100, !100}
!741 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !742, splitDebugInlining: false, nameTableKind: None)
!742 = !{!735}
!743 = !{!744, !745, !746, !747, !748}
!744 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !737, file: !738, line: 38, type: !100)
!745 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !737, file: !738, line: 38, type: !100)
!746 = !DILocalVariable(name: "translation", scope: !737, file: !738, line: 40, type: !100)
!747 = !DILocalVariable(name: "w", scope: !737, file: !738, line: 47, type: !366)
!748 = !DILocalVariable(name: "mbs", scope: !737, file: !738, line: 48, type: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !750, line: 6, baseType: !751)
!750 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !752, line: 21, baseType: !753)
!752 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 13, size: 64, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !753, file: !752, line: 15, baseType: !63, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !753, file: !752, line: 20, baseType: !757, size: 32, offset: 32)
!757 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !753, file: !752, line: 16, size: 32, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !757, file: !752, line: 18, baseType: !69, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !757, file: !752, line: 19, baseType: !216, size: 32)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 16, elements: !227)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !764, line: 78, type: !248, isLocal: true, isDefinition: true)
!764 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !764, line: 79, type: !221, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !764, line: 80, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 13)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !764, line: 81, type: !769, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !764, line: 82, type: !198, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !764, line: 83, type: !226, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !764, line: 84, type: !248, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !764, line: 85, type: !19, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !764, line: 86, type: !19, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !764, line: 87, type: !248, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !788, file: !764, line: 76, type: !862, isLocal: false, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !789, retainedTypes: !797, globals: !798, splitDebugInlining: false, nameTableKind: None)
!789 = !{!790, !792, !67}
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !791, line: 42, baseType: !69, size: 32, elements: !414)
!791 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !791, line: 254, baseType: !69, size: 32, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!795 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!796 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!797 = !{!95, !63, !96, !97}
!798 = !{!762, !765, !767, !772, !774, !776, !778, !780, !782, !784, !786, !799, !803, !813, !815, !820, !822, !824, !826, !828, !851, !858, !860}
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !788, file: !764, line: 92, type: !801, isLocal: false, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 320, elements: !50)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !788, file: !764, line: 1040, type: !805, isLocal: false, isDefinition: true)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !764, line: 56, size: 448, elements: !806)
!806 = !{!807, !808, !809, !811, !812}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !805, file: !764, line: 59, baseType: !790, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !805, file: !764, line: 62, baseType: !63, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !805, file: !764, line: 66, baseType: !810, size: 256, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !249)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !805, file: !764, line: 69, baseType: !100, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !805, file: !764, line: 72, baseType: !100, size: 64, offset: 384)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !788, file: !764, line: 107, type: !805, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "slot0", scope: !788, file: !764, line: 831, type: !817, isLocal: true, isDefinition: true)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 256)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !764, line: 321, type: !226, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !764, line: 357, type: !226, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !764, line: 358, type: !226, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !764, line: 199, type: !19, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "quote", scope: !830, file: !764, line: 228, type: !849, isLocal: true, isDefinition: true)
!830 = distinct !DISubprogram(name: "gettext_quote", scope: !764, file: !764, line: 197, type: !831, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!100, !100, !790}
!833 = !{!834, !835, !836, !837, !838}
!834 = !DILocalVariable(name: "msgid", arg: 1, scope: !830, file: !764, line: 197, type: !100)
!835 = !DILocalVariable(name: "s", arg: 2, scope: !830, file: !764, line: 197, type: !790)
!836 = !DILocalVariable(name: "translation", scope: !830, file: !764, line: 199, type: !100)
!837 = !DILocalVariable(name: "w", scope: !830, file: !764, line: 229, type: !366)
!838 = !DILocalVariable(name: "mbs", scope: !830, file: !764, line: 230, type: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !750, line: 6, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !752, line: 21, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 13, size: 64, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !841, file: !752, line: 15, baseType: !63, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !841, file: !752, line: 20, baseType: !845, size: 32, offset: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !752, line: 16, size: 32, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !845, file: !752, line: 18, baseType: !69, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !845, file: !752, line: 19, baseType: !216, size: 32)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !850)
!850 = !{!228, !218}
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "slotvec", scope: !788, file: !764, line: 834, type: !853, isLocal: true, isDefinition: true)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !764, line: 823, size: 128, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !764, line: 825, baseType: !97, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !854, file: !764, line: 826, baseType: !94, size: 64, offset: 64)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "nslots", scope: !788, file: !764, line: 832, type: !63, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "slotvec0", scope: !788, file: !764, line: 833, type: !854, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 704, elements: !449)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !866, line: 67, type: !316, isLocal: true, isDefinition: true)
!866 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !866, line: 69, type: !19, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !866, line: 83, type: !19, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !866, line: 83, type: !216, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !866, line: 85, type: !226, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !866, line: 88, type: !877, isLocal: true, isDefinition: true)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 171)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !866, line: 88, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !405)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !866, line: 105, type: !111, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !866, line: 109, type: !399, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !866, line: 113, type: !546, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !866, line: 120, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 32)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !866, line: 127, type: !896, isLocal: true, isDefinition: true)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 36)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !866, line: 134, type: !270, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !866, line: 142, type: !903, isLocal: true, isDefinition: true)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 44)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !866, line: 150, type: !908, isLocal: true, isDefinition: true)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 48)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !866, line: 159, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 52)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !866, line: 170, type: !918, isLocal: true, isDefinition: true)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 60)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !866, line: 248, type: !198, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !866, line: 248, type: !292, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !866, line: 254, type: !198, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !866, line: 254, type: !106, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !866, line: 254, type: !270, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !866, line: 259, type: !3, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !866, line: 259, type: !935, isLocal: true, isDefinition: true)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 29)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !940, file: !941, line: 26, type: !943, isLocal: false, isDefinition: true)
!940 = distinct !DICompileUnit(language: DW_LANG_C11, file: !941, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !942, splitDebugInlining: false, nameTableKind: None)
!941 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!942 = !{!938}
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 376, elements: !535)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "exit_failure", scope: !946, file: !947, line: 24, type: !949, isLocal: false, isDefinition: true)
!946 = distinct !DICompileUnit(language: DW_LANG_C11, file: !947, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !948, splitDebugInlining: false, nameTableKind: None)
!947 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!948 = !{!944}
!949 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !952, line: 34, type: !235, isLocal: true, isDefinition: true)
!952 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !952, line: 34, type: !19, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !952, line: 34, type: !265, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !959, line: 108, type: !44, isLocal: true, isDefinition: true)
!959 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "internal_state", scope: !962, file: !959, line: 97, type: !965, isLocal: true, isDefinition: true)
!962 = distinct !DICompileUnit(language: DW_LANG_C11, file: !959, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !963, globals: !964, splitDebugInlining: false, nameTableKind: None)
!963 = !{!95, !97, !102}
!964 = !{!957, !960}
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !750, line: 6, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !752, line: 21, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 13, size: 64, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !967, file: !752, line: 15, baseType: !63, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !967, file: !752, line: 20, baseType: !971, size: 32, offset: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !967, file: !752, line: 16, size: 32, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !971, file: !752, line: 18, baseType: !69, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !971, file: !752, line: 19, baseType: !216, size: 32)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !977, line: 35, type: !226, isLocal: true, isDefinition: true)
!977 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !977, line: 35, type: !221, isLocal: true, isDefinition: true)
!980 = distinct !DICompileUnit(language: DW_LANG_C11, file: !981, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !982, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!982 = !{!983}
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !984, line: 44, baseType: !69, size: 32, elements: !428)
!984 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!985 = distinct !DICompileUnit(language: DW_LANG_C11, file: !986, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!986 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!987 = distinct !DICompileUnit(language: DW_LANG_C11, file: !988, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !989, splitDebugInlining: false, nameTableKind: None)
!988 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!989 = !{!95}
!990 = distinct !DICompileUnit(language: DW_LANG_C11, file: !991, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!992 = distinct !DICompileUnit(language: DW_LANG_C11, file: !993, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !989, splitDebugInlining: false, nameTableKind: None)
!993 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!994 = distinct !DICompileUnit(language: DW_LANG_C11, file: !995, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!995 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!996 = distinct !DICompileUnit(language: DW_LANG_C11, file: !866, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !997, retainedTypes: !989, globals: !1001, splitDebugInlining: false, nameTableKind: None)
!997 = !{!998}
!998 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !866, line: 40, baseType: !69, size: 32, elements: !999)
!999 = !{!1000}
!1000 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1001 = !{!864, !867, !869, !871, !873, !875, !880, !883, !885, !887, !889, !894, !899, !901, !906, !911, !916, !921, !923, !925, !927, !929, !931, !933}
!1002 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1003, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1004, retainedTypes: !1034, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1004 = !{!1005, !1017}
!1005 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1006, file: !1003, line: 188, baseType: !69, size: 32, elements: !1015)
!1006 = distinct !DISubprogram(name: "x2nrealloc", scope: !1003, file: !1003, line: 176, type: !1007, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1002, retainedNodes: !1010)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!95, !95, !1009, !97}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!1010 = !{!1011, !1012, !1013, !1014}
!1011 = !DILocalVariable(name: "p", arg: 1, scope: !1006, file: !1003, line: 176, type: !95)
!1012 = !DILocalVariable(name: "pn", arg: 2, scope: !1006, file: !1003, line: 176, type: !1009)
!1013 = !DILocalVariable(name: "s", arg: 3, scope: !1006, file: !1003, line: 176, type: !97)
!1014 = !DILocalVariable(name: "n", scope: !1006, file: !1003, line: 178, type: !97)
!1015 = !{!1016}
!1016 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1017 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1018, file: !1003, line: 228, baseType: !69, size: 32, elements: !1015)
!1018 = distinct !DISubprogram(name: "xpalloc", scope: !1003, file: !1003, line: 223, type: !1019, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1002, retainedNodes: !1024)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!95, !95, !1021, !1022, !356, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1023, line: 130, baseType: !356)
!1023 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1025 = !DILocalVariable(name: "pa", arg: 1, scope: !1018, file: !1003, line: 223, type: !95)
!1026 = !DILocalVariable(name: "pn", arg: 2, scope: !1018, file: !1003, line: 223, type: !1021)
