; ModuleID = 'src/false.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating failure.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"false\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!163 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !3, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !72, line: 679, type: !128, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !72, line: 683, type: !9, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !72, line: 688, type: !9, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !72, line: 691, type: !141, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !72, line: 839, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 16)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !72, line: 840, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 22)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !72, line: 841, type: !164, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !72, line: 862, type: !112, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !72, line: 868, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 71)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !72, line: 875, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 27)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 51)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 12)
!211 = !{!212, !213, !214, !217, !219, !220, !221, !225, !226, !227, !228, !230, !283, !284, !285, !287, !288}
!212 = !DILocalVariable(name: "program", arg: 1, scope: !71, file: !72, line: 573, type: !75)
!213 = !DILocalVariable(name: "option", arg: 2, scope: !71, file: !72, line: 573, type: !75)
!214 = !DILocalVariable(name: "term", scope: !215, file: !72, line: 585, type: !75)
!215 = distinct !DILexicalBlock(scope: !216, file: !72, line: 582, column: 5)
!216 = distinct !DILexicalBlock(scope: !71, file: !72, line: 581, column: 7)
!217 = !DILocalVariable(name: "double_space", scope: !71, file: !72, line: 594, type: !218)
!218 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!219 = !DILocalVariable(name: "first_word", scope: !71, file: !72, line: 595, type: !75)
!220 = !DILocalVariable(name: "option_text", scope: !71, file: !72, line: 596, type: !75)
!221 = !DILocalVariable(name: "s", scope: !222, file: !72, line: 608, type: !75)
!222 = distinct !DILexicalBlock(scope: !223, file: !72, line: 605, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !72, line: 604, column: 12)
!224 = distinct !DILexicalBlock(scope: !71, file: !72, line: 597, column: 7)
!225 = !DILocalVariable(name: "spaces", scope: !222, file: !72, line: 609, type: !101)
!226 = !DILocalVariable(name: "anchor_len", scope: !71, file: !72, line: 620, type: !101)
!227 = !DILocalVariable(name: "desc_text", scope: !71, file: !72, line: 625, type: !75)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !72, line: 644, type: !75)
!229 = distinct !DILexicalBlock(scope: !71, file: !72, line: 644, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !72, line: 644, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !234)
!233 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !236)
!235 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !252, !254, !255, !256, !260, !261, !263, !264, !267, !269, !272, !275, !276, !277, !278, !279}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 51, baseType: !99, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 36, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 70, baseType: !253, size: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !258, line: 152, baseType: !259)
!258 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!259 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 43, baseType: null)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !258, line: 153, baseType: !259)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !235, line: 37, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !235, line: 38, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !235, line: 93, baseType: !253, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 20)
!283 = !DILocalVariable(name: "__cnt", scope: !229, file: !72, line: 644, type: !101)
!284 = !DILocalVariable(name: "url_program", scope: !71, file: !72, line: 648, type: !75)
!285 = !DILocalVariable(name: "__ptr", scope: !286, file: !72, line: 686, type: !75)
!286 = distinct !DILexicalBlock(scope: !71, file: !72, line: 686, column: 3)
!287 = !DILocalVariable(name: "__stream", scope: !286, file: !72, line: 686, type: !231)
!288 = !DILocalVariable(name: "__cnt", scope: !286, file: !72, line: 686, type: !101)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !291, line: 3, type: !164, isLocal: true, isDefinition: true)
!291 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "Version", scope: !294, file: !291, line: 3, type: !75, isLocal: false, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C11, file: !291, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !295, splitDebugInlining: false, nameTableKind: None)
!295 = !{!289, !292}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "file_name", scope: !298, file: !299, line: 45, type: !75, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C11, file: !299, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !300, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!300 = !{!301, !303, !305, !307, !296, !309}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !54, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !208, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !299, line: 123, type: !54, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !299, line: 126, type: !128, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !298, file: !299, line: 55, type: !218, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !313, file: !314, line: 66, type: !364, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C11, file: !314, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !315, globals: !316, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!315 = !{!98, !104}
!316 = !{!317, !319, !343, !345, !347, !349, !311, !351, !353, !355, !357, !362}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !314, line: 272, type: !9, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "old_file_name", scope: !321, file: !314, line: 304, type: !75, isLocal: true, isDefinition: true)
!321 = distinct !DISubprogram(name: "verror_at_line", scope: !314, file: !314, line: 298, type: !322, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !336)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !99, !99, !75, !82, !75, !324}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !325, line: 52, baseType: !326)
!325 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !327, line: 12, baseType: !328)
!327 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !314, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !330)
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !329, file: !314, baseType: !98, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !329, file: !314, baseType: !98, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !329, file: !314, baseType: !98, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !329, file: !314, baseType: !99, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !329, file: !314, baseType: !99, size: 32, offset: 224)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DILocalVariable(name: "status", arg: 1, scope: !321, file: !314, line: 298, type: !99)
!338 = !DILocalVariable(name: "errnum", arg: 2, scope: !321, file: !314, line: 298, type: !99)
!339 = !DILocalVariable(name: "file_name", arg: 3, scope: !321, file: !314, line: 298, type: !75)
!340 = !DILocalVariable(name: "line_number", arg: 4, scope: !321, file: !314, line: 298, type: !82)
!341 = !DILocalVariable(name: "message", arg: 5, scope: !321, file: !314, line: 298, type: !75)
!342 = !DILocalVariable(name: "args", arg: 6, scope: !321, file: !314, line: 298, type: !324)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "old_line_number", scope: !321, file: !314, line: 305, type: !82, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !314, line: 338, type: !112, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !141, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !119, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "error_message_count", scope: !313, file: !314, line: 69, type: !82, isLocal: false, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !313, file: !314, line: 295, type: !99, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !54, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 21)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !314, line: 214, type: !9, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "program_name", scope: !369, file: !370, line: 31, type: !75, isLocal: false, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C11, file: !370, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !371, globals: !372, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!371 = !{!98, !97}
!372 = !{!367, !373, !375}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !370, line: 46, type: !141, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !370, line: 49, type: !112, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "utf07FF", scope: !379, file: !380, line: 46, type: !407, isLocal: true, isDefinition: true)
!379 = distinct !DISubprogram(name: "proper_name_lite", scope: !380, file: !380, line: 38, type: !381, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !383, retainedNodes: !385)
!380 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!381 = !DISubroutineType(types: !382)
!382 = !{!75, !75, !75}
!383 = distinct !DICompileUnit(language: DW_LANG_C11, file: !380, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !384, splitDebugInlining: false, nameTableKind: None)
!384 = !{!377}
!385 = !{!386, !387, !388, !389, !394}
!386 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !379, file: !380, line: 38, type: !75)
!387 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !379, file: !380, line: 38, type: !75)
!388 = !DILocalVariable(name: "translation", scope: !379, file: !380, line: 40, type: !75)
!389 = !DILocalVariable(name: "w", scope: !379, file: !380, line: 47, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !391, line: 37, baseType: !392)
!391 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !258, line: 57, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !258, line: 42, baseType: !82)
!394 = !DILocalVariable(name: "mbs", scope: !379, file: !380, line: 48, type: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !396, line: 6, baseType: !397)
!396 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !398, line: 21, baseType: !399)
!398 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 13, size: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !399, file: !398, line: 15, baseType: !99, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !399, file: !398, line: 20, baseType: !403, size: 32, offset: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !399, file: !398, line: 16, size: 32, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !403, file: !398, line: 18, baseType: !82, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !403, file: !398, line: 19, baseType: !112, size: 32)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, elements: !120)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !410, line: 78, type: !141, isLocal: true, isDefinition: true)
!410 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !410, line: 79, type: !19, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !410, line: 80, type: !66, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !410, line: 81, type: !66, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !410, line: 82, type: !280, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !410, line: 83, type: !119, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !410, line: 84, type: !141, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !410, line: 85, type: !54, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !410, line: 86, type: !54, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !410, line: 87, type: !141, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !431, file: !410, line: 76, type: !517, isLocal: false, isDefinition: true)
!431 = distinct !DICompileUnit(language: DW_LANG_C11, file: !410, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !432, retainedTypes: !452, globals: !453, splitDebugInlining: false, nameTableKind: None)
!432 = !{!433, !447, !80}
!433 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !434, line: 42, baseType: !82, size: 32, elements: !435)
!434 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!436 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!437 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!438 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!439 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!440 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!441 = !DIEnumerator(name: "c_quoting_style", value: 5)
!442 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!443 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!444 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!445 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!446 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !434, line: 254, baseType: !82, size: 32, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!450 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!451 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!452 = !{!98, !99, !100, !101}
!453 = !{!408, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !454, !458, !468, !470, !475, !477, !479, !481, !483, !506, !513, !515}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !431, file: !410, line: 92, type: !456, isLocal: false, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !45)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !431, file: !410, line: 1040, type: !460, isLocal: false, isDefinition: true)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !410, line: 56, size: 448, elements: !461)
!461 = !{!462, !463, !464, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !460, file: !410, line: 59, baseType: !433, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !410, line: 62, baseType: !99, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !460, file: !410, line: 66, baseType: !465, size: 256, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, elements: !142)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !460, file: !410, line: 69, baseType: !75, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !460, file: !410, line: 72, baseType: !75, size: 64, offset: 384)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !431, file: !410, line: 107, type: !460, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "slot0", scope: !431, file: !410, line: 831, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 256)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !410, line: 321, type: !119, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !410, line: 357, type: !119, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !410, line: 358, type: !119, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !410, line: 199, type: !54, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "quote", scope: !485, file: !410, line: 228, type: !504, isLocal: true, isDefinition: true)
!485 = distinct !DISubprogram(name: "gettext_quote", scope: !410, file: !410, line: 197, type: !486, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !431, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!75, !75, !433}
!488 = !{!489, !490, !491, !492, !493}
!489 = !DILocalVariable(name: "msgid", arg: 1, scope: !485, file: !410, line: 197, type: !75)
!490 = !DILocalVariable(name: "s", arg: 2, scope: !485, file: !410, line: 197, type: !433)
!491 = !DILocalVariable(name: "translation", scope: !485, file: !410, line: 199, type: !75)
!492 = !DILocalVariable(name: "w", scope: !485, file: !410, line: 229, type: !390)
!493 = !DILocalVariable(name: "mbs", scope: !485, file: !410, line: 230, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !396, line: 6, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !398, line: 21, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 13, size: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !496, file: !398, line: 15, baseType: !99, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !496, file: !398, line: 20, baseType: !500, size: 32, offset: 32)
!500 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !398, line: 16, size: 32, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !500, file: !398, line: 18, baseType: !82, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !500, file: !398, line: 19, baseType: !112, size: 32)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !505)
!505 = !{!121, !114}
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "slotvec", scope: !431, file: !410, line: 834, type: !508, isLocal: true, isDefinition: true)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !410, line: 823, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !509, file: !410, line: 825, baseType: !101, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !509, file: !410, line: 826, baseType: !97, size: 64, offset: 64)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "nslots", scope: !431, file: !410, line: 832, type: !99, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "slotvec0", scope: !431, file: !410, line: 833, type: !509, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 704, elements: !519)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!519 = !{!520}
!520 = !DISubrange(count: 11)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !523, line: 67, type: !208, isLocal: true, isDefinition: true)
!523 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !523, line: 69, type: !54, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !523, line: 83, type: !54, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !523, line: 83, type: !112, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !523, line: 85, type: !119, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !523, line: 88, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 171)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !523, line: 88, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 34)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !523, line: 105, type: !179, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !523, line: 109, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 23)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !523, line: 113, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 28)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !523, line: 120, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 32)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !523, line: 127, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 36)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !523, line: 134, type: !159, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !523, line: 142, type: !14, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !523, line: 150, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 48)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !523, line: 159, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 52)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !523, line: 170, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 60)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !523, line: 248, type: !280, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !523, line: 248, type: !184, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !523, line: 254, type: !280, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !523, line: 254, type: !61, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !523, line: 254, type: !159, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !523, line: 259, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 39)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !523, line: 259, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 29)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !605, file: !606, line: 26, type: !608, isLocal: false, isDefinition: true)
!605 = distinct !DICompileUnit(language: DW_LANG_C11, file: !606, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !607, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!607 = !{!603}
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 376, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 47)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "exit_failure", scope: !613, file: !614, line: 24, type: !616, isLocal: false, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C11, file: !614, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !615, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!615 = !{!611}
!616 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !619, line: 34, type: !128, isLocal: true, isDefinition: true)
!619 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !619, line: 34, type: !54, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !619, line: 34, type: !154, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !626, line: 108, type: !39, isLocal: true, isDefinition: true)
!626 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "internal_state", scope: !629, file: !626, line: 97, type: !632, isLocal: true, isDefinition: true)
!629 = distinct !DICompileUnit(language: DW_LANG_C11, file: !626, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !630, globals: !631, splitDebugInlining: false, nameTableKind: None)
!630 = !{!98, !101, !104}
!631 = !{!624, !627}
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !396, line: 6, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !398, line: 21, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 13, size: 64, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !634, file: !398, line: 15, baseType: !99, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !634, file: !398, line: 20, baseType: !638, size: 32, offset: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !634, file: !398, line: 16, size: 32, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !638, file: !398, line: 18, baseType: !82, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !638, file: !398, line: 19, baseType: !112, size: 32)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 35, type: !119, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !644, line: 35, type: !19, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !648, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !523, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !650, retainedTypes: !654, globals: !655, splitDebugInlining: false, nameTableKind: None)
!650 = !{!651}
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !523, line: 40, baseType: !82, size: 32, elements: !652)
!652 = !{!653}
!653 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!654 = !{!98}
!655 = !{!521, !524, !526, !528, !530, !532, !537, !542, !544, !549, !554, !559, !564, !566, !568, !573, !578, !583, !585, !587, !589, !591, !593, !598}
!656 = distinct !DICompileUnit(language: DW_LANG_C11, file: !657, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !658, retainedTypes: !690, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!658 = !{!659, !671}
!659 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !660, file: !657, line: 188, baseType: !82, size: 32, elements: !669)
!660 = distinct !DISubprogram(name: "x2nrealloc", scope: !657, file: !657, line: 176, type: !661, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !656, retainedNodes: !664)
!661 = !DISubroutineType(types: !662)
!662 = !{!98, !98, !663, !101}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!664 = !{!665, !666, !667, !668}
!665 = !DILocalVariable(name: "p", arg: 1, scope: !660, file: !657, line: 176, type: !98)
!666 = !DILocalVariable(name: "pn", arg: 2, scope: !660, file: !657, line: 176, type: !663)
!667 = !DILocalVariable(name: "s", arg: 3, scope: !660, file: !657, line: 176, type: !101)
!668 = !DILocalVariable(name: "n", scope: !660, file: !657, line: 178, type: !101)
!669 = !{!670}
!670 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!671 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !672, file: !657, line: 228, baseType: !82, size: 32, elements: !669)
!672 = distinct !DISubprogram(name: "xpalloc", scope: !657, file: !657, line: 223, type: !673, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !656, retainedNodes: !680)
!673 = !DISubroutineType(types: !674)
!674 = !{!98, !98, !675, !676, !678, !676}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !677, line: 130, baseType: !678)
!677 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !679, line: 18, baseType: !259)
!679 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689}
!681 = !DILocalVariable(name: "pa", arg: 1, scope: !672, file: !657, line: 223, type: !98)
!682 = !DILocalVariable(name: "pn", arg: 2, scope: !672, file: !657, line: 223, type: !675)
!683 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !672, file: !657, line: 223, type: !676)
!684 = !DILocalVariable(name: "n_max", arg: 4, scope: !672, file: !657, line: 223, type: !678)
!685 = !DILocalVariable(name: "s", arg: 5, scope: !672, file: !657, line: 223, type: !676)
!686 = !DILocalVariable(name: "n0", scope: !672, file: !657, line: 230, type: !676)
!687 = !DILocalVariable(name: "n", scope: !672, file: !657, line: 237, type: !676)
!688 = !DILocalVariable(name: "nbytes", scope: !672, file: !657, line: 248, type: !676)
!689 = !DILocalVariable(name: "adjusted_nbytes", scope: !672, file: !657, line: 252, type: !676)
!690 = !{!97, !98}
!691 = distinct !DICompileUnit(language: DW_LANG_C11, file: !619, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !692, splitDebugInlining: false, nameTableKind: None)
!692 = !{!617, !620, !622}
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !694, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!695 = distinct !DICompileUnit(language: DW_LANG_C11, file: !696, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!697 = distinct !DICompileUnit(language: DW_LANG_C11, file: !698, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !704, splitDebugInlining: false, nameTableKind: None)
!704 = !{!642, !645}
!705 = distinct !DICompileUnit(language: DW_LANG_C11, file: !706, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!707 = distinct !DICompileUnit(language: DW_LANG_C11, file: !708, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!709 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!710 = !{i32 7, !"Dwarf Version", i32 5}
!711 = !{i32 2, !"Debug Info Version", i32 3}
!712 = !{i32 1, !"wchar_size", i32 4}
!713 = !{i32 8, !"PIC Level", i32 2}
!714 = !{i32 7, !"PIE Level", i32 2}
!715 = !{i32 7, !"uwtable", i32 2}
!716 = !{i32 7, !"frame-pointer", i32 1}
!717 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!718 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !719, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !99}
!721 = !{!722}
!722 = !DILocalVariable(name: "status", arg: 1, scope: !718, file: !2, line: 36, type: !99)
!723 = !DILocation(line: 0, scope: !718)
!724 = !DILocation(line: 38, column: 3, scope: !718)
!725 = !{!726, !726, i64 0}
!726 = !{!"any pointer", !727, i64 0}
!727 = !{!"omnipotent char", !728, i64 0}
!728 = !{!"Simple C/C++ TBAA"}
!729 = !DILocation(line: 43, column: 3, scope: !718)
!730 = !DILocation(line: 47, column: 3, scope: !718)
!731 = !DILocation(line: 48, column: 3, scope: !718)
!732 = !DILocation(line: 49, column: 3, scope: !718)
!733 = !DILocation(line: 50, column: 3, scope: !718)
!734 = !DILocation(line: 51, column: 3, scope: !718)
!735 = !DISubprogram(name: "dcgettext", scope: !736, file: !736, line: 51, type: !737, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!737 = !DISubroutineType(types: !738)
!738 = !{!97, !75, !75, !99}
!739 = !DISubprogram(name: "__printf_chk", scope: !740, file: !740, line: 95, type: !741, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!740 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!741 = !DISubroutineType(types: !742)
!742 = !{!99, !99, !743, null}
!743 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!744 = !DILocation(line: 0, scope: !71)
!745 = !DILocation(line: 581, column: 7, scope: !216)
!746 = !{!747, !747, i64 0}
!747 = !{!"int", !727, i64 0}
!748 = !DILocation(line: 581, column: 19, scope: !216)
!749 = !DILocation(line: 581, column: 7, scope: !71)
!750 = !DILocation(line: 585, column: 26, scope: !215)
!751 = !DILocation(line: 0, scope: !215)
!752 = !DILocation(line: 586, column: 23, scope: !215)
!753 = !DILocation(line: 586, column: 28, scope: !215)
!754 = !DILocation(line: 586, column: 32, scope: !215)
!755 = !{!727, !727, i64 0}
!756 = !DILocation(line: 586, column: 38, scope: !215)
!757 = !DILocalVariable(name: "__s1", arg: 1, scope: !758, file: !759, line: 1359, type: !75)
!758 = distinct !DISubprogram(name: "streq", scope: !759, file: !759, line: 1359, type: !760, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !762)
!759 = !DIFile(filename: "./lib/string.h", directory: "/src")
!760 = !DISubroutineType(types: !761)
!761 = !{!218, !75, !75}
!762 = !{!757, !763}
!763 = !DILocalVariable(name: "__s2", arg: 2, scope: !758, file: !759, line: 1359, type: !75)
!764 = !DILocation(line: 0, scope: !758, inlinedAt: !765)
!765 = distinct !DILocation(line: 586, column: 41, scope: !215)
!766 = !DILocation(line: 1361, column: 11, scope: !758, inlinedAt: !765)
!767 = !DILocation(line: 1361, column: 10, scope: !758, inlinedAt: !765)
!768 = !DILocation(line: 586, column: 19, scope: !215)
!769 = !DILocation(line: 587, column: 5, scope: !215)
!770 = !DILocation(line: 588, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !71, file: !72, line: 588, column: 7)
!772 = !DILocation(line: 588, column: 7, scope: !71)
!773 = !DILocation(line: 590, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !771, file: !72, line: 589, column: 5)
!775 = !DILocation(line: 591, column: 7, scope: !774)
!776 = !DILocation(line: 595, column: 37, scope: !71)
!777 = !DILocation(line: 595, column: 35, scope: !71)
!778 = !DILocation(line: 596, column: 29, scope: !71)
!779 = !DILocation(line: 597, column: 8, scope: !224)
!780 = !DILocation(line: 597, column: 7, scope: !71)
!781 = !DILocation(line: 604, column: 24, scope: !223)
!782 = !DILocation(line: 604, column: 12, scope: !224)
!783 = !DILocation(line: 0, scope: !222)
!784 = !DILocation(line: 610, column: 16, scope: !222)
!785 = !DILocation(line: 610, column: 7, scope: !222)
!786 = !DILocation(line: 611, column: 21, scope: !222)
!787 = !{!788, !788, i64 0}
!788 = !{!"short", !727, i64 0}
!789 = !DILocation(line: 611, column: 19, scope: !222)
!790 = !DILocation(line: 611, column: 16, scope: !222)
!791 = !DILocation(line: 610, column: 30, scope: !222)
!792 = distinct !{!792, !785, !786, !793}
!793 = !{!"llvm.loop.mustprogress"}
!794 = !DILocation(line: 612, column: 18, scope: !795)
!795 = distinct !DILexicalBlock(scope: !222, file: !72, line: 612, column: 11)
!796 = !DILocation(line: 612, column: 11, scope: !222)
!797 = !DILocation(line: 620, column: 23, scope: !71)
!798 = !DILocation(line: 625, column: 39, scope: !71)
!799 = !DILocation(line: 626, column: 3, scope: !71)
!800 = !DILocation(line: 626, column: 10, scope: !71)
!801 = !DILocation(line: 626, column: 21, scope: !71)
!802 = !DILocation(line: 628, column: 44, scope: !803)
!803 = distinct !DILexicalBlock(scope: !804, file: !72, line: 628, column: 11)
!804 = distinct !DILexicalBlock(scope: !71, file: !72, line: 627, column: 5)
!805 = !DILocation(line: 628, column: 32, scope: !803)
!806 = !DILocation(line: 628, column: 49, scope: !803)
!807 = !DILocation(line: 628, column: 11, scope: !804)
!808 = !DILocation(line: 630, column: 11, scope: !809)
!809 = distinct !DILexicalBlock(scope: !804, file: !72, line: 630, column: 11)
!810 = !DILocation(line: 630, column: 11, scope: !804)
!811 = !DILocation(line: 632, column: 26, scope: !812)
!812 = distinct !DILexicalBlock(scope: !813, file: !72, line: 632, column: 15)
!813 = distinct !DILexicalBlock(scope: !809, file: !72, line: 631, column: 9)
!814 = !DILocation(line: 632, column: 34, scope: !812)
!815 = !DILocation(line: 632, column: 37, scope: !812)
!816 = !DILocation(line: 632, column: 15, scope: !813)
!817 = !DILocation(line: 640, column: 16, scope: !804)
!818 = distinct !{!818, !799, !819, !793}
!819 = !DILocation(line: 641, column: 5, scope: !71)
!820 = !DILocation(line: 644, column: 3, scope: !71)
!821 = !DILocation(line: 0, scope: !758, inlinedAt: !822)
!822 = distinct !DILocation(line: 648, column: 31, scope: !71)
!823 = !{}
!824 = !DILocation(line: 0, scope: !758, inlinedAt: !825)
!825 = distinct !DILocation(line: 649, column: 31, scope: !71)
!826 = !DILocation(line: 0, scope: !758, inlinedAt: !827)
!827 = distinct !DILocation(line: 650, column: 31, scope: !71)
!828 = !DILocation(line: 0, scope: !758, inlinedAt: !829)
!829 = distinct !DILocation(line: 651, column: 31, scope: !71)
!830 = !DILocation(line: 0, scope: !758, inlinedAt: !831)
!831 = distinct !DILocation(line: 652, column: 31, scope: !71)
!832 = !DILocation(line: 0, scope: !758, inlinedAt: !833)
!833 = distinct !DILocation(line: 653, column: 31, scope: !71)
!834 = !DILocation(line: 0, scope: !758, inlinedAt: !835)
!835 = distinct !DILocation(line: 654, column: 31, scope: !71)
!836 = !DILocation(line: 0, scope: !758, inlinedAt: !837)
!837 = distinct !DILocation(line: 655, column: 31, scope: !71)
!838 = !DILocation(line: 0, scope: !758, inlinedAt: !839)
!839 = distinct !DILocation(line: 656, column: 31, scope: !71)
!840 = !DILocation(line: 0, scope: !758, inlinedAt: !841)
!841 = distinct !DILocation(line: 657, column: 31, scope: !71)
!842 = !DILocation(line: 663, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !71, file: !72, line: 663, column: 7)
!844 = !DILocation(line: 664, column: 7, scope: !843)
!845 = !DILocation(line: 664, column: 10, scope: !843)
!846 = !DILocation(line: 663, column: 7, scope: !71)
!847 = !DILocation(line: 669, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !843, file: !72, line: 665, column: 5)
!849 = !DILocation(line: 671, column: 5, scope: !848)
!850 = !DILocation(line: 676, column: 7, scope: !851)
!851 = distinct !DILexicalBlock(scope: !843, file: !72, line: 673, column: 5)
!852 = !DILocation(line: 679, column: 3, scope: !71)
!853 = !DILocation(line: 683, column: 3, scope: !71)
!854 = !DILocation(line: 686, column: 3, scope: !71)
!855 = !DILocation(line: 688, column: 3, scope: !71)
!856 = !DILocation(line: 691, column: 3, scope: !71)
!857 = !DILocation(line: 695, column: 3, scope: !71)
!858 = !DILocation(line: 696, column: 1, scope: !71)
!859 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !72, file: !72, line: 836, type: !860, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !862)
!860 = !DISubroutineType(cc: DW_CC_nocall, types: !861)
!861 = !{null, !75}
!862 = !{!863, !864, !871, !872, !874, !875}
!863 = !DILocalVariable(name: "program", arg: 1, scope: !859, file: !72, line: 836, type: !75)
!864 = !DILocalVariable(name: "infomap", scope: !859, file: !72, line: 838, type: !865)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 896, elements: !55)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !859, file: !72, line: 838, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !867, file: !72, line: 838, baseType: !75, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !867, file: !72, line: 838, baseType: !75, size: 64, offset: 64)
!871 = !DILocalVariable(name: "node", scope: !859, file: !72, line: 848, type: !75)
!872 = !DILocalVariable(name: "map_prog", scope: !859, file: !72, line: 849, type: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!874 = !DILocalVariable(name: "lc_messages", scope: !859, file: !72, line: 861, type: !75)
!875 = !DILocalVariable(name: "url_program", scope: !859, file: !72, line: 874, type: !75)
!876 = !DILocation(line: 0, scope: !859)
!877 = !DILocation(line: 857, column: 3, scope: !859)
!878 = !DILocation(line: 861, column: 29, scope: !859)
!879 = !DILocation(line: 862, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !859, file: !72, line: 862, column: 7)
!881 = !DILocation(line: 862, column: 19, scope: !880)
!882 = !DILocation(line: 862, column: 22, scope: !880)
!883 = !DILocation(line: 862, column: 7, scope: !859)
!884 = !DILocation(line: 868, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !72, line: 863, column: 5)
!886 = !DILocation(line: 870, column: 5, scope: !885)
!887 = !DILocation(line: 875, column: 3, scope: !859)
!888 = !DILocation(line: 877, column: 3, scope: !859)
!889 = !DILocation(line: 879, column: 1, scope: !859)
!890 = !DISubprogram(name: "exit", scope: !891, file: !891, line: 624, type: !719, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!891 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!892 = !DISubprogram(name: "setlocale", scope: !893, file: !893, line: 122, type: !894, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!893 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!894 = !DISubroutineType(types: !895)
!895 = !{!97, !99, !75}
!896 = !DISubprogram(name: "strncmp", scope: !897, file: !897, line: 159, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!897 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!898 = !DISubroutineType(types: !899)
!899 = !{!99, !75, !75, !101}
!900 = !DISubprogram(name: "fputs_unlocked", scope: !325, file: !325, line: 691, type: !901, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!901 = !DISubroutineType(types: !902)
!902 = !{!99, !743, !903}
!903 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!904 = !DISubprogram(name: "getenv", scope: !891, file: !891, line: 641, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!905 = !DISubroutineType(types: !906)
!906 = !{!97, !75}
!907 = !DISubprogram(name: "strcmp", scope: !897, file: !897, line: 156, type: !908, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!908 = !DISubroutineType(types: !909)
!909 = !{!99, !75, !75}
!910 = !DISubprogram(name: "strspn", scope: !897, file: !897, line: 297, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!911 = !DISubroutineType(types: !912)
!912 = !{!103, !75, !75}
!913 = !DISubprogram(name: "strchr", scope: !897, file: !897, line: 246, type: !914, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!914 = !DISubroutineType(types: !915)
!915 = !{!97, !75, !99}
!916 = !DISubprogram(name: "__ctype_b_loc", scope: !81, file: !81, line: 79, type: !917, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!917 = !DISubroutineType(types: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!922 = !DISubprogram(name: "strcspn", scope: !897, file: !897, line: 293, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!923 = !DISubprogram(name: "fwrite_unlocked", scope: !325, file: !325, line: 704, type: !924, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!924 = !DISubroutineType(types: !925)
!925 = !{!101, !926, !101, !101, !903}
!926 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!929 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !930, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !933)
!930 = !DISubroutineType(types: !931)
!931 = !{!99, !99, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!933 = !{!934, !935}
!934 = !DILocalVariable(name: "argc", arg: 1, scope: !929, file: !2, line: 55, type: !99)
!935 = !DILocalVariable(name: "argv", arg: 2, scope: !929, file: !2, line: 55, type: !932)
!936 = !DILocation(line: 0, scope: !929)
!937 = !DILocation(line: 59, column: 12, scope: !938)
!938 = distinct !DILexicalBlock(scope: !929, file: !2, line: 59, column: 7)
!939 = !DILocation(line: 59, column: 7, scope: !929)
!940 = !DILocation(line: 62, column: 25, scope: !941)
!941 = distinct !DILexicalBlock(scope: !938, file: !2, line: 60, column: 5)
!942 = !DILocation(line: 62, column: 7, scope: !941)
!943 = !DILocation(line: 63, column: 7, scope: !941)
!944 = !DILocation(line: 64, column: 7, scope: !941)
!945 = !DILocation(line: 65, column: 7, scope: !941)
!946 = !DILocation(line: 69, column: 7, scope: !941)
!947 = !DILocation(line: 71, column: 18, scope: !948)
!948 = distinct !DILexicalBlock(scope: !941, file: !2, line: 71, column: 11)
!949 = !DILocation(line: 0, scope: !758, inlinedAt: !950)
!950 = distinct !DILocation(line: 71, column: 11, scope: !948)
!951 = !DILocation(line: 1361, column: 11, scope: !758, inlinedAt: !950)
!952 = !DILocation(line: 1361, column: 10, scope: !758, inlinedAt: !950)
!953 = !DILocation(line: 71, column: 11, scope: !941)
!954 = !DILocation(line: 72, column: 9, scope: !948)
!955 = !DILocation(line: 0, scope: !758, inlinedAt: !956)
!956 = distinct !DILocation(line: 74, column: 11, scope: !957)
!957 = distinct !DILexicalBlock(scope: !941, file: !2, line: 74, column: 11)
!958 = !DILocation(line: 1361, column: 11, scope: !758, inlinedAt: !956)
!959 = !DILocation(line: 1361, column: 10, scope: !758, inlinedAt: !956)
!960 = !DILocation(line: 74, column: 11, scope: !941)
!961 = !DILocation(line: 75, column: 22, scope: !957)
!962 = !DILocation(line: 75, column: 58, scope: !957)
!963 = !DILocation(line: 75, column: 67, scope: !957)
!964 = !DILocation(line: 75, column: 9, scope: !957)
!965 = !DILocation(line: 79, column: 3, scope: !929)
!966 = !DISubprogram(name: "bindtextdomain", scope: !736, file: !736, line: 86, type: !967, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!967 = !DISubroutineType(types: !968)
!968 = !{!97, !75, !75}
!969 = !DISubprogram(name: "textdomain", scope: !736, file: !736, line: 82, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!970 = !DISubprogram(name: "atexit", scope: !891, file: !891, line: 602, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!971 = !DISubroutineType(types: !972)
!972 = !{!99, !364}
!973 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !299, file: !299, line: 50, type: !974, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !975)
!974 = !DISubroutineType(types: !861)
!975 = !{!976}
!976 = !DILocalVariable(name: "file", arg: 1, scope: !973, file: !299, line: 50, type: !75)
!977 = !DILocation(line: 0, scope: !973)
!978 = !DILocation(line: 52, column: 13, scope: !973)
!979 = !DILocation(line: 53, column: 1, scope: !973)
!980 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !299, file: !299, line: 87, type: !981, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !218}
!983 = !{!984}
!984 = !DILocalVariable(name: "ignore", arg: 1, scope: !980, file: !299, line: 87, type: !218)
!985 = !DILocation(line: 0, scope: !980)
!986 = !DILocation(line: 89, column: 16, scope: !980)
!987 = !{!988, !988, i64 0}
!988 = !{!"_Bool", !727, i64 0}
!989 = !DILocation(line: 90, column: 1, scope: !980)
!990 = distinct !DISubprogram(name: "close_stdout", scope: !299, file: !299, line: 116, type: !365, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !991)
!991 = !{!992}
!992 = !DILocalVariable(name: "write_error", scope: !993, file: !299, line: 121, type: !75)
!993 = distinct !DILexicalBlock(scope: !994, file: !299, line: 120, column: 5)
!994 = distinct !DILexicalBlock(scope: !990, file: !299, line: 118, column: 7)
!995 = !DILocation(line: 118, column: 21, scope: !994)
!996 = !DILocation(line: 118, column: 7, scope: !994)
!997 = !DILocation(line: 118, column: 29, scope: !994)
!998 = !DILocation(line: 119, column: 7, scope: !994)
!999 = !DILocation(line: 119, column: 12, scope: !994)
!1000 = !{i8 0, i8 2}
!1001 = !DILocation(line: 119, column: 25, scope: !994)
!1002 = !DILocation(line: 119, column: 28, scope: !994)
!1003 = !DILocation(line: 119, column: 34, scope: !994)
!1004 = !DILocation(line: 118, column: 7, scope: !990)
!1005 = !DILocation(line: 121, column: 33, scope: !993)
!1006 = !DILocation(line: 0, scope: !993)
!1007 = !DILocation(line: 122, column: 11, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !993, file: !299, line: 122, column: 11)
!1009 = !DILocation(line: 0, scope: !1008)
!1010 = !DILocation(line: 122, column: 11, scope: !993)
!1011 = !DILocation(line: 123, column: 9, scope: !1008)
!1012 = !DILocation(line: 126, column: 9, scope: !1008)
!1013 = !DILocation(line: 128, column: 14, scope: !993)
!1014 = !DILocation(line: 128, column: 7, scope: !993)
!1015 = !DILocation(line: 133, column: 42, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !990, file: !299, line: 133, column: 7)
!1017 = !DILocation(line: 133, column: 28, scope: !1016)
!1018 = !DILocation(line: 133, column: 50, scope: !1016)
!1019 = !DILocation(line: 133, column: 7, scope: !990)
!1020 = !DILocation(line: 134, column: 12, scope: !1016)
!1021 = !DILocation(line: 134, column: 5, scope: !1016)
!1022 = !DILocation(line: 135, column: 1, scope: !990)
!1023 = !DISubprogram(name: "__errno_location", scope: !1024, file: !1024, line: 37, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1024 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!1028 = !DISubprogram(name: "_exit", scope: !1029, file: !1029, line: 624, type: !719, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1029 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1030 = distinct !DISubprogram(name: "verror", scope: !314, file: !314, line: 251, type: !1031, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1033)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{null, !99, !99, !75, !324}
!1033 = !{!1034, !1035, !1036, !1037}
!1034 = !DILocalVariable(name: "status", arg: 1, scope: !1030, file: !314, line: 251, type: !99)
!1035 = !DILocalVariable(name: "errnum", arg: 2, scope: !1030, file: !314, line: 251, type: !99)
!1036 = !DILocalVariable(name: "message", arg: 3, scope: !1030, file: !314, line: 251, type: !75)
!1037 = !DILocalVariable(name: "args", arg: 4, scope: !1030, file: !314, line: 251, type: !324)
!1038 = !DILocation(line: 0, scope: !1030)
!1039 = !DILocation(line: 261, column: 3, scope: !1030)
!1040 = !DILocation(line: 265, column: 7, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1030, file: !314, line: 265, column: 7)
!1042 = !DILocation(line: 265, column: 7, scope: !1030)
!1043 = !DILocation(line: 266, column: 5, scope: !1041)
!1044 = !DILocation(line: 272, column: 7, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1041, file: !314, line: 268, column: 5)
!1046 = !DILocation(line: 276, column: 3, scope: !1030)
!1047 = !{i64 0, i64 8, !725, i64 8, i64 8, !725, i64 16, i64 8, !725, i64 24, i64 4, !746, i64 28, i64 4, !746}
!1048 = !DILocation(line: 282, column: 1, scope: !1030)
!1049 = distinct !DISubprogram(name: "flush_stdout", scope: !314, file: !314, line: 163, type: !365, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1050)
!1050 = !{!1051}
!1051 = !DILocalVariable(name: "stdout_fd", scope: !1049, file: !314, line: 166, type: !99)
!1052 = !DILocation(line: 0, scope: !1049)
!1053 = !DILocalVariable(name: "fd", arg: 1, scope: !1054, file: !314, line: 145, type: !99)
!1054 = distinct !DISubprogram(name: "is_open", scope: !314, file: !314, line: 145, type: !1055, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1057)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!99, !99}
!1057 = !{!1053}
!1058 = !DILocation(line: 0, scope: !1054, inlinedAt: !1059)
!1059 = distinct !DILocation(line: 182, column: 25, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1049, file: !314, line: 182, column: 7)
!1061 = !DILocation(line: 157, column: 15, scope: !1054, inlinedAt: !1059)
!1062 = !DILocation(line: 157, column: 12, scope: !1054, inlinedAt: !1059)
!1063 = !DILocation(line: 182, column: 7, scope: !1049)
!1064 = !DILocation(line: 184, column: 5, scope: !1060)
!1065 = !DILocation(line: 185, column: 1, scope: !1049)
!1066 = !DISubprogram(name: "__fprintf_chk", scope: !740, file: !740, line: 93, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!99, !1069, !99, !743, null}
!1069 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1072, file: !235, line: 51, baseType: !99, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1072, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1072, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1072, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1072, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1072, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1072, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1072, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1072, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1072, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1072, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1072, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1072, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1072, file: !235, line: 70, baseType: !1088, size: 64, offset: 832)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1072, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1072, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1072, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1072, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1072, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1072, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1072, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1072, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1072, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1072, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1072, file: !235, line: 93, baseType: !1088, size: 64, offset: 1344)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1072, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1072, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1072, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1072, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!1104 = distinct !DISubprogram(name: "error_tail", scope: !314, file: !314, line: 219, type: !1031, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1105)
!1105 = !{!1106, !1107, !1108, !1109}
!1106 = !DILocalVariable(name: "status", arg: 1, scope: !1104, file: !314, line: 219, type: !99)
!1107 = !DILocalVariable(name: "errnum", arg: 2, scope: !1104, file: !314, line: 219, type: !99)
!1108 = !DILocalVariable(name: "message", arg: 3, scope: !1104, file: !314, line: 219, type: !75)
!1109 = !DILocalVariable(name: "args", arg: 4, scope: !1104, file: !314, line: 219, type: !324)
!1110 = distinct !DIAssignID()
!1111 = !DILocation(line: 0, scope: !1104)
!1112 = !DILocation(line: 229, column: 13, scope: !1104)
!1113 = !DILocation(line: 135, column: 10, scope: !1114, inlinedAt: !1121)
!1114 = distinct !DISubprogram(name: "vfprintf", scope: !740, file: !740, line: 132, type: !1115, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1117)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!99, !1069, !743, !326}
!1117 = !{!1118, !1119, !1120}
!1118 = !DILocalVariable(name: "__stream", arg: 1, scope: !1114, file: !740, line: 132, type: !1069)
!1119 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1114, file: !740, line: 133, type: !743)
!1120 = !DILocalVariable(name: "__ap", arg: 3, scope: !1114, file: !740, line: 133, type: !326)
!1121 = distinct !DILocation(line: 229, column: 3, scope: !1104)
!1122 = !{!1123, !1125}
!1123 = distinct !{!1123, !1124, !"vfprintf.inline: argument 0"}
!1124 = distinct !{!1124, !"vfprintf.inline"}
!1125 = distinct !{!1125, !1124, !"vfprintf.inline: argument 1"}
!1126 = !DILocation(line: 229, column: 3, scope: !1104)
!1127 = !DILocation(line: 0, scope: !1114, inlinedAt: !1121)
!1128 = !DILocation(line: 232, column: 3, scope: !1104)
!1129 = !DILocation(line: 233, column: 7, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1104, file: !314, line: 233, column: 7)
!1131 = !DILocation(line: 233, column: 7, scope: !1104)
!1132 = !DILocalVariable(name: "errbuf", scope: !1133, file: !314, line: 193, type: !1137)
!1133 = distinct !DISubprogram(name: "print_errno_message", scope: !314, file: !314, line: 188, type: !719, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1134)
!1134 = !{!1135, !1136, !1132}
!1135 = !DILocalVariable(name: "errnum", arg: 1, scope: !1133, file: !314, line: 188, type: !99)
!1136 = !DILocalVariable(name: "s", scope: !1133, file: !314, line: 190, type: !75)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1138)
!1138 = !{!1139}
!1139 = !DISubrange(count: 1024)
!1140 = !DILocation(line: 0, scope: !1133, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 234, column: 5, scope: !1130)
!1142 = !DILocation(line: 193, column: 3, scope: !1133, inlinedAt: !1141)
!1143 = !DILocation(line: 195, column: 7, scope: !1133, inlinedAt: !1141)
!1144 = !DILocation(line: 207, column: 9, scope: !1145, inlinedAt: !1141)
!1145 = distinct !DILexicalBlock(scope: !1133, file: !314, line: 207, column: 7)
!1146 = !DILocation(line: 207, column: 7, scope: !1133, inlinedAt: !1141)
!1147 = !DILocation(line: 208, column: 9, scope: !1145, inlinedAt: !1141)
!1148 = !DILocation(line: 208, column: 5, scope: !1145, inlinedAt: !1141)
!1149 = !DILocation(line: 214, column: 3, scope: !1133, inlinedAt: !1141)
!1150 = !DILocation(line: 216, column: 1, scope: !1133, inlinedAt: !1141)
!1151 = !DILocation(line: 234, column: 5, scope: !1130)
!1152 = !DILocation(line: 238, column: 3, scope: !1104)
!1153 = !DILocalVariable(name: "__c", arg: 1, scope: !1154, file: !1155, line: 101, type: !99)
!1154 = distinct !DISubprogram(name: "putc_unlocked", scope: !1155, file: !1155, line: 101, type: !1156, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1158)
!1155 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!99, !99, !1070}
!1158 = !{!1153, !1159}
!1159 = !DILocalVariable(name: "__stream", arg: 2, scope: !1154, file: !1155, line: 101, type: !1070)
!1160 = !DILocation(line: 0, scope: !1154, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 238, column: 3, scope: !1104)
!1162 = !DILocation(line: 103, column: 10, scope: !1154, inlinedAt: !1161)
!1163 = !{!1164, !726, i64 40}
