; ModuleID = 'src/fmt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.Word = type { ptr, i32, i32, i8, i32, i64, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [42 x i8] c"Usage: %s [-WIDTH] [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [129 x i8] c"Reformat each paragraph in the FILE(s), writing to standard output.\0AThe option -WIDTH is an abbreviated form of --width=DIGITS.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"fmt\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [71 x i8] c"  -c, --crown-margin\0A         preserve indentation of first two lines\0A\00", align 1, !dbg !22

!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !2, line: 445, type: !173, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 450, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 27)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 23)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "crown", scope: !89, file: !2, line: 173, type: !195, isLocal: true, isDefinition: true)
!195 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "tagged", scope: !89, file: !2, line: 176, type: !195, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "split", scope: !89, file: !2, line: 179, type: !195, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "uniform", scope: !89, file: !2, line: 182, type: !195, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "goal_width", scope: !89, file: !2, line: 203, type: !93, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !92, line: 729, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 56)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !92, line: 736, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 75)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !216, file: !92, line: 575, type: !93, isLocal: true, isDefinition: true)
!216 = distinct !DISubprogram(name: "oputs_", scope: !92, file: !92, line: 573, type: !217, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !219)
!217 = !DISubroutineType(cc: DW_CC_nocall, types: !218)
!218 = !{null, !150, !150}
!219 = !{!220, !221, !222, !225, !226, !227, !228, !232, !233, !234, !235, !237, !289, !290, !291, !293, !294}
!220 = !DILocalVariable(name: "program", arg: 1, scope: !216, file: !92, line: 573, type: !150)
!221 = !DILocalVariable(name: "option", arg: 2, scope: !216, file: !92, line: 573, type: !150)
!222 = !DILocalVariable(name: "term", scope: !223, file: !92, line: 585, type: !150)
!223 = distinct !DILexicalBlock(scope: !224, file: !92, line: 582, column: 5)
!224 = distinct !DILexicalBlock(scope: !216, file: !92, line: 581, column: 7)
!225 = !DILocalVariable(name: "double_space", scope: !216, file: !92, line: 594, type: !195)
!226 = !DILocalVariable(name: "first_word", scope: !216, file: !92, line: 595, type: !150)
!227 = !DILocalVariable(name: "option_text", scope: !216, file: !92, line: 596, type: !150)
!228 = !DILocalVariable(name: "s", scope: !229, file: !92, line: 608, type: !150)
!229 = distinct !DILexicalBlock(scope: !230, file: !92, line: 605, column: 5)
!230 = distinct !DILexicalBlock(scope: !231, file: !92, line: 604, column: 12)
!231 = distinct !DILexicalBlock(scope: !216, file: !92, line: 597, column: 7)
!232 = !DILocalVariable(name: "spaces", scope: !229, file: !92, line: 609, type: !147)
!233 = !DILocalVariable(name: "anchor_len", scope: !216, file: !92, line: 620, type: !147)
!234 = !DILocalVariable(name: "desc_text", scope: !216, file: !92, line: 625, type: !150)
!235 = !DILocalVariable(name: "__ptr", scope: !236, file: !92, line: 644, type: !150)
!236 = distinct !DILexicalBlock(scope: !216, file: !92, line: 644, column: 3)
!237 = !DILocalVariable(name: "__stream", scope: !236, file: !92, line: 644, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !241)
!240 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !243)
!242 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !259, !261, !262, !263, !266, !267, !269, !270, !273, !275, !278, !281, !282, !283, !284, !285}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !242, line: 51, baseType: !93, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !241, file: !242, line: 54, baseType: !144, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !241, file: !242, line: 55, baseType: !144, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !241, file: !242, line: 56, baseType: !144, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !241, file: !242, line: 57, baseType: !144, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !241, file: !242, line: 58, baseType: !144, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !241, file: !242, line: 59, baseType: !144, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !241, file: !242, line: 60, baseType: !144, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !241, file: !242, line: 61, baseType: !144, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !241, file: !242, line: 64, baseType: !144, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !241, file: !242, line: 65, baseType: !144, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !241, file: !242, line: 66, baseType: !144, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !241, file: !242, line: 68, baseType: !257, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !242, line: 36, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !241, file: !242, line: 70, baseType: !260, size: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !241, file: !242, line: 72, baseType: !93, size: 32, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !242, line: 73, baseType: !93, size: 32, offset: 928)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !241, file: !242, line: 74, baseType: !264, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !265, line: 152, baseType: !155)
!265 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !241, file: !242, line: 77, baseType: !146, size: 16, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !241, file: !242, line: 78, baseType: !268, size: 8, offset: 1040)
!268 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !241, file: !242, line: 79, baseType: !69, size: 8, offset: 1048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !242, line: 81, baseType: !271, size: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !242, line: 43, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !242, line: 89, baseType: !274, size: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !265, line: 153, baseType: !155)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !241, file: !242, line: 91, baseType: !276, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !242, line: 37, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !241, file: !242, line: 92, baseType: !279, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !242, line: 38, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !241, file: !242, line: 93, baseType: !260, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !241, file: !242, line: 94, baseType: !145, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !241, file: !242, line: 95, baseType: !147, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !241, file: !242, line: 96, baseType: !93, size: 32, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !241, file: !242, line: 98, baseType: !286, size: 160, offset: 1568)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 20)
!289 = !DILocalVariable(name: "__cnt", scope: !236, file: !92, line: 644, type: !147)
!290 = !DILocalVariable(name: "url_program", scope: !216, file: !92, line: 648, type: !150)
!291 = !DILocalVariable(name: "__ptr", scope: !292, file: !92, line: 686, type: !150)
!292 = distinct !DILexicalBlock(scope: !216, file: !92, line: 686, column: 3)
!293 = !DILocalVariable(name: "__stream", scope: !292, file: !92, line: 686, type: !238)
!294 = !DILocalVariable(name: "__cnt", scope: !292, file: !92, line: 686, type: !147)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !92, line: 585, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !92, line: 586, type: !297, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !92, line: 595, type: !19, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !92, line: 620, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 6)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !173, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !297, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !19, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !185, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !92, line: 650, type: !297, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !306, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !306, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !92, line: 652, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 7)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !92, line: 653, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !92, line: 654, type: !74, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !92, line: 655, type: !74, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !92, line: 656, type: !74, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !92, line: 657, type: !74, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !92, line: 663, type: !325, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !92, line: 664, type: !74, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 17)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 40)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 15)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 61)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !92, line: 679, type: !185, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !92, line: 683, type: !297, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !92, line: 688, type: !297, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !92, line: 691, type: !330, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !92, line: 839, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 16)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !92, line: 840, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 22)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !92, line: 841, type: !357, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !92, line: 862, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !92, line: 868, type: !24, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !92, line: 875, type: !180, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 51)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 12)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 13)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !325, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 11)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !347, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 323, type: !375, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !306, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !297, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !297, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !330, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "max_width", scope: !89, file: !2, line: 189, type: !93, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "prefix_lead_space", scope: !89, file: !2, line: 197, type: !93, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "prefix", scope: !89, file: !2, line: 185, type: !150, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "prefix_full_length", scope: !89, file: !2, line: 194, type: !93, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "prefix_length", scope: !89, file: !2, line: 200, type: !93, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 514, type: !410, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 516, type: !347, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "tabs", scope: !89, file: !2, line: 231, type: !195, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "other_indent", scope: !89, file: !2, line: 240, type: !93, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "in_column", scope: !89, file: !2, line: 208, type: !93, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "next_prefix_indent", scope: !89, file: !2, line: 254, type: !93, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "next_char", scope: !89, file: !2, line: 250, type: !93, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "last_line_length", scope: !89, file: !2, line: 259, type: !93, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "out_column", scope: !89, file: !2, line: 211, type: !93, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "prefix_indent", scope: !89, file: !2, line: 234, type: !93, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "first_indent", scope: !89, file: !2, line: 237, type: !93, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "parabuf", scope: !89, file: !2, line: 215, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40000, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 5000)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "wptr", scope: !89, file: !2, line: 218, type: !144, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "unused_word_type", scope: !89, file: !2, line: 222, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 320000, elements: !481)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !2, line: 128, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Word", file: !2, line: 130, size: 320, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !468, file: !2, line: 135, baseType: !150, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !2, line: 136, baseType: !93, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !468, file: !2, line: 137, baseType: !93, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "paren", scope: !468, file: !2, line: 138, baseType: !99, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !468, file: !2, line: 139, baseType: !99, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "punct", scope: !468, file: !2, line: 140, baseType: !99, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !468, file: !2, line: 141, baseType: !99, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !468, file: !2, line: 145, baseType: !93, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "best_cost", scope: !468, file: !2, line: 146, baseType: !154, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_break", scope: !468, file: !2, line: 147, baseType: !480, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!481 = !{!482}
!482 = !DISubrange(count: 1000)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !92, line: 952, type: !398, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 798, type: !306, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 800, type: !297, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 802, type: !19, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "word_limit", scope: !89, file: !2, line: 227, type: !480, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 2560, elements: !75)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !496, line: 50, size: 256, elements: !497)
!496 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!497 = !{!498, !499, !500, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !496, line: 52, baseType: !150, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !495, file: !496, line: 55, baseType: !93, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !496, line: 56, baseType: !501, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !495, file: !496, line: 57, baseType: !93, size: 32, offset: 192)
!503 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!504 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!505 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!506 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!507 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !510, line: 3, type: !357, isLocal: true, isDefinition: true)
!510 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "Version", scope: !513, file: !510, line: 3, type: !150, isLocal: false, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C11, file: !510, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !514, splitDebugInlining: false, nameTableKind: None)
!514 = !{!508, !511}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "file_name", scope: !517, file: !518, line: 45, type: !150, isLocal: true, isDefinition: true)
!517 = distinct !DICompileUnit(language: DW_LANG_C11, file: !518, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !519, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!519 = !{!520, !522, !524, !526, !515, !528}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !518, line: 121, type: !325, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !518, line: 121, type: !398, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !518, line: 123, type: !325, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !518, line: 126, type: !185, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !517, file: !518, line: 55, type: !195, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !532, file: !533, line: 66, type: !580, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C11, file: !533, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !534, globals: !535, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!534 = !{!145, !152}
!535 = !{!536, !538, !562, !564, !566, !568, !530, !570, !572, !574, !576, !578}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !533, line: 272, type: !297, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "old_file_name", scope: !540, file: !533, line: 304, type: !150, isLocal: true, isDefinition: true)
!540 = distinct !DISubprogram(name: "verror_at_line", scope: !533, file: !533, line: 298, type: !541, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !532, retainedNodes: !555)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !93, !93, !150, !99, !150, !543}
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !544, line: 52, baseType: !545)
!544 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !546, line: 12, baseType: !547)
!546 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !533, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !549)
!549 = !{!550, !551, !552, !553, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !548, file: !533, baseType: !145, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !548, file: !533, baseType: !145, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !548, file: !533, baseType: !145, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !548, file: !533, baseType: !93, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !548, file: !533, baseType: !93, size: 32, offset: 224)
!555 = !{!556, !557, !558, !559, !560, !561}
!556 = !DILocalVariable(name: "status", arg: 1, scope: !540, file: !533, line: 298, type: !93)
!557 = !DILocalVariable(name: "errnum", arg: 2, scope: !540, file: !533, line: 298, type: !93)
!558 = !DILocalVariable(name: "file_name", arg: 3, scope: !540, file: !533, line: 298, type: !150)
!559 = !DILocalVariable(name: "line_number", arg: 4, scope: !540, file: !533, line: 298, type: !99)
!560 = !DILocalVariable(name: "message", arg: 5, scope: !540, file: !533, line: 298, type: !150)
!561 = !DILocalVariable(name: "args", arg: 6, scope: !540, file: !533, line: 298, type: !543)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "old_line_number", scope: !540, file: !533, line: 305, type: !99, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !533, line: 338, type: !19, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !533, line: 346, type: !330, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !533, line: 346, type: !173, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "error_message_count", scope: !532, file: !533, line: 69, type: !99, isLocal: false, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !532, file: !533, line: 295, type: !93, isLocal: false, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !533, line: 208, type: !325, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !533, line: 208, type: !84, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !533, line: 214, type: !297, isLocal: true, isDefinition: true)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null}
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "program_name", scope: !585, file: !586, line: 31, type: !150, isLocal: false, isDefinition: true)
!585 = distinct !DICompileUnit(language: DW_LANG_C11, file: !586, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !587, globals: !588, splitDebugInlining: false, nameTableKind: None)
!586 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!587 = !{!145, !144}
!588 = !{!583, !589, !591}
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !586, line: 46, type: !330, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !586, line: 49, type: !19, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "utf07FF", scope: !595, file: !596, line: 46, type: !623, isLocal: true, isDefinition: true)
!595 = distinct !DISubprogram(name: "proper_name_lite", scope: !596, file: !596, line: 38, type: !597, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !599, retainedNodes: !601)
!596 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!597 = !DISubroutineType(types: !598)
!598 = !{!150, !150, !150}
!599 = distinct !DICompileUnit(language: DW_LANG_C11, file: !596, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !600, splitDebugInlining: false, nameTableKind: None)
!600 = !{!593}
!601 = !{!602, !603, !604, !605, !610}
!602 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !595, file: !596, line: 38, type: !150)
!603 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !595, file: !596, line: 38, type: !150)
!604 = !DILocalVariable(name: "translation", scope: !595, file: !596, line: 40, type: !150)
!605 = !DILocalVariable(name: "w", scope: !595, file: !596, line: 47, type: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !607, line: 37, baseType: !608)
!607 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !265, line: 57, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !265, line: 42, baseType: !99)
!610 = !DILocalVariable(name: "mbs", scope: !595, file: !596, line: 48, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !612, line: 6, baseType: !613)
!612 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !614, line: 21, baseType: !615)
!614 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 13, size: 64, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !615, file: !614, line: 15, baseType: !93, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !615, file: !614, line: 20, baseType: !619, size: 32, offset: 32)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !615, file: !614, line: 16, size: 32, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !619, file: !614, line: 18, baseType: !99, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !619, file: !614, line: 19, baseType: !19, size: 32)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 16, elements: !174)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !626, line: 78, type: !330, isLocal: true, isDefinition: true)
!626 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !626, line: 79, type: !306, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !626, line: 80, type: !403, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !626, line: 81, type: !403, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !626, line: 82, type: !286, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !626, line: 83, type: !173, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !626, line: 84, type: !330, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !626, line: 85, type: !325, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !626, line: 86, type: !325, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !626, line: 87, type: !330, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !647, file: !626, line: 76, type: !721, isLocal: false, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !626, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !648, retainedTypes: !656, globals: !657, splitDebugInlining: false, nameTableKind: None)
!648 = !{!649, !651, !119}
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !650, line: 42, baseType: !99, size: 32, elements: !107)
!650 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !650, line: 254, baseType: !99, size: 32, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!654 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!655 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!656 = !{!145, !93, !146, !147}
!657 = !{!624, !627, !629, !631, !633, !635, !637, !639, !641, !643, !645, !658, !662, !672, !674, !679, !681, !683, !685, !687, !710, !717, !719}
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !647, file: !626, line: 92, type: !660, isLocal: false, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 320, elements: !75)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !647, file: !626, line: 1040, type: !664, isLocal: false, isDefinition: true)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !626, line: 56, size: 448, elements: !665)
!665 = !{!666, !667, !668, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !664, file: !626, line: 59, baseType: !649, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !664, file: !626, line: 62, baseType: !93, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !664, file: !626, line: 66, baseType: !669, size: 256, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !331)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !664, file: !626, line: 69, baseType: !150, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !664, file: !626, line: 72, baseType: !150, size: 64, offset: 384)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !647, file: !626, line: 107, type: !664, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "slot0", scope: !647, file: !626, line: 831, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 256)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !626, line: 321, type: !173, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !626, line: 357, type: !173, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !626, line: 358, type: !173, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !626, line: 199, type: !325, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "quote", scope: !689, file: !626, line: 228, type: !708, isLocal: true, isDefinition: true)
!689 = distinct !DISubprogram(name: "gettext_quote", scope: !626, file: !626, line: 197, type: !690, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !647, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!150, !150, !649}
!692 = !{!693, !694, !695, !696, !697}
!693 = !DILocalVariable(name: "msgid", arg: 1, scope: !689, file: !626, line: 197, type: !150)
!694 = !DILocalVariable(name: "s", arg: 2, scope: !689, file: !626, line: 197, type: !649)
!695 = !DILocalVariable(name: "translation", scope: !689, file: !626, line: 199, type: !150)
!696 = !DILocalVariable(name: "w", scope: !689, file: !626, line: 229, type: !606)
!697 = !DILocalVariable(name: "mbs", scope: !689, file: !626, line: 230, type: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !612, line: 6, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !614, line: 21, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 13, size: 64, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !700, file: !614, line: 15, baseType: !93, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !700, file: !614, line: 20, baseType: !704, size: 32, offset: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !614, line: 16, size: 32, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !704, file: !614, line: 18, baseType: !99, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !704, file: !614, line: 19, baseType: !19, size: 32)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !709)
!709 = !{!175, !21}
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "slotvec", scope: !647, file: !626, line: 834, type: !712, isLocal: true, isDefinition: true)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !626, line: 823, size: 128, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !626, line: 825, baseType: !147, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !713, file: !626, line: 826, baseType: !144, size: 64, offset: 64)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "nslots", scope: !647, file: !626, line: 832, type: !93, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "slotvec0", scope: !647, file: !626, line: 833, type: !713, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 704, elements: !411)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !725, line: 67, type: !398, isLocal: true, isDefinition: true)
!725 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !725, line: 69, type: !325, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !325, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !19, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !725, line: 85, type: !173, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 171)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 34)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !725, line: 105, type: !375, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !725, line: 109, type: !190, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !725, line: 113, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 28)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !725, line: 120, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 32)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !725, line: 127, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 36)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !725, line: 134, type: !352, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !725, line: 142, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 44)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !725, line: 150, type: !772, isLocal: true, isDefinition: true)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 48)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !725, line: 159, type: !777, isLocal: true, isDefinition: true)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 52)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !725, line: 170, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 60)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !286, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !380, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !286, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !164, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !352, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !3, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !799, isLocal: true, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 29)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !804, file: !805, line: 26, type: !807, isLocal: false, isDefinition: true)
!804 = distinct !DICompileUnit(language: DW_LANG_C11, file: !805, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !806, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!806 = !{!802}
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 376, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 47)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "exit_failure", scope: !812, file: !813, line: 24, type: !815, isLocal: false, isDefinition: true)
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !814, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!814 = !{!810}
!815 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !93)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !818, line: 34, type: !185, isLocal: true, isDefinition: true)
!818 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !818, line: 34, type: !325, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !818, line: 34, type: !347, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !825, line: 80, type: !325, isLocal: true, isDefinition: true)
!825 = !DIFile(filename: "lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !828, line: 108, type: !69, isLocal: true, isDefinition: true)
!828 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "internal_state", scope: !831, file: !828, line: 97, type: !834, isLocal: true, isDefinition: true)
!831 = distinct !DICompileUnit(language: DW_LANG_C11, file: !828, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !832, globals: !833, splitDebugInlining: false, nameTableKind: None)
!832 = !{!145, !147, !152}
!833 = !{!826, !829}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !612, line: 6, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !614, line: 21, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 13, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !836, file: !614, line: 15, baseType: !93, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !836, file: !614, line: 20, baseType: !840, size: 32, offset: 32)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !614, line: 16, size: 32, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !840, file: !614, line: 18, baseType: !99, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !840, file: !614, line: 19, baseType: !19, size: 32)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !846, line: 35, type: !173, isLocal: true, isDefinition: true)
!846 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !846, line: 35, type: !306, isLocal: true, isDefinition: true)
!849 = distinct !DICompileUnit(language: DW_LANG_C11, file: !850, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !851, splitDebugInlining: false, nameTableKind: None)
!850 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!851 = !{!852}
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !853, line: 44, baseType: !99, size: 32, elements: !136)
!853 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!854 = distinct !DICompileUnit(language: DW_LANG_C11, file: !855, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!855 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!856 = distinct !DICompileUnit(language: DW_LANG_C11, file: !857, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !858, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!858 = !{!145}
!859 = distinct !DICompileUnit(language: DW_LANG_C11, file: !860, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!861 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !858, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!863 = distinct !DICompileUnit(language: DW_LANG_C11, file: !864, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!865 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !866, retainedTypes: !858, globals: !870, splitDebugInlining: false, nameTableKind: None)
!866 = !{!867}
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 40, baseType: !99, size: 32, elements: !868)
!868 = !{!869}
!869 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!870 = !{!723, !726, !728, !730, !732, !734, !739, !744, !746, !748, !753, !758, !763, !765, !770, !775, !780, !785, !787, !789, !791, !793, !795, !797}
!871 = distinct !DICompileUnit(language: DW_LANG_C11, file: !872, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !873, retainedTypes: !905, splitDebugInlining: false, nameTableKind: None)
!872 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!873 = !{!874, !886}
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !875, file: !872, line: 188, baseType: !99, size: 32, elements: !884)
!875 = distinct !DISubprogram(name: "x2nrealloc", scope: !872, file: !872, line: 176, type: !876, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !871, retainedNodes: !879)
!876 = !DISubroutineType(types: !877)
!877 = !{!145, !145, !878, !147}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!879 = !{!880, !881, !882, !883}
!880 = !DILocalVariable(name: "p", arg: 1, scope: !875, file: !872, line: 176, type: !145)
!881 = !DILocalVariable(name: "pn", arg: 2, scope: !875, file: !872, line: 176, type: !878)
!882 = !DILocalVariable(name: "s", arg: 3, scope: !875, file: !872, line: 176, type: !147)
!883 = !DILocalVariable(name: "n", scope: !875, file: !872, line: 178, type: !147)
!884 = !{!885}
!885 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !887, file: !872, line: 228, baseType: !99, size: 32, elements: !884)
!887 = distinct !DISubprogram(name: "xpalloc", scope: !872, file: !872, line: 223, type: !888, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !871, retainedNodes: !895)
!888 = !DISubroutineType(types: !889)
!889 = !{!145, !145, !890, !891, !893, !891}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !892, line: 130, baseType: !893)
!892 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !894, line: 18, baseType: !155)
!894 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904}
!896 = !DILocalVariable(name: "pa", arg: 1, scope: !887, file: !872, line: 223, type: !145)
!897 = !DILocalVariable(name: "pn", arg: 2, scope: !887, file: !872, line: 223, type: !890)
!898 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !887, file: !872, line: 223, type: !891)
!899 = !DILocalVariable(name: "n_max", arg: 4, scope: !887, file: !872, line: 223, type: !893)
!900 = !DILocalVariable(name: "s", arg: 5, scope: !887, file: !872, line: 223, type: !891)
!901 = !DILocalVariable(name: "n0", scope: !887, file: !872, line: 230, type: !891)
!902 = !DILocalVariable(name: "n", scope: !887, file: !872, line: 237, type: !891)
!903 = !DILocalVariable(name: "nbytes", scope: !887, file: !872, line: 248, type: !891)
!904 = !DILocalVariable(name: "adjusted_nbytes", scope: !887, file: !872, line: 252, type: !891)
!905 = !{!144, !145}
!906 = distinct !DICompileUnit(language: DW_LANG_C11, file: !818, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !907, splitDebugInlining: false, nameTableKind: None)
!907 = !{!816, !819, !821}
!908 = distinct !DICompileUnit(language: DW_LANG_C11, file: !909, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xdectoumax.o -MD -MP -MF lib/.deps/libcoreutils_a-xdectoumax.Tpo -c lib/xdectoumax.c -o lib/.libcoreutils_a-xdectoumax.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !910, globals: !921, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!910 = !{!911, !919}
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !912, line: 30, baseType: !99, size: 32, elements: !913)
!912 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!915 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!916 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!917 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!918 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 24, baseType: !99, size: 32, elements: !100)
!920 = !DIFile(filename: "lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!921 = !{!823}
!922 = distinct !DICompileUnit(language: DW_LANG_C11, file: !923, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xstrtoumax.o -MD -MP -MF lib/.deps/libcoreutils_a-xstrtoumax.Tpo -c lib/xstrtoumax.c -o lib/.libcoreutils_a-xstrtoumax.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !924, retainedTypes: !927, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!924 = !{!925, !119}
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !926, line: 30, baseType: !99, size: 32, elements: !913)
!926 = !DIFile(filename: "lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!927 = !{!93, !146, !144, !928}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !929, line: 102, baseType: !930)
!929 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !265, line: 73, baseType: !149)
!931 = distinct !DICompileUnit(language: DW_LANG_C11, file: !932, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fopen.o -MD -MP -MF lib/.deps/libcoreutils_a-fopen.Tpo -c lib/fopen.c -o lib/.libcoreutils_a-fopen.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !858, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!933 = distinct !DICompileUnit(language: DW_LANG_C11, file: !934, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!934 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!935 = distinct !DICompileUnit(language: DW_LANG_C11, file: !936, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !858, splitDebugInlining: false, nameTableKind: None)
!936 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!937 = distinct !DICompileUnit(language: DW_LANG_C11, file: !846, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !938, splitDebugInlining: false, nameTableKind: None)
!938 = !{!844, !847}
!939 = distinct !DICompileUnit(language: DW_LANG_C11, file: !940, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!940 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!941 = distinct !DICompileUnit(language: DW_LANG_C11, file: !942, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !858, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!943 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!944 = !{i32 7, !"Dwarf Version", i32 5}
!945 = !{i32 2, !"Debug Info Version", i32 3}
!946 = !{i32 1, !"wchar_size", i32 4}
!947 = !{i32 8, !"PIC Level", i32 2}
!948 = !{i32 7, !"PIE Level", i32 2}
!949 = !{i32 7, !"uwtable", i32 2}
!950 = !{i32 7, !"frame-pointer", i32 1}
!951 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!952 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 262, type: !953, scopeLine: 263, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{null, !93}
!955 = !{!956}
!956 = !DILocalVariable(name: "status", arg: 1, scope: !952, file: !2, line: 262, type: !93)
!957 = !DILocation(line: 0, scope: !952)
!958 = !DILocation(line: 264, column: 14, scope: !959)
!959 = distinct !DILexicalBlock(scope: !952, file: !2, line: 264, column: 7)
!960 = !DILocation(line: 264, column: 7, scope: !952)
!961 = !DILocation(line: 265, column: 5, scope: !962)
!962 = distinct !DILexicalBlock(scope: !959, file: !2, line: 265, column: 5)
!963 = !{!964, !964, i64 0}
!964 = !{!"any pointer", !965, i64 0}
!965 = !{!"omnipotent char", !966, i64 0}
!966 = !{!"Simple C/C++ TBAA"}
!967 = !DILocation(line: 268, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !959, file: !2, line: 267, column: 5)
!969 = !DILocation(line: 269, column: 7, scope: !968)
!970 = !DILocation(line: 729, column: 3, scope: !971, inlinedAt: !972)
!971 = distinct !DISubprogram(name: "emit_stdin_note", scope: !92, file: !92, line: 727, type: !581, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89)
!972 = distinct !DILocation(line: 274, column: 7, scope: !968)
!973 = !DILocation(line: 736, column: 3, scope: !974, inlinedAt: !975)
!974 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !92, file: !92, line: 734, type: !581, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89)
!975 = distinct !DILocation(line: 275, column: 7, scope: !968)
!976 = !DILocation(line: 277, column: 7, scope: !968)
!977 = !DILocation(line: 281, column: 7, scope: !968)
!978 = !DILocation(line: 286, column: 7, scope: !968)
!979 = !DILocation(line: 290, column: 7, scope: !968)
!980 = !DILocation(line: 294, column: 7, scope: !968)
!981 = !DILocation(line: 298, column: 7, scope: !968)
!982 = !DILocation(line: 304, column: 7, scope: !968)
!983 = !DILocation(line: 308, column: 7, scope: !968)
!984 = !DILocation(line: 309, column: 7, scope: !968)
!985 = !DILocalVariable(name: "program", arg: 1, scope: !986, file: !92, line: 836, type: !150)
!986 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !92, file: !92, line: 836, type: !987, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !989)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !150}
!989 = !{!985, !990, !997, !998, !1000, !1001}
!990 = !DILocalVariable(name: "infomap", scope: !986, file: !92, line: 838, type: !991)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 896, elements: !326)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !986, file: !92, line: 838, size: 128, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !993, file: !92, line: 838, baseType: !150, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !993, file: !92, line: 838, baseType: !150, size: 64, offset: 64)
!997 = !DILocalVariable(name: "node", scope: !986, file: !92, line: 848, type: !150)
!998 = !DILocalVariable(name: "map_prog", scope: !986, file: !92, line: 849, type: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!1000 = !DILocalVariable(name: "lc_messages", scope: !986, file: !92, line: 861, type: !150)
!1001 = !DILocalVariable(name: "url_program", scope: !986, file: !92, line: 874, type: !150)
!1002 = !DILocation(line: 0, scope: !986, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 310, column: 7, scope: !968)
!1004 = !{}
!1005 = !DILocation(line: 857, column: 3, scope: !986, inlinedAt: !1003)
!1006 = !DILocation(line: 861, column: 29, scope: !986, inlinedAt: !1003)
!1007 = !DILocation(line: 862, column: 7, scope: !1008, inlinedAt: !1003)
!1008 = distinct !DILexicalBlock(scope: !986, file: !92, line: 862, column: 7)
!1009 = !DILocation(line: 862, column: 19, scope: !1008, inlinedAt: !1003)
!1010 = !DILocation(line: 862, column: 22, scope: !1008, inlinedAt: !1003)
!1011 = !DILocation(line: 862, column: 7, scope: !986, inlinedAt: !1003)
!1012 = !DILocation(line: 868, column: 7, scope: !1013, inlinedAt: !1003)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !92, line: 863, column: 5)
!1014 = !DILocation(line: 870, column: 5, scope: !1013, inlinedAt: !1003)
!1015 = !DILocation(line: 875, column: 3, scope: !986, inlinedAt: !1003)
!1016 = !DILocation(line: 877, column: 3, scope: !986, inlinedAt: !1003)
!1017 = !DILocation(line: 312, column: 3, scope: !952)
!1018 = !DISubprogram(name: "dcgettext", scope: !1019, file: !1019, line: 51, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1019 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!144, !150, !150, !93}
!1022 = !DISubprogram(name: "__fprintf_chk", scope: !1023, file: !1023, line: 93, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1023 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!93, !1026, !93, !1027, null}
!1026 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!1027 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!1028 = !DISubprogram(name: "__printf_chk", scope: !1023, file: !1023, line: 95, type: !1029, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!93, !93, !1027, null}
!1031 = !DISubprogram(name: "fputs_unlocked", scope: !544, file: !544, line: 691, type: !1032, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!93, !1027, !1026}
!1034 = !DILocation(line: 0, scope: !216)
!1035 = !DILocation(line: 581, column: 7, scope: !224)
!1036 = !{!1037, !1037, i64 0}
!1037 = !{!"int", !965, i64 0}
!1038 = !DILocation(line: 581, column: 19, scope: !224)
!1039 = !DILocation(line: 581, column: 7, scope: !216)
!1040 = !DILocation(line: 585, column: 26, scope: !223)
!1041 = !DILocation(line: 0, scope: !223)
!1042 = !DILocation(line: 586, column: 23, scope: !223)
!1043 = !DILocation(line: 586, column: 28, scope: !223)
!1044 = !DILocation(line: 586, column: 32, scope: !223)
!1045 = !{!965, !965, i64 0}
!1046 = !DILocation(line: 586, column: 38, scope: !223)
!1047 = !DILocalVariable(name: "__s1", arg: 1, scope: !1048, file: !1049, line: 1359, type: !150)
!1048 = distinct !DISubprogram(name: "streq", scope: !1049, file: !1049, line: 1359, type: !1050, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1052)
!1049 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!195, !150, !150}
!1052 = !{!1047, !1053}
!1053 = !DILocalVariable(name: "__s2", arg: 2, scope: !1048, file: !1049, line: 1359, type: !150)
!1054 = !DILocation(line: 0, scope: !1048, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 586, column: 41, scope: !223)
!1056 = !DILocation(line: 1361, column: 11, scope: !1048, inlinedAt: !1055)
!1057 = !DILocation(line: 1361, column: 10, scope: !1048, inlinedAt: !1055)
!1058 = !DILocation(line: 586, column: 19, scope: !223)
!1059 = !DILocation(line: 587, column: 5, scope: !223)
!1060 = !DILocation(line: 588, column: 7, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !216, file: !92, line: 588, column: 7)
!1062 = !DILocation(line: 588, column: 7, scope: !216)
!1063 = !DILocation(line: 590, column: 7, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1061, file: !92, line: 589, column: 5)
!1065 = !DILocation(line: 591, column: 7, scope: !1064)
!1066 = !DILocation(line: 595, column: 37, scope: !216)
!1067 = !DILocation(line: 595, column: 35, scope: !216)
!1068 = !DILocation(line: 596, column: 29, scope: !216)
!1069 = !DILocation(line: 597, column: 8, scope: !231)
!1070 = !DILocation(line: 597, column: 7, scope: !216)
!1071 = !DILocation(line: 604, column: 24, scope: !230)
!1072 = !DILocation(line: 604, column: 12, scope: !231)
!1073 = !DILocation(line: 0, scope: !229)
