; ModuleID = 'src/head.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.linebuffer = type { [8193 x i8], i64, i64, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.8 }
%union.anon.8 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7

!160 = distinct !DIGlobalVariable(scope: null, file: !2, line: 995, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 30)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1014, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 18)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 14)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 13)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !70, file: !2, line: 55, type: !186, isLocal: true, isDefinition: true)
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "print_headers", scope: !70, file: !2, line: 58, type: !186, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !70, file: !2, line: 70, type: !186, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !82, line: 729, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 56)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !82, line: 736, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 75)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !203, file: !82, line: 575, type: !67, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "oputs_", scope: !82, file: !82, line: 573, type: !204, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !206)
!204 = !DISubroutineType(cc: DW_CC_nocall, types: !205)
!205 = !{null, !131, !131}
!206 = !{!207, !208, !209, !212, !213, !214, !215, !219, !220, !221, !222, !224, !277, !278, !279, !281, !282}
!207 = !DILocalVariable(name: "program", arg: 1, scope: !203, file: !82, line: 573, type: !131)
!208 = !DILocalVariable(name: "option", arg: 2, scope: !203, file: !82, line: 573, type: !131)
!209 = !DILocalVariable(name: "term", scope: !210, file: !82, line: 585, type: !131)
!210 = distinct !DILexicalBlock(scope: !211, file: !82, line: 582, column: 5)
!211 = distinct !DILexicalBlock(scope: !203, file: !82, line: 581, column: 7)
!212 = !DILocalVariable(name: "double_space", scope: !203, file: !82, line: 594, type: !186)
!213 = !DILocalVariable(name: "first_word", scope: !203, file: !82, line: 595, type: !131)
!214 = !DILocalVariable(name: "option_text", scope: !203, file: !82, line: 596, type: !131)
!215 = !DILocalVariable(name: "s", scope: !216, file: !82, line: 608, type: !131)
!216 = distinct !DILexicalBlock(scope: !217, file: !82, line: 605, column: 5)
!217 = distinct !DILexicalBlock(scope: !218, file: !82, line: 604, column: 12)
!218 = distinct !DILexicalBlock(scope: !203, file: !82, line: 597, column: 7)
!219 = !DILocalVariable(name: "spaces", scope: !216, file: !82, line: 609, type: !134)
!220 = !DILocalVariable(name: "anchor_len", scope: !203, file: !82, line: 620, type: !134)
!221 = !DILocalVariable(name: "desc_text", scope: !203, file: !82, line: 625, type: !131)
!222 = !DILocalVariable(name: "__ptr", scope: !223, file: !82, line: 644, type: !131)
!223 = distinct !DILexicalBlock(scope: !203, file: !82, line: 644, column: 3)
!224 = !DILocalVariable(name: "__stream", scope: !223, file: !82, line: 644, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !227, line: 7, baseType: !228)
!227 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !229, line: 49, size: 1728, elements: !230)
!229 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !246, !248, !249, !250, !254, !255, !257, !258, !261, !263, !266, !269, !270, !271, !272, !273}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !228, file: !229, line: 51, baseType: !67, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !228, file: !229, line: 54, baseType: !69, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !228, file: !229, line: 55, baseType: !69, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !228, file: !229, line: 56, baseType: !69, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !228, file: !229, line: 57, baseType: !69, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !228, file: !229, line: 58, baseType: !69, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !228, file: !229, line: 59, baseType: !69, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !228, file: !229, line: 60, baseType: !69, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !228, file: !229, line: 61, baseType: !69, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !228, file: !229, line: 64, baseType: !69, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !228, file: !229, line: 65, baseType: !69, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !228, file: !229, line: 66, baseType: !69, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !228, file: !229, line: 68, baseType: !244, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !229, line: 36, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !228, file: !229, line: 70, baseType: !247, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !228, file: !229, line: 72, baseType: !67, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !228, file: !229, line: 73, baseType: !67, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !228, file: !229, line: 74, baseType: !251, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !252, line: 152, baseType: !253)
!252 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!253 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !228, file: !229, line: 77, baseType: !133, size: 16, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !228, file: !229, line: 78, baseType: !256, size: 8, offset: 1040)
!256 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !228, file: !229, line: 79, baseType: !146, size: 8, offset: 1048)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !228, file: !229, line: 81, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !229, line: 43, baseType: null)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !228, file: !229, line: 89, baseType: !262, size: 64, offset: 1152)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !252, line: 153, baseType: !253)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !228, file: !229, line: 91, baseType: !264, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !229, line: 37, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !228, file: !229, line: 92, baseType: !267, size: 64, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !229, line: 38, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !228, file: !229, line: 93, baseType: !247, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !228, file: !229, line: 94, baseType: !128, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !228, file: !229, line: 95, baseType: !134, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !228, file: !229, line: 96, baseType: !67, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !228, file: !229, line: 98, baseType: !274, size: 160, offset: 1568)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 20)
!277 = !DILocalVariable(name: "__cnt", scope: !223, file: !82, line: 644, type: !134)
!278 = !DILocalVariable(name: "url_program", scope: !203, file: !82, line: 648, type: !131)
!279 = !DILocalVariable(name: "__ptr", scope: !280, file: !82, line: 686, type: !131)
!280 = distinct !DILexicalBlock(scope: !203, file: !82, line: 686, column: 3)
!281 = !DILocalVariable(name: "__stream", scope: !280, file: !82, line: 686, type: !225)
!282 = !DILocalVariable(name: "__cnt", scope: !280, file: !82, line: 686, type: !134)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !82, line: 585, type: !19, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !82, line: 586, type: !19, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !82, line: 595, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 4)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !82, line: 620, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 6)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !141, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !19, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !289, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 3)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !82, line: 650, type: !19, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !294, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !294, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !82, line: 652, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 7)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !82, line: 653, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !82, line: 654, type: !151, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !82, line: 655, type: !151, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !82, line: 656, type: !151, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !82, line: 657, type: !151, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !82, line: 663, type: !316, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !82, line: 664, type: !151, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 17)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 40)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 15)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 61)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !82, line: 679, type: !305, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !82, line: 683, type: !19, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !82, line: 688, type: !19, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !82, line: 691, type: !321, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !82, line: 839, type: !176, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !82, line: 840, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 22)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !82, line: 841, type: !348, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !82, line: 862, type: !289, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !82, line: 868, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 71)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !82, line: 875, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 27)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 51)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 12)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "line_end", scope: !70, file: !2, line: 61, type: !4, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 907, type: !348, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !2, line: 909, type: !156, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 910, type: !156, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !294, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !294, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !274, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !294, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !316, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !321, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !176, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !321, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "long_options", scope: !70, file: !2, line: 86, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 2560, elements: !152)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !426, line: 50, size: 256, elements: !427)
!426 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!427 = !{!428, !429, !430, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !425, file: !426, line: 52, baseType: !131, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !425, file: !426, line: 55, baseType: !67, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !425, file: !426, line: 56, baseType: !431, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !425, file: !426, line: 57, baseType: !67, size: 32, offset: 192)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 875, type: !348, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 883, type: !382, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 891, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 19)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 842, type: !176, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "first_file", scope: !446, file: !2, line: 181, type: !186, isLocal: true, isDefinition: true)
!446 = distinct !DISubprogram(name: "write_header", scope: !2, file: !2, line: 179, type: !447, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !131}
!449 = !{!450}
!450 = !DILocalVariable(name: "filename", arg: 1, scope: !446, file: !2, line: 179, type: !131)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !171, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !141, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !161, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !3, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !338, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !176, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !338, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 29)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !141, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 11)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 520, elements: !40)
!480 = !{!481, !482, !483, !484, !485, !486, !490, !491, !492, !493, !496, !497, !498, !499}
!481 = !DILocalVariable(name: "argc", arg: 1, scope: !64, file: !2, line: 915, type: !67)
!482 = !DILocalVariable(name: "argv", arg: 2, scope: !64, file: !2, line: 915, type: !68)
!483 = !DILocalVariable(name: "header_mode", scope: !64, file: !2, line: 917, type: !72)
!484 = !DILocalVariable(name: "ok", scope: !64, file: !2, line: 918, type: !186)
!485 = !DILocalVariable(name: "c", scope: !64, file: !2, line: 919, type: !67)
!486 = !DILocalVariable(name: "n_units", scope: !64, file: !2, line: 923, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !488, line: 102, baseType: !489)
!488 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !252, line: 73, baseType: !136)
!490 = !DILocalVariable(name: "count_lines", scope: !64, file: !2, line: 927, type: !186)
!491 = !DILocalVariable(name: "elide_from_end", scope: !64, file: !2, line: 931, type: !186)
!492 = !DILocalVariable(name: "file_list", scope: !64, file: !2, line: 936, type: !129)
!493 = !DILocalVariable(name: "a", scope: !494, file: !2, line: 948, type: !69)
!494 = distinct !DILexicalBlock(scope: !495, file: !2, line: 947, column: 5)
!495 = distinct !DILexicalBlock(scope: !64, file: !2, line: 946, column: 7)
!496 = !DILocalVariable(name: "n_string", scope: !494, file: !2, line: 949, type: !69)
!497 = !DILocalVariable(name: "end_n_string", scope: !494, file: !2, line: 950, type: !69)
!498 = !DILocalVariable(name: "multiplier_char", scope: !494, file: !2, line: 951, type: !4)
!499 = !DILocalVariable(name: "i", scope: !500, file: !2, line: 1073, type: !134)
!500 = distinct !DILexicalBlock(scope: !64, file: !2, line: 1073, column: 3)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !142)
!502 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!503 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!504 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!505 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!506 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !509, line: 3, type: !348, isLocal: true, isDefinition: true)
!509 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "Version", scope: !512, file: !509, line: 3, type: !131, isLocal: false, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C11, file: !509, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !513, splitDebugInlining: false, nameTableKind: None)
!513 = !{!507, !510}
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "file_name", scope: !516, file: !517, line: 45, type: !131, isLocal: true, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C11, file: !517, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !518, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!518 = !{!519, !521, !523, !525, !514, !527}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !517, line: 121, type: !316, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !517, line: 121, type: !392, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !517, line: 123, type: !316, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !517, line: 126, type: !305, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !516, file: !517, line: 55, type: !186, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !531, file: !532, line: 66, type: !582, isLocal: false, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C11, file: !532, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !533, globals: !534, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!533 = !{!128, !137}
!534 = !{!535, !537, !561, !563, !565, !567, !529, !569, !571, !573, !575, !580}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !532, line: 272, type: !19, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "old_file_name", scope: !539, file: !532, line: 304, type: !131, isLocal: true, isDefinition: true)
!539 = distinct !DISubprogram(name: "verror_at_line", scope: !532, file: !532, line: 298, type: !540, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !531, retainedNodes: !554)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !67, !67, !131, !73, !131, !542}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !543, line: 52, baseType: !544)
!543 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !545, line: 12, baseType: !546)
!545 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !532, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !548)
!548 = !{!549, !550, !551, !552, !553}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !547, file: !532, baseType: !128, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !547, file: !532, baseType: !128, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !547, file: !532, baseType: !128, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !547, file: !532, baseType: !67, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !547, file: !532, baseType: !67, size: 32, offset: 224)
!554 = !{!555, !556, !557, !558, !559, !560}
!555 = !DILocalVariable(name: "status", arg: 1, scope: !539, file: !532, line: 298, type: !67)
!556 = !DILocalVariable(name: "errnum", arg: 2, scope: !539, file: !532, line: 298, type: !67)
!557 = !DILocalVariable(name: "file_name", arg: 3, scope: !539, file: !532, line: 298, type: !131)
!558 = !DILocalVariable(name: "line_number", arg: 4, scope: !539, file: !532, line: 298, type: !73)
!559 = !DILocalVariable(name: "message", arg: 5, scope: !539, file: !532, line: 298, type: !131)
!560 = !DILocalVariable(name: "args", arg: 6, scope: !539, file: !532, line: 298, type: !542)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "old_line_number", scope: !539, file: !532, line: 305, type: !73, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !532, line: 338, type: !289, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !532, line: 346, type: !321, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !532, line: 346, type: !141, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "error_message_count", scope: !531, file: !532, line: 69, type: !73, isLocal: false, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !531, file: !532, line: 295, type: !67, isLocal: false, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !532, line: 208, type: !316, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !532, line: 208, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 21)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !532, line: 214, type: !19, isLocal: true, isDefinition: true)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "program_name", scope: !587, file: !588, line: 31, type: !131, isLocal: false, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C11, file: !588, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !589, globals: !590, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!589 = !{!128, !69}
!590 = !{!585, !591, !593}
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !588, line: 46, type: !321, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !588, line: 49, type: !289, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "utf07FF", scope: !597, file: !598, line: 46, type: !625, isLocal: true, isDefinition: true)
!597 = distinct !DISubprogram(name: "proper_name_lite", scope: !598, file: !598, line: 38, type: !599, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !601, retainedNodes: !603)
!598 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!599 = !DISubroutineType(types: !600)
!600 = !{!131, !131, !131}
!601 = distinct !DICompileUnit(language: DW_LANG_C11, file: !598, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !602, splitDebugInlining: false, nameTableKind: None)
!602 = !{!595}
!603 = !{!604, !605, !606, !607, !612}
!604 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !597, file: !598, line: 38, type: !131)
!605 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !597, file: !598, line: 38, type: !131)
!606 = !DILocalVariable(name: "translation", scope: !597, file: !598, line: 40, type: !131)
!607 = !DILocalVariable(name: "w", scope: !597, file: !598, line: 47, type: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !609, line: 37, baseType: !610)
!609 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !252, line: 57, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !252, line: 42, baseType: !73)
!612 = !DILocalVariable(name: "mbs", scope: !597, file: !598, line: 48, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !614, line: 6, baseType: !615)
!614 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !616, line: 21, baseType: !617)
!616 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 13, size: 64, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !617, file: !616, line: 15, baseType: !67, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !617, file: !616, line: 20, baseType: !621, size: 32, offset: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !616, line: 16, size: 32, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !621, file: !616, line: 18, baseType: !73, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !621, file: !616, line: 19, baseType: !289, size: 32)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 16, elements: !142)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !628, line: 78, type: !321, isLocal: true, isDefinition: true)
!628 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !628, line: 79, type: !294, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !628, line: 80, type: !181, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !628, line: 81, type: !181, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !628, line: 82, type: !274, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !628, line: 83, type: !141, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !628, line: 84, type: !321, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !628, line: 85, type: !316, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !628, line: 86, type: !316, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !628, line: 87, type: !321, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !649, file: !628, line: 76, type: !723, isLocal: false, isDefinition: true)
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !628, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !650, retainedTypes: !658, globals: !659, splitDebugInlining: false, nameTableKind: None)
!650 = !{!651, !653, !86}
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !652, line: 42, baseType: !73, size: 32, elements: !110)
!652 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !652, line: 254, baseType: !73, size: 32, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!656 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!657 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!658 = !{!128, !67, !133, !134}
!659 = !{!626, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647, !660, !664, !674, !676, !681, !683, !685, !687, !689, !712, !719, !721}
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !649, file: !628, line: 92, type: !662, isLocal: false, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 320, elements: !152)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !649, file: !628, line: 1040, type: !666, isLocal: false, isDefinition: true)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !628, line: 56, size: 448, elements: !667)
!667 = !{!668, !669, !670, !672, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !666, file: !628, line: 59, baseType: !651, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !666, file: !628, line: 62, baseType: !67, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !666, file: !628, line: 66, baseType: !671, size: 256, offset: 64)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 256, elements: !322)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !666, file: !628, line: 69, baseType: !131, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !666, file: !628, line: 72, baseType: !131, size: 64, offset: 384)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !649, file: !628, line: 107, type: !666, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "slot0", scope: !649, file: !628, line: 831, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 256)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !628, line: 321, type: !141, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !628, line: 357, type: !141, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !628, line: 358, type: !141, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !628, line: 199, type: !316, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "quote", scope: !691, file: !628, line: 228, type: !710, isLocal: true, isDefinition: true)
!691 = distinct !DISubprogram(name: "gettext_quote", scope: !628, file: !628, line: 197, type: !692, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{!131, !131, !651}
!694 = !{!695, !696, !697, !698, !699}
!695 = !DILocalVariable(name: "msgid", arg: 1, scope: !691, file: !628, line: 197, type: !131)
!696 = !DILocalVariable(name: "s", arg: 2, scope: !691, file: !628, line: 197, type: !651)
!697 = !DILocalVariable(name: "translation", scope: !691, file: !628, line: 199, type: !131)
!698 = !DILocalVariable(name: "w", scope: !691, file: !628, line: 229, type: !608)
!699 = !DILocalVariable(name: "mbs", scope: !691, file: !628, line: 230, type: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !614, line: 6, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !616, line: 21, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 13, size: 64, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !702, file: !616, line: 15, baseType: !67, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !702, file: !616, line: 20, baseType: !706, size: 32, offset: 32)
!706 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !702, file: !616, line: 16, size: 32, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !706, file: !616, line: 18, baseType: !73, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !706, file: !616, line: 19, baseType: !289, size: 32)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !711)
!711 = !{!143, !291}
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "slotvec", scope: !649, file: !628, line: 834, type: !714, isLocal: true, isDefinition: true)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !628, line: 823, size: 128, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !715, file: !628, line: 825, baseType: !134, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !715, file: !628, line: 826, baseType: !69, size: 64, offset: 64)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "nslots", scope: !649, file: !628, line: 832, type: !67, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "slotvec0", scope: !649, file: !628, line: 833, type: !715, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 704, elements: !475)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !726, line: 67, type: !392, isLocal: true, isDefinition: true)
!726 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !726, line: 69, type: !316, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !726, line: 83, type: !316, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !726, line: 83, type: !289, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !726, line: 85, type: !141, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !726, line: 88, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 171)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !726, line: 88, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 34)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !726, line: 105, type: !176, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !726, line: 109, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 23)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !726, line: 113, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 28)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !726, line: 120, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 32)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !726, line: 127, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 36)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !726, line: 134, type: !343, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !726, line: 142, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 44)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !726, line: 150, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 48)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !726, line: 159, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 52)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !726, line: 170, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 60)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !726, line: 248, type: !274, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !726, line: 248, type: !368, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !726, line: 254, type: !274, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !726, line: 254, type: !171, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !726, line: 254, type: !343, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !726, line: 259, type: !3, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !726, line: 259, type: !467, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !805, file: !806, line: 26, type: !808, isLocal: false, isDefinition: true)
!805 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !807, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!807 = !{!803}
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 376, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 47)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "exit_failure", scope: !813, file: !814, line: 24, type: !816, isLocal: false, isDefinition: true)
!813 = distinct !DICompileUnit(language: DW_LANG_C11, file: !814, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !815, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!815 = !{!811}
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !819, line: 34, type: !305, isLocal: true, isDefinition: true)
!819 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !819, line: 34, type: !316, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !819, line: 34, type: !338, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !826, line: 80, type: !316, isLocal: true, isDefinition: true)
!826 = !DIFile(filename: "lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !829, line: 108, type: !146, isLocal: true, isDefinition: true)
!829 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "internal_state", scope: !832, file: !829, line: 97, type: !835, isLocal: true, isDefinition: true)
!832 = distinct !DICompileUnit(language: DW_LANG_C11, file: !829, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !833, globals: !834, splitDebugInlining: false, nameTableKind: None)
!833 = !{!128, !134, !137}
!834 = !{!827, !830}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !614, line: 6, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !616, line: 21, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 13, size: 64, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !837, file: !616, line: 15, baseType: !67, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !837, file: !616, line: 20, baseType: !841, size: 32, offset: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !837, file: !616, line: 16, size: 32, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !841, file: !616, line: 18, baseType: !73, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !841, file: !616, line: 19, baseType: !289, size: 32)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !847, line: 35, type: !141, isLocal: true, isDefinition: true)
!847 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !847, line: 35, type: !294, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !852, line: 202, type: !316, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !855, file: !852, line: 211, type: !1040, isLocal: true, isDefinition: true)
!855 = distinct !DISubprogram(name: "printf_fetchargs", scope: !852, file: !852, line: 42, type: !856, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1031, retainedNodes: !1035)
!856 = !DISubroutineType(types: !857)
!857 = !{!67, !858, !868}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !859, line: 12, baseType: !860)
!859 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "7bd78a282b99fcfe41a9e3c566d14f7d")
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !852, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !862)
!862 = !{!863, !864, !865, !866, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !861, file: !852, baseType: !128, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !861, file: !852, baseType: !128, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !861, file: !852, baseType: !128, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !861, file: !852, baseType: !67, size: 32, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !861, file: !852, baseType: !67, size: 32, offset: 224)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !870, line: 185, baseType: !871)
!870 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 179, size: 1920, elements: !872)
!872 = !{!873, !874, !1029}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !871, file: !870, line: 181, baseType: !134, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !871, file: !870, line: 182, baseType: !875, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !870, line: 174, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 111, size: 256, elements: !878)
!878 = !{!879, !930}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !877, file: !870, line: 113, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !870, line: 108, baseType: !881)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !870, line: 47, baseType: !73, size: 32, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!883 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!884 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!885 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!886 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!887 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!888 = !DIEnumerator(name: "TYPE_INT", value: 5)
!889 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!890 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!891 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!892 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!893 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!894 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!895 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!896 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!897 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!898 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!899 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!900 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!901 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!902 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!903 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!904 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!905 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!906 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!907 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!908 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!909 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!910 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!911 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!912 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!913 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!914 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!915 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!916 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!917 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!918 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!919 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!920 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!921 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!922 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!923 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!924 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!925 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!926 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!927 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!928 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!929 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !877, file: !870, line: 172, baseType: !931, size: 128, offset: 128)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !877, file: !870, line: 114, size: 128, elements: !932)
!932 = !{!933, !934, !935, !937, !938, !939, !940, !941, !942, !944, !946, !950, !954, !957, !960, !963, !965, !968, !971, !973, !975, !977, !979, !981, !983, !985, !987, !989, !991, !993, !994, !997, !998, !1003, !1004, !1006, !1008, !1009, !1011, !1013, !1015, !1017, !1019, !1021, !1023, !1025, !1027}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !931, file: !870, line: 116, baseType: !256, size: 8)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !931, file: !870, line: 117, baseType: !137, size: 8)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !931, file: !870, line: 118, baseType: !936, size: 16)
!936 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !931, file: !870, line: 119, baseType: !133, size: 16)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !931, file: !870, line: 120, baseType: !67, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !931, file: !870, line: 121, baseType: !73, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !931, file: !870, line: 122, baseType: !253, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !931, file: !870, line: 123, baseType: !136, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !931, file: !870, line: 124, baseType: !943, size: 64)
!943 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !931, file: !870, line: 125, baseType: !945, size: 64)
!945 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !931, file: !870, line: 126, baseType: !947, size: 8)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !948, line: 24, baseType: !949)
!948 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !252, line: 37, baseType: !256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !931, file: !870, line: 127, baseType: !951, size: 8)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !952, line: 24, baseType: !953)
!952 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !252, line: 38, baseType: !137)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !931, file: !870, line: 128, baseType: !955, size: 16)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !948, line: 25, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !252, line: 39, baseType: !936)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !931, file: !870, line: 129, baseType: !958, size: 16)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !952, line: 25, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !252, line: 40, baseType: !133)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !931, file: !870, line: 130, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !948, line: 26, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !252, line: 41, baseType: !67)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !931, file: !870, line: 131, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !952, line: 26, baseType: !611)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !931, file: !870, line: 132, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !948, line: 27, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !252, line: 44, baseType: !253)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !931, file: !870, line: 133, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !952, line: 27, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !252, line: 45, baseType: !136)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !931, file: !870, line: 134, baseType: !972, size: 8)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !488, line: 58, baseType: !256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !931, file: !870, line: 135, baseType: !974, size: 8)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !488, line: 71, baseType: !137)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !931, file: !870, line: 136, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !488, line: 60, baseType: !253)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !931, file: !870, line: 137, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !488, line: 73, baseType: !136)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !931, file: !870, line: 138, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !488, line: 61, baseType: !253)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !931, file: !870, line: 139, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !488, line: 74, baseType: !136)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !931, file: !870, line: 140, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !488, line: 62, baseType: !253)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !931, file: !870, line: 141, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !488, line: 75, baseType: !136)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !931, file: !870, line: 142, baseType: !988, size: 32)
!988 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !931, file: !870, line: 143, baseType: !990, size: 64)
!990 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !931, file: !870, line: 144, baseType: !992, size: 128)
!992 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !931, file: !870, line: 145, baseType: !67, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !931, file: !870, line: 147, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !996, line: 20, baseType: !73)
!996 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!997 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !931, file: !870, line: 149, baseType: !131, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !931, file: !870, line: 150, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1002, line: 24, baseType: !73)
!1002 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1bf0c51e90dd5eb05cdcc01afdea587a")
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !931, file: !870, line: 151, baseType: !128, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !931, file: !870, line: 152, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !931, file: !870, line: 153, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !931, file: !870, line: 154, baseType: !431, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !931, file: !870, line: 155, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !931, file: !870, line: 156, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !931, file: !870, line: 157, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !931, file: !870, line: 158, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !931, file: !870, line: 159, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !931, file: !870, line: 160, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !931, file: !870, line: 161, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !931, file: !870, line: 162, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !931, file: !870, line: 163, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !931, file: !870, line: 164, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !871, file: !870, line: 183, baseType: !1030, size: 1792, offset: 128)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 1792, elements: !317)
!1031 = distinct !DICompileUnit(language: DW_LANG_C11, file: !852, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-printf-args.o -MD -MP -MF lib/.deps/libcoreutils_a-printf-args.Tpo -c lib/printf-args.c -o lib/.libcoreutils_a-printf-args.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1032, retainedTypes: !1033, globals: !1034, splitDebugInlining: false, nameTableKind: None)
!1032 = !{!881}
!1033 = !{!128, !1001}
!1034 = !{!850, !853}
!1035 = !{!1036, !1037, !1038, !1039}
!1036 = !DILocalVariable(name: "args", arg: 1, scope: !855, file: !852, line: 42, type: !858)
!1037 = !DILocalVariable(name: "a", arg: 2, scope: !855, file: !852, line: 42, type: !868)
!1038 = !DILocalVariable(name: "i", scope: !855, file: !852, line: 44, type: !134)
!1039 = !DILocalVariable(name: "ap", scope: !855, file: !852, line: 45, type: !875)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 224, elements: !317)
!1041 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1042, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1042 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1043 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1044, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-full-read.o -MD -MP -MF lib/.deps/libcoreutils_a-full-read.Tpo -c lib/full-read.c -o lib/.libcoreutils_a-full-read.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1045, splitDebugInlining: false, nameTableKind: None)
!1044 = !DIFile(filename: "lib/full-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "717d8293e026c44a771a83b22da54cc2")
!1045 = !{!69}
!1046 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1047, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1047 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1048 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1049, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-safe-read.o -MD -MP -MF lib/.deps/libcoreutils_a-safe-read.Tpo -c lib/safe-read.c -o lib/.libcoreutils_a-safe-read.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1050, retainedTypes: !1055, splitDebugInlining: false, nameTableKind: None)
!1049 = !DIFile(filename: "lib/safe-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "434e548fbeff241cc07e1dbcc7b4611f")
!1050 = !{!1051}
!1051 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1052, line: 36, baseType: !73, size: 32, elements: !1053)
!1052 = !DIFile(filename: "lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!1053 = !{!1054}
!1054 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!1055 = !{!134}
!1056 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1057, retainedTypes: !1061, globals: !1062, splitDebugInlining: false, nameTableKind: None)
!1057 = !{!1058}
!1058 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !726, line: 40, baseType: !73, size: 32, elements: !1059)
!1059 = !{!1060}
!1060 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1061 = !{!128}
!1062 = !{!724, !727, !729, !731, !733, !735, !740, !745, !747, !752, !757, !762, !767, !769, !774, !779, !784, !789, !791, !793, !795, !797, !799, !801}
!1063 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1064, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1065, retainedTypes: !1097, splitDebugInlining: false, nameTableKind: None)
!1064 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1065 = !{!1066, !1078}
!1066 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1067, file: !1064, line: 188, baseType: !73, size: 32, elements: !1076)
!1067 = distinct !DISubprogram(name: "x2nrealloc", scope: !1064, file: !1064, line: 176, type: !1068, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1063, retainedNodes: !1071)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!128, !128, !1070, !134}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!1071 = !{!1072, !1073, !1074, !1075}
!1072 = !DILocalVariable(name: "p", arg: 1, scope: !1067, file: !1064, line: 176, type: !128)
!1073 = !DILocalVariable(name: "pn", arg: 2, scope: !1067, file: !1064, line: 176, type: !1070)
!1074 = !DILocalVariable(name: "s", arg: 3, scope: !1067, file: !1064, line: 176, type: !134)
!1075 = !DILocalVariable(name: "n", scope: !1067, file: !1064, line: 178, type: !134)
!1076 = !{!1077}
!1077 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1078 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1079, file: !1064, line: 228, baseType: !73, size: 32, elements: !1076)
!1079 = distinct !DISubprogram(name: "xpalloc", scope: !1064, file: !1064, line: 223, type: !1080, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1063, retainedNodes: !1087)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!128, !128, !1082, !1083, !1085, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1084, line: 130, baseType: !1085)
!1084 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1086, line: 18, baseType: !253)
!1086 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1088 = !DILocalVariable(name: "pa", arg: 1, scope: !1079, file: !1064, line: 223, type: !128)
!1089 = !DILocalVariable(name: "pn", arg: 2, scope: !1079, file: !1064, line: 223, type: !1082)
!1090 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1079, file: !1064, line: 223, type: !1083)
!1091 = !DILocalVariable(name: "n_max", arg: 4, scope: !1079, file: !1064, line: 223, type: !1085)
!1092 = !DILocalVariable(name: "s", arg: 5, scope: !1079, file: !1064, line: 223, type: !1083)
!1093 = !DILocalVariable(name: "n0", scope: !1079, file: !1064, line: 230, type: !1083)
!1094 = !DILocalVariable(name: "n", scope: !1079, file: !1064, line: 237, type: !1083)
!1095 = !DILocalVariable(name: "nbytes", scope: !1079, file: !1064, line: 248, type: !1083)
!1096 = !DILocalVariable(name: "adjusted_nbytes", scope: !1079, file: !1064, line: 252, type: !1083)
!1097 = !{!69, !128}
!1098 = distinct !DICompileUnit(language: DW_LANG_C11, file: !819, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1099, splitDebugInlining: false, nameTableKind: None)
!1099 = !{!817, !820, !822}
!1100 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1101, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xdectoumax.o -MD -MP -MF lib/.deps/libcoreutils_a-xdectoumax.Tpo -c lib/xdectoumax.c -o lib/.libcoreutils_a-xdectoumax.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1102, globals: !1113, splitDebugInlining: false, nameTableKind: None)
