; ModuleID = 'src/link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s FILE1 FILE2\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [76 x i8] c"Call the link function to create a link named FILE2 to an existing FILE1.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"link\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 15)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !77, line: 676, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 61)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !77, line: 679, type: !148, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !77, line: 683, type: !19, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !77, line: 688, type: !19, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !77, line: 691, type: !164, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !77, line: 839, type: !56, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !77, line: 840, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 22)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !77, line: 841, type: !185, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !77, line: 862, type: !129, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !77, line: 868, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 71)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !77, line: 875, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 27)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 51)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 12)
!232 = !{!233, !234, !235, !238, !240, !241, !242, !246, !247, !248, !249, !251, !305, !306, !307, !309, !310}
!233 = !DILocalVariable(name: "program", arg: 1, scope: !76, file: !77, line: 573, type: !80)
!234 = !DILocalVariable(name: "option", arg: 2, scope: !76, file: !77, line: 573, type: !80)
!235 = !DILocalVariable(name: "term", scope: !236, file: !77, line: 585, type: !80)
!236 = distinct !DILexicalBlock(scope: !237, file: !77, line: 582, column: 5)
!237 = distinct !DILexicalBlock(scope: !76, file: !77, line: 581, column: 7)
!238 = !DILocalVariable(name: "double_space", scope: !76, file: !77, line: 594, type: !239)
!239 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!240 = !DILocalVariable(name: "first_word", scope: !76, file: !77, line: 595, type: !80)
!241 = !DILocalVariable(name: "option_text", scope: !76, file: !77, line: 596, type: !80)
!242 = !DILocalVariable(name: "s", scope: !243, file: !77, line: 608, type: !80)
!243 = distinct !DILexicalBlock(scope: !244, file: !77, line: 605, column: 5)
!244 = distinct !DILexicalBlock(scope: !245, file: !77, line: 604, column: 12)
!245 = distinct !DILexicalBlock(scope: !76, file: !77, line: 597, column: 7)
!246 = !DILocalVariable(name: "spaces", scope: !243, file: !77, line: 609, type: !118)
!247 = !DILocalVariable(name: "anchor_len", scope: !76, file: !77, line: 620, type: !118)
!248 = !DILocalVariable(name: "desc_text", scope: !76, file: !77, line: 625, type: !80)
!249 = !DILocalVariable(name: "__ptr", scope: !250, file: !77, line: 644, type: !80)
!250 = distinct !DILexicalBlock(scope: !76, file: !77, line: 644, column: 3)
!251 = !DILocalVariable(name: "__stream", scope: !250, file: !77, line: 644, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !255)
!254 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !257)
!256 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!257 = !{!258, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !274, !276, !277, !278, !282, !283, !285, !286, !289, !291, !294, !297, !298, !299, !300, !301}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !255, file: !256, line: 51, baseType: !116, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !255, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !255, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !255, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !255, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !255, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !255, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !255, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !255, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !255, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !255, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !255, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !255, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !256, line: 36, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !255, file: !256, line: 70, baseType: !275, size: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !255, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !255, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !255, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !280, line: 152, baseType: !281)
!280 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!281 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !255, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !255, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!284 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !255, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !255, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !256, line: 43, baseType: null)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !255, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !280, line: 153, baseType: !281)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !255, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !256, line: 37, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !255, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !256, line: 38, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !255, file: !256, line: 93, baseType: !275, size: 64, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !255, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !255, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !255, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !255, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 20)
!305 = !DILocalVariable(name: "__cnt", scope: !250, file: !77, line: 644, type: !118)
!306 = !DILocalVariable(name: "url_program", scope: !76, file: !77, line: 648, type: !80)
!307 = !DILocalVariable(name: "__ptr", scope: !308, file: !77, line: 686, type: !80)
!308 = distinct !DILexicalBlock(scope: !76, file: !77, line: 686, column: 3)
!309 = !DILocalVariable(name: "__stream", scope: !308, file: !77, line: 686, type: !252)
!310 = !DILocalVariable(name: "__cnt", scope: !308, file: !77, line: 686, type: !118)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !313, line: 3, type: !185, isLocal: true, isDefinition: true)
!313 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "Version", scope: !316, file: !313, line: 3, type: !80, isLocal: false, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!317 = !{!311, !314}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "file_name", scope: !320, file: !321, line: 45, type: !80, isLocal: true, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C11, file: !321, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !322, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!322 = !{!323, !325, !327, !329, !318, !331}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !159, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !229, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !321, line: 123, type: !159, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !321, line: 126, type: !148, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !320, file: !321, line: 55, type: !239, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !335, file: !336, line: 66, type: !386, isLocal: false, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C11, file: !336, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !337, globals: !338, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!337 = !{!115, !121}
!338 = !{!339, !341, !365, !367, !369, !371, !333, !373, !375, !377, !379, !384}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !336, line: 272, type: !19, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "old_file_name", scope: !343, file: !336, line: 304, type: !80, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "verror_at_line", scope: !336, file: !336, line: 298, type: !344, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !358)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !116, !116, !80, !86, !80, !346}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !347, line: 52, baseType: !348)
!347 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !349, line: 12, baseType: !350)
!349 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !336, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !352)
!352 = !{!353, !354, !355, !356, !357}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !351, file: !336, baseType: !115, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !351, file: !336, baseType: !115, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !351, file: !336, baseType: !115, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !351, file: !336, baseType: !116, size: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !351, file: !336, baseType: !116, size: 32, offset: 224)
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DILocalVariable(name: "status", arg: 1, scope: !343, file: !336, line: 298, type: !116)
!360 = !DILocalVariable(name: "errnum", arg: 2, scope: !343, file: !336, line: 298, type: !116)
!361 = !DILocalVariable(name: "file_name", arg: 3, scope: !343, file: !336, line: 298, type: !80)
!362 = !DILocalVariable(name: "line_number", arg: 4, scope: !343, file: !336, line: 298, type: !86)
!363 = !DILocalVariable(name: "message", arg: 5, scope: !343, file: !336, line: 298, type: !80)
!364 = !DILocalVariable(name: "args", arg: 6, scope: !343, file: !336, line: 298, type: !346)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "old_line_number", scope: !343, file: !336, line: 305, type: !86, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !336, line: 338, type: !129, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !164, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !139, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "error_message_count", scope: !335, file: !336, line: 69, type: !86, isLocal: false, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !335, file: !336, line: 295, type: !116, isLocal: false, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !159, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 21)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !336, line: 214, type: !19, isLocal: true, isDefinition: true)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null}
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !391, line: 60, type: !139, isLocal: true, isDefinition: true)
!391 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "long_options", scope: !394, file: !391, line: 34, type: !403, isLocal: true, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C11, file: !391, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, globals: !396, splitDebugInlining: false, nameTableKind: None)
!395 = !{!115}
!396 = !{!389, !397, !399, !401, !392}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !391, line: 112, type: !34, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !391, line: 36, type: !19, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !391, line: 37, type: !164, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 768, elements: !149)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !406, line: 50, size: 256, elements: !407)
!406 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!407 = !{!408, !409, !410, !412}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !406, line: 52, baseType: !80, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !405, file: !406, line: 55, baseType: !116, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !406, line: 56, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !405, file: !406, line: 57, baseType: !116, size: 32, offset: 192)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "program_name", scope: !415, file: !416, line: 31, type: !80, isLocal: false, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C11, file: !416, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !417, globals: !418, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!417 = !{!115, !260}
!418 = !{!413, !419, !421}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !416, line: 46, type: !164, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !416, line: 49, type: !129, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "utf07FF", scope: !425, file: !426, line: 46, type: !453, isLocal: true, isDefinition: true)
!425 = distinct !DISubprogram(name: "proper_name_lite", scope: !426, file: !426, line: 38, type: !427, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !429, retainedNodes: !431)
!426 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!427 = !DISubroutineType(types: !428)
!428 = !{!80, !80, !80}
!429 = distinct !DICompileUnit(language: DW_LANG_C11, file: !426, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !430, splitDebugInlining: false, nameTableKind: None)
!430 = !{!423}
!431 = !{!432, !433, !434, !435, !440}
!432 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !425, file: !426, line: 38, type: !80)
!433 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !425, file: !426, line: 38, type: !80)
!434 = !DILocalVariable(name: "translation", scope: !425, file: !426, line: 40, type: !80)
!435 = !DILocalVariable(name: "w", scope: !425, file: !426, line: 47, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !437, line: 37, baseType: !438)
!437 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !280, line: 57, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !280, line: 42, baseType: !86)
!440 = !DILocalVariable(name: "mbs", scope: !425, file: !426, line: 48, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !442, line: 6, baseType: !443)
!442 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !444, line: 21, baseType: !445)
!444 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 13, size: 64, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !445, file: !444, line: 15, baseType: !116, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !445, file: !444, line: 20, baseType: !449, size: 32, offset: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !445, file: !444, line: 16, size: 32, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !449, file: !444, line: 18, baseType: !86, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !449, file: !444, line: 19, baseType: !129, size: 32)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !140)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !456, line: 78, type: !164, isLocal: true, isDefinition: true)
!456 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !456, line: 79, type: !134, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !456, line: 80, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 13)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !456, line: 81, type: !461, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !456, line: 82, type: !302, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !456, line: 83, type: !139, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !456, line: 84, type: !164, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !456, line: 85, type: !159, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !456, line: 86, type: !159, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !456, line: 87, type: !164, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !480, file: !456, line: 76, type: !554, isLocal: false, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C11, file: !456, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !481, retainedTypes: !489, globals: !490, splitDebugInlining: false, nameTableKind: None)
!481 = !{!482, !484, !99}
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !483, line: 42, baseType: !86, size: 32, elements: !87)
!483 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !483, line: 254, baseType: !86, size: 32, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!487 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!488 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!489 = !{!115, !116, !117, !118}
!490 = !{!454, !457, !459, !464, !466, !468, !470, !472, !474, !476, !478, !491, !495, !505, !507, !512, !514, !516, !518, !520, !543, !550, !552}
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !480, file: !456, line: 92, type: !493, isLocal: false, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 320, elements: !40)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !480, file: !456, line: 1040, type: !497, isLocal: false, isDefinition: true)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !456, line: 56, size: 448, elements: !498)
!498 = !{!499, !500, !501, !503, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !497, file: !456, line: 59, baseType: !482, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !497, file: !456, line: 62, baseType: !116, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !497, file: !456, line: 66, baseType: !502, size: 256, offset: 64)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 256, elements: !165)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !497, file: !456, line: 69, baseType: !80, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !497, file: !456, line: 72, baseType: !80, size: 64, offset: 384)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !480, file: !456, line: 107, type: !497, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "slot0", scope: !480, file: !456, line: 831, type: !509, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 256)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !456, line: 321, type: !139, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !456, line: 357, type: !139, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !456, line: 358, type: !139, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !456, line: 199, type: !159, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "quote", scope: !522, file: !456, line: 228, type: !541, isLocal: true, isDefinition: true)
!522 = distinct !DISubprogram(name: "gettext_quote", scope: !456, file: !456, line: 197, type: !523, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !480, retainedNodes: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!80, !80, !482}
!525 = !{!526, !527, !528, !529, !530}
!526 = !DILocalVariable(name: "msgid", arg: 1, scope: !522, file: !456, line: 197, type: !80)
!527 = !DILocalVariable(name: "s", arg: 2, scope: !522, file: !456, line: 197, type: !482)
!528 = !DILocalVariable(name: "translation", scope: !522, file: !456, line: 199, type: !80)
!529 = !DILocalVariable(name: "w", scope: !522, file: !456, line: 229, type: !436)
!530 = !DILocalVariable(name: "mbs", scope: !522, file: !456, line: 230, type: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !442, line: 6, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !444, line: 21, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 13, size: 64, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !533, file: !444, line: 15, baseType: !116, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !533, file: !444, line: 20, baseType: !537, size: 32, offset: 32)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !444, line: 16, size: 32, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !537, file: !444, line: 18, baseType: !86, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !537, file: !444, line: 19, baseType: !129, size: 32)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !542)
!542 = !{!141, !131}
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "slotvec", scope: !480, file: !456, line: 834, type: !545, isLocal: true, isDefinition: true)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !456, line: 823, size: 128, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !546, file: !456, line: 825, baseType: !118, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !546, file: !456, line: 826, baseType: !260, size: 64, offset: 64)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "nslots", scope: !480, file: !456, line: 832, type: !116, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "slotvec0", scope: !480, file: !456, line: 833, type: !546, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 704, elements: !556)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!556 = !{!557}
!557 = !DISubrange(count: 11)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !560, line: 67, type: !229, isLocal: true, isDefinition: true)
!560 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !560, line: 69, type: !159, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !560, line: 83, type: !159, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !560, line: 83, type: !129, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !560, line: 85, type: !139, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !560, line: 88, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 171)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !560, line: 88, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 34)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !560, line: 105, type: !56, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !560, line: 109, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 23)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !560, line: 113, type: !71, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !560, line: 120, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 32)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !560, line: 127, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 36)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !560, line: 134, type: !9, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !560, line: 142, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 44)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !560, line: 150, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 48)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !560, line: 159, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 52)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !560, line: 170, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 60)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !560, line: 248, type: !302, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !560, line: 248, type: !205, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !560, line: 254, type: !302, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !560, line: 254, type: !49, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !560, line: 254, type: !9, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !560, line: 259, type: !3, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !560, line: 259, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 29)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !639, file: !640, line: 26, type: !642, isLocal: false, isDefinition: true)
!639 = distinct !DICompileUnit(language: DW_LANG_C11, file: !640, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !641, splitDebugInlining: false, nameTableKind: None)
!640 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!641 = !{!637}
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 376, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 47)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "exit_failure", scope: !647, file: !648, line: 24, type: !650, isLocal: false, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !648, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !649, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!649 = !{!645}
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !653, line: 34, type: !148, isLocal: true, isDefinition: true)
!653 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !653, line: 34, type: !159, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !653, line: 34, type: !66, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !660, line: 108, type: !34, isLocal: true, isDefinition: true)
!660 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "internal_state", scope: !663, file: !660, line: 97, type: !666, isLocal: true, isDefinition: true)
!663 = distinct !DICompileUnit(language: DW_LANG_C11, file: !660, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !664, globals: !665, splitDebugInlining: false, nameTableKind: None)
!664 = !{!115, !118, !121}
!665 = !{!658, !661}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !442, line: 6, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !444, line: 21, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 13, size: 64, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !668, file: !444, line: 15, baseType: !116, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !668, file: !444, line: 20, baseType: !672, size: 32, offset: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !668, file: !444, line: 16, size: 32, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !672, file: !444, line: 18, baseType: !86, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !672, file: !444, line: 19, baseType: !129, size: 32)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !678, line: 35, type: !139, isLocal: true, isDefinition: true)
!678 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !678, line: 35, type: !134, isLocal: true, isDefinition: true)
!681 = distinct !DICompileUnit(language: DW_LANG_C11, file: !682, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!683 = distinct !DICompileUnit(language: DW_LANG_C11, file: !560, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !684, retainedTypes: !395, globals: !688, splitDebugInlining: false, nameTableKind: None)
!684 = !{!685}
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !560, line: 40, baseType: !86, size: 32, elements: !686)
!686 = !{!687}
!687 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!688 = !{!558, !561, !563, !565, !567, !569, !574, !579, !581, !586, !588, !593, !598, !600, !605, !610, !615, !620, !622, !624, !626, !628, !630, !632}
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !691, retainedTypes: !723, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!691 = !{!692, !704}
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !693, file: !690, line: 188, baseType: !86, size: 32, elements: !702)
!693 = distinct !DISubprogram(name: "x2nrealloc", scope: !690, file: !690, line: 176, type: !694, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !697)
!694 = !DISubroutineType(types: !695)
!695 = !{!115, !115, !696, !118}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!697 = !{!698, !699, !700, !701}
!698 = !DILocalVariable(name: "p", arg: 1, scope: !693, file: !690, line: 176, type: !115)
!699 = !DILocalVariable(name: "pn", arg: 2, scope: !693, file: !690, line: 176, type: !696)
!700 = !DILocalVariable(name: "s", arg: 3, scope: !693, file: !690, line: 176, type: !118)
!701 = !DILocalVariable(name: "n", scope: !693, file: !690, line: 178, type: !118)
!702 = !{!703}
!703 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !705, file: !690, line: 228, baseType: !86, size: 32, elements: !702)
!705 = distinct !DISubprogram(name: "xpalloc", scope: !690, file: !690, line: 223, type: !706, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !713)
!706 = !DISubroutineType(types: !707)
!707 = !{!115, !115, !708, !709, !711, !709}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !710, line: 130, baseType: !711)
!710 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !712, line: 18, baseType: !281)
!712 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722}
!714 = !DILocalVariable(name: "pa", arg: 1, scope: !705, file: !690, line: 223, type: !115)
!715 = !DILocalVariable(name: "pn", arg: 2, scope: !705, file: !690, line: 223, type: !708)
!716 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !705, file: !690, line: 223, type: !709)
!717 = !DILocalVariable(name: "n_max", arg: 4, scope: !705, file: !690, line: 223, type: !711)
!718 = !DILocalVariable(name: "s", arg: 5, scope: !705, file: !690, line: 223, type: !709)
!719 = !DILocalVariable(name: "n0", scope: !705, file: !690, line: 230, type: !709)
!720 = !DILocalVariable(name: "n", scope: !705, file: !690, line: 237, type: !709)
!721 = !DILocalVariable(name: "nbytes", scope: !705, file: !690, line: 248, type: !709)
!722 = !DILocalVariable(name: "adjusted_nbytes", scope: !705, file: !690, line: 252, type: !709)
!723 = !{!260, !115}
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !653, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !725, splitDebugInlining: false, nameTableKind: None)
!725 = !{!651, !654, !656}
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!732 = distinct !DICompileUnit(language: DW_LANG_C11, file: !733, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!734 = distinct !DICompileUnit(language: DW_LANG_C11, file: !735, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !678, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !737, splitDebugInlining: false, nameTableKind: None)
!737 = !{!676, !679}
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !739, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !741, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!742 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!743 = !{i32 7, !"Dwarf Version", i32 5}
!744 = !{i32 2, !"Debug Info Version", i32 3}
!745 = !{i32 1, !"wchar_size", i32 4}
!746 = !{i32 8, !"PIC Level", i32 2}
!747 = !{i32 7, !"PIE Level", i32 2}
!748 = !{i32 7, !"uwtable", i32 2}
!749 = !{i32 7, !"frame-pointer", i32 1}
!750 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!751 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !752, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !116}
!754 = !{!755}
!755 = !DILocalVariable(name: "status", arg: 1, scope: !751, file: !2, line: 37, type: !116)
!756 = !DILocation(line: 0, scope: !751)
!757 = !DILocation(line: 39, column: 14, scope: !758)
!758 = distinct !DILexicalBlock(scope: !751, file: !2, line: 39, column: 7)
!759 = !DILocation(line: 39, column: 7, scope: !751)
!760 = !DILocation(line: 40, column: 5, scope: !761)
!761 = distinct !DILexicalBlock(scope: !758, file: !2, line: 40, column: 5)
!762 = !{!763, !763, i64 0}
!763 = !{!"any pointer", !764, i64 0}
!764 = !{!"omnipotent char", !765, i64 0}
!765 = !{!"Simple C/C++ TBAA"}
!766 = !DILocation(line: 43, column: 7, scope: !767)
!767 = distinct !DILexicalBlock(scope: !758, file: !2, line: 42, column: 5)
!768 = !DILocation(line: 46, column: 7, scope: !767)
!769 = !DILocation(line: 49, column: 7, scope: !767)
!770 = !DILocation(line: 50, column: 7, scope: !767)
!771 = !DILocalVariable(name: "program", arg: 1, scope: !772, file: !77, line: 836, type: !80)
!772 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !77, file: !77, line: 836, type: !773, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !80}
!775 = !{!771, !776, !783, !784, !786, !787}
!776 = !DILocalVariable(name: "infomap", scope: !772, file: !77, line: 838, type: !777)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 896, elements: !160)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !772, file: !77, line: 838, size: 128, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !779, file: !77, line: 838, baseType: !80, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !779, file: !77, line: 838, baseType: !80, size: 64, offset: 64)
!783 = !DILocalVariable(name: "node", scope: !772, file: !77, line: 848, type: !80)
!784 = !DILocalVariable(name: "map_prog", scope: !772, file: !77, line: 849, type: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!786 = !DILocalVariable(name: "lc_messages", scope: !772, file: !77, line: 861, type: !80)
!787 = !DILocalVariable(name: "url_program", scope: !772, file: !77, line: 874, type: !80)
!788 = !DILocation(line: 0, scope: !772, inlinedAt: !789)
!789 = distinct !DILocation(line: 51, column: 7, scope: !767)
!790 = !{}
!791 = !DILocation(line: 857, column: 3, scope: !772, inlinedAt: !789)
!792 = !DILocation(line: 861, column: 29, scope: !772, inlinedAt: !789)
!793 = !DILocation(line: 862, column: 7, scope: !794, inlinedAt: !789)
!794 = distinct !DILexicalBlock(scope: !772, file: !77, line: 862, column: 7)
!795 = !DILocation(line: 862, column: 19, scope: !794, inlinedAt: !789)
!796 = !DILocation(line: 862, column: 22, scope: !794, inlinedAt: !789)
!797 = !DILocation(line: 862, column: 7, scope: !772, inlinedAt: !789)
!798 = !DILocation(line: 868, column: 7, scope: !799, inlinedAt: !789)
!799 = distinct !DILexicalBlock(scope: !794, file: !77, line: 863, column: 5)
!800 = !DILocation(line: 870, column: 5, scope: !799, inlinedAt: !789)
!801 = !DILocation(line: 875, column: 3, scope: !772, inlinedAt: !789)
!802 = !DILocation(line: 877, column: 3, scope: !772, inlinedAt: !789)
!803 = !DILocation(line: 53, column: 3, scope: !751)
!804 = !DISubprogram(name: "dcgettext", scope: !805, file: !805, line: 51, type: !806, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!806 = !DISubroutineType(types: !807)
!807 = !{!260, !80, !80, !116}
!808 = !DISubprogram(name: "__fprintf_chk", scope: !809, file: !809, line: 93, type: !810, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!809 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!810 = !DISubroutineType(types: !811)
!811 = !{!116, !812, !116, !813, null}
!812 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !252)
!813 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!814 = !DISubprogram(name: "__printf_chk", scope: !809, file: !809, line: 95, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!116, !116, !813, null}
!817 = !DISubprogram(name: "fputs_unlocked", scope: !347, file: !347, line: 691, type: !818, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!818 = !DISubroutineType(types: !819)
!819 = !{!116, !813, !812}
!820 = !DILocation(line: 0, scope: !76)
!821 = !DILocation(line: 581, column: 7, scope: !237)
!822 = !{!823, !823, i64 0}
!823 = !{!"int", !764, i64 0}
!824 = !DILocation(line: 581, column: 19, scope: !237)
!825 = !DILocation(line: 581, column: 7, scope: !76)
!826 = !DILocation(line: 585, column: 26, scope: !236)
!827 = !DILocation(line: 0, scope: !236)
!828 = !DILocation(line: 586, column: 23, scope: !236)
!829 = !DILocation(line: 586, column: 28, scope: !236)
!830 = !DILocation(line: 586, column: 32, scope: !236)
!831 = !{!764, !764, i64 0}
!832 = !DILocation(line: 586, column: 38, scope: !236)
!833 = !DILocalVariable(name: "__s1", arg: 1, scope: !834, file: !835, line: 1359, type: !80)
!834 = distinct !DISubprogram(name: "streq", scope: !835, file: !835, line: 1359, type: !836, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !838)
!835 = !DIFile(filename: "./lib/string.h", directory: "/src")
!836 = !DISubroutineType(types: !837)
!837 = !{!239, !80, !80}
!838 = !{!833, !839}
!839 = !DILocalVariable(name: "__s2", arg: 2, scope: !834, file: !835, line: 1359, type: !80)
!840 = !DILocation(line: 0, scope: !834, inlinedAt: !841)
!841 = distinct !DILocation(line: 586, column: 41, scope: !236)
!842 = !DILocation(line: 1361, column: 11, scope: !834, inlinedAt: !841)
!843 = !DILocation(line: 1361, column: 10, scope: !834, inlinedAt: !841)
!844 = !DILocation(line: 586, column: 19, scope: !236)
!845 = !DILocation(line: 587, column: 5, scope: !236)
!846 = !DILocation(line: 588, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !76, file: !77, line: 588, column: 7)
!848 = !DILocation(line: 588, column: 7, scope: !76)
!849 = !DILocation(line: 590, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !847, file: !77, line: 589, column: 5)
!851 = !DILocation(line: 591, column: 7, scope: !850)
!852 = !DILocation(line: 595, column: 37, scope: !76)
!853 = !DILocation(line: 595, column: 35, scope: !76)
!854 = !DILocation(line: 596, column: 29, scope: !76)
!855 = !DILocation(line: 597, column: 8, scope: !245)
!856 = !DILocation(line: 597, column: 7, scope: !76)
!857 = !DILocation(line: 604, column: 24, scope: !244)
!858 = !DILocation(line: 604, column: 12, scope: !245)
!859 = !DILocation(line: 0, scope: !243)
!860 = !DILocation(line: 610, column: 16, scope: !243)
!861 = !DILocation(line: 610, column: 7, scope: !243)
!862 = !DILocation(line: 611, column: 21, scope: !243)
!863 = !{!864, !864, i64 0}
!864 = !{!"short", !764, i64 0}
!865 = !DILocation(line: 611, column: 19, scope: !243)
!866 = !DILocation(line: 611, column: 16, scope: !243)
!867 = !DILocation(line: 610, column: 30, scope: !243)
!868 = distinct !{!868, !861, !862, !869}
!869 = !{!"llvm.loop.mustprogress"}
!870 = !DILocation(line: 612, column: 18, scope: !871)
!871 = distinct !DILexicalBlock(scope: !243, file: !77, line: 612, column: 11)
!872 = !DILocation(line: 612, column: 11, scope: !243)
!873 = !DILocation(line: 620, column: 23, scope: !76)
!874 = !DILocation(line: 625, column: 39, scope: !76)
!875 = !DILocation(line: 626, column: 3, scope: !76)
!876 = !DILocation(line: 626, column: 10, scope: !76)
!877 = !DILocation(line: 626, column: 21, scope: !76)
!878 = !DILocation(line: 628, column: 44, scope: !879)
!879 = distinct !DILexicalBlock(scope: !880, file: !77, line: 628, column: 11)
!880 = distinct !DILexicalBlock(scope: !76, file: !77, line: 627, column: 5)
!881 = !DILocation(line: 628, column: 32, scope: !879)
!882 = !DILocation(line: 628, column: 49, scope: !879)
!883 = !DILocation(line: 628, column: 11, scope: !880)
!884 = !DILocation(line: 630, column: 11, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !77, line: 630, column: 11)
!886 = !DILocation(line: 630, column: 11, scope: !880)
!887 = !DILocation(line: 632, column: 26, scope: !888)
!888 = distinct !DILexicalBlock(scope: !889, file: !77, line: 632, column: 15)
!889 = distinct !DILexicalBlock(scope: !885, file: !77, line: 631, column: 9)
!890 = !DILocation(line: 632, column: 34, scope: !888)
!891 = !DILocation(line: 632, column: 37, scope: !888)
!892 = !DILocation(line: 632, column: 15, scope: !889)
!893 = !DILocation(line: 640, column: 16, scope: !880)
!894 = distinct !{!894, !875, !895, !869}
!895 = !DILocation(line: 641, column: 5, scope: !76)
!896 = !DILocation(line: 644, column: 3, scope: !76)
!897 = !DILocation(line: 0, scope: !834, inlinedAt: !898)
!898 = distinct !DILocation(line: 648, column: 31, scope: !76)
!899 = !DILocation(line: 0, scope: !834, inlinedAt: !900)
!900 = distinct !DILocation(line: 649, column: 31, scope: !76)
!901 = !DILocation(line: 0, scope: !834, inlinedAt: !902)
!902 = distinct !DILocation(line: 650, column: 31, scope: !76)
!903 = !DILocation(line: 0, scope: !834, inlinedAt: !904)
!904 = distinct !DILocation(line: 651, column: 31, scope: !76)
!905 = !DILocation(line: 0, scope: !834, inlinedAt: !906)
!906 = distinct !DILocation(line: 652, column: 31, scope: !76)
!907 = !DILocation(line: 0, scope: !834, inlinedAt: !908)
!908 = distinct !DILocation(line: 653, column: 31, scope: !76)
!909 = !DILocation(line: 0, scope: !834, inlinedAt: !910)
!910 = distinct !DILocation(line: 654, column: 31, scope: !76)
!911 = !DILocation(line: 0, scope: !834, inlinedAt: !912)
!912 = distinct !DILocation(line: 655, column: 31, scope: !76)
!913 = !DILocation(line: 0, scope: !834, inlinedAt: !914)
!914 = distinct !DILocation(line: 656, column: 31, scope: !76)
!915 = !DILocation(line: 0, scope: !834, inlinedAt: !916)
!916 = distinct !DILocation(line: 657, column: 31, scope: !76)
!917 = !DILocation(line: 663, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !76, file: !77, line: 663, column: 7)
!919 = !DILocation(line: 664, column: 7, scope: !918)
!920 = !DILocation(line: 664, column: 10, scope: !918)
!921 = !DILocation(line: 663, column: 7, scope: !76)
!922 = !DILocation(line: 669, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !918, file: !77, line: 665, column: 5)
!924 = !DILocation(line: 671, column: 5, scope: !923)
!925 = !DILocation(line: 676, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !918, file: !77, line: 673, column: 5)
!927 = !DILocation(line: 679, column: 3, scope: !76)
!928 = !DILocation(line: 683, column: 3, scope: !76)
!929 = !DILocation(line: 686, column: 3, scope: !76)
!930 = !DILocation(line: 688, column: 3, scope: !76)
!931 = !DILocation(line: 691, column: 3, scope: !76)
!932 = !DILocation(line: 695, column: 3, scope: !76)
!933 = !DILocation(line: 696, column: 1, scope: !76)
!934 = !DISubprogram(name: "setlocale", scope: !935, file: !935, line: 122, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!935 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!936 = !DISubroutineType(types: !937)
!937 = !{!260, !116, !80}
!938 = !DISubprogram(name: "strncmp", scope: !939, file: !939, line: 159, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!939 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!940 = !DISubroutineType(types: !941)
!941 = !{!116, !80, !80, !118}
!942 = !DISubprogram(name: "exit", scope: !943, file: !943, line: 624, type: !752, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!943 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!944 = !DISubprogram(name: "getenv", scope: !943, file: !943, line: 641, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!945 = !DISubroutineType(types: !946)
!946 = !{!260, !80}
!947 = !DISubprogram(name: "strcmp", scope: !939, file: !939, line: 156, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!948 = !DISubroutineType(types: !949)
!949 = !{!116, !80, !80}
!950 = !DISubprogram(name: "strspn", scope: !939, file: !939, line: 297, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!951 = !DISubroutineType(types: !952)
!952 = !{!120, !80, !80}
!953 = !DISubprogram(name: "strchr", scope: !939, file: !939, line: 246, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!954 = !DISubroutineType(types: !955)
!955 = !{!260, !80, !116}
!956 = !DISubprogram(name: "__ctype_b_loc", scope: !100, file: !100, line: 79, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!957 = !DISubroutineType(types: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!962 = !DISubprogram(name: "strcspn", scope: !939, file: !939, line: 293, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!963 = !DISubprogram(name: "fwrite_unlocked", scope: !347, file: !347, line: 704, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!964 = !DISubroutineType(types: !965)
!965 = !{!118, !966, !118, !118, !812}
!966 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!969 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 57, type: !970, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !973)
!970 = !DISubroutineType(types: !971)
!971 = !{!116, !116, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!973 = !{!974, !975}
!974 = !DILocalVariable(name: "argc", arg: 1, scope: !969, file: !2, line: 57, type: !116)
!975 = !DILocalVariable(name: "argv", arg: 2, scope: !969, file: !2, line: 57, type: !972)
!976 = !DILocation(line: 0, scope: !969)
!977 = !DILocation(line: 60, column: 21, scope: !969)
!978 = !DILocation(line: 60, column: 3, scope: !969)
!979 = !DILocation(line: 61, column: 3, scope: !969)
!980 = !DILocation(line: 62, column: 3, scope: !969)
!981 = !DILocation(line: 63, column: 3, scope: !969)
!982 = !DILocation(line: 65, column: 3, scope: !969)
!983 = !DILocation(line: 68, column: 36, scope: !969)
!984 = !DILocation(line: 68, column: 58, scope: !969)
!985 = !DILocation(line: 67, column: 3, scope: !969)
!986 = !DILocation(line: 71, column: 14, scope: !987)
!987 = distinct !DILexicalBlock(scope: !969, file: !2, line: 71, column: 7)
!988 = !DILocation(line: 71, column: 21, scope: !987)
!989 = !DILocation(line: 71, column: 12, scope: !987)
!990 = !DILocation(line: 71, column: 7, scope: !969)
!991 = !DILocation(line: 73, column: 16, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !2, line: 73, column: 11)
!993 = distinct !DILexicalBlock(scope: !987, file: !2, line: 72, column: 5)
!994 = !DILocation(line: 73, column: 11, scope: !993)
!995 = !DILocation(line: 74, column: 9, scope: !992)
!996 = !DILocation(line: 76, column: 9, scope: !992)
!997 = !DILocation(line: 77, column: 7, scope: !993)
!998 = !DILocation(line: 80, column: 18, scope: !999)
!999 = distinct !DILexicalBlock(scope: !969, file: !2, line: 80, column: 7)
!1000 = !DILocation(line: 80, column: 7, scope: !969)
!1001 = !DILocation(line: 82, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !999, file: !2, line: 81, column: 5)
!1003 = !DILocation(line: 83, column: 7, scope: !1002)
!1004 = !DILocation(line: 86, column: 13, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !969, file: !2, line: 86, column: 7)
!1006 = !DILocation(line: 86, column: 27, scope: !1005)
!1007 = !DILocation(line: 86, column: 7, scope: !1005)
!1008 = !DILocation(line: 86, column: 45, scope: !1005)
!1009 = !DILocation(line: 86, column: 7, scope: !969)
!1010 = !DILocation(line: 87, column: 5, scope: !1005)
!1011 = !DILocation(line: 90, column: 3, scope: !969)
!1012 = !DISubprogram(name: "bindtextdomain", scope: !805, file: !805, line: 86, type: !1013, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!260, !80, !80}
!1015 = !DISubprogram(name: "textdomain", scope: !805, file: !805, line: 82, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1016 = !DISubprogram(name: "atexit", scope: !943, file: !943, line: 602, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!116, !386}
!1019 = !DISubprogram(name: "link", scope: !1020, file: !1020, line: 819, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1020 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1021 = !DISubprogram(name: "__errno_location", scope: !1022, file: !1022, line: 37, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1022 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!411}
!1025 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !321, file: !321, line: 50, type: !773, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1026)
!1026 = !{!1027}
!1027 = !DILocalVariable(name: "file", arg: 1, scope: !1025, file: !321, line: 50, type: !80)
!1028 = !DILocation(line: 0, scope: !1025)
!1029 = !DILocation(line: 52, column: 13, scope: !1025)
!1030 = !DILocation(line: 53, column: 1, scope: !1025)
!1031 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !321, file: !321, line: 87, type: !1032, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1034)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{null, !239}
!1034 = !{!1035}
!1035 = !DILocalVariable(name: "ignore", arg: 1, scope: !1031, file: !321, line: 87, type: !239)
!1036 = !DILocation(line: 0, scope: !1031)
!1037 = !DILocation(line: 89, column: 16, scope: !1031)
!1038 = !{!1039, !1039, i64 0}
!1039 = !{!"_Bool", !764, i64 0}
!1040 = !DILocation(line: 90, column: 1, scope: !1031)
!1041 = distinct !DISubprogram(name: "close_stdout", scope: !321, file: !321, line: 116, type: !387, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1042)
!1042 = !{!1043}
!1043 = !DILocalVariable(name: "write_error", scope: !1044, file: !321, line: 121, type: !80)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !321, line: 120, column: 5)
!1045 = distinct !DILexicalBlock(scope: !1041, file: !321, line: 118, column: 7)
!1046 = !DILocation(line: 118, column: 21, scope: !1045)
!1047 = !DILocation(line: 118, column: 7, scope: !1045)
!1048 = !DILocation(line: 118, column: 29, scope: !1045)
!1049 = !DILocation(line: 119, column: 7, scope: !1045)
!1050 = !DILocation(line: 119, column: 12, scope: !1045)
!1051 = !{i8 0, i8 2}
!1052 = !DILocation(line: 119, column: 25, scope: !1045)
!1053 = !DILocation(line: 119, column: 28, scope: !1045)
!1054 = !DILocation(line: 119, column: 34, scope: !1045)
!1055 = !DILocation(line: 118, column: 7, scope: !1041)
!1056 = !DILocation(line: 121, column: 33, scope: !1044)
!1057 = !DILocation(line: 0, scope: !1044)
!1058 = !DILocation(line: 122, column: 11, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1044, file: !321, line: 122, column: 11)
!1060 = !DILocation(line: 0, scope: !1059)
!1061 = !DILocation(line: 122, column: 11, scope: !1044)
!1062 = !DILocation(line: 123, column: 9, scope: !1059)
!1063 = !DILocation(line: 126, column: 9, scope: !1059)
!1064 = !DILocation(line: 128, column: 14, scope: !1044)
!1065 = !DILocation(line: 128, column: 7, scope: !1044)
!1066 = !DILocation(line: 133, column: 42, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1041, file: !321, line: 133, column: 7)
!1068 = !DILocation(line: 133, column: 28, scope: !1067)
!1069 = !DILocation(line: 133, column: 50, scope: !1067)
!1070 = !DILocation(line: 133, column: 7, scope: !1041)
!1071 = !DILocation(line: 134, column: 12, scope: !1067)
!1072 = !DILocation(line: 134, column: 5, scope: !1067)
!1073 = !DILocation(line: 135, column: 1, scope: !1041)
!1074 = !DISubprogram(name: "_exit", scope: !1020, file: !1020, line: 624, type: !752, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1075 = distinct !DISubprogram(name: "verror", scope: !336, file: !336, line: 251, type: !1076, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !116, !116, !80, !346}
!1078 = !{!1079, !1080, !1081, !1082}
!1079 = !DILocalVariable(name: "status", arg: 1, scope: !1075, file: !336, line: 251, type: !116)
!1080 = !DILocalVariable(name: "errnum", arg: 2, scope: !1075, file: !336, line: 251, type: !116)
!1081 = !DILocalVariable(name: "message", arg: 3, scope: !1075, file: !336, line: 251, type: !80)
!1082 = !DILocalVariable(name: "args", arg: 4, scope: !1075, file: !336, line: 251, type: !346)
!1083 = !DILocation(line: 0, scope: !1075)
!1084 = !DILocation(line: 261, column: 3, scope: !1075)
!1085 = !DILocation(line: 265, column: 7, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1075, file: !336, line: 265, column: 7)
!1087 = !DILocation(line: 265, column: 7, scope: !1075)
!1088 = !DILocation(line: 266, column: 5, scope: !1086)
!1089 = !DILocation(line: 272, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1086, file: !336, line: 268, column: 5)
!1091 = !DILocation(line: 276, column: 3, scope: !1075)
!1092 = !{i64 0, i64 8, !762, i64 8, i64 8, !762, i64 16, i64 8, !762, i64 24, i64 4, !822, i64 28, i64 4, !822}
!1093 = !DILocation(line: 282, column: 1, scope: !1075)
!1094 = distinct !DISubprogram(name: "flush_stdout", scope: !336, file: !336, line: 163, type: !387, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1095)
!1095 = !{!1096}
!1096 = !DILocalVariable(name: "stdout_fd", scope: !1094, file: !336, line: 166, type: !116)
!1097 = !DILocation(line: 0, scope: !1094)
!1098 = !DILocalVariable(name: "fd", arg: 1, scope: !1099, file: !336, line: 145, type: !116)
!1099 = distinct !DISubprogram(name: "is_open", scope: !336, file: !336, line: 145, type: !1100, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!116, !116}
!1102 = !{!1098}
!1103 = !DILocation(line: 0, scope: !1099, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 182, column: 25, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1094, file: !336, line: 182, column: 7)
!1106 = !DILocation(line: 157, column: 15, scope: !1099, inlinedAt: !1104)
!1107 = !DILocation(line: 157, column: 12, scope: !1099, inlinedAt: !1104)
!1108 = !DILocation(line: 182, column: 7, scope: !1094)
!1109 = !DILocation(line: 184, column: 5, scope: !1105)
!1110 = !DILocation(line: 185, column: 1, scope: !1094)
!1111 = distinct !DISubprogram(name: "error_tail", scope: !336, file: !336, line: 219, type: !1076, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1112)
!1112 = !{!1113, !1114, !1115, !1116}
!1113 = !DILocalVariable(name: "status", arg: 1, scope: !1111, file: !336, line: 219, type: !116)
!1114 = !DILocalVariable(name: "errnum", arg: 2, scope: !1111, file: !336, line: 219, type: !116)
!1115 = !DILocalVariable(name: "message", arg: 3, scope: !1111, file: !336, line: 219, type: !80)
!1116 = !DILocalVariable(name: "args", arg: 4, scope: !1111, file: !336, line: 219, type: !346)
!1117 = distinct !DIAssignID()
!1118 = !DILocation(line: 0, scope: !1111)
!1119 = !DILocation(line: 229, column: 13, scope: !1111)
!1120 = !DILocation(line: 135, column: 10, scope: !1121, inlinedAt: !1163)
!1121 = distinct !DISubprogram(name: "vfprintf", scope: !809, file: !809, line: 132, type: !1122, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1159)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!116, !1124, !813, !348}
!1124 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1127, file: !256, line: 51, baseType: !116, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1127, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1127, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1127, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1127, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1127, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1127, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1127, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1127, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1127, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1127, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1127, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1127, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1127, file: !256, line: 70, baseType: !1143, size: 64, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1127, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1127, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1127, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1127, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1127, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1127, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1127, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1127, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1127, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1127, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1127, file: !256, line: 93, baseType: !1143, size: 64, offset: 1344)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1127, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1127, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1127, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1127, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!1159 = !{!1160, !1161, !1162}
!1160 = !DILocalVariable(name: "__stream", arg: 1, scope: !1121, file: !809, line: 132, type: !1124)
!1161 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1121, file: !809, line: 133, type: !813)
!1162 = !DILocalVariable(name: "__ap", arg: 3, scope: !1121, file: !809, line: 133, type: !348)
!1163 = distinct !DILocation(line: 229, column: 3, scope: !1111)
!1164 = !{!1165, !1167}
!1165 = distinct !{!1165, !1166, !"vfprintf.inline: argument 0"}
