; ModuleID = 'src/od.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.tspec = type { i32, i32, ptr, [18 x i8], i8, i32, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.12 }
%union.anon.12 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1829, type: !24, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !24, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1832, type: !24, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1833, type: !24, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1835, type: !24, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 14)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 13)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1875, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 46)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1949, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 17)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !24, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 45)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1970, type: !100, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1973, type: !24, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2012, type: !340, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2031, type: !333, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2061, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 15)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "string_min", scope: !161, file: !2, line: 193, type: !256, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !161, file: !2, line: 196, type: !360, isLocal: true, isDefinition: true)
!360 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "traditional", scope: !161, file: !2, line: 201, type: !360, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !161, file: !2, line: 204, type: !360, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !161, file: !2, line: 208, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !368, line: 101, baseType: !369)
!368 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !370, line: 72, baseType: !260)
!370 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !161, file: !2, line: 216, type: !367, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "spec", scope: !161, file: !2, line: 228, type: !375, isLocal: true, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !2, line: 122, size: 384, elements: !377)
!377 = !{!378, !379, !380, !381, !385, !386, !387}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !376, file: !2, line: 124, baseType: !185, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !2, line: 125, baseType: !196, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !376, file: !2, line: 126, baseType: !252, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !376, file: !2, line: 127, baseType: !382, size: 144, offset: 128)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 18)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !376, file: !2, line: 128, baseType: !360, size: 8, offset: 272)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !376, file: !2, line: 129, baseType: !158, size: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !376, file: !2, line: 130, baseType: !256, size: 64, offset: 320)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "n_specs", scope: !161, file: !2, line: 231, type: !256, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !161, file: !2, line: 240, type: !256, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "file_list", scope: !161, file: !2, line: 247, type: !243, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "in_stream", scope: !161, file: !2, line: 254, type: !396, isLocal: true, isDefinition: true)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !398, line: 7, baseType: !399)
!398 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !400, line: 49, size: 1728, elements: !401)
!400 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !417, !419, !420, !421, !423, !424, !426, !427, !430, !432, !435, !438, !439, !440, !441, !442}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !399, file: !400, line: 51, baseType: !158, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !399, file: !400, line: 54, baseType: !160, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !399, file: !400, line: 55, baseType: !160, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !399, file: !400, line: 56, baseType: !160, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !399, file: !400, line: 57, baseType: !160, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !399, file: !400, line: 58, baseType: !160, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !399, file: !400, line: 59, baseType: !160, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !399, file: !400, line: 60, baseType: !160, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !399, file: !400, line: 61, baseType: !160, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !399, file: !400, line: 64, baseType: !160, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !399, file: !400, line: 65, baseType: !160, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !399, file: !400, line: 66, baseType: !160, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !399, file: !400, line: 68, baseType: !415, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !400, line: 36, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !399, file: !400, line: 70, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !399, file: !400, line: 72, baseType: !158, size: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !399, file: !400, line: 73, baseType: !158, size: 32, offset: 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !399, file: !400, line: 74, baseType: !422, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !370, line: 152, baseType: !260)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !399, file: !400, line: 77, baseType: !247, size: 16, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !399, file: !400, line: 78, baseType: !425, size: 8, offset: 1040)
!425 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !399, file: !400, line: 79, baseType: !265, size: 8, offset: 1048)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !399, file: !400, line: 81, baseType: !428, size: 64, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !400, line: 43, baseType: null)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !399, file: !400, line: 89, baseType: !431, size: 64, offset: 1152)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !370, line: 153, baseType: !260)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !399, file: !400, line: 91, baseType: !433, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !400, line: 37, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !399, file: !400, line: 92, baseType: !436, size: 64, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !400, line: 38, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !399, file: !400, line: 93, baseType: !418, size: 64, offset: 1344)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !399, file: !400, line: 94, baseType: !240, size: 64, offset: 1408)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !399, file: !400, line: 95, baseType: !248, size: 64, offset: 1472)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !399, file: !400, line: 96, baseType: !158, size: 32, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !399, file: !400, line: 98, baseType: !443, size: 160, offset: 1568)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 20)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !161, file: !2, line: 257, type: !360, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "input_swap", scope: !161, file: !2, line: 305, type: !360, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !181, line: 729, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 56)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !181, line: 736, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 75)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !462, file: !181, line: 575, type: !158, isLocal: true, isDefinition: true)
!462 = distinct !DISubprogram(name: "oputs_", scope: !181, file: !181, line: 573, type: !463, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !465)
!463 = !DISubroutineType(cc: DW_CC_nocall, types: !464)
!464 = !{null, !245, !245}
!465 = !{!466, !467, !468, !471, !472, !473, !474, !478, !479, !480, !481, !483, !484, !485, !486, !488, !489}
!466 = !DILocalVariable(name: "program", arg: 1, scope: !462, file: !181, line: 573, type: !245)
!467 = !DILocalVariable(name: "option", arg: 2, scope: !462, file: !181, line: 573, type: !245)
!468 = !DILocalVariable(name: "term", scope: !469, file: !181, line: 585, type: !245)
!469 = distinct !DILexicalBlock(scope: !470, file: !181, line: 582, column: 5)
!470 = distinct !DILexicalBlock(scope: !462, file: !181, line: 581, column: 7)
!471 = !DILocalVariable(name: "double_space", scope: !462, file: !181, line: 594, type: !360)
!472 = !DILocalVariable(name: "first_word", scope: !462, file: !181, line: 595, type: !245)
!473 = !DILocalVariable(name: "option_text", scope: !462, file: !181, line: 596, type: !245)
!474 = !DILocalVariable(name: "s", scope: !475, file: !181, line: 608, type: !245)
!475 = distinct !DILexicalBlock(scope: !476, file: !181, line: 605, column: 5)
!476 = distinct !DILexicalBlock(scope: !477, file: !181, line: 604, column: 12)
!477 = distinct !DILexicalBlock(scope: !462, file: !181, line: 597, column: 7)
!478 = !DILocalVariable(name: "spaces", scope: !475, file: !181, line: 609, type: !248)
!479 = !DILocalVariable(name: "anchor_len", scope: !462, file: !181, line: 620, type: !248)
!480 = !DILocalVariable(name: "desc_text", scope: !462, file: !181, line: 625, type: !245)
!481 = !DILocalVariable(name: "__ptr", scope: !482, file: !181, line: 644, type: !245)
!482 = distinct !DILexicalBlock(scope: !462, file: !181, line: 644, column: 3)
!483 = !DILocalVariable(name: "__stream", scope: !482, file: !181, line: 644, type: !396)
!484 = !DILocalVariable(name: "__cnt", scope: !482, file: !181, line: 644, type: !248)
!485 = !DILocalVariable(name: "url_program", scope: !462, file: !181, line: 648, type: !245)
!486 = !DILocalVariable(name: "__ptr", scope: !487, file: !181, line: 686, type: !245)
!487 = distinct !DILexicalBlock(scope: !462, file: !181, line: 686, column: 3)
!488 = !DILocalVariable(name: "__stream", scope: !487, file: !181, line: 686, type: !396)
!489 = !DILocalVariable(name: "__cnt", scope: !487, file: !181, line: 686, type: !248)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !181, line: 585, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 5)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !181, line: 586, type: !492, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !181, line: 595, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 4)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !181, line: 620, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 6)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !287, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !492, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !499, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !24, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !181, line: 650, type: !492, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !504, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !504, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !181, line: 652, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 7)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !181, line: 653, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 8)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !181, line: 654, type: !270, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !181, line: 655, type: !270, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !181, line: 656, type: !270, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !181, line: 657, type: !270, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !181, line: 663, type: !523, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !181, line: 664, type: !270, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !333, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 40)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !353, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 61)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !181, line: 679, type: !24, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !181, line: 683, type: !492, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !181, line: 688, type: !492, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !181, line: 691, type: !528, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !181, line: 839, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 16)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !181, line: 840, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 22)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !181, line: 841, type: !353, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !181, line: 862, type: !499, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !181, line: 868, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 71)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !181, line: 875, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 27)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !120, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 12)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "short_options", scope: !161, file: !2, line: 307, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 280, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 35)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 335, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 11)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !2, line: 336, type: !318, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !603, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !2, line: 338, type: !523, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !382, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !528, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !593, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !504, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 343, type: !523, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !492, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 346, type: !528, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "long_options", scope: !161, file: !2, line: 333, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 3072, elements: !594)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !631, line: 50, size: 256, elements: !632)
!631 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!632 = !{!633, !634, !635, !637}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !631, line: 52, baseType: !245, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !630, file: !631, line: 55, baseType: !158, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !630, file: !631, line: 56, baseType: !636, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !630, file: !631, line: 57, baseType: !158, size: 32, offset: 192)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1267, type: !333, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "format_address", scope: !161, file: !2, line: 213, type: !642, isLocal: true, isDefinition: true)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !367, !4}
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "address_base", scope: !161, file: !2, line: 182, type: !158, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !161, file: !2, line: 190, type: !158, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !270, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !282, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 328, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 41)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !161, file: !2, line: 234, type: !256, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 797, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 23)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 807, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 76)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !504, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !287, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !499, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !282, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !287, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !499, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !287, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !499, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !287, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !499, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !287, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 664, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 83)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 921, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 656, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 82)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !2, line: 937, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 53)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 993, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !656)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "integral_type_size", scope: !161, file: !2, line: 265, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 288, elements: !283)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !161, file: !2, line: 288, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 544, elements: !334)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !2, line: 585, type: !499, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 618, type: !499, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "charname", scope: !161, file: !2, line: 172, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1056, elements: !740)
!740 = !{!741, !501}
!741 = !DISubrange(count: 33)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !2, line: 651, type: !24, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !24, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !2, line: 659, type: !24, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !2, line: 663, type: !24, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 667, type: !24, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 671, type: !24, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 675, type: !24, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !2, line: 679, type: !24, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !24, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !492, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !161, file: !2, line: 225, type: !360, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "endian_types", scope: !161, file: !2, line: 328, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 64, elements: !288)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !523, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !499, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "endian_args", scope: !161, file: !2, line: 323, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, elements: !25)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1488, type: !24, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1294, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !599)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "end_offset", scope: !161, file: !2, line: 220, type: !367, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !287, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "default_file_list", scope: !161, file: !2, line: 251, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !288)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1039, type: !287, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "input_filename", scope: !161, file: !2, line: 244, type: !245, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1227, type: !3, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1086, type: !593, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "width_bytes", scope: !161, file: !2, line: 134, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 288, elements: !283)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 32)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 136, elements: !334)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 30)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !655, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "first", scope: !816, file: !2, line: 1313, type: !360, isLocal: true, isDefinition: true)
!816 = distinct !DISubprogram(name: "write_block", scope: !2, file: !2, line: 1310, type: !817, scopeLine: 1312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !367, !256, !245, !245}
!819 = !{!820, !821, !822, !823, !824, !828, !831, !832, !833, !836, !838}
!820 = !DILocalVariable(name: "current_offset", arg: 1, scope: !816, file: !2, line: 1310, type: !367)
!821 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !816, file: !2, line: 1310, type: !256)
!822 = !DILocalVariable(name: "prev_block", arg: 3, scope: !816, file: !2, line: 1311, type: !245)
!823 = !DILocalVariable(name: "curr_block", arg: 4, scope: !816, file: !2, line: 1311, type: !245)
!824 = !DILocalVariable(name: "i", scope: !825, file: !2, line: 1334, type: !256)
!825 = distinct !DILexicalBlock(scope: !826, file: !2, line: 1334, column: 7)
!826 = distinct !DILexicalBlock(scope: !827, file: !2, line: 1332, column: 5)
!827 = distinct !DILexicalBlock(scope: !816, file: !2, line: 1316, column: 7)
!828 = !DILocalVariable(name: "datum_width", scope: !829, file: !2, line: 1336, type: !158)
!829 = distinct !DILexicalBlock(scope: !830, file: !2, line: 1335, column: 9)
!830 = distinct !DILexicalBlock(scope: !825, file: !2, line: 1334, column: 7)
!831 = !DILocalVariable(name: "fields_per_block", scope: !829, file: !2, line: 1337, type: !256)
!832 = !DILocalVariable(name: "blank_fields", scope: !829, file: !2, line: 1338, type: !256)
!833 = !DILocalVariable(name: "field_width", scope: !834, file: !2, line: 1349, type: !158)
!834 = distinct !DILexicalBlock(scope: !835, file: !2, line: 1347, column: 13)
!835 = distinct !DILexicalBlock(scope: !829, file: !2, line: 1346, column: 15)
!836 = !DILocalVariable(name: "f", scope: !837, file: !2, line: 1350, type: !256)
!837 = distinct !DILexicalBlock(scope: !834, file: !2, line: 1350, column: 15)
!838 = !DILocalVariable(name: "pad_width", scope: !834, file: !2, line: 1352, type: !256)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !816, file: !2, line: 1314, type: !360, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1327, type: !24, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !499, isLocal: true, isDefinition: true)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !858, !859, !860, !861, !865, !868, !871, !872, !874, !877, !878, !880, !883, !884}
!846 = !DILocalVariable(name: "argc", arg: 1, scope: !155, file: !2, line: 1677, type: !158)
!847 = !DILocalVariable(name: "argv", arg: 2, scope: !155, file: !2, line: 1677, type: !159)
!848 = !DILocalVariable(name: "n_files", scope: !155, file: !2, line: 1679, type: !158)
!849 = !DILocalVariable(name: "l_c_m", scope: !155, file: !2, line: 1680, type: !158)
!850 = !DILocalVariable(name: "desired_width", scope: !155, file: !2, line: 1681, type: !256)
!851 = !DILocalVariable(name: "modern", scope: !155, file: !2, line: 1682, type: !360)
!852 = !DILocalVariable(name: "ok", scope: !155, file: !2, line: 1683, type: !360)
!853 = !DILocalVariable(name: "width_per_block", scope: !155, file: !2, line: 1684, type: !256)
!854 = !DILocalVariable(name: "max_bytes_to_format", scope: !155, file: !2, line: 1689, type: !367)
!855 = !DILocalVariable(name: "pseudo_start", scope: !155, file: !2, line: 1693, type: !367)
!856 = !DILocalVariable(name: "tmp", scope: !857, file: !2, line: 1705, type: !367)
!857 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1704, column: 5)
!858 = !DILocalVariable(name: "s_err", scope: !857, file: !2, line: 1706, type: !163)
!859 = !DILocalVariable(name: "oi", scope: !857, file: !2, line: 1707, type: !158)
!860 = !DILocalVariable(name: "c", scope: !857, file: !2, line: 1708, type: !158)
!861 = !DILocalVariable(name: "i", scope: !862, file: !2, line: 1769, type: !256)
!862 = distinct !DILexicalBlock(scope: !863, file: !2, line: 1765, column: 13)
!863 = distinct !DILexicalBlock(scope: !864, file: !2, line: 1762, column: 15)
!864 = distinct !DILexicalBlock(scope: !857, file: !2, line: 1713, column: 9)
!865 = !DILocalVariable(name: "w_tmp", scope: !866, file: !2, line: 1847, type: !367)
!866 = distinct !DILexicalBlock(scope: !867, file: !2, line: 1846, column: 13)
!867 = distinct !DILexicalBlock(scope: !864, file: !2, line: 1841, column: 15)
!868 = !DILocalVariable(name: "o1", scope: !869, file: !2, line: 1894, type: !367)
!869 = distinct !DILexicalBlock(scope: !870, file: !2, line: 1893, column: 5)
!870 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1892, column: 7)
!871 = !DILocalVariable(name: "o2", scope: !869, file: !2, line: 1895, type: !367)
!872 = !DILocalVariable(name: "i", scope: !873, file: !2, line: 2027, type: !256)
!873 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2027, column: 3)
!874 = !DILocalVariable(name: "fields_per_block", scope: !875, file: !2, line: 2029, type: !256)
!875 = distinct !DILexicalBlock(scope: !876, file: !2, line: 2028, column: 5)
!876 = distinct !DILexicalBlock(scope: !873, file: !2, line: 2027, column: 3)
!877 = !DILocalVariable(name: "block_width", scope: !875, file: !2, line: 2032, type: !256)
!878 = !DILocalVariable(name: "i", scope: !879, file: !2, line: 2036, type: !256)
!879 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2036, column: 3)
!880 = !DILocalVariable(name: "fields_per_block", scope: !881, file: !2, line: 2038, type: !256)
!881 = distinct !DILexicalBlock(scope: !882, file: !2, line: 2037, column: 5)
!882 = distinct !DILexicalBlock(scope: !879, file: !2, line: 2036, column: 3)
!883 = !DILocalVariable(name: "block_width", scope: !881, file: !2, line: 2039, type: !256)
!884 = !DILabel(scope: !155, name: "cleanup", file: !2, line: 2058)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 120, elements: !354)
!886 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!887 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!888 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!889 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!890 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!891 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!892 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!893 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !896, line: 3, type: !353, isLocal: true, isDefinition: true)
!896 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "Version", scope: !899, file: !896, line: 3, type: !245, isLocal: false, isDefinition: true)
!899 = distinct !DICompileUnit(language: DW_LANG_C11, file: !896, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !900, splitDebugInlining: false, nameTableKind: None)
!900 = !{!894, !897}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !903, file: !904, line: 65, type: !928, isLocal: false, isDefinition: true)
!903 = distinct !DICompileUnit(language: DW_LANG_C11, file: !904, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !905, retainedTypes: !908, globals: !909, splitDebugInlining: false, nameTableKind: None)
!904 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!905 = !{!906}
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !907, line: 42, baseType: !165, size: 32, elements: !227)
!907 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!908 = !{!240, !245, !251}
!909 = !{!901, !910, !912, !914, !919, !924, !926}
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !904, line: 141, type: !523, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !904, line: 141, type: !586, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !904, line: 142, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 29)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !904, line: 160, type: !921, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 21)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !904, line: 165, type: !528, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !904, line: 170, type: !492, isLocal: true, isDefinition: true)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !929, line: 69, baseType: !930)
!929 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null}
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "file_name", scope: !935, file: !936, line: 45, type: !245, isLocal: true, isDefinition: true)
!935 = distinct !DICompileUnit(language: DW_LANG_C11, file: !936, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !937, splitDebugInlining: false, nameTableKind: None)
!936 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!937 = !{!938, !940, !942, !944, !933, !946}
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !936, line: 121, type: !523, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !936, line: 121, type: !593, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !936, line: 123, type: !523, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !936, line: 126, type: !24, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !935, file: !936, line: 55, type: !360, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !950, file: !951, line: 66, type: !930, isLocal: false, isDefinition: true)
!950 = distinct !DICompileUnit(language: DW_LANG_C11, file: !951, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !952, globals: !953, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!952 = !{!240, !251}
!953 = !{!954, !956, !980, !982, !984, !986, !948, !988, !990, !992, !994, !996}
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !951, line: 272, type: !492, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "old_file_name", scope: !958, file: !951, line: 304, type: !245, isLocal: true, isDefinition: true)
!958 = distinct !DISubprogram(name: "verror_at_line", scope: !951, file: !951, line: 298, type: !959, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !950, retainedNodes: !973)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !158, !158, !245, !165, !245, !961}
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !962, line: 52, baseType: !963)
!962 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !964, line: 12, baseType: !965)
!964 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !951, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !967)
!967 = !{!968, !969, !970, !971, !972}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !966, file: !951, baseType: !240, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !966, file: !951, baseType: !240, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !966, file: !951, baseType: !240, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !966, file: !951, baseType: !158, size: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !966, file: !951, baseType: !158, size: 32, offset: 224)
!973 = !{!974, !975, !976, !977, !978, !979}
!974 = !DILocalVariable(name: "status", arg: 1, scope: !958, file: !951, line: 298, type: !158)
!975 = !DILocalVariable(name: "errnum", arg: 2, scope: !958, file: !951, line: 298, type: !158)
!976 = !DILocalVariable(name: "file_name", arg: 3, scope: !958, file: !951, line: 298, type: !245)
!977 = !DILocalVariable(name: "line_number", arg: 4, scope: !958, file: !951, line: 298, type: !165)
!978 = !DILocalVariable(name: "message", arg: 5, scope: !958, file: !951, line: 298, type: !245)
!979 = !DILocalVariable(name: "args", arg: 6, scope: !958, file: !951, line: 298, type: !961)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "old_line_number", scope: !958, file: !951, line: 305, type: !165, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !951, line: 338, type: !499, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !951, line: 346, type: !528, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !951, line: 346, type: !287, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "error_message_count", scope: !950, file: !951, line: 69, type: !165, isLocal: false, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !950, file: !951, line: 295, type: !158, isLocal: false, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !951, line: 208, type: !523, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !951, line: 208, type: !921, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !951, line: 214, type: !492, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "program_name", scope: !1000, file: !1001, line: 31, type: !245, isLocal: false, isDefinition: true)
!1000 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1001, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1002, globals: !1003, splitDebugInlining: false, nameTableKind: None)
!1001 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1002 = !{!240, !160}
!1003 = !{!998, !1004, !1006}
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !1001, line: 46, type: !528, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !1001, line: 49, type: !499, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1010, file: !1011, line: 46, type: !1038, isLocal: true, isDefinition: true)
!1010 = distinct !DISubprogram(name: "proper_name_lite", scope: !1011, file: !1011, line: 38, type: !1012, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1014, retainedNodes: !1016)
!1011 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!245, !245, !245}
!1014 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1011, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1015, splitDebugInlining: false, nameTableKind: None)
!1015 = !{!1008}
!1016 = !{!1017, !1018, !1019, !1020, !1025}
!1017 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1010, file: !1011, line: 38, type: !245)
!1018 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1010, file: !1011, line: 38, type: !245)
!1019 = !DILocalVariable(name: "translation", scope: !1010, file: !1011, line: 40, type: !245)
!1020 = !DILocalVariable(name: "w", scope: !1010, file: !1011, line: 47, type: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1022, line: 37, baseType: !1023)
!1022 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !370, line: 57, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !370, line: 42, baseType: !165)
!1025 = !DILocalVariable(name: "mbs", scope: !1010, file: !1011, line: 48, type: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1027, line: 6, baseType: !1028)
!1027 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1029, line: 21, baseType: !1030)
!1029 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1029, line: 13, size: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1030, file: !1029, line: 15, baseType: !158, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1030, file: !1029, line: 20, baseType: !1034, size: 32, offset: 32)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1030, file: !1029, line: 16, size: 32, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1034, file: !1029, line: 18, baseType: !165, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1034, file: !1029, line: 19, baseType: !499, size: 32)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 16, elements: !288)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 78, type: !528, isLocal: true, isDefinition: true)
!1041 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 79, type: !504, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 80, type: !323, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 81, type: !323, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 82, type: !443, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 83, type: !287, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 84, type: !528, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 85, type: !523, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 86, type: !523, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 87, type: !528, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1062, file: !1041, line: 76, type: !1134, isLocal: false, isDefinition: true)
!1062 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1041, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1063, retainedTypes: !1069, globals: !1070, splitDebugInlining: false, nameTableKind: None)
!1063 = !{!906, !1064, !210}
!1064 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !907, line: 254, baseType: !165, size: 32, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1067 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1068 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1069 = !{!240, !158, !247, !248}
!1070 = !{!1039, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1071, !1075, !1085, !1087, !1092, !1094, !1096, !1098, !1100, !1123, !1130, !1132}
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1062, file: !1041, line: 92, type: !1073, isLocal: false, isDefinition: true)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 320, elements: !271)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1062, file: !1041, line: 1040, type: !1077, isLocal: false, isDefinition: true)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1041, line: 56, size: 448, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1083, !1084}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1077, file: !1041, line: 59, baseType: !906, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !1041, line: 62, baseType: !158, size: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1077, file: !1041, line: 66, baseType: !1082, size: 256, offset: 64)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 256, elements: !529)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1077, file: !1041, line: 69, baseType: !245, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1077, file: !1041, line: 72, baseType: !245, size: 64, offset: 384)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1062, file: !1041, line: 107, type: !1077, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "slot0", scope: !1062, file: !1041, line: 831, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 256)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 321, type: !287, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 357, type: !287, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 358, type: !287, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(scope: null, file: !1041, line: 199, type: !523, isLocal: true, isDefinition: true)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(name: "quote", scope: !1102, file: !1041, line: 228, type: !1121, isLocal: true, isDefinition: true)
!1102 = distinct !DISubprogram(name: "gettext_quote", scope: !1041, file: !1041, line: 197, type: !1103, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1062, retainedNodes: !1105)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!245, !245, !906}
!1105 = !{!1106, !1107, !1108, !1109, !1110}
!1106 = !DILocalVariable(name: "msgid", arg: 1, scope: !1102, file: !1041, line: 197, type: !245)
!1107 = !DILocalVariable(name: "s", arg: 2, scope: !1102, file: !1041, line: 197, type: !906)
!1108 = !DILocalVariable(name: "translation", scope: !1102, file: !1041, line: 199, type: !245)
!1109 = !DILocalVariable(name: "w", scope: !1102, file: !1041, line: 229, type: !1021)
!1110 = !DILocalVariable(name: "mbs", scope: !1102, file: !1041, line: 230, type: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1027, line: 6, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1029, line: 21, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1029, line: 13, size: 64, elements: !1114)
!1114 = !{!1115, !1116}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1113, file: !1029, line: 15, baseType: !158, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1113, file: !1029, line: 20, baseType: !1117, size: 32, offset: 32)
!1117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1113, file: !1029, line: 16, size: 32, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1117, file: !1029, line: 18, baseType: !165, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1117, file: !1029, line: 19, baseType: !499, size: 32)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 64, elements: !1122)
!1122 = !{!289, !501}
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "slotvec", scope: !1062, file: !1041, line: 834, type: !1125, isLocal: true, isDefinition: true)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1041, line: 823, size: 128, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !1041, line: 825, baseType: !248, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1126, file: !1041, line: 826, baseType: !160, size: 64, offset: 64)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "nslots", scope: !1062, file: !1041, line: 832, type: !158, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1062, file: !1041, line: 833, type: !1126, isLocal: true, isDefinition: true)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 704, elements: !604)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 67, type: !593, isLocal: true, isDefinition: true)
!1137 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 69, type: !523, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 83, type: !523, isLocal: true, isDefinition: true)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 83, type: !499, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 85, type: !287, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 88, type: !1148, isLocal: true, isDefinition: true)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1149)
!1149 = !{!1150}
!1150 = !DISubrange(count: 171)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 88, type: !1153, isLocal: true, isDefinition: true)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1154)
!1154 = !{!1155}
!1155 = !DISubrange(count: 34)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 105, type: !567, isLocal: true, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 109, type: !662, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 113, type: !1162, isLocal: true, isDefinition: true)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1163)
!1163 = !{!1164}
!1164 = !DISubrange(count: 28)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 120, type: !801, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 127, type: !1169, isLocal: true, isDefinition: true)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1170)
!1170 = !{!1171}
!1171 = !DISubrange(count: 36)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 134, type: !547, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 142, type: !110, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 150, type: !1178, isLocal: true, isDefinition: true)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1179)
!1179 = !{!1180}
!1180 = !DISubrange(count: 48)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 159, type: !1183, isLocal: true, isDefinition: true)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1184)
!1184 = !{!1185}
!1185 = !DISubrange(count: 52)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 170, type: !95, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 248, type: !443, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 248, type: !572, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 254, type: !443, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 254, type: !318, isLocal: true, isDefinition: true)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 254, type: !547, isLocal: true, isDefinition: true)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 259, type: !3, isLocal: true, isDefinition: true)
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(scope: null, file: !1137, line: 259, type: !916, isLocal: true, isDefinition: true)
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1204, file: !1205, line: 26, type: !1207, isLocal: false, isDefinition: true)
!1204 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1205, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1206, splitDebugInlining: false, nameTableKind: None)
!1205 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1206 = !{!1202}
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 376, elements: !1208)
!1208 = !{!1209}
!1209 = !DISubrange(count: 47)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1212, line: 34, type: !24, isLocal: true, isDefinition: true)
!1212 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1212, line: 34, type: !523, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1212, line: 34, type: !333, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !1219, line: 47, type: !523, isLocal: true, isDefinition: true)
!1219 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(scope: null, file: !1219, line: 47, type: !801, isLocal: true, isDefinition: true)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1224, file: !1225, line: 24, type: !1227, isLocal: false, isDefinition: true)
!1224 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1225, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1226, splitDebugInlining: false, nameTableKind: None)
!1225 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1226 = !{!1222}
!1227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !1230, line: 60, type: !586, isLocal: true, isDefinition: true)
!1230 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!1231 = !DIGlobalVariableExpression(var: !1232, expr: !DIExpression())
!1232 = distinct !DIGlobalVariable(scope: null, file: !1230, line: 65, type: !100, isLocal: true, isDefinition: true)
!1233 = !DIGlobalVariableExpression(var: !1234, expr: !DIExpression())
!1234 = distinct !DIGlobalVariable(scope: null, file: !1230, line: 69, type: !916, isLocal: true, isDefinition: true)
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(scope: null, file: !1230, line: 73, type: !24, isLocal: true, isDefinition: true)
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !1230, line: 86, type: !523, isLocal: true, isDefinition: true)
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(scope: null, file: !1241, line: 108, type: !265, isLocal: true, isDefinition: true)
!1241 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(name: "internal_state", scope: !1244, file: !1241, line: 97, type: !1247, isLocal: true, isDefinition: true)
!1244 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1241, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1245, globals: !1246, splitDebugInlining: false, nameTableKind: None)
!1245 = !{!240, !248, !251}
!1246 = !{!1239, !1242}
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1027, line: 6, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1029, line: 21, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1029, line: 13, size: 64, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1249, file: !1029, line: 15, baseType: !158, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1249, file: !1029, line: 20, baseType: !1253, size: 32, offset: 32)
!1253 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1249, file: !1029, line: 16, size: 32, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1253, file: !1029, line: 18, baseType: !165, size: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1253, file: !1029, line: 19, baseType: !499, size: 32)
!1257 = !DIGlobalVariableExpression(var: !1258, expr: !DIExpression())
!1258 = distinct !DIGlobalVariable(scope: null, file: !1259, line: 35, type: !287, isLocal: true, isDefinition: true)
!1259 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1259, line: 35, type: !504, isLocal: true, isDefinition: true)
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(scope: null, file: !1264, line: 202, type: !523, isLocal: true, isDefinition: true)
!1264 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !1267, file: !1264, line: 211, type: !1452, isLocal: true, isDefinition: true)
!1267 = distinct !DISubprogram(name: "printf_fetchargs", scope: !1264, file: !1264, line: 42, type: !1268, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1443, retainedNodes: !1447)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!158, !1270, !1280}
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1271, line: 12, baseType: !1272)
!1271 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "7bd78a282b99fcfe41a9e3c566d14f7d")
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1264, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278, !1279}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1273, file: !1264, baseType: !240, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1273, file: !1264, baseType: !240, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1273, file: !1264, baseType: !240, size: 64, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1273, file: !1264, baseType: !158, size: 32, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1273, file: !1264, baseType: !158, size: 32, offset: 224)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !1282, line: 185, baseType: !1283)
!1282 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1282, line: 179, size: 1920, elements: !1284)
!1284 = !{!1285, !1286, !1441}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1283, file: !1282, line: 181, baseType: !248, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1283, file: !1282, line: 182, baseType: !1287, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !1282, line: 174, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1282, line: 111, size: 256, elements: !1290)
!1290 = !{!1291, !1342}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1289, file: !1282, line: 113, baseType: !1292, size: 32)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !1282, line: 108, baseType: !1293)
!1293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1282, line: 47, baseType: !165, size: 32, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!1295 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1296 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1297 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1298 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1299 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1300 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1301 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1302 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1303 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1304 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1305 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1306 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1307 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1308 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1309 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1310 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1311 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1312 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1313 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1314 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1315 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
