; ModuleID = 'src/pinky.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i64, %struct.timespec, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }


!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 18, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!174 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !64, !69, !74, !79, !84, !89, !94, !99, !104, !179, !181, !186, !191, !196, !198, !201, !283, !288, !290, !295, !297, !299, !301, !303, !308, !310, !312, !314, !319, !324, !326, !328, !330, !332, !334, !336, !338, !343, !348, !350, !352, !354, !356, !358, !360, !365, !367, !369, !374, !379, !381, !383, !385, !387, !106, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !536, !538, !540, !542, !544, !546, !563, !565, !567, !569, !571, !594, !596, !601, !603, !605, !607, !609, !611, !613, !615, !620, !622}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !86, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 17)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 16)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 12)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !56, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "do_lookup", scope: !108, file: !2, line: 68, type: !200, isLocal: true, isDefinition: true)
!200 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !203, file: !115, line: 575, type: !116, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "oputs_", scope: !115, file: !115, line: 573, type: !204, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !206)
!204 = !DISubroutineType(cc: DW_CC_nocall, types: !205)
!205 = !{null, !175, !175}
!206 = !{!207, !208, !209, !212, !213, !214, !215, !219, !220, !221, !222, !224, !277, !278, !279, !281, !282}
!207 = !DILocalVariable(name: "program", arg: 1, scope: !203, file: !115, line: 573, type: !175)
!208 = !DILocalVariable(name: "option", arg: 2, scope: !203, file: !115, line: 573, type: !175)
!209 = !DILocalVariable(name: "term", scope: !210, file: !115, line: 585, type: !175)
!210 = distinct !DILexicalBlock(scope: !211, file: !115, line: 582, column: 5)
!211 = distinct !DILexicalBlock(scope: !203, file: !115, line: 581, column: 7)
!212 = !DILocalVariable(name: "double_space", scope: !203, file: !115, line: 594, type: !200)
!213 = !DILocalVariable(name: "first_word", scope: !203, file: !115, line: 595, type: !175)
!214 = !DILocalVariable(name: "option_text", scope: !203, file: !115, line: 596, type: !175)
!215 = !DILocalVariable(name: "s", scope: !216, file: !115, line: 608, type: !175)
!216 = distinct !DILexicalBlock(scope: !217, file: !115, line: 605, column: 5)
!217 = distinct !DILexicalBlock(scope: !218, file: !115, line: 604, column: 12)
!218 = distinct !DILexicalBlock(scope: !203, file: !115, line: 597, column: 7)
!219 = !DILocalVariable(name: "spaces", scope: !216, file: !115, line: 609, type: !172)
!220 = !DILocalVariable(name: "anchor_len", scope: !203, file: !115, line: 620, type: !172)
!221 = !DILocalVariable(name: "desc_text", scope: !203, file: !115, line: 625, type: !175)
!222 = !DILocalVariable(name: "__ptr", scope: !223, file: !115, line: 644, type: !175)
!223 = distinct !DILexicalBlock(scope: !203, file: !115, line: 644, column: 3)
!224 = !DILocalVariable(name: "__stream", scope: !223, file: !115, line: 644, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !227, line: 7, baseType: !228)
!227 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !229, line: 49, size: 1728, elements: !230)
!229 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !246, !248, !249, !250, !254, !255, !257, !258, !261, !263, !266, !269, !270, !271, !272, !273}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !228, file: !229, line: 51, baseType: !116, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !228, file: !229, line: 54, baseType: !169, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !228, file: !229, line: 55, baseType: !169, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !228, file: !229, line: 56, baseType: !169, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !228, file: !229, line: 57, baseType: !169, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !228, file: !229, line: 58, baseType: !169, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !228, file: !229, line: 59, baseType: !169, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !228, file: !229, line: 60, baseType: !169, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !228, file: !229, line: 61, baseType: !169, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !228, file: !229, line: 64, baseType: !169, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !228, file: !229, line: 65, baseType: !169, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !228, file: !229, line: 66, baseType: !169, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !228, file: !229, line: 68, baseType: !244, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !229, line: 36, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !228, file: !229, line: 70, baseType: !247, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !228, file: !229, line: 72, baseType: !116, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !228, file: !229, line: 73, baseType: !116, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !228, file: !229, line: 74, baseType: !251, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !252, line: 152, baseType: !253)
!252 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!253 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !228, file: !229, line: 77, baseType: !171, size: 16, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !228, file: !229, line: 78, baseType: !256, size: 8, offset: 1040)
!256 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !228, file: !229, line: 79, baseType: !91, size: 8, offset: 1048)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !228, file: !229, line: 81, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !229, line: 43, baseType: null)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !228, file: !229, line: 89, baseType: !262, size: 64, offset: 1152)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !252, line: 153, baseType: !253)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !228, file: !229, line: 91, baseType: !264, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !229, line: 37, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !228, file: !229, line: 92, baseType: !267, size: 64, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !229, line: 38, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !228, file: !229, line: 93, baseType: !247, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !228, file: !229, line: 94, baseType: !170, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !228, file: !229, line: 95, baseType: !172, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !228, file: !229, line: 96, baseType: !116, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !228, file: !229, line: 98, baseType: !274, size: 160, offset: 1568)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 20)
!277 = !DILocalVariable(name: "__cnt", scope: !223, file: !115, line: 644, type: !172)
!278 = !DILocalVariable(name: "url_program", scope: !203, file: !115, line: 648, type: !175)
!279 = !DILocalVariable(name: "__ptr", scope: !280, file: !115, line: 686, type: !175)
!280 = distinct !DILexicalBlock(scope: !203, file: !115, line: 686, column: 3)
!281 = !DILocalVariable(name: "__stream", scope: !280, file: !115, line: 686, type: !225)
!282 = !DILocalVariable(name: "__cnt", scope: !280, file: !115, line: 686, type: !172)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !115, line: 585, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 5)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !115, line: 586, type: !285, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !115, line: 595, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 4)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !115, line: 620, type: !19, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !14, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !285, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !292, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 3)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !115, line: 650, type: !285, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !115, line: 652, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 7)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !115, line: 653, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !115, line: 654, type: !96, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !115, line: 655, type: !96, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !115, line: 656, type: !96, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !115, line: 657, type: !96, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !115, line: 663, type: !316, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !115, line: 664, type: !96, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !183, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 40)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 15)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !24, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !115, line: 679, type: !305, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !115, line: 683, type: !285, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !115, line: 688, type: !285, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !115, line: 691, type: !321, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !115, line: 839, type: !188, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !115, line: 840, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 22)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !115, line: 841, type: !345, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !115, line: 862, type: !292, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !115, line: 868, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 71)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !115, line: 875, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 27)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !39, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !193, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !316, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !285, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !321, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "do_short_format", scope: !108, file: !2, line: 65, type: !200, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "include_heading", scope: !108, file: !2, line: 49, type: !200, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "include_fullname", scope: !108, file: !2, line: 52, type: !200, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "include_where", scope: !108, file: !2, line: 72, type: !200, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "include_idle", scope: !108, file: !2, line: 46, type: !200, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "include_project", scope: !108, file: !2, line: 55, type: !200, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "include_plan", scope: !108, file: !2, line: 58, type: !200, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !108, file: !2, line: 62, type: !200, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !305, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 422, type: !345, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !193, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "time_format", scope: !108, file: !2, line: 77, type: !175, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "time_format_width", scope: !108, file: !2, line: 78, type: !116, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !285, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !316, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !285, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !19, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !285, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !19, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !285, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !19, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !285, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !292, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !19, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dev_dirfd", scope: !441, file: !2, line: 212, type: !116, isLocal: true, isDefinition: true)
!441 = distinct !DISubprogram(name: "print_entry", scope: !2, file: !2, line: 200, type: !442, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !473)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !136, line: 92, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !136, line: 65, size: 576, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !461, !465, !466, !468}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !447, file: !136, line: 69, baseType: !169, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !447, file: !136, line: 70, baseType: !169, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !447, file: !136, line: 71, baseType: !169, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !447, file: !136, line: 72, baseType: !169, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !447, file: !136, line: 74, baseType: !454, size: 128, offset: 256)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 11, size: 128, elements: !456)
!455 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !454, file: !455, line: 16, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !252, line: 160, baseType: !253)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !454, file: !455, line: 21, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !252, line: 197, baseType: !253)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !447, file: !136, line: 75, baseType: !462, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !463, line: 97, baseType: !464)
!463 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !252, line: 154, baseType: !116)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !447, file: !136, line: 76, baseType: !462, size: 32, offset: 416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !447, file: !136, line: 77, baseType: !467, size: 16, offset: 448)
!467 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !447, file: !136, line: 79, baseType: !469, size: 64, offset: 480)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !136, line: 79, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !469, file: !136, line: 79, baseType: !116, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !469, file: !136, line: 79, baseType: !116, size: 32, offset: 32)
!473 = !{!474, !475, !476, !477, !478, !507, !510, !511, !512, !526, !530, !531, !534, !535}
!474 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !441, file: !2, line: 200, type: !444)
!475 = !DILocalVariable(name: "line", scope: !441, file: !2, line: 203, type: !169)
!476 = !DILocalVariable(name: "space", scope: !441, file: !2, line: 204, type: !169)
!477 = !DILocalVariable(name: "dirfd", scope: !441, file: !2, line: 207, type: !116)
!478 = !DILocalVariable(name: "stats", scope: !441, file: !2, line: 222, type: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !480, line: 44, size: 1024, elements: !481)
!480 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!481 = !{!482, !484, !486, !488, !490, !492, !494, !495, !496, !497, !499, !500, !502, !503, !504, !505}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !479, file: !480, line: 46, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !252, line: 145, baseType: !174)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !479, file: !480, line: 47, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !252, line: 148, baseType: !174)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !479, file: !480, line: 48, baseType: !487, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !252, line: 150, baseType: !111)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !479, file: !480, line: 49, baseType: !489, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !252, line: 151, baseType: !111)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !479, file: !480, line: 50, baseType: !491, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !252, line: 146, baseType: !111)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !479, file: !480, line: 51, baseType: !493, size: 32, offset: 224)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !252, line: 147, baseType: !111)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !479, file: !480, line: 52, baseType: !483, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !479, file: !480, line: 53, baseType: !483, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !479, file: !480, line: 54, baseType: !251, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !479, file: !480, line: 55, baseType: !498, size: 32, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !252, line: 175, baseType: !116)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !479, file: !480, line: 56, baseType: !116, size: 32, offset: 480)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !479, file: !480, line: 57, baseType: !501, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !252, line: 180, baseType: !253)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !479, file: !480, line: 65, baseType: !454, size: 128, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !479, file: !480, line: 66, baseType: !454, size: 128, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !479, file: !480, line: 67, baseType: !454, size: 128, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !479, file: !480, line: 79, baseType: !506, size: 64, offset: 960)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !15)
!507 = !DILocalVariable(name: "last_change", scope: !441, file: !2, line: 223, type: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !509, line: 10, baseType: !458)
!509 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!510 = !DILocalVariable(name: "mesg", scope: !441, file: !2, line: 224, type: !4)
!511 = !DILocalVariable(name: "ut_user", scope: !441, file: !2, line: 236, type: !169)
!512 = !DILocalVariable(name: "pw", scope: !513, file: !2, line: 244, type: !515)
!513 = distinct !DILexicalBlock(scope: !514, file: !2, line: 243, column: 5)
!514 = distinct !DILexicalBlock(scope: !441, file: !2, line: 242, column: 7)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !517, line: 49, size: 384, elements: !518)
!517 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!518 = !{!519, !520, !521, !522, !523, !524, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !516, file: !517, line: 51, baseType: !169, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !516, file: !517, line: 52, baseType: !169, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !516, file: !517, line: 54, baseType: !491, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !516, file: !517, line: 55, baseType: !493, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !516, file: !517, line: 56, baseType: !169, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !516, file: !517, line: 57, baseType: !169, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !516, file: !517, line: 58, baseType: !169, size: 64, offset: 320)
!526 = !DILocalVariable(name: "comma", scope: !527, file: !2, line: 250, type: !529)
!527 = distinct !DILexicalBlock(scope: !528, file: !2, line: 249, column: 9)
!528 = distinct !DILexicalBlock(scope: !513, file: !2, line: 245, column: 11)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!530 = !DILocalVariable(name: "result", scope: !527, file: !2, line: 255, type: !169)
!531 = !DILocalVariable(name: "ut_host", scope: !532, file: !2, line: 282, type: !169)
!532 = distinct !DILexicalBlock(scope: !533, file: !2, line: 281, column: 5)
!533 = distinct !DILexicalBlock(scope: !441, file: !2, line: 280, column: 7)
!534 = !DILocalVariable(name: "display", scope: !532, file: !2, line: 285, type: !169)
!535 = !DILocalVariable(name: "host", scope: !532, file: !2, line: 289, type: !169)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !285, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !19, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !193, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !96, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !19, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "now", scope: !548, file: !2, line: 158, type: !508, isLocal: true, isDefinition: true)
!548 = distinct !DISubprogram(name: "idle_string", scope: !2, file: !2, line: 156, type: !549, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !551)
!549 = !DISubroutineType(types: !550)
!550 = !{!175, !508}
!551 = !{!552, !553, !554, !557, !558}
!552 = !DILocalVariable(name: "when", arg: 1, scope: !548, file: !2, line: 156, type: !508)
!553 = !DILocalVariable(name: "seconds_idle", scope: !548, file: !2, line: 164, type: !508)
!554 = !DILocalVariable(name: "hours", scope: !555, file: !2, line: 169, type: !116)
!555 = distinct !DILexicalBlock(scope: !556, file: !2, line: 168, column: 5)
!556 = distinct !DILexicalBlock(scope: !548, file: !2, line: 167, column: 7)
!557 = !DILocalVariable(name: "minutes", scope: !555, file: !2, line: 170, type: !116)
!558 = !DILocalVariable(name: "days", scope: !559, file: !2, line: 175, type: !560)
!559 = distinct !DILexicalBlock(scope: !556, file: !2, line: 174, column: 5)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !561, line: 101, baseType: !562)
!561 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !252, line: 72, baseType: !253)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "buf", scope: !548, file: !2, line: 159, type: !362, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !19, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !96, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !285, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "buf", scope: !573, file: !2, line: 185, type: !9, isLocal: true, isDefinition: true)
!573 = distinct !DISubprogram(name: "time_string", scope: !2, file: !2, line: 183, type: !574, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!175, !444}
!576 = !{!577, !578}
!577 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !573, file: !2, line: 183, type: !444)
!578 = !DILocalVariable(name: "tmp", scope: !573, file: !2, line: 186, type: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !581, line: 7, size: 448, elements: !582)
!581 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !580, file: !581, line: 9, baseType: !116, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !580, file: !581, line: 10, baseType: !116, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !580, file: !581, line: 11, baseType: !116, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !580, file: !581, line: 12, baseType: !116, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !580, file: !581, line: 13, baseType: !116, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !580, file: !581, line: 14, baseType: !116, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !580, file: !581, line: 15, baseType: !116, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !580, file: !581, line: 16, baseType: !116, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !580, file: !581, line: 17, baseType: !116, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !580, file: !581, line: 20, baseType: !253, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !580, file: !581, line: 21, baseType: !175, size: 64, offset: 384)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !115, line: 952, type: !193, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 13)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !19, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !345, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !285, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 375, type: !193, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 376, type: !19, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !321, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !96, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 9)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !316, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !19, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 1024, elements: !293)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !627, line: 50, size: 256, elements: !628)
!627 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!628 = !{!629, !630, !631, !633}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !627, line: 52, baseType: !175, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !626, file: !627, line: 55, baseType: !116, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !626, file: !627, line: 56, baseType: !632, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !626, file: !627, line: 57, baseType: !116, size: 32, offset: 192)
!634 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!635 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!636 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!637 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!638 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!639 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!640 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!641 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!642 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !645, line: 3, type: !345, isLocal: true, isDefinition: true)
!645 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "Version", scope: !648, file: !645, line: 3, type: !175, isLocal: false, isDefinition: true)
!648 = distinct !DICompileUnit(language: DW_LANG_C11, file: !645, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !649, splitDebugInlining: false, nameTableKind: None)
!649 = !{!643, !646}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "last_cherror", scope: !652, file: !653, line: 28, type: !116, isLocal: true, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C11, file: !653, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-canon-host.o -MD -MP -MF lib/.deps/libcoreutils_a-canon-host.Tpo -c lib/canon-host.c -o lib/.libcoreutils_a-canon-host.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !654, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "lib/canon-host.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b27163e4eb904e69bce9c14960126cc5")
!654 = !{!655, !650}
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "hints", scope: !657, file: !653, line: 63, type: !665, isLocal: true, isDefinition: true)
!657 = distinct !DISubprogram(name: "canon_host_r", scope: !653, file: !653, line: 61, type: !658, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !652, retainedNodes: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{!169, !175, !632}
!660 = !{!661, !662, !663, !686, !687}
!661 = !DILocalVariable(name: "host", arg: 1, scope: !657, file: !653, line: 61, type: !175)
!662 = !DILocalVariable(name: "cherror", arg: 2, scope: !657, file: !653, line: 61, type: !632)
!663 = !DILocalVariable(name: "res", scope: !657, file: !653, line: 66, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !666, line: 565, size: 384, elements: !667)
!666 = !DIFile(filename: "/usr/include/netdb.h", directory: "", checksumkind: CSK_MD5, checksum: "dd84cdc2a8dcb66c232d326e9ca8b469")
!667 = !{!668, !669, !670, !671, !672, !676, !684, !685}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !665, file: !666, line: 567, baseType: !116, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !665, file: !666, line: 568, baseType: !116, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !665, file: !666, line: 569, baseType: !116, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !665, file: !666, line: 570, baseType: !116, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !665, file: !666, line: 571, baseType: !673, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !674, line: 33, baseType: !675)
!674 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !252, line: 210, baseType: !111)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !665, file: !666, line: 572, baseType: !677, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !674, line: 180, size: 128, elements: !679)
!679 = !{!680, !683}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !678, file: !674, line: 182, baseType: !681, size: 16)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !682, line: 28, baseType: !171)
!682 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !678, file: !674, line: 183, baseType: !86, size: 112, offset: 16)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !665, file: !666, line: 573, baseType: !169, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !665, file: !666, line: 574, baseType: !664, size: 64, offset: 320)
!686 = !DILocalVariable(name: "status", scope: !657, file: !653, line: 67, type: !116)
!687 = !DILocalVariable(name: "retval", scope: !657, file: !653, line: 69, type: !169)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "file_name", scope: !690, file: !691, line: 45, type: !175, isLocal: true, isDefinition: true)
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !692, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!692 = !{!693, !695, !697, !699, !688, !701}
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !691, line: 121, type: !316, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !691, line: 121, type: !193, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !691, line: 123, type: !316, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !691, line: 126, type: !305, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !690, file: !691, line: 55, type: !200, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !705, file: !706, line: 66, type: !756, isLocal: false, isDefinition: true)
!705 = distinct !DICompileUnit(language: DW_LANG_C11, file: !706, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !707, globals: !708, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!707 = !{!170, !177}
!708 = !{!709, !711, !735, !737, !739, !741, !703, !743, !745, !747, !749, !754}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !706, line: 272, type: !285, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "old_file_name", scope: !713, file: !706, line: 304, type: !175, isLocal: true, isDefinition: true)
!713 = distinct !DISubprogram(name: "verror_at_line", scope: !706, file: !706, line: 298, type: !714, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !705, retainedNodes: !728)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !116, !116, !175, !111, !175, !716}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !717, line: 52, baseType: !718)
!717 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !719, line: 12, baseType: !720)
!719 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !706, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !722)
!722 = !{!723, !724, !725, !726, !727}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !721, file: !706, baseType: !170, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !721, file: !706, baseType: !170, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !721, file: !706, baseType: !170, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !721, file: !706, baseType: !116, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !721, file: !706, baseType: !116, size: 32, offset: 224)
!728 = !{!729, !730, !731, !732, !733, !734}
!729 = !DILocalVariable(name: "status", arg: 1, scope: !713, file: !706, line: 298, type: !116)
!730 = !DILocalVariable(name: "errnum", arg: 2, scope: !713, file: !706, line: 298, type: !116)
!731 = !DILocalVariable(name: "file_name", arg: 3, scope: !713, file: !706, line: 298, type: !175)
!732 = !DILocalVariable(name: "line_number", arg: 4, scope: !713, file: !706, line: 298, type: !111)
!733 = !DILocalVariable(name: "message", arg: 5, scope: !713, file: !706, line: 298, type: !175)
!734 = !DILocalVariable(name: "args", arg: 6, scope: !713, file: !706, line: 298, type: !716)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "old_line_number", scope: !713, file: !706, line: 305, type: !111, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !706, line: 338, type: !292, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !706, line: 346, type: !321, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !706, line: 346, type: !14, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "error_message_count", scope: !705, file: !706, line: 69, type: !111, isLocal: false, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !705, file: !706, line: 295, type: !116, isLocal: false, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !706, line: 208, type: !316, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !706, line: 208, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 21)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !706, line: 214, type: !285, isLocal: true, isDefinition: true)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null}
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !761, line: 35, type: !14, isLocal: true, isDefinition: true)
!761 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !761, line: 35, type: !19, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "program_name", scope: !766, file: !767, line: 31, type: !175, isLocal: false, isDefinition: true)
!766 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !768, globals: !769, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!768 = !{!170, !169}
!769 = !{!764, !770, !772}
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !767, line: 46, type: !321, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !767, line: 49, type: !292, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "utf07FF", scope: !776, file: !777, line: 46, type: !804, isLocal: true, isDefinition: true)
!776 = distinct !DISubprogram(name: "proper_name_lite", scope: !777, file: !777, line: 38, type: !778, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !780, retainedNodes: !782)
!777 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!778 = !DISubroutineType(types: !779)
!779 = !{!175, !175, !175}
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !781, splitDebugInlining: false, nameTableKind: None)
!781 = !{!774}
!782 = !{!783, !784, !785, !786, !791}
!783 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !776, file: !777, line: 38, type: !175)
!784 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !776, file: !777, line: 38, type: !175)
!785 = !DILocalVariable(name: "translation", scope: !776, file: !777, line: 40, type: !175)
!786 = !DILocalVariable(name: "w", scope: !776, file: !777, line: 47, type: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !788, line: 37, baseType: !789)
!788 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !252, line: 57, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !252, line: 42, baseType: !111)
!791 = !DILocalVariable(name: "mbs", scope: !776, file: !777, line: 48, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !794)
!793 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !796)
!795 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !796, file: !795, line: 15, baseType: !116, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !796, file: !795, line: 20, baseType: !800, size: 32, offset: 32)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !796, file: !795, line: 16, size: 32, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !800, file: !795, line: 18, baseType: !111, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !800, file: !795, line: 19, baseType: !292, size: 32)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 16, elements: !15)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !807, line: 78, type: !321, isLocal: true, isDefinition: true)
!807 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !807, line: 79, type: !19, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !807, line: 80, type: !598, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !807, line: 81, type: !598, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !807, line: 82, type: !274, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !807, line: 83, type: !14, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !807, line: 84, type: !321, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !807, line: 85, type: !316, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !807, line: 86, type: !316, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !807, line: 87, type: !321, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !828, file: !807, line: 76, type: !902, isLocal: false, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !829, retainedTypes: !837, globals: !838, splitDebugInlining: false, nameTableKind: None)
!829 = !{!830, !832, !120}
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !831, line: 42, baseType: !111, size: 32, elements: !144)
!831 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!832 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !831, line: 254, baseType: !111, size: 32, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!835 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!836 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!837 = !{!170, !116, !171, !172}
!838 = !{!805, !808, !810, !812, !814, !816, !818, !820, !822, !824, !826, !839, !843, !853, !855, !860, !862, !864, !866, !868, !891, !898, !900}
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !828, file: !807, line: 92, type: !841, isLocal: false, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 320, elements: !97)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !828, file: !807, line: 1040, type: !845, isLocal: false, isDefinition: true)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !807, line: 56, size: 448, elements: !846)
!846 = !{!847, !848, !849, !851, !852}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !845, file: !807, line: 59, baseType: !830, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !845, file: !807, line: 62, baseType: !116, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !845, file: !807, line: 66, baseType: !850, size: 256, offset: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !322)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !845, file: !807, line: 69, baseType: !175, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !845, file: !807, line: 72, baseType: !175, size: 64, offset: 384)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !828, file: !807, line: 107, type: !845, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "slot0", scope: !828, file: !807, line: 831, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 256)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !807, line: 321, type: !14, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !807, line: 357, type: !14, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !807, line: 358, type: !14, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !807, line: 199, type: !316, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "quote", scope: !870, file: !807, line: 228, type: !889, isLocal: true, isDefinition: true)
!870 = distinct !DISubprogram(name: "gettext_quote", scope: !807, file: !807, line: 197, type: !871, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !828, retainedNodes: !873)
!871 = !DISubroutineType(types: !872)
!872 = !{!175, !175, !830}
!873 = !{!874, !875, !876, !877, !878}
!874 = !DILocalVariable(name: "msgid", arg: 1, scope: !870, file: !807, line: 197, type: !175)
!875 = !DILocalVariable(name: "s", arg: 2, scope: !870, file: !807, line: 197, type: !830)
!876 = !DILocalVariable(name: "translation", scope: !870, file: !807, line: 199, type: !175)
!877 = !DILocalVariable(name: "w", scope: !870, file: !807, line: 229, type: !787)
!878 = !DILocalVariable(name: "mbs", scope: !870, file: !807, line: 230, type: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !881, file: !795, line: 15, baseType: !116, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !881, file: !795, line: 20, baseType: !885, size: 32, offset: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !881, file: !795, line: 16, size: 32, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !885, file: !795, line: 18, baseType: !111, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !885, file: !795, line: 19, baseType: !292, size: 32)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !890)
!890 = !{!16, !294}
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "slotvec", scope: !828, file: !807, line: 834, type: !893, isLocal: true, isDefinition: true)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !807, line: 823, size: 128, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !894, file: !807, line: 825, baseType: !172, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !894, file: !807, line: 826, baseType: !169, size: 64, offset: 64)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "nslots", scope: !828, file: !807, line: 832, type: !116, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "slotvec0", scope: !828, file: !807, line: 833, type: !894, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 704, elements: !904)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!904 = !{!905}
!905 = !DISubrange(count: 11)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !908, line: 347, type: !86, isLocal: true, isDefinition: true)
!908 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !908, line: 398, type: !617, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !908, line: 399, type: !14, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !908, line: 446, type: !316, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !908, line: 447, type: !91, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !919, line: 98, type: !920, isLocal: true, isDefinition: true)
!919 = !DIFile(filename: "lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 29)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !919, line: 99, type: !920, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !919, line: 100, type: !751, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !919, line: 40, type: !598, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !919, line: 40, type: !305, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !933, line: 67, type: !193, isLocal: true, isDefinition: true)
!933 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !933, line: 69, type: !316, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !933, line: 83, type: !316, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !933, line: 83, type: !292, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !933, line: 85, type: !14, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !933, line: 88, type: !944, isLocal: true, isDefinition: true)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 171)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !933, line: 88, type: !949, isLocal: true, isDefinition: true)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 34)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !933, line: 105, type: !188, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !933, line: 109, type: !956, isLocal: true, isDefinition: true)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 23)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !933, line: 113, type: !961, isLocal: true, isDefinition: true)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 28)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !933, line: 120, type: !966, isLocal: true, isDefinition: true)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 32)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !933, line: 127, type: !971, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 36)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !933, line: 134, type: !340, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !933, line: 142, type: !978, isLocal: true, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 44)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !933, line: 150, type: !983, isLocal: true, isDefinition: true)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 48)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !933, line: 159, type: !51, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !933, line: 170, type: !990, isLocal: true, isDefinition: true)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 60)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !933, line: 248, type: !274, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !933, line: 248, type: !362, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !933, line: 254, type: !274, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !933, line: 254, type: !86, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !933, line: 254, type: !340, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !933, line: 259, type: !3, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !933, line: 259, type: !920, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1009, file: !1010, line: 26, type: !1012, isLocal: false, isDefinition: true)
!1009 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1010, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1011, splitDebugInlining: false, nameTableKind: None)
!1010 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1011 = !{!1007}
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 376, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 47)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1017, file: !1018, line: 24, type: !1020, isLocal: false, isDefinition: true)
!1017 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1018, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1019, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1019 = !{!1015}
!1020 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !1023, line: 34, type: !305, isLocal: true, isDefinition: true)
!1023 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !1023, line: 34, type: !316, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !1023, line: 34, type: !183, isLocal: true, isDefinition: true)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(scope: null, file: !1030, line: 108, type: !91, isLocal: true, isDefinition: true)
!1030 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "internal_state", scope: !1033, file: !1030, line: 97, type: !1036, isLocal: true, isDefinition: true)
!1033 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1030, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1034, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!1034 = !{!170, !172, !177}
!1035 = !{!1028, !1031}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !793, line: 6, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !795, line: 21, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 13, size: 64, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1038, file: !795, line: 15, baseType: !116, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1038, file: !795, line: 20, baseType: !1042, size: 32, offset: 32)
!1042 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1038, file: !795, line: 16, size: 32, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1042, file: !795, line: 18, baseType: !111, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1042, file: !795, line: 19, baseType: !292, size: 32)
!1046 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1047, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1048, splitDebugInlining: false, nameTableKind: None)
!1047 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1048 = !{!1049}
!1049 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1050, line: 44, baseType: !111, size: 32, elements: !161)
!1050 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!1051 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1052, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-filenamecat.o -MD -MP -MF lib/.deps/libcoreutils_a-filenamecat.Tpo -c lib/filenamecat.c -o lib/.libcoreutils_a-filenamecat.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1053, splitDebugInlining: false, nameTableKind: None)
!1052 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!1053 = !{!170}
!1054 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1055, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-filenamecat-lgpl.o -MD -MP -MF lib/.deps/libcoreutils_a-filenamecat-lgpl.Tpo -c lib/filenamecat-lgpl.c -o lib/.libcoreutils_a-filenamecat-lgpl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1053, splitDebugInlining: false, nameTableKind: None)
!1055 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!1056 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1057, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1057 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1058 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1059, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-full-write.o -MD -MP -MF lib/.deps/libcoreutils_a-full-write.Tpo -c lib/full-write.c -o lib/.libcoreutils_a-full-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1060, splitDebugInlining: false, nameTableKind: None)
!1059 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!1060 = !{!175}
!1061 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1062, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1062 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1063 = distinct !DICompileUnit(language: DW_LANG_C11, file: !761, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1064, splitDebugInlining: false, nameTableKind: None)
!1064 = !{!759, !762}
