; ModuleID = 'src/pr.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.calendar_month_name = type { ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.COLUMN = type { ptr, ptr, i32, ptr, ptr, i32, i32, i32, i32, i8, i8 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.calendar_date = type { i32, i32, i32, ptr }
%struct.tm_zone = type { ptr, i8, [0 x i8] }
%struct.__locale_struct = type { [13 x ptr], ptr, ptr, ptr, [13 x ptr] }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !0
@.str.1 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [24 x i8] c"/usr/local/share/locale\00", align 1, !dbg !12

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 872, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/pr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "27d8badc8ebadb1bf01f07d9b3f9f5ef")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!5 = !{!6}
!6 = !DISubrange(count: 1)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 873, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 10)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 873, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 24)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "short_options", scope: !19, file: !2, line: 739, type: !888, isLocal: true, isDefinition: true)
!19 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/pr.o -MD -MP -MF src/.deps/pr.Tpo -c src/pr.c -o src/.pr.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !20, retainedTypes: !178, globals: !181, splitDebugInlining: false, nameTableKind: None)
!20 = !{!21, !26, !32, !40, !47, !50, !53, !140, !154, !163}
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 733, baseType: !22, size: 32, elements: !23)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24, !25}
!24 = !DIEnumerator(name: "COLUMNS_OPTION", value: 256)
!25 = !DIEnumerator(name: "PAGES_OPTION", value: 257)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 337, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31}
!30 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!31 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !33, line: 30, baseType: !22, size: 32, elements: !34)
!33 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!36 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!37 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!38 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!39 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 24, baseType: !22, size: 32, elements: !42)
!41 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!44 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!45 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!46 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 536, baseType: !22, size: 32, elements: !48)
!48 = !{!49}
!49 = !DIEnumerator(name: "lines_per_header", value: 5)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 538, baseType: !22, size: 32, elements: !51)
!51 = !{!52}
!52 = !DIEnumerator(name: "lines_per_footer", value: 5)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !54, file: !2, line: 388, baseType: !22, size: 32, elements: !135)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "COLUMN", file: !2, line: 384, size: 512, elements: !55)
!55 = !{!56, !115, !118, !119, !125, !129, !130, !131, !132, !133, !134}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !54, file: !2, line: 386, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 7, baseType: !60)
!59 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!62 = !{!63, !64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !81, !82, !83, !87, !89, !91, !92, !95, !97, !100, !103, !104, !106, !110, !111}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !28, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !65, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !65, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !65, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !65, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !65, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !65, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !65, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !65, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !65, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !65, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !80, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !28, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !28, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !86)
!85 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !88, size: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !90, size: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !3, size: 8, offset: 1048)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !93, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !96, size: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !86)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !98, size: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !101, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !80, size: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !105, size: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !107, size: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 18, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!109 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !28, size: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !112, size: 160, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !2, line: 387, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !54, file: !2, line: 396, baseType: !53, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "print_func", scope: !54, file: !2, line: 399, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !124}
!123 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "char_func", scope: !54, file: !2, line: 402, baseType: !126, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !4}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "current_line", scope: !54, file: !2, line: 404, baseType: !28, size: 32, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lines_stored", scope: !54, file: !2, line: 405, baseType: !28, size: 32, offset: 352)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "lines_to_print", scope: !54, file: !2, line: 406, baseType: !28, size: 32, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "start_position", scope: !54, file: !2, line: 407, baseType: !28, size: 32, offset: 416)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !54, file: !2, line: 408, baseType: !123, size: 8, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "full_page_printed", scope: !54, file: !2, line: 409, baseType: !123, size: 8, offset: 456)
!135 = !{!136, !137, !138, !139}
!136 = !DIEnumerator(name: "OPEN", value: 0)
!137 = !DIEnumerator(name: "FF_FOUND", value: 1)
!138 = !DIEnumerator(name: "ON_HOLD", value: 2)
!139 = !DIEnumerator(name: "CLOSED", value: 3)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !141, line: 42, baseType: !22, size: 32, elements: !142)
!141 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!143 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!144 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!145 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!146 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!147 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!148 = !DIEnumerator(name: "c_quoting_style", value: 5)
!149 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!150 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!151 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!152 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!153 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !155, line: 44, baseType: !22, size: 32, elements: !156)
!155 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!158 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!159 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!160 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!161 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!162 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 46, baseType: !22, size: 32, elements: !165)
!164 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!166 = !DIEnumerator(name: "_ISupper", value: 256)
!167 = !DIEnumerator(name: "_ISlower", value: 512)
!168 = !DIEnumerator(name: "_ISalpha", value: 1024)
!169 = !DIEnumerator(name: "_ISdigit", value: 2048)
!170 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!171 = !DIEnumerator(name: "_ISspace", value: 8192)
!172 = !DIEnumerator(name: "_ISprint", value: 16384)
!173 = !DIEnumerator(name: "_ISgraph", value: 32768)
!174 = !DIEnumerator(name: "_ISblank", value: 1)
!175 = !DIEnumerator(name: "_IScntrl", value: 2)
!176 = !DIEnumerator(name: "_ISpunct", value: 4)
!177 = !DIEnumerator(name: "_ISalnum", value: 8)
!178 = !{!105, !65, !28, !179, !180, !88, !107, !116}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!181 = !{!0, !7, !12, !182, !187, !192, !197, !199, !204, !209, !211, !216, !221, !226, !231, !236, !238, !240, !242, !247, !252, !254, !259, !264, !266, !271, !276, !281, !286, !291, !296, !301, !306, !311, !316, !321, !326, !331, !336, !341, !346, !351, !356, !361, !366, !371, !376, !381, !386, !388, !393, !395, !397, !17, !403, !408, !413, !418, !423, !425, !430, !432, !434, !436, !438, !443, !445, !447, !449, !454, !456, !461, !463, !465, !467, !469, !471, !473, !475, !480, !482, !496, !501, !503, !508, !510, !512, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !583, !585, !587, !589, !594, !596, !598, !600, !602, !604, !606, !608, !610, !614, !616, !618, !620, !693, !695, !697, !699, !701, !703, !707, !709, !711, !713, !718, !720, !722, !724, !726, !728, !730, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !760, !762, !764, !766, !768, !773, !778, !808, !810, !812, !814, !816, !818, !820, !822, !824, !826, !828, !830, !832, !834, !836, !838, !840, !842, !844, !846, !848, !853, !855, !857, !859, !861, !863, !865, !867, !869, !871, !873, !878, !881, !886}
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !2, line: 915, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 50)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 918, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 22)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !2, line: 979, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 41)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 995, type: !194, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 32)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1036, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 45)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1046, type: !206, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1049, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 3)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1049, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 14)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1049, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 13)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1049, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 15)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1063, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 16)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1064, type: !228, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1065, type: !228, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1067, type: !213, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1074, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 59)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1078, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 61)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1150, type: !228, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2762, type: !256, isLocal: true, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 39)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2765, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 33)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2770, type: !206, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2777, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 952, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 119)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2781, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1264, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 158)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2786, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 712, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 89)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2790, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 704, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 88)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2794, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 55)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2798, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 544, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 68)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2802, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 100)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2806, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1432, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 179)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2812, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1128, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 141)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2817, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 856, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 107)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2821, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1160, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 145)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2826, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1496, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 187)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2832, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1088, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 136)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2837, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1376, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 172)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2842, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 131)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2847, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1152, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 144)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2852, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 616, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 77)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2856, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2224, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 278)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2863, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1624, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 203)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2869, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 728, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 91)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2873, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1064, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 133)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2878, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 64)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2882, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1208, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 151)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2887, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1456, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 182)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2893, type: !184, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2894, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 62)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "custom_header", scope: !19, file: !2, line: 708, type: !65, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "date_format", scope: !19, file: !2, line: 711, type: !116, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "localtz", scope: !19, file: !2, line: 714, type: !399, isLocal: true, isDefinition: true)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !400, line: 1039, baseType: !401)
!400 = !DIFile(filename: "./lib/time.h", directory: "/src")
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !400, line: 1039, flags: DIFlagFwdDecl)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !2, line: 744, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 6)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 745, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 8)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 746, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 7)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !2, line: 747, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 19)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 748, type: !223, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 749, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 12)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 750, type: !427, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 751, type: !9, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !2, line: 752, type: !415, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 753, type: !427, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 754, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 11)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !2, line: 755, type: !415, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !2, line: 756, type: !405, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !2, line: 757, type: !223, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 758, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 18)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 759, type: !415, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !2, line: 760, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 17)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !2, line: 761, type: !9, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 762, type: !440, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 763, type: !427, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !2, line: 764, type: !233, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !2, line: 765, type: !458, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !2, line: 766, type: !405, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !2, line: 767, type: !440, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !2, line: 768, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 5)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !2, line: 769, type: !410, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "long_options", scope: !19, file: !2, line: 742, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 6912, elements: !494)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !487, line: 50, size: 256, elements: !488)
!487 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!488 = !{!489, !490, !491, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !487, line: 52, baseType: !116, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !486, file: !487, line: 55, baseType: !28, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !486, file: !487, line: 56, baseType: !492, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !486, file: !487, line: 57, baseType: !28, size: 32, offset: 192)
!494 = !{!495}
!495 = !DISubrange(count: 27)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "first_page_number", scope: !19, file: !2, line: 611, type: !498, isLocal: true, isDefinition: true)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !499, line: 102, baseType: !500)
!499 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !85, line: 73, baseType: !109)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "last_page_number", scope: !19, file: !2, line: 612, type: !498, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !2, line: 840, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 26)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "columns", scope: !19, file: !2, line: 607, type: !28, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "print_across_flag", scope: !19, file: !2, line: 520, type: !123, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "storing_columns", scope: !19, file: !2, line: 523, type: !123, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "balance_columns", scope: !19, file: !2, line: 529, type: !123, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "use_cntrl_prefix", scope: !19, file: !2, line: 671, type: !123, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "double_space", scope: !19, file: !2, line: 674, type: !123, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "input_tab_char", scope: !19, file: !2, line: 559, type: !4, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "chars_per_input_tab", scope: !19, file: !2, line: 563, type: !28, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "untabify_input", scope: !19, file: !2, line: 556, type: !123, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "use_form_feed", scope: !19, file: !2, line: 514, type: !123, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "output_tab_char", scope: !19, file: !2, line: 569, type: !4, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "chars_per_output_tab", scope: !19, file: !2, line: 572, type: !28, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "tabify_output", scope: !19, file: !2, line: 566, type: !123, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "join_lines", scope: !19, file: !2, line: 549, type: !123, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "lines_per_page", scope: !19, file: !2, line: 532, type: !28, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "parallel_files", scope: !19, file: !2, line: 479, type: !123, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "numbered_lines", scope: !19, file: !2, line: 636, type: !123, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "number_separator", scope: !19, file: !2, line: 639, type: !4, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "chars_per_number", scope: !19, file: !2, line: 655, type: !28, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "skip_count", scope: !19, file: !2, line: 648, type: !123, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "start_line_num", scope: !19, file: !2, line: 652, type: !28, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "chars_per_margin", scope: !19, file: !2, line: 580, type: !28, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "ignore_failed_opens", scope: !19, file: !2, line: 681, type: !123, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "use_col_separator", scope: !19, file: !2, line: 685, type: !123, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 776, type: !458, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "col_sep_string", scope: !19, file: !2, line: 690, type: !116, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "col_sep_length", scope: !19, file: !2, line: 691, type: !28, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "extremities", scope: !19, file: !2, line: 502, type: !123, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "keep_FF", scope: !19, file: !2, line: 506, type: !123, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "use_esc_sequence", scope: !19, file: !2, line: 667, type: !123, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "truncate_lines", scope: !19, file: !2, line: 545, type: !123, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "chars_per_line", scope: !19, file: !2, line: 542, type: !28, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "explicit_columns", scope: !19, file: !2, line: 499, type: !123, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !19, file: !2, line: 517, type: !123, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "failed_opens", scope: !19, file: !2, line: 596, type: !123, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1174, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 28)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1193, type: !249, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1298, type: !189, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "lines_per_body", scope: !19, file: !2, line: 537, type: !28, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !2, line: 693, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 2)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "line_separator", scope: !19, file: !2, line: 693, type: !65, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 692, type: !591, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "column_separator", scope: !19, file: !2, line: 692, type: !65, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "number_width", scope: !19, file: !2, line: 660, type: !28, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "chars_per_column", scope: !19, file: !2, line: 553, type: !28, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "number_buff", scope: !19, file: !2, line: 663, type: !65, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "clump_buff", scope: !19, file: !2, line: 723, type: !65, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "total_files", scope: !19, file: !2, line: 678, type: !28, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "column_vector", scope: !19, file: !2, line: 449, type: !612, isLocal: true, isDefinition: true)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLUMN", file: !2, line: 417, baseType: !54)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1485, type: !591, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1494, type: !591, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1500, type: !213, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "timespec", scope: !622, file: !2, line: 1662, type: !654, isLocal: true, isDefinition: true)
!622 = distinct !DISubprogram(name: "init_header", scope: !2, file: !2, line: 1647, type: !623, scopeLine: 1648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !625)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !116, !28}
!625 = !{!626, !627, !628, !629, !665, !666, !667, !682, !687}
!626 = !DILocalVariable(name: "filename", arg: 1, scope: !622, file: !2, line: 1647, type: !116)
!627 = !DILocalVariable(name: "desc", arg: 2, scope: !622, file: !2, line: 1647, type: !28)
!628 = !DILocalVariable(name: "buf", scope: !622, file: !2, line: 1649, type: !65)
!629 = !DILocalVariable(name: "st", scope: !622, file: !2, line: 1650, type: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !631, line: 44, size: 1024, elements: !632)
!631 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!632 = !{!633, !635, !637, !639, !641, !643, !645, !646, !647, !648, !650, !651, !653, !661, !662, !663}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !630, file: !631, line: 46, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !109)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !630, file: !631, line: 47, baseType: !636, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !109)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !630, file: !631, line: 48, baseType: !638, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !22)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !630, file: !631, line: 49, baseType: !640, size: 32, offset: 160)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !22)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !630, file: !631, line: 50, baseType: !642, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !22)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !630, file: !631, line: 51, baseType: !644, size: 32, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !22)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !630, file: !631, line: 52, baseType: !634, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !630, file: !631, line: 53, baseType: !634, size: 64, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !630, file: !631, line: 54, baseType: !84, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !630, file: !631, line: 55, baseType: !649, size: 32, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !28)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !630, file: !631, line: 56, baseType: !28, size: 32, offset: 480)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !630, file: !631, line: 57, baseType: !652, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !86)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !630, file: !631, line: 65, baseType: !654, size: 128, offset: 576)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !655, line: 11, size: 128, elements: !656)
!655 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!656 = !{!657, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !654, file: !655, line: 16, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !86)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !654, file: !655, line: 21, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !86)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !630, file: !631, line: 66, baseType: !654, size: 128, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !630, file: !631, line: 67, baseType: !654, size: 128, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !630, file: !631, line: 79, baseType: !664, size: 64, offset: 960)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !592)
!665 = !DILocalVariable(name: "t", scope: !622, file: !2, line: 1651, type: !654)
!666 = !DILocalVariable(name: "ns", scope: !622, file: !2, line: 1652, type: !28)
!667 = !DILocalVariable(name: "tm", scope: !622, file: !2, line: 1653, type: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !669, line: 7, size: 448, elements: !670)
!669 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !668, file: !669, line: 9, baseType: !28, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !668, file: !669, line: 10, baseType: !28, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !668, file: !669, line: 11, baseType: !28, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !668, file: !669, line: 12, baseType: !28, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !668, file: !669, line: 13, baseType: !28, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !668, file: !669, line: 14, baseType: !28, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !668, file: !669, line: 15, baseType: !28, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !668, file: !669, line: 16, baseType: !28, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !668, file: !669, line: 17, baseType: !28, size: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !668, file: !669, line: 20, baseType: !86, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !668, file: !669, line: 21, baseType: !116, size: 64, offset: 384)
!682 = !DILocalVariable(name: "len", scope: !683, file: !2, line: 1671, type: !685)
!683 = distinct !DILexicalBlock(scope: !684, file: !2, line: 1670, column: 5)
!684 = distinct !DILexicalBlock(scope: !622, file: !2, line: 1669, column: 7)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !686, line: 18, baseType: !86)
!686 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!687 = !DILocalVariable(name: "secbuf", scope: !688, file: !2, line: 1681, type: !690)
!688 = distinct !DILexicalBlock(scope: !689, file: !2, line: 1680, column: 5)
!689 = distinct !DILexicalBlock(scope: !622, file: !2, line: 1679, column: 7)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 21)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1683, type: !410, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "date_text", scope: !19, file: !2, line: 717, type: !65, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "file_text", scope: !19, file: !2, line: 718, type: !116, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "header_width_available", scope: !19, file: !2, line: 721, type: !28, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "files_ready_to_read", scope: !19, file: !2, line: 615, type: !28, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "buff_allocated", scope: !19, file: !2, line: 463, type: !705, isLocal: true, isDefinition: true)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !706, line: 130, baseType: !685)
!706 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "line_vector", scope: !19, file: !2, line: 469, type: !492, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "end_vector", scope: !19, file: !2, line: 476, type: !492, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "buff", scope: !19, file: !2, line: 455, type: !65, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2367, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 48)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "last_line", scope: !19, file: !2, line: 729, type: !123, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "page_number", scope: !19, file: !2, line: 618, type: !498, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "buff_current", scope: !19, file: !2, line: 459, type: !22, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "pad_vertically", scope: !19, file: !2, line: 705, type: !123, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "print_a_header", scope: !19, file: !2, line: 511, type: !123, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2394, type: !690, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2399, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 9)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2405, type: !690, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "padding_not_printed", scope: !19, file: !2, line: 701, type: !28, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "separators_not_printed", scope: !19, file: !2, line: 697, type: !28, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "spaces_not_printed", scope: !19, file: !2, line: 577, type: !28, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "output_position", scope: !19, file: !2, line: 586, type: !28, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "input_position", scope: !19, file: !2, line: 592, type: !28, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "FF_only", scope: !19, file: !2, line: 494, type: !123, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "print_a_FF", scope: !19, file: !2, line: 507, type: !123, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2683, type: !477, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "align_empty_cols", scope: !19, file: !2, line: 483, type: !123, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2044, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 4)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "empty_line", scope: !19, file: !2, line: 487, type: !123, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !27, line: 952, type: !427, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "line_count", scope: !19, file: !2, line: 643, type: !28, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "line_number", scope: !19, file: !2, line: 633, type: !28, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !27, line: 729, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 56)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !27, line: 736, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 75)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !780, file: !27, line: 575, type: !28, isLocal: true, isDefinition: true)
!780 = distinct !DISubprogram(name: "oputs_", scope: !27, file: !27, line: 573, type: !781, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !783)
!781 = !DISubroutineType(cc: DW_CC_nocall, types: !782)
!782 = !{null, !116, !116}
!783 = !{!784, !785, !786, !789, !790, !791, !792, !796, !797, !798, !799, !801, !802, !803, !804, !806, !807}
!784 = !DILocalVariable(name: "program", arg: 1, scope: !780, file: !27, line: 573, type: !116)
!785 = !DILocalVariable(name: "option", arg: 2, scope: !780, file: !27, line: 573, type: !116)
!786 = !DILocalVariable(name: "term", scope: !787, file: !27, line: 585, type: !116)
!787 = distinct !DILexicalBlock(scope: !788, file: !27, line: 582, column: 5)
!788 = distinct !DILexicalBlock(scope: !780, file: !27, line: 581, column: 7)
!789 = !DILocalVariable(name: "double_space", scope: !780, file: !27, line: 594, type: !123)
!790 = !DILocalVariable(name: "first_word", scope: !780, file: !27, line: 595, type: !116)
!791 = !DILocalVariable(name: "option_text", scope: !780, file: !27, line: 596, type: !116)
!792 = !DILocalVariable(name: "s", scope: !793, file: !27, line: 608, type: !116)
!793 = distinct !DILexicalBlock(scope: !794, file: !27, line: 605, column: 5)
!794 = distinct !DILexicalBlock(scope: !795, file: !27, line: 604, column: 12)
!795 = distinct !DILexicalBlock(scope: !780, file: !27, line: 597, column: 7)
!796 = !DILocalVariable(name: "spaces", scope: !793, file: !27, line: 609, type: !107)
!797 = !DILocalVariable(name: "anchor_len", scope: !780, file: !27, line: 620, type: !107)
!798 = !DILocalVariable(name: "desc_text", scope: !780, file: !27, line: 625, type: !116)
!799 = !DILocalVariable(name: "__ptr", scope: !800, file: !27, line: 644, type: !116)
!800 = distinct !DILexicalBlock(scope: !780, file: !27, line: 644, column: 3)
!801 = !DILocalVariable(name: "__stream", scope: !800, file: !27, line: 644, type: !57)
!802 = !DILocalVariable(name: "__cnt", scope: !800, file: !27, line: 644, type: !107)
!803 = !DILocalVariable(name: "url_program", scope: !780, file: !27, line: 648, type: !116)
!804 = !DILocalVariable(name: "__ptr", scope: !805, file: !27, line: 686, type: !116)
!805 = distinct !DILexicalBlock(scope: !780, file: !27, line: 686, column: 3)
!806 = !DILocalVariable(name: "__stream", scope: !805, file: !27, line: 686, type: !57)
!807 = !DILocalVariable(name: "__cnt", scope: !805, file: !27, line: 686, type: !107)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !27, line: 585, type: !477, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !27, line: 586, type: !477, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !27, line: 595, type: !757, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !27, line: 620, type: !405, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !27, line: 648, type: !591, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !27, line: 648, type: !477, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !27, line: 649, type: !757, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !27, line: 649, type: !213, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !27, line: 650, type: !477, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !27, line: 651, type: !405, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !27, line: 651, type: !405, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !27, line: 652, type: !415, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !27, line: 653, type: !410, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !27, line: 654, type: !9, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !27, line: 655, type: !9, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !27, line: 656, type: !9, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !27, line: 657, type: !9, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !27, line: 663, type: !415, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !27, line: 664, type: !9, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !27, line: 669, type: !458, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !27, line: 669, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 40)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !27, line: 676, type: !228, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !27, line: 676, type: !249, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !27, line: 679, type: !213, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !27, line: 683, type: !477, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !27, line: 688, type: !477, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !27, line: 691, type: !410, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !27, line: 839, type: !233, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !27, line: 840, type: !189, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !27, line: 841, type: !228, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !27, line: 862, type: !757, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !27, line: 868, type: !875, isLocal: true, isDefinition: true)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 71)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !27, line: 875, type: !880, isLocal: true, isDefinition: true)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !494)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !27, line: 877, type: !883, isLocal: true, isDefinition: true)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 51)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !27, line: 877, type: !427, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 424, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 53)
!891 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!892 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!893 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!894 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!895 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!896 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!897 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!898 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!899 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!900 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!901 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!902 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!903 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!904 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!905 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!906 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!907 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!908 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!909 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!910 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!911 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!912 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!913 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!914 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!915 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!916 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!917 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !920, line: 3, type: !228, isLocal: true, isDefinition: true)
!920 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "Version", scope: !923, file: !920, line: 3, type: !116, isLocal: false, isDefinition: true)
!923 = distinct !DICompileUnit(language: DW_LANG_C11, file: !920, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !924, splitDebugInlining: false, nameTableKind: None)
!924 = !{!918, !921}
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "file_name", scope: !927, file: !928, line: 45, type: !116, isLocal: true, isDefinition: true)
!927 = distinct !DICompileUnit(language: DW_LANG_C11, file: !928, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !929, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!929 = !{!930, !932, !934, !936, !925, !938}
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !928, line: 121, type: !415, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !928, line: 121, type: !427, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !928, line: 123, type: !415, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !928, line: 126, type: !213, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !927, file: !928, line: 55, type: !123, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !942, file: !943, line: 66, type: !990, isLocal: false, isDefinition: true)
!942 = distinct !DICompileUnit(language: DW_LANG_C11, file: !943, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !944, globals: !945, splitDebugInlining: false, nameTableKind: None)
!943 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!944 = !{!105, !180}
!945 = !{!946, !948, !972, !974, !976, !978, !940, !980, !982, !984, !986, !988}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !943, line: 272, type: !477, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "old_file_name", scope: !950, file: !943, line: 304, type: !116, isLocal: true, isDefinition: true)
!950 = distinct !DISubprogram(name: "verror_at_line", scope: !943, file: !943, line: 298, type: !951, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !942, retainedNodes: !965)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !28, !28, !116, !22, !116, !953}
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !954, line: 52, baseType: !955)
!954 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !956, line: 12, baseType: !957)
!956 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !943, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !959)
!959 = !{!960, !961, !962, !963, !964}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !958, file: !943, baseType: !105, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !958, file: !943, baseType: !105, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !958, file: !943, baseType: !105, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !958, file: !943, baseType: !28, size: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !958, file: !943, baseType: !28, size: 32, offset: 224)
!965 = !{!966, !967, !968, !969, !970, !971}
!966 = !DILocalVariable(name: "status", arg: 1, scope: !950, file: !943, line: 298, type: !28)
!967 = !DILocalVariable(name: "errnum", arg: 2, scope: !950, file: !943, line: 298, type: !28)
!968 = !DILocalVariable(name: "file_name", arg: 3, scope: !950, file: !943, line: 298, type: !116)
!969 = !DILocalVariable(name: "line_number", arg: 4, scope: !950, file: !943, line: 298, type: !22)
!970 = !DILocalVariable(name: "message", arg: 5, scope: !950, file: !943, line: 298, type: !116)
!971 = !DILocalVariable(name: "args", arg: 6, scope: !950, file: !943, line: 298, type: !953)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "old_line_number", scope: !950, file: !943, line: 305, type: !22, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !943, line: 338, type: !757, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !943, line: 346, type: !410, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !943, line: 346, type: !591, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "error_message_count", scope: !942, file: !943, line: 69, type: !22, isLocal: false, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !942, file: !943, line: 295, type: !28, isLocal: false, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !943, line: 208, type: !415, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !943, line: 208, type: !690, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !943, line: 214, type: !477, isLocal: true, isDefinition: true)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{null}
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !995, line: 35, type: !591, isLocal: true, isDefinition: true)
!995 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !995, line: 35, type: !405, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 1143, type: !405, isLocal: true, isDefinition: true)
!1000 = !DIFile(filename: "lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 1146, type: !410, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 1149, type: !405, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !1007, file: !1038, line: 75, type: !1107, isLocal: true, isDefinition: true)
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1008, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-nstrftime.o -MD -MP -MF lib/.deps/libcoreutils_a-nstrftime.Tpo -c lib/nstrftime.c -o lib/.libcoreutils_a-nstrftime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1009, retainedTypes: !1017, globals: !1031, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/nstrftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1a46cf0b441bf81ebaa8e46decf753ed")
!1009 = !{!1010}
!1010 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !1000, line: 163, baseType: !22, size: 32, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016}
!1012 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!1013 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!1014 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!1015 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!1016 = !DIEnumerator(name: "NO_PAD", value: 4)
!1017 = !{!105, !22, !1018, !107, !28, !180, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !400, line: 1039, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1023, line: 24, size: 128, elements: !1024)
!1023 = !DIFile(filename: "lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !1023, line: 28, baseType: !1021, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1022, file: !1023, line: 33, baseType: !4, size: 8, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1022, file: !1023, line: 45, baseType: !1028, offset: 72)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: -1)
!1031 = !{!998, !1001, !1003, !1032, !1034, !1036, !1005, !1039, !1041, !1043, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1093, !1102, !1105, !1124, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1140, !1142, !1144, !1146, !1148, !1151, !1154, !1156, !1158, !1160, !1162, !1164, !1166, !1168, !1170, !1172, !1174, !1176, !1178, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1194, !1196, !1198, !1200, !1202, !1205, !1207, !1209, !1211}
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 1151, type: !405, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 1153, type: !405, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 78, type: !732, isLocal: true, isDefinition: true)
!1038 = !DIFile(filename: "lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 26, type: !420, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 26, type: !732, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 27, type: !1045, isLocal: true, isDefinition: true)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 31)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 27, type: !732, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 28, type: !420, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 28, type: !427, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 29, type: !420, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 29, type: !427, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 30, type: !189, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 30, type: !732, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 31, type: !1064, isLocal: true, isDefinition: true)
