; ModuleID = 'src/printf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.12 }
%union.anon.12 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s FORMAT [ARGUMENT]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [73 x i8] c"Print ARGUMENT(s) according to FORMAT, or execute according to OPTION:\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"printf\00", align 1, !dbg !17

!117 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!118 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !123, !125, !127, !132, !134, !139, !141, !146, !77, !148, !232, !237, !239, !244, !249, !254, !256, !258, !260, !262, !264, !266, !268, !273, !275, !277, !279, !281, !286, !291, !296, !301, !303, !305, !307, !309, !311, !316, !318, !320, !325, !330, !335, !340, !342, !344, !346, !348, !351, !356, !358, !363, !365, !367, !372, !374}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 709, type: !19, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 712, type: !64, isLocal: true, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 14)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !74, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 730, type: !74, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 747, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 53)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "exit_status", scope: !79, file: !2, line: 36, type: !114, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !150, file: !151, line: 575, type: !114, isLocal: true, isDefinition: true)
!150 = distinct !DISubprogram(name: "oputs_", scope: !151, file: !151, line: 573, type: !152, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !154)
!151 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!152 = !DISubroutineType(cc: DW_CC_nocall, types: !153)
!153 = !{null, !119, !119}
!154 = !{!155, !156, !157, !160, !162, !163, !164, !168, !169, !170, !171, !173, !226, !227, !228, !230, !231}
!155 = !DILocalVariable(name: "program", arg: 1, scope: !150, file: !151, line: 573, type: !119)
!156 = !DILocalVariable(name: "option", arg: 2, scope: !150, file: !151, line: 573, type: !119)
!157 = !DILocalVariable(name: "term", scope: !158, file: !151, line: 585, type: !119)
!158 = distinct !DILexicalBlock(scope: !159, file: !151, line: 582, column: 5)
!159 = distinct !DILexicalBlock(scope: !150, file: !151, line: 581, column: 7)
!160 = !DILocalVariable(name: "double_space", scope: !150, file: !151, line: 594, type: !161)
!161 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!162 = !DILocalVariable(name: "first_word", scope: !150, file: !151, line: 595, type: !119)
!163 = !DILocalVariable(name: "option_text", scope: !150, file: !151, line: 596, type: !119)
!164 = !DILocalVariable(name: "s", scope: !165, file: !151, line: 608, type: !119)
!165 = distinct !DILexicalBlock(scope: !166, file: !151, line: 605, column: 5)
!166 = distinct !DILexicalBlock(scope: !167, file: !151, line: 604, column: 12)
!167 = distinct !DILexicalBlock(scope: !150, file: !151, line: 597, column: 7)
!168 = !DILocalVariable(name: "spaces", scope: !165, file: !151, line: 609, type: !116)
!169 = !DILocalVariable(name: "anchor_len", scope: !150, file: !151, line: 620, type: !116)
!170 = !DILocalVariable(name: "desc_text", scope: !150, file: !151, line: 625, type: !119)
!171 = !DILocalVariable(name: "__ptr", scope: !172, file: !151, line: 644, type: !119)
!172 = distinct !DILexicalBlock(scope: !150, file: !151, line: 644, column: 3)
!173 = !DILocalVariable(name: "__stream", scope: !172, file: !151, line: 644, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !177)
!176 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !179)
!178 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !195, !197, !198, !199, !203, !204, !206, !207, !210, !212, !215, !218, !219, !220, !221, !222}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !178, line: 51, baseType: !114, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !178, line: 36, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !178, line: 70, baseType: !196, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !201, line: 152, baseType: !202)
!201 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!202 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !178, line: 43, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !201, line: 153, baseType: !202)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !178, line: 37, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !178, line: 38, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !178, line: 93, baseType: !196, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 20)
!226 = !DILocalVariable(name: "__cnt", scope: !172, file: !151, line: 644, type: !116)
!227 = !DILocalVariable(name: "url_program", scope: !150, file: !151, line: 648, type: !119)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !151, line: 686, type: !119)
!229 = distinct !DILexicalBlock(scope: !150, file: !151, line: 686, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !151, line: 686, type: !174)
!231 = !DILocalVariable(name: "__cnt", scope: !229, file: !151, line: 686, type: !116)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !151, line: 585, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 5)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !151, line: 586, type: !234, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !151, line: 595, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 4)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !151, line: 620, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 6)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !151, line: 648, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !151, line: 648, type: !234, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !151, line: 649, type: !241, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !151, line: 649, type: !136, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !151, line: 650, type: !234, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !151, line: 651, type: !246, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !151, line: 651, type: !246, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !151, line: 652, type: !19, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !151, line: 653, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !151, line: 654, type: !64, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !151, line: 655, type: !64, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !151, line: 656, type: !64, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !151, line: 657, type: !64, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !151, line: 669, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 17)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !151, line: 669, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 40)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !151, line: 676, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 15)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !151, line: 676, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 61)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !151, line: 679, type: !136, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !151, line: 683, type: !234, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !151, line: 688, type: !234, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !151, line: 691, type: !270, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !151, line: 839, type: !74, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !151, line: 840, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 22)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !151, line: 841, type: !293, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !151, line: 862, type: !241, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !151, line: 868, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 71)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !151, line: 875, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 27)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !151, line: 877, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 51)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !151, line: 877, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 12)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !69, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 638, type: !313, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 662, type: !3, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !14, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !79, file: !2, line: 43, type: !350, isLocal: true, isDefinition: true)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 29)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !136, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 35)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !251, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !251, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 37)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 246, type: !337, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 41)
!379 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !382, line: 3, type: !293, isLocal: true, isDefinition: true)
!382 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "Version", scope: !385, file: !382, line: 3, type: !119, isLocal: false, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C11, file: !382, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !386, splitDebugInlining: false, nameTableKind: None)
!386 = !{!380, !383}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "file_name", scope: !389, file: !390, line: 45, type: !119, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !390, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!391 = !{!392, !394, !396, !398, !387, !400}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !19, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !337, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !390, line: 123, type: !19, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !390, line: 126, type: !136, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !389, file: !390, line: 55, type: !161, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !404, file: !405, line: 66, type: !455, isLocal: false, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C11, file: !405, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!406 = !{!112, !121}
!407 = !{!408, !410, !434, !436, !438, !440, !402, !442, !444, !446, !448, !453}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !405, line: 272, type: !234, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "old_file_name", scope: !412, file: !405, line: 304, type: !119, isLocal: true, isDefinition: true)
!412 = distinct !DISubprogram(name: "verror_at_line", scope: !405, file: !405, line: 298, type: !413, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !427)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !114, !114, !119, !83, !119, !415}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !416, line: 52, baseType: !417)
!416 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !418, line: 12, baseType: !419)
!418 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !405, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !421)
!421 = !{!422, !423, !424, !425, !426}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !420, file: !405, baseType: !112, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !420, file: !405, baseType: !112, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !420, file: !405, baseType: !112, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !420, file: !405, baseType: !114, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !420, file: !405, baseType: !114, size: 32, offset: 224)
!427 = !{!428, !429, !430, !431, !432, !433}
!428 = !DILocalVariable(name: "status", arg: 1, scope: !412, file: !405, line: 298, type: !114)
!429 = !DILocalVariable(name: "errnum", arg: 2, scope: !412, file: !405, line: 298, type: !114)
!430 = !DILocalVariable(name: "file_name", arg: 3, scope: !412, file: !405, line: 298, type: !119)
!431 = !DILocalVariable(name: "line_number", arg: 4, scope: !412, file: !405, line: 298, type: !83)
!432 = !DILocalVariable(name: "message", arg: 5, scope: !412, file: !405, line: 298, type: !119)
!433 = !DILocalVariable(name: "args", arg: 6, scope: !412, file: !405, line: 298, type: !415)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "old_line_number", scope: !412, file: !405, line: 305, type: !83, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !405, line: 338, type: !241, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !270, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !251, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "error_message_count", scope: !404, file: !405, line: 69, type: !83, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !404, file: !405, line: 295, type: !114, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !19, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 21)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !405, line: 214, type: !234, isLocal: true, isDefinition: true)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "program_name", scope: !460, file: !461, line: 31, type: !119, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !461, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !462, globals: !463, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!462 = !{!112, !113}
!463 = !{!458, !464, !466}
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !461, line: 46, type: !270, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !461, line: 49, type: !241, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "utf07FF", scope: !470, file: !471, line: 46, type: !498, isLocal: true, isDefinition: true)
!470 = distinct !DISubprogram(name: "proper_name_lite", scope: !471, file: !471, line: 38, type: !472, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !474, retainedNodes: !476)
!471 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!472 = !DISubroutineType(types: !473)
!473 = !{!119, !119, !119}
!474 = distinct !DICompileUnit(language: DW_LANG_C11, file: !471, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !475, splitDebugInlining: false, nameTableKind: None)
!475 = !{!468}
!476 = !{!477, !478, !479, !480, !485}
!477 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !470, file: !471, line: 38, type: !119)
!478 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !470, file: !471, line: 38, type: !119)
!479 = !DILocalVariable(name: "translation", scope: !470, file: !471, line: 40, type: !119)
!480 = !DILocalVariable(name: "w", scope: !470, file: !471, line: 47, type: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !482, line: 37, baseType: !483)
!482 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !201, line: 57, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !201, line: 42, baseType: !83)
!485 = !DILocalVariable(name: "mbs", scope: !470, file: !471, line: 48, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !487, line: 6, baseType: !488)
!487 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !489, line: 21, baseType: !490)
!489 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 13, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !490, file: !489, line: 15, baseType: !114, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !490, file: !489, line: 20, baseType: !494, size: 32, offset: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !489, line: 16, size: 32, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !494, file: !489, line: 18, baseType: !83, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !494, file: !489, line: 19, baseType: !241, size: 32)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 16, elements: !252)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !501, line: 78, type: !270, isLocal: true, isDefinition: true)
!501 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !501, line: 79, type: !246, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !501, line: 80, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 13)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !501, line: 81, type: !506, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !501, line: 82, type: !223, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !501, line: 83, type: !251, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !501, line: 84, type: !270, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !501, line: 85, type: !19, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !501, line: 86, type: !19, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !501, line: 87, type: !270, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !525, file: !501, line: 76, type: !599, isLocal: false, isDefinition: true)
!525 = distinct !DICompileUnit(language: DW_LANG_C11, file: !501, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !526, retainedTypes: !534, globals: !535, splitDebugInlining: false, nameTableKind: None)
!526 = !{!527, !529, !81}
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !528, line: 42, baseType: !83, size: 32, elements: !99)
!528 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !528, line: 254, baseType: !83, size: 32, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!532 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!533 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!534 = !{!112, !114, !115, !116}
!535 = !{!499, !502, !504, !509, !511, !513, !515, !517, !519, !521, !523, !536, !540, !550, !552, !557, !559, !561, !563, !565, !588, !595, !597}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !525, file: !501, line: 92, type: !538, isLocal: false, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 320, elements: !65)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !525, file: !501, line: 1040, type: !542, isLocal: false, isDefinition: true)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !501, line: 56, size: 448, elements: !543)
!543 = !{!544, !545, !546, !548, !549}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !542, file: !501, line: 59, baseType: !527, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !542, file: !501, line: 62, baseType: !114, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !542, file: !501, line: 66, baseType: !547, size: 256, offset: 64)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !271)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !542, file: !501, line: 69, baseType: !119, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !542, file: !501, line: 72, baseType: !119, size: 64, offset: 384)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !525, file: !501, line: 107, type: !542, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "slot0", scope: !525, file: !501, line: 831, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 256)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !501, line: 321, type: !251, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !501, line: 357, type: !251, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !501, line: 358, type: !251, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !501, line: 199, type: !19, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "quote", scope: !567, file: !501, line: 228, type: !586, isLocal: true, isDefinition: true)
!567 = distinct !DISubprogram(name: "gettext_quote", scope: !501, file: !501, line: 197, type: !568, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !525, retainedNodes: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!119, !119, !527}
!570 = !{!571, !572, !573, !574, !575}
!571 = !DILocalVariable(name: "msgid", arg: 1, scope: !567, file: !501, line: 197, type: !119)
!572 = !DILocalVariable(name: "s", arg: 2, scope: !567, file: !501, line: 197, type: !527)
!573 = !DILocalVariable(name: "translation", scope: !567, file: !501, line: 199, type: !119)
!574 = !DILocalVariable(name: "w", scope: !567, file: !501, line: 229, type: !481)
!575 = !DILocalVariable(name: "mbs", scope: !567, file: !501, line: 230, type: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !487, line: 6, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !489, line: 21, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 13, size: 64, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !578, file: !489, line: 15, baseType: !114, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !578, file: !489, line: 20, baseType: !582, size: 32, offset: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !578, file: !489, line: 16, size: 32, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !582, file: !489, line: 18, baseType: !83, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !582, file: !489, line: 19, baseType: !241, size: 32)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !587)
!587 = !{!253, !243}
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "slotvec", scope: !525, file: !501, line: 834, type: !590, isLocal: true, isDefinition: true)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !501, line: 823, size: 128, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !591, file: !501, line: 825, baseType: !116, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !591, file: !501, line: 826, baseType: !113, size: 64, offset: 64)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "nslots", scope: !525, file: !501, line: 832, type: !114, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "slotvec0", scope: !525, file: !501, line: 833, type: !591, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 704, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 11)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!603 = distinct !DIGlobalVariable(name: "initialized", scope: !604, file: !605, line: 71, type: !114, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "unicode_to_mb", scope: !605, file: !605, line: 64, type: !606, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !687)
!605 = !DIFile(filename: "lib/unicodeio.c", directory: "/src", checksumkind: CSK_MD5, checksum: "34bd73d3f6fd35e045c925e67e34cd2b")
!606 = !DISubroutineType(types: !607)
!607 = !{!202, !83, !608, !611, !112}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!202, !119, !116, !112}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!202, !83, !119, !112}
!614 = distinct !DICompileUnit(language: DW_LANG_C11, file: !605, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-unicodeio.o -MD -MP -MF lib/.deps/libcoreutils_a-unicodeio.Tpo -c lib/unicodeio.c -o lib/.libcoreutils_a-unicodeio.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !615, globals: !654, splitDebugInlining: false, nameTableKind: None)
!615 = !{!616, !618, !619, !116, !620, !112}
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !617, line: 29, baseType: !112)
!617 = !DIFile(filename: "/usr/include/iconv.h", directory: "", checksumkind: CSK_MD5, checksum: "694d7c23a6e081413ae05832107726a3")
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !622, file: !178, line: 51, baseType: !114, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !622, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !622, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !622, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !622, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !622, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !622, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !622, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !622, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !622, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !622, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !622, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !622, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !622, file: !178, line: 70, baseType: !638, size: 64, offset: 832)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !622, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !622, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !622, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !622, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !622, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !622, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !622, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !622, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !622, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !622, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !622, file: !178, line: 93, baseType: !638, size: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !622, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !622, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !622, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !622, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!654 = !{!655, !656, !658, !660, !662, !664, !666, !671, !676, !681, !683, !685}
!655 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "is_utf8", scope: !604, file: !605, line: 72, type: !114, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "utf8_to_local", scope: !604, file: !605, line: 74, type: !616, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !605, line: 81, type: !246, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !605, line: 88, type: !246, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !605, line: 99, type: !19, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !605, line: 99, type: !668, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 26)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !605, line: 109, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 23)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !605, line: 178, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 45)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !605, line: 180, type: !9, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !605, line: 195, type: !19, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !605, line: 197, type: !19, isLocal: true, isDefinition: true)
!687 = !{!688, !689, !690, !691, !692, !695, !696, !697, !703, !704, !705, !706, !707}
!688 = !DILocalVariable(name: "code", arg: 1, scope: !604, file: !605, line: 64, type: !83)
!689 = !DILocalVariable(name: "success", arg: 2, scope: !604, file: !605, line: 65, type: !608)
!690 = !DILocalVariable(name: "failure", arg: 3, scope: !604, file: !605, line: 67, type: !611)
!691 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !604, file: !605, line: 69, type: !112)
!692 = !DILocalVariable(name: "charset", scope: !693, file: !605, line: 79, type: !119)
!693 = distinct !DILexicalBlock(scope: !694, file: !605, line: 78, column: 5)
!694 = distinct !DILexicalBlock(scope: !604, file: !605, line: 77, column: 7)
!695 = !DILocalVariable(name: "inbuf", scope: !604, file: !605, line: 106, type: !246)
!696 = !DILocalVariable(name: "count", scope: !604, file: !605, line: 107, type: !114)
!697 = !DILocalVariable(name: "outbuf", scope: !698, file: !605, line: 114, type: !700)
!698 = distinct !DILexicalBlock(scope: !699, file: !605, line: 113, column: 5)
!699 = distinct !DILexicalBlock(scope: !604, file: !605, line: 112, column: 7)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 25)
!703 = !DILocalVariable(name: "inptr", scope: !698, file: !605, line: 115, type: !119)
!704 = !DILocalVariable(name: "inbytesleft", scope: !698, file: !605, line: 116, type: !116)
!705 = !DILocalVariable(name: "outptr", scope: !698, file: !605, line: 117, type: !113)
!706 = !DILocalVariable(name: "outbytesleft", scope: !698, file: !605, line: 118, type: !116)
!707 = !DILocalVariable(name: "res", scope: !698, file: !605, line: 121, type: !116)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !710, line: 67, type: !337, isLocal: true, isDefinition: true)
!710 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !710, line: 69, type: !19, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !710, line: 83, type: !19, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !710, line: 83, type: !241, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !710, line: 85, type: !251, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !710, line: 88, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 171)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !710, line: 88, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 34)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !710, line: 105, type: !74, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !710, line: 109, type: !673, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !710, line: 113, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 28)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !710, line: 120, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 32)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !710, line: 127, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 36)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !710, line: 134, type: !288, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !710, line: 142, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 44)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !710, line: 150, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 48)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !710, line: 159, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 52)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !710, line: 170, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 60)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !710, line: 248, type: !223, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !710, line: 248, type: !313, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !710, line: 254, type: !223, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !710, line: 254, type: !129, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !710, line: 254, type: !288, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !710, line: 259, type: !3, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !710, line: 259, type: !353, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !786, file: !787, line: 26, type: !789, isLocal: false, isDefinition: true)
!786 = distinct !DICompileUnit(language: DW_LANG_C11, file: !787, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !788, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!788 = !{!784}
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 376, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 47)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !794, line: 34, type: !136, isLocal: true, isDefinition: true)
!794 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !794, line: 34, type: !19, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !794, line: 34, type: !283, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "exit_failure", scope: !801, file: !802, line: 24, type: !804, isLocal: false, isDefinition: true)
!801 = distinct !DICompileUnit(language: DW_LANG_C11, file: !802, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !803, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!803 = !{!799}
!804 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !807, line: 47, type: !19, isLocal: true, isDefinition: true)
!807 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !807, line: 47, type: !740, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !812, file: !838, line: 58, type: !839, isLocal: true, isDefinition: true)
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-c-strtold.o -MD -MP -MF lib/.deps/libcoreutils_a-c-strtold.Tpo -c lib/c-strtold.c -o lib/.libcoreutils_a-c-strtold.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !814, globals: !835, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!814 = !{!113, !815}
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !816, line: 24, baseType: !817)
!816 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !818, line: 41, baseType: !819)
!818 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !818, line: 27, size: 1856, elements: !821)
!821 = !{!822, !826, !829, !832, !833}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !820, file: !818, line: 30, baseType: !823, size: 832)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 832, elements: !507)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !818, line: 30, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !820, file: !818, line: 33, baseType: !827, size: 64, offset: 832)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !820, file: !818, line: 34, baseType: !830, size: 64, offset: 896)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !820, file: !818, line: 35, baseType: !830, size: 64, offset: 960)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !820, file: !818, line: 38, baseType: !834, size: 832, offset: 1024)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 832, elements: !507)
!835 = !{!836, !810}
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !838, line: 66, type: !251, isLocal: true, isDefinition: true)
!838 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!839 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !815)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !842, line: 35, type: !251, isLocal: true, isDefinition: true)
!842 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !842, line: 35, type: !246, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !847, line: 873, type: !59, isLocal: true, isDefinition: true)
!847 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !847, line: 1032, type: !246, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !852, line: 108, type: !59, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "internal_state", scope: !855, file: !852, line: 97, type: !858, isLocal: true, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !852, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !856, globals: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !{!112, !116, !121}
!857 = !{!850, !853}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !487, line: 6, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !489, line: 21, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 13, size: 64, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !860, file: !489, line: 15, baseType: !114, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !860, file: !489, line: 20, baseType: !864, size: 32, offset: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !489, line: 16, size: 32, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !864, file: !489, line: 18, baseType: !83, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !864, file: !489, line: 19, baseType: !241, size: 32)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !870, line: 202, type: !19, isLocal: true, isDefinition: true)
!870 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !873, file: !870, line: 211, type: !1060, isLocal: true, isDefinition: true)
!873 = distinct !DISubprogram(name: "printf_fetchargs", scope: !870, file: !870, line: 42, type: !874, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1051, retainedNodes: !1055)
!874 = !DISubroutineType(types: !875)
!875 = !{!114, !876, !886}
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !877, line: 12, baseType: !878)
!877 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "7bd78a282b99fcfe41a9e3c566d14f7d")
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !870, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !880)
!880 = !{!881, !882, !883, !884, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !879, file: !870, baseType: !112, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !879, file: !870, baseType: !112, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !879, file: !870, baseType: !112, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !879, file: !870, baseType: !114, size: 32, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !879, file: !870, baseType: !114, size: 32, offset: 224)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !888, line: 185, baseType: !889)
!888 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 179, size: 1920, elements: !890)
!890 = !{!891, !892, !1049}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !889, file: !888, line: 181, baseType: !116, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !889, file: !888, line: 182, baseType: !893, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !888, line: 174, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 111, size: 256, elements: !896)
!896 = !{!897, !948}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !895, file: !888, line: 113, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !888, line: 108, baseType: !899)
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 47, baseType: !83, size: 32, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!901 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!902 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!903 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!904 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!905 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!906 = !DIEnumerator(name: "TYPE_INT", value: 5)
!907 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!908 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!909 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!910 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!911 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!912 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!913 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!914 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!915 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!916 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!917 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!918 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!919 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!920 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!921 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!922 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!923 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!924 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!925 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!926 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!927 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!928 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!929 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!930 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!931 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!932 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!933 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!934 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!935 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!936 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!937 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!938 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!939 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!940 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!941 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!942 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!943 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!944 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!945 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!946 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!947 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !895, file: !888, line: 172, baseType: !949, size: 128, offset: 128)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !895, file: !888, line: 114, size: 128, elements: !950)
!950 = !{!951, !952, !953, !955, !956, !957, !958, !959, !960, !962, !964, !968, !972, !975, !978, !981, !983, !986, !989, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1013, !1016, !1017, !1022, !1023, !1025, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1043, !1045, !1047}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !949, file: !888, line: 116, baseType: !205, size: 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !949, file: !888, line: 117, baseType: !121, size: 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !949, file: !888, line: 118, baseType: !954, size: 16)
!954 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !949, file: !888, line: 119, baseType: !115, size: 16)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !949, file: !888, line: 120, baseType: !114, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !949, file: !888, line: 121, baseType: !83, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !949, file: !888, line: 122, baseType: !202, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !949, file: !888, line: 123, baseType: !118, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !949, file: !888, line: 124, baseType: !961, size: 64)
!961 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !949, file: !888, line: 125, baseType: !963, size: 64)
!963 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !949, file: !888, line: 126, baseType: !965, size: 8)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !966, line: 24, baseType: !967)
!966 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !201, line: 37, baseType: !205)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !949, file: !888, line: 127, baseType: !969, size: 8)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !970, line: 24, baseType: !971)
!970 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !201, line: 38, baseType: !121)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !949, file: !888, line: 128, baseType: !973, size: 16)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !966, line: 25, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !201, line: 39, baseType: !954)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !949, file: !888, line: 129, baseType: !976, size: 16)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !970, line: 25, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !201, line: 40, baseType: !115)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !949, file: !888, line: 130, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !966, line: 26, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !201, line: 41, baseType: !114)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !949, file: !888, line: 131, baseType: !982, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !970, line: 26, baseType: !484)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !949, file: !888, line: 132, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !966, line: 27, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !201, line: 44, baseType: !202)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !949, file: !888, line: 133, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !970, line: 27, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !201, line: 45, baseType: !118)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !949, file: !888, line: 134, baseType: !990, size: 8)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !991, line: 58, baseType: !205)
!991 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!992 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !949, file: !888, line: 135, baseType: !993, size: 8)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !991, line: 71, baseType: !121)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !949, file: !888, line: 136, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !991, line: 60, baseType: !202)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !949, file: !888, line: 137, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !991, line: 73, baseType: !118)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !949, file: !888, line: 138, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !991, line: 61, baseType: !202)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !949, file: !888, line: 139, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !991, line: 74, baseType: !118)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !949, file: !888, line: 140, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !991, line: 62, baseType: !202)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !949, file: !888, line: 141, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !991, line: 75, baseType: !118)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !949, file: !888, line: 142, baseType: !1007, size: 32)
!1007 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !949, file: !888, line: 143, baseType: !1009, size: 64)
!1009 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !949, file: !888, line: 144, baseType: !1011, size: 128)
!1011 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !949, file: !888, line: 145, baseType: !114, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !949, file: !888, line: 147, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1015, line: 20, baseType: !83)
!1015 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !949, file: !888, line: 149, baseType: !119, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !949, file: !888, line: 150, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1021, line: 24, baseType: !83)
!1021 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1bf0c51e90dd5eb05cdcc01afdea587a")
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !949, file: !888, line: 151, baseType: !112, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !949, file: !888, line: 152, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !949, file: !888, line: 153, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !949, file: !888, line: 154, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !949, file: !888, line: 155, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !949, file: !888, line: 156, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !949, file: !888, line: 157, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !949, file: !888, line: 158, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !949, file: !888, line: 159, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !949, file: !888, line: 160, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !949, file: !888, line: 161, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !949, file: !888, line: 162, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !949, file: !888, line: 163, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !949, file: !888, line: 164, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !889, file: !888, line: 183, baseType: !1050, size: 1792, offset: 128)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 1792, elements: !20)
!1051 = distinct !DICompileUnit(language: DW_LANG_C11, file: !870, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-printf-args.o -MD -MP -MF lib/.deps/libcoreutils_a-printf-args.Tpo -c lib/printf-args.c -o lib/.libcoreutils_a-printf-args.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1052, retainedTypes: !1053, globals: !1054, splitDebugInlining: false, nameTableKind: None)
!1052 = !{!899}
!1053 = !{!112, !1020}
!1054 = !{!868, !871}
!1055 = !{!1056, !1057, !1058, !1059}
!1056 = !DILocalVariable(name: "args", arg: 1, scope: !873, file: !870, line: 42, type: !876)
!1057 = !DILocalVariable(name: "a", arg: 2, scope: !873, file: !870, line: 42, type: !886)
!1058 = !DILocalVariable(name: "i", scope: !873, file: !870, line: 44, type: !116)
!1059 = !DILocalVariable(name: "ap", scope: !873, file: !870, line: 45, type: !893)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 224, elements: !20)
!1061 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1062, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-cl-strtold.o -MD -MP -MF lib/.deps/libcoreutils_a-cl-strtold.Tpo -c lib/cl-strtold.c -o lib/.libcoreutils_a-cl-strtold.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1062 = !DIFile(filename: "lib/cl-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "08106583cc121226b1b473993ba401e0")
!1063 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1064, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1064 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1065 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1066, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtowc.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtowc.Tpo -c lib/mbrtowc.c -o lib/.libcoreutils_a-mbrtowc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1067, splitDebugInlining: false, nameTableKind: None)
