; ModuleID = 'src/ptx.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.regex_data = type { ptr, %struct.re_pattern_buffer, [256 x i8] }
%struct.re_pattern_buffer = type { ptr, i64, i64, i64, ptr, ptr, i64, i8 }
%struct.WORD_TABLE = type { ptr, i64, i64 }
%struct.re_registers = type { i32, ptr, ptr }
%struct.BLOCK = type { ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.WORD = type { ptr, i64 }
%struct.OCCURS = type { %struct.WORD, i64, i64, i64, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [91 x i8] c"Usage: %s [OPTION]... [INPUT]...   (without -G)\0A  or:  %s -G [OPTION]... [INPUT [OUTPUT]]\0A\00", align 1, !dbg !7

!115 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/ptx.o -MD -MP -MF src/.deps/ptx.Tpo -c src/ptx.c -o src/.ptx.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !116, retainedTypes: !170, globals: !206, splitDebugInlining: false, nameTableKind: None)
!116 = !{!117, !126, !132, !135, !141, !155}
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !118, line: 30, baseType: !119, size: 32, elements: !120)
!118 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!122 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!123 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!124 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!125 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Format", file: !2, line: 62, baseType: !119, size: 32, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIEnumerator(name: "UNKNOWN_FORMAT", value: 0)
!129 = !DIEnumerator(name: "DUMB_FORMAT", value: 1)
!130 = !DIEnumerator(name: "ROFF_FORMAT", value: 2)
!131 = !DIEnumerator(name: "TEX_FORMAT", value: 3)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1749, baseType: !119, size: 32, elements: !133)
!133 = !{!134}
!134 = !DIEnumerator(name: "FORMAT_OPTION", value: 256)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 337, baseType: !137, size: 32, elements: !138)
!136 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !{!139, !140}
!139 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!140 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !142, line: 42, baseType: !119, size: 32, elements: !143)
!142 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!144 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!145 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!146 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!147 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!148 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!149 = !DIEnumerator(name: "c_quoting_style", value: 5)
!150 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!151 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!152 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!153 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!154 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !156, line: 46, baseType: !119, size: 32, elements: !157)
!156 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!158 = !DIEnumerator(name: "_ISupper", value: 256)
!159 = !DIEnumerator(name: "_ISlower", value: 512)
!160 = !DIEnumerator(name: "_ISalpha", value: 1024)
!161 = !DIEnumerator(name: "_ISdigit", value: 2048)
!162 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!163 = !DIEnumerator(name: "_ISspace", value: 8192)
!164 = !DIEnumerator(name: "_ISprint", value: 16384)
!165 = !DIEnumerator(name: "_ISgraph", value: 32768)
!166 = !DIEnumerator(name: "_ISblank", value: 1)
!167 = !DIEnumerator(name: "_IScntrl", value: 2)
!168 = !DIEnumerator(name: "_ISpunct", value: 4)
!169 = !DIEnumerator(name: "_ISalnum", value: 8)
!170 = !{!171, !173, !174, !137, !175, !176, !179, !181, !182}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!175 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !177, line: 18, baseType: !178)
!177 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!178 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCCURS", file: !2, line: 230, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 222, size: 384, elements: !186)
!186 = !{!187, !198, !199, !200, !205}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !185, file: !2, line: 224, baseType: !188, size: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !2, line: 117, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 112, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !189, file: !2, line: 114, baseType: !173, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !2, line: 115, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !194, line: 130, baseType: !195)
!194 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !196, line: 18, baseType: !197)
!196 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!197 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !185, file: !2, line: 225, baseType: !195, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !185, file: !2, line: 226, baseType: !195, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !185, file: !2, line: 227, baseType: !201, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !202, line: 101, baseType: !203)
!202 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !204, line: 72, baseType: !197)
!204 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "file_index", scope: !185, file: !2, line: 228, baseType: !137, size: 32, offset: 320)
!206 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !59, !64, !66, !68, !70, !72, !74, !79, !81, !83, !88, !93, !98, !103, !108, !207, !212, !217, !222, !227, !229, !234, !239, !241, !246, !248, !280, !282, !284, !286, !295, !297, !299, !301, !304, !307, !315, !318, !323, !328, !409, !414, !416, !418, !423, !425, !427, !429, !431, !433, !435, !437, !442, !447, !449, !451, !453, !455, !457, !459, !461, !466, !471, !476, !478, !480, !482, !484, !489, !491, !493, !495, !497, !499, !504, !509, !511, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !543, !545, !547, !549, !113, !551, !553, !555, !557, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !585, !587, !589, !593, !598, !600, !603, !608, !610, !615, !625, !630, !632, !634, !638, !640, !642, !644, !646, !648, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668, !670, !672, !674, !676, !678, !680, !682}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 22)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1858, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 23)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1902, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 9)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 14)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !100, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 17)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1939, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 2)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1965, type: !236, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1966, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 3)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1974, type: !231, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "context_regex", scope: !115, file: !2, line: 98, type: !250, isLocal: true, isDefinition: true)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regex_data", file: !2, line: 88, size: 2624, elements: !251)
!251 = !{!252, !253, !276}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !250, file: !2, line: 91, baseType: !179, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !250, file: !2, line: 94, baseType: !254, size: 512, offset: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !255, line: 413, size: 512, elements: !256)
!255 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!256 = !{!257, !260, !262, !263, !265, !266, !268, !269, !270, !271, !272, !273, !274, !275}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !254, file: !255, line: 417, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !255, line: 417, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !254, file: !255, line: 420, baseType: !261, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !255, line: 56, baseType: !178)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !254, file: !255, line: 423, baseType: !261, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !254, file: !255, line: 426, baseType: !264, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !255, line: 71, baseType: !178)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !254, file: !255, line: 431, baseType: !173, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !254, file: !255, line: 437, baseType: !267, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !254, file: !255, line: 440, baseType: !176, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !254, file: !255, line: 446, baseType: !119, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !254, file: !255, line: 457, baseType: !119, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !254, file: !255, line: 461, baseType: !119, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !254, file: !255, line: 465, baseType: !119, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !254, file: !255, line: 469, baseType: !119, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !254, file: !255, line: 472, baseType: !119, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !254, file: !255, line: 475, baseType: !119, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !250, file: !2, line: 95, baseType: !277, size: 2048, offset: 576)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 256)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "word_regex", scope: !115, file: !2, line: 99, type: !250, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "maximum_word_length", scope: !115, file: !2, line: 146, type: !193, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "reference_max_width", scope: !115, file: !2, line: 149, type: !193, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "ignore_table", scope: !115, file: !2, line: 153, type: !288, isLocal: true, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD_TABLE", file: !2, line: 125, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 119, size: 192, elements: !290)
!290 = !{!291, !293, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !289, file: !2, line: 121, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !289, file: !2, line: 122, baseType: !193, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !289, file: !2, line: 123, baseType: !193, size: 64, offset: 128)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "only_table", scope: !115, file: !2, line: 154, type: !288, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "number_input_files", scope: !115, file: !2, line: 158, type: !137, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "total_line_count", scope: !115, file: !2, line: 159, type: !201, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "input_file_name", scope: !115, file: !2, line: 160, type: !303, isLocal: true, isDefinition: true)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "file_line_count", scope: !115, file: !2, line: 161, type: !306, isLocal: true, isDefinition: true)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "text_buffers", scope: !115, file: !2, line: 163, type: !309, isLocal: true, isDefinition: true)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLOCK", file: !2, line: 110, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 105, size: 128, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !311, file: !2, line: 107, baseType: !173, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !311, file: !2, line: 108, baseType: !173, size: 64, offset: 64)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "number_of_occurs", scope: !115, file: !2, line: 237, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !96)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !136, line: 729, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 56)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !136, line: 736, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 75)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !330, file: !136, line: 575, type: !137, isLocal: true, isDefinition: true)
!330 = distinct !DISubprogram(name: "oputs_", scope: !136, file: !136, line: 573, type: !331, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !333)
!331 = !DISubroutineType(cc: DW_CC_nocall, types: !332)
!332 = !{null, !179, !179}
!333 = !{!334, !335, !336, !339, !341, !342, !343, !347, !348, !349, !350, !352, !403, !404, !405, !407, !408}
!334 = !DILocalVariable(name: "program", arg: 1, scope: !330, file: !136, line: 573, type: !179)
!335 = !DILocalVariable(name: "option", arg: 2, scope: !330, file: !136, line: 573, type: !179)
!336 = !DILocalVariable(name: "term", scope: !337, file: !136, line: 585, type: !179)
!337 = distinct !DILexicalBlock(scope: !338, file: !136, line: 582, column: 5)
!338 = distinct !DILexicalBlock(scope: !330, file: !136, line: 581, column: 7)
!339 = !DILocalVariable(name: "double_space", scope: !330, file: !136, line: 594, type: !340)
!340 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!341 = !DILocalVariable(name: "first_word", scope: !330, file: !136, line: 595, type: !179)
!342 = !DILocalVariable(name: "option_text", scope: !330, file: !136, line: 596, type: !179)
!343 = !DILocalVariable(name: "s", scope: !344, file: !136, line: 608, type: !179)
!344 = distinct !DILexicalBlock(scope: !345, file: !136, line: 605, column: 5)
!345 = distinct !DILexicalBlock(scope: !346, file: !136, line: 604, column: 12)
!346 = distinct !DILexicalBlock(scope: !330, file: !136, line: 597, column: 7)
!347 = !DILocalVariable(name: "spaces", scope: !344, file: !136, line: 609, type: !176)
!348 = !DILocalVariable(name: "anchor_len", scope: !330, file: !136, line: 620, type: !176)
!349 = !DILocalVariable(name: "desc_text", scope: !330, file: !136, line: 625, type: !179)
!350 = !DILocalVariable(name: "__ptr", scope: !351, file: !136, line: 644, type: !179)
!351 = distinct !DILexicalBlock(scope: !330, file: !136, line: 644, column: 3)
!352 = !DILocalVariable(name: "__stream", scope: !351, file: !136, line: 644, type: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !355, line: 7, baseType: !356)
!355 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !357, line: 49, size: 1728, elements: !358)
!357 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !374, !376, !377, !378, !380, !381, !383, !384, !387, !389, !392, !395, !396, !397, !398, !399}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !356, file: !357, line: 51, baseType: !137, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !356, file: !357, line: 54, baseType: !173, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !356, file: !357, line: 55, baseType: !173, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !356, file: !357, line: 56, baseType: !173, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !356, file: !357, line: 57, baseType: !173, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !356, file: !357, line: 58, baseType: !173, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !356, file: !357, line: 59, baseType: !173, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !356, file: !357, line: 60, baseType: !173, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !356, file: !357, line: 61, baseType: !173, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !356, file: !357, line: 64, baseType: !173, size: 64, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !356, file: !357, line: 65, baseType: !173, size: 64, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !356, file: !357, line: 66, baseType: !173, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !356, file: !357, line: 68, baseType: !372, size: 64, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !357, line: 36, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !356, file: !357, line: 70, baseType: !375, size: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !356, file: !357, line: 72, baseType: !137, size: 32, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !356, file: !357, line: 73, baseType: !137, size: 32, offset: 928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !356, file: !357, line: 74, baseType: !379, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !204, line: 152, baseType: !197)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !356, file: !357, line: 77, baseType: !175, size: 16, offset: 1024)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !356, file: !357, line: 78, baseType: !382, size: 8, offset: 1040)
!382 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !356, file: !357, line: 79, baseType: !95, size: 8, offset: 1048)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !356, file: !357, line: 81, baseType: !385, size: 64, offset: 1088)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !357, line: 43, baseType: null)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !356, file: !357, line: 89, baseType: !388, size: 64, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !204, line: 153, baseType: !197)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !356, file: !357, line: 91, baseType: !390, size: 64, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !357, line: 37, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !356, file: !357, line: 92, baseType: !393, size: 64, offset: 1280)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !357, line: 38, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !356, file: !357, line: 93, baseType: !375, size: 64, offset: 1344)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !356, file: !357, line: 94, baseType: !174, size: 64, offset: 1408)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !356, file: !357, line: 95, baseType: !176, size: 64, offset: 1472)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !356, file: !357, line: 96, baseType: !137, size: 32, offset: 1536)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !356, file: !357, line: 98, baseType: !400, size: 160, offset: 1568)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 20)
!403 = !DILocalVariable(name: "__cnt", scope: !351, file: !136, line: 644, type: !176)
!404 = !DILocalVariable(name: "url_program", scope: !330, file: !136, line: 648, type: !179)
!405 = !DILocalVariable(name: "__ptr", scope: !406, file: !136, line: 686, type: !179)
!406 = distinct !DILexicalBlock(scope: !330, file: !136, line: 686, column: 3)
!407 = !DILocalVariable(name: "__stream", scope: !406, file: !136, line: 686, type: !353)
!408 = !DILocalVariable(name: "__cnt", scope: !406, file: !136, line: 686, type: !176)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !136, line: 585, type: !411, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 5)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !136, line: 586, type: !411, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !136, line: 595, type: !19, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !136, line: 620, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 6)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !136, line: 648, type: !236, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !136, line: 648, type: !411, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !136, line: 649, type: !19, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !136, line: 649, type: !243, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !136, line: 650, type: !411, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !136, line: 651, type: !420, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !136, line: 651, type: !420, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !136, line: 652, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 7)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !136, line: 653, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 8)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !136, line: 654, type: !100, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !136, line: 655, type: !100, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !136, line: 656, type: !100, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !136, line: 657, type: !100, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !136, line: 663, type: !439, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !136, line: 664, type: !100, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !136, line: 669, type: !231, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !136, line: 669, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 40)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !136, line: 676, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 15)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !136, line: 676, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 61)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !136, line: 679, type: !243, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !136, line: 683, type: !411, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !136, line: 688, type: !411, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !136, line: 691, type: !444, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !136, line: 839, type: !486, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 16)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !136, line: 840, type: !209, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !136, line: 841, type: !468, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !136, line: 862, type: !19, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !136, line: 868, type: !54, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !136, line: 875, type: !110, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !136, line: 877, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 51)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !136, line: 877, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 12)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1757, type: !468, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1758, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 11)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1759, type: !486, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1760, type: !506, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1761, type: !219, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1762, type: !506, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1763, type: !513, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1764, type: !100, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1765, type: !513, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1766, type: !486, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1767, type: !439, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1768, type: !486, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1769, type: !506, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1770, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 13)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1771, type: !420, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1772, type: !506, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1773, type: !411, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1774, type: !444, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "gnu_extensions", scope: !115, file: !2, line: 70, type: !340, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "break_file", scope: !115, file: !2, line: 83, type: !179, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "ignore_case", scope: !115, file: !2, line: 82, type: !340, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "gap_size", scope: !115, file: !2, line: 75, type: !193, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "ignore_file", scope: !115, file: !2, line: 85, type: !179, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "only_file", scope: !115, file: !2, line: 84, type: !179, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "input_reference", scope: !115, file: !2, line: 72, type: !340, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "line_width", scope: !115, file: !2, line: 74, type: !193, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "auto_reference", scope: !115, file: !2, line: 71, type: !340, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !236, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "truncation_string", scope: !115, file: !2, line: 76, type: !179, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !243, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "macro_name", scope: !115, file: !2, line: 78, type: !179, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "output_format", scope: !115, file: !2, line: 79, type: !126, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "right_reference", scope: !115, file: !2, line: 73, type: !340, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "format_vals", scope: !115, file: !2, line: 1783, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 64, elements: !237)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1780, type: !411, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1780, type: !19, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "format_args", scope: !115, file: !2, line: 1778, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 192, elements: !244)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 442, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !2, line: 444, type: !236, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "folded_chars", scope: !115, file: !2, line: 130, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, elements: !278)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 19)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "word_fastmap", scope: !115, file: !2, line: 143, type: !277, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !2, line: 793, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 57)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "context_regs", scope: !115, file: !2, line: 133, type: !617, isLocal: true, isDefinition: true)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !255, line: 497, size: 192, elements: !618)
!618 = !{!619, !621, !624}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !617, file: !255, line: 499, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !255, line: 55, baseType: !119)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !617, file: !255, line: 500, baseType: !622, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !255, line: 490, baseType: !137)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !617, file: !255, line: 501, baseType: !622, size: 64, offset: 128)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 286, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 36)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "word_regs", scope: !115, file: !2, line: 136, type: !617, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "occurs_alloc", scope: !115, file: !2, line: 236, type: !317, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "occurs_table", scope: !115, file: !2, line: 235, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 64, elements: !96)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1081, type: !19, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1194, type: !219, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "reference", scope: !115, file: !2, line: 277, type: !310, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "half_line_width", scope: !115, file: !2, line: 246, type: !193, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "before_max_width", scope: !115, file: !2, line: 250, type: !195, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "keyafter_max_width", scope: !115, file: !2, line: 254, type: !195, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "truncation_string_length", scope: !115, file: !2, line: 257, type: !193, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "edited_flag", scope: !115, file: !2, line: 243, type: !277, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "tail", scope: !115, file: !2, line: 265, type: !310, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "tail_truncation", scope: !115, file: !2, line: 266, type: !340, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "head", scope: !115, file: !2, line: 274, type: !310, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "head_truncation", scope: !115, file: !2, line: 275, type: !340, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1395, type: !411, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "keyafter", scope: !115, file: !2, line: 271, type: !310, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "keyafter_truncation", scope: !115, file: !2, line: 272, type: !340, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "before", scope: !115, file: !2, line: 268, type: !310, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "before_truncation", scope: !115, file: !2, line: 269, type: !340, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1040, type: !420, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1045, type: !540, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1420, type: !420, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1428, type: !243, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1473, type: !411, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1476, type: !243, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 4864, elements: !606)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !687, line: 50, size: 256, elements: !688)
!687 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!688 = !{!689, !690, !691, !693}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !687, line: 52, baseType: !179, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !686, file: !687, line: 55, baseType: !137, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !686, file: !687, line: 56, baseType: !692, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !686, file: !687, line: 57, baseType: !137, size: 32, offset: 192)
!694 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!695 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!696 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!697 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!698 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !701, line: 3, type: !468, isLocal: true, isDefinition: true)
!701 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "Version", scope: !704, file: !701, line: 3, type: !179, isLocal: false, isDefinition: true)
!704 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !705, splitDebugInlining: false, nameTableKind: None)
!705 = !{!699, !702}
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !708, file: !709, line: 65, type: !733, isLocal: false, isDefinition: true)
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !710, retainedTypes: !713, globals: !714, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!710 = !{!711}
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !712, line: 42, baseType: !119, size: 32, elements: !143)
!712 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!713 = !{!174, !179, !181}
!714 = !{!706, !715, !717, !719, !724, !729, !731}
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !709, line: 141, type: !439, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !709, line: 141, type: !110, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !709, line: 142, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 29)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !709, line: 160, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 21)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !709, line: 165, type: !444, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !709, line: 170, type: !411, isLocal: true, isDefinition: true)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !734, line: 69, baseType: !735)
!734 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null}
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "file_name", scope: !740, file: !741, line: 45, type: !179, isLocal: true, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !741, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !742, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!742 = !{!743, !745, !747, !749, !738, !751}
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !741, line: 121, type: !439, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !741, line: 121, type: !506, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !741, line: 123, type: !439, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !741, line: 126, type: !243, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !740, file: !741, line: 55, type: !340, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !755, file: !756, line: 66, type: !735, isLocal: false, isDefinition: true)
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !757, globals: !758, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!757 = !{!174, !181}
!758 = !{!759, !761, !785, !787, !789, !791, !753, !793, !795, !797, !799, !801}
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !756, line: 272, type: !411, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "old_file_name", scope: !763, file: !756, line: 304, type: !179, isLocal: true, isDefinition: true)
!763 = distinct !DISubprogram(name: "verror_at_line", scope: !756, file: !756, line: 298, type: !764, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !755, retainedNodes: !778)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !137, !137, !179, !119, !179, !766}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !767, line: 52, baseType: !768)
!767 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !769, line: 12, baseType: !770)
!769 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !756, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !772)
!772 = !{!773, !774, !775, !776, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !771, file: !756, baseType: !174, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !771, file: !756, baseType: !174, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !771, file: !756, baseType: !174, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !771, file: !756, baseType: !137, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !771, file: !756, baseType: !137, size: 32, offset: 224)
!778 = !{!779, !780, !781, !782, !783, !784}
!779 = !DILocalVariable(name: "status", arg: 1, scope: !763, file: !756, line: 298, type: !137)
!780 = !DILocalVariable(name: "errnum", arg: 2, scope: !763, file: !756, line: 298, type: !137)
!781 = !DILocalVariable(name: "file_name", arg: 3, scope: !763, file: !756, line: 298, type: !179)
!782 = !DILocalVariable(name: "line_number", arg: 4, scope: !763, file: !756, line: 298, type: !119)
!783 = !DILocalVariable(name: "message", arg: 5, scope: !763, file: !756, line: 298, type: !179)
!784 = !DILocalVariable(name: "args", arg: 6, scope: !763, file: !756, line: 298, type: !766)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "old_line_number", scope: !763, file: !756, line: 305, type: !119, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !756, line: 338, type: !19, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !756, line: 346, type: !444, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !756, line: 346, type: !236, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "error_message_count", scope: !755, file: !756, line: 69, type: !119, isLocal: false, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !755, file: !756, line: 295, type: !137, isLocal: false, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !756, line: 208, type: !439, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !756, line: 208, type: !726, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !756, line: 214, type: !411, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !805, line: 40, type: !100, isLocal: true, isDefinition: true)
!805 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "program_name", scope: !808, file: !809, line: 31, type: !179, isLocal: false, isDefinition: true)
!808 = distinct !DICompileUnit(language: DW_LANG_C11, file: !809, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !810, globals: !811, splitDebugInlining: false, nameTableKind: None)
!809 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!810 = !{!174, !173}
!811 = !{!806, !812, !814}
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !809, line: 46, type: !444, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !809, line: 49, type: !19, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "utf07FF", scope: !818, file: !819, line: 46, type: !846, isLocal: true, isDefinition: true)
!818 = distinct !DISubprogram(name: "proper_name_lite", scope: !819, file: !819, line: 38, type: !820, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !822, retainedNodes: !824)
!819 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!820 = !DISubroutineType(types: !821)
!821 = !{!179, !179, !179}
!822 = distinct !DICompileUnit(language: DW_LANG_C11, file: !819, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !823, splitDebugInlining: false, nameTableKind: None)
!823 = !{!816}
!824 = !{!825, !826, !827, !828, !833}
!825 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !818, file: !819, line: 38, type: !179)
!826 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !818, file: !819, line: 38, type: !179)
!827 = !DILocalVariable(name: "translation", scope: !818, file: !819, line: 40, type: !179)
!828 = !DILocalVariable(name: "w", scope: !818, file: !819, line: 47, type: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !830, line: 37, baseType: !831)
!830 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !204, line: 57, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !204, line: 42, baseType: !119)
!833 = !DILocalVariable(name: "mbs", scope: !818, file: !819, line: 48, type: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !835, line: 6, baseType: !836)
!835 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !837, line: 21, baseType: !838)
!837 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !837, line: 13, size: 64, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !838, file: !837, line: 15, baseType: !137, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !838, file: !837, line: 20, baseType: !842, size: 32, offset: 32)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !838, file: !837, line: 16, size: 32, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !842, file: !837, line: 18, baseType: !119, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !842, file: !837, line: 19, baseType: !19, size: 32)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 16, elements: !237)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !849, line: 78, type: !444, isLocal: true, isDefinition: true)
!849 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !849, line: 79, type: !420, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !849, line: 80, type: !540, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !849, line: 81, type: !540, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !849, line: 82, type: !400, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !849, line: 83, type: !236, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !849, line: 84, type: !444, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !849, line: 85, type: !439, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !849, line: 86, type: !439, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !849, line: 87, type: !444, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !870, file: !849, line: 76, type: !939, isLocal: false, isDefinition: true)
!870 = distinct !DICompileUnit(language: DW_LANG_C11, file: !849, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !871, retainedTypes: !877, globals: !878, splitDebugInlining: false, nameTableKind: None)
!871 = !{!711, !872, !155}
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !712, line: 254, baseType: !119, size: 32, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!875 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!876 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!877 = !{!174, !137, !175, !176}
!878 = !{!847, !850, !852, !854, !856, !858, !860, !862, !864, !866, !868, !879, !883, !893, !895, !897, !899, !901, !903, !905, !928, !935, !937}
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !870, file: !849, line: 92, type: !881, isLocal: false, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 320, elements: !101)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !870, file: !849, line: 1040, type: !885, isLocal: false, isDefinition: true)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !849, line: 56, size: 448, elements: !886)
!886 = !{!887, !888, !889, !891, !892}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !885, file: !849, line: 59, baseType: !711, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !885, file: !849, line: 62, baseType: !137, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !885, file: !849, line: 66, baseType: !890, size: 256, offset: 64)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 256, elements: !445)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !885, file: !849, line: 69, baseType: !179, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !885, file: !849, line: 72, baseType: !179, size: 64, offset: 384)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !870, file: !849, line: 107, type: !885, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "slot0", scope: !870, file: !849, line: 831, type: !277, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !849, line: 321, type: !236, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !849, line: 357, type: !236, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !849, line: 358, type: !236, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !849, line: 199, type: !439, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "quote", scope: !907, file: !849, line: 228, type: !926, isLocal: true, isDefinition: true)
!907 = distinct !DISubprogram(name: "gettext_quote", scope: !849, file: !849, line: 197, type: !908, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !870, retainedNodes: !910)
!908 = !DISubroutineType(types: !909)
!909 = !{!179, !179, !711}
!910 = !{!911, !912, !913, !914, !915}
!911 = !DILocalVariable(name: "msgid", arg: 1, scope: !907, file: !849, line: 197, type: !179)
!912 = !DILocalVariable(name: "s", arg: 2, scope: !907, file: !849, line: 197, type: !711)
!913 = !DILocalVariable(name: "translation", scope: !907, file: !849, line: 199, type: !179)
!914 = !DILocalVariable(name: "w", scope: !907, file: !849, line: 229, type: !829)
!915 = !DILocalVariable(name: "mbs", scope: !907, file: !849, line: 230, type: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !835, line: 6, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !837, line: 21, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !837, line: 13, size: 64, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !918, file: !837, line: 15, baseType: !137, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !918, file: !837, line: 20, baseType: !922, size: 32, offset: 32)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !918, file: !837, line: 16, size: 32, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !922, file: !837, line: 18, baseType: !119, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !922, file: !837, line: 19, baseType: !19, size: 32)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 64, elements: !927)
!927 = !{!238, !21}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "slotvec", scope: !870, file: !849, line: 834, type: !930, isLocal: true, isDefinition: true)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !849, line: 823, size: 128, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !931, file: !849, line: 825, baseType: !176, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !931, file: !849, line: 826, baseType: !173, size: 64, offset: 64)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "nslots", scope: !870, file: !849, line: 832, type: !137, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "slotvec0", scope: !870, file: !849, line: 833, type: !931, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 704, elements: !514)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !942, line: 192, type: !19, isLocal: true, isDefinition: true)
!942 = !DIFile(filename: "lib/read-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5e61a5e6b0c83d68cde0efd76e0ac088")
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !942, line: 192, type: !243, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !947, line: 67, type: !506, isLocal: true, isDefinition: true)
!947 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !947, line: 69, type: !439, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !947, line: 83, type: !439, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !947, line: 83, type: !19, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !947, line: 85, type: !236, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !947, line: 88, type: !958, isLocal: true, isDefinition: true)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 171)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !947, line: 88, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 34)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !947, line: 105, type: !486, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !947, line: 109, type: !214, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !947, line: 113, type: !972, isLocal: true, isDefinition: true)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 28)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !947, line: 120, type: !595, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !947, line: 127, type: !627, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !947, line: 134, type: !463, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !947, line: 142, type: !983, isLocal: true, isDefinition: true)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 44)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !947, line: 150, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 48)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !947, line: 159, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 52)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !947, line: 170, type: !998, isLocal: true, isDefinition: true)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 60)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !947, line: 248, type: !400, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !947, line: 248, type: !209, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !947, line: 254, type: !400, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !947, line: 254, type: !224, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !947, line: 254, type: !463, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !947, line: 259, type: !3, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !947, line: 259, type: !721, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1017, file: !1018, line: 26, type: !1020, isLocal: false, isDefinition: true)
!1017 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1018, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1019, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1019 = !{!1015}
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 376, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 47)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1025, file: !1026, line: 24, type: !1028, isLocal: false, isDefinition: true)
!1025 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1026, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1027, splitDebugInlining: false, nameTableKind: None)
!1026 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1027 = !{!1023}
!1028 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 34, type: !243, isLocal: true, isDefinition: true)
!1031 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 34, type: !439, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1031, line: 34, type: !231, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 108, type: !95, isLocal: true, isDefinition: true)
!1038 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "internal_state", scope: !1041, file: !1038, line: 97, type: !1044, isLocal: true, isDefinition: true)
!1041 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1038, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, globals: !1043, splitDebugInlining: false, nameTableKind: None)
!1042 = !{!174, !176, !181}
!1043 = !{!1036, !1039}
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !835, line: 6, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !837, line: 21, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !837, line: 13, size: 64, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1046, file: !837, line: 15, baseType: !137, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1046, file: !837, line: 20, baseType: !1050, size: 32, offset: 32)
!1050 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1046, file: !837, line: 16, size: 32, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1050, file: !837, line: 18, baseType: !119, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1050, file: !837, line: 19, baseType: !19, size: 32)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 35, type: !236, isLocal: true, isDefinition: true)
!1056 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 35, type: !420, isLocal: true, isDefinition: true)
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !805, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-freopen-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-freopen-safer.Tpo -c lib/freopen-safer.c -o lib/.libcoreutils_a-freopen-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1060, splitDebugInlining: false, nameTableKind: None)
!1060 = !{!803}
!1061 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1062, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1062 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1063 = distinct !DICompileUnit(language: DW_LANG_C11, file: !942, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-read-file.o -MD -MP -MF lib/.deps/libcoreutils_a-read-file.Tpo -c lib/read-file.c -o lib/.libcoreutils_a-read-file.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1064, globals: !1065, splitDebugInlining: false, nameTableKind: None)
!1064 = !{!174, !178}
!1065 = !{!940, !943}
!1066 = distinct !DICompileUnit(language: DW_LANG_C11, file: !947, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1067, retainedTypes: !1071, globals: !1072, splitDebugInlining: false, nameTableKind: None)
!1067 = !{!1068}
