; ModuleID = 'src/rm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.15 }
%union.anon.15 = type { i32 }
%struct.rm_options = type { i8, i32, i8, i8, i8, ptr, i8, i8, i8, i8 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [2 x i32] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }

!197 = !{!198, !200, !201, !158, !202, !203, !205, !207}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!202 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !204, line: 18, baseType: !188)
!204 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!207 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!208 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !79, !84, !89, !94, !99, !104, !109, !114, !209, !214, !219, !221, !226, !231, !233, !238, !243, !248, !253, !255, !299, !301, !306, !311, !313, !318, !323, !325, !330, !335, !413, !418, !420, !422, !427, !429, !431, !433, !435, !437, !439, !441, !446, !448, !450, !452, !454, !456, !458, !460, !465, !470, !475, !480, !482, !484, !486, !488, !490, !495, !497, !499, !504, !506, !511, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !119, !536, !540, !542, !544, !546, !548, !550, !552, !556}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 289, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 14)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 19)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !69, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 329, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 4)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 42)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !211, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 11)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 16)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 20)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 13)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !240, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !257, file: !2, line: 368, type: !276, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 234, type: !258, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !261)
!258 = !DISubroutineType(types: !259)
!259 = !{!158, !158, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!261 = !{!262, !263, !264, !266, !290, !291, !292, !296, !297, !298}
!262 = !DILocalVariable(name: "argc", arg: 1, scope: !257, file: !2, line: 234, type: !158)
!263 = !DILocalVariable(name: "argv", arg: 2, scope: !257, file: !2, line: 234, type: !260)
!264 = !DILocalVariable(name: "preserve_root", scope: !257, file: !2, line: 236, type: !265)
!265 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!266 = !DILocalVariable(name: "x", scope: !257, file: !2, line: 237, type: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !124, line: 32, size: 256, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !286, !287, !288, !289}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !267, file: !124, line: 35, baseType: !265, size: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !267, file: !124, line: 38, baseType: !123, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !267, file: !124, line: 47, baseType: !265, size: 8, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !267, file: !124, line: 50, baseType: !265, size: 8, offset: 72)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !267, file: !124, line: 53, baseType: !265, size: 8, offset: 80)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !267, file: !124, line: 57, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !277, line: 30, size: 128, elements: !278)
!277 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!278 = !{!279, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !276, file: !277, line: 32, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !281, line: 47, baseType: !282)
!281 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !192, line: 148, baseType: !188)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !276, file: !277, line: 33, baseType: !284, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !281, line: 59, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !192, line: 145, baseType: !188)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !267, file: !124, line: 61, baseType: !265, size: 8, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !267, file: !124, line: 64, baseType: !265, size: 8, offset: 200)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !267, file: !124, line: 67, baseType: !265, size: 8, offset: 208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !267, file: !124, line: 75, baseType: !265, size: 8, offset: 216)
!290 = !DILocalVariable(name: "prompt_once", scope: !257, file: !2, line: 238, type: !265)
!291 = !DILocalVariable(name: "c", scope: !257, file: !2, line: 239, type: !158)
!292 = !DILocalVariable(name: "i", scope: !293, file: !2, line: 287, type: !158)
!293 = distinct !DILexicalBlock(scope: !294, file: !2, line: 286, column: 11)
!294 = distinct !DILexicalBlock(scope: !295, file: !2, line: 257, column: 9)
!295 = distinct !DILexicalBlock(scope: !257, file: !2, line: 255, column: 5)
!296 = !DILocalVariable(name: "n_files", scope: !257, file: !2, line: 375, type: !189)
!297 = !DILocalVariable(name: "file", scope: !257, file: !2, line: 376, type: !260)
!298 = !DILocalVariable(name: "status", scope: !257, file: !2, line: 393, type: !162)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !14, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 2)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 38)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !3, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 26)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 27)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !86, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 9)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 184, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 23)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !337, file: !157, line: 575, type: !158, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "oputs_", scope: !157, file: !157, line: 573, type: !338, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !340)
!338 = !DISubroutineType(cc: DW_CC_nocall, types: !339)
!339 = !{null, !205, !205}
!340 = !{!341, !342, !343, !346, !347, !348, !349, !353, !354, !355, !356, !358, !407, !408, !409, !411, !412}
!341 = !DILocalVariable(name: "program", arg: 1, scope: !337, file: !157, line: 573, type: !205)
!342 = !DILocalVariable(name: "option", arg: 2, scope: !337, file: !157, line: 573, type: !205)
!343 = !DILocalVariable(name: "term", scope: !344, file: !157, line: 585, type: !205)
!344 = distinct !DILexicalBlock(scope: !345, file: !157, line: 582, column: 5)
!345 = distinct !DILexicalBlock(scope: !337, file: !157, line: 581, column: 7)
!346 = !DILocalVariable(name: "double_space", scope: !337, file: !157, line: 594, type: !265)
!347 = !DILocalVariable(name: "first_word", scope: !337, file: !157, line: 595, type: !205)
!348 = !DILocalVariable(name: "option_text", scope: !337, file: !157, line: 596, type: !205)
!349 = !DILocalVariable(name: "s", scope: !350, file: !157, line: 608, type: !205)
!350 = distinct !DILexicalBlock(scope: !351, file: !157, line: 605, column: 5)
!351 = distinct !DILexicalBlock(scope: !352, file: !157, line: 604, column: 12)
!352 = distinct !DILexicalBlock(scope: !337, file: !157, line: 597, column: 7)
!353 = !DILocalVariable(name: "spaces", scope: !350, file: !157, line: 609, type: !203)
!354 = !DILocalVariable(name: "anchor_len", scope: !337, file: !157, line: 620, type: !203)
!355 = !DILocalVariable(name: "desc_text", scope: !337, file: !157, line: 625, type: !205)
!356 = !DILocalVariable(name: "__ptr", scope: !357, file: !157, line: 644, type: !205)
!357 = distinct !DILexicalBlock(scope: !337, file: !157, line: 644, column: 3)
!358 = !DILocalVariable(name: "__stream", scope: !357, file: !157, line: 644, type: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !361, line: 7, baseType: !362)
!361 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !363, line: 49, size: 1728, elements: !364)
!363 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !380, !382, !383, !384, !387, !388, !390, !391, !394, !396, !399, !402, !403, !404, !405, !406}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !362, file: !363, line: 51, baseType: !158, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !362, file: !363, line: 54, baseType: !200, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !362, file: !363, line: 55, baseType: !200, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !362, file: !363, line: 56, baseType: !200, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !362, file: !363, line: 57, baseType: !200, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !362, file: !363, line: 58, baseType: !200, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !362, file: !363, line: 59, baseType: !200, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !362, file: !363, line: 60, baseType: !200, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !362, file: !363, line: 61, baseType: !200, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !362, file: !363, line: 64, baseType: !200, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !362, file: !363, line: 65, baseType: !200, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !362, file: !363, line: 66, baseType: !200, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !362, file: !363, line: 68, baseType: !378, size: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !363, line: 36, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !362, file: !363, line: 70, baseType: !381, size: 64, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !362, file: !363, line: 72, baseType: !158, size: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !362, file: !363, line: 73, baseType: !158, size: 32, offset: 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !362, file: !363, line: 74, baseType: !385, size: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !192, line: 152, baseType: !386)
!386 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !362, file: !363, line: 77, baseType: !202, size: 16, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !362, file: !363, line: 78, baseType: !389, size: 8, offset: 1040)
!389 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !362, file: !363, line: 79, baseType: !101, size: 8, offset: 1048)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !362, file: !363, line: 81, baseType: !392, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !363, line: 43, baseType: null)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !362, file: !363, line: 89, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !192, line: 153, baseType: !386)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !362, file: !363, line: 91, baseType: !397, size: 64, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !363, line: 37, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !362, file: !363, line: 92, baseType: !400, size: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !363, line: 38, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !362, file: !363, line: 93, baseType: !381, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !362, file: !363, line: 94, baseType: !201, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !362, file: !363, line: 95, baseType: !203, size: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !362, file: !363, line: 96, baseType: !158, size: 32, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !362, file: !363, line: 98, baseType: !245, size: 160, offset: 1568)
!407 = !DILocalVariable(name: "__cnt", scope: !357, file: !157, line: 644, type: !203)
!408 = !DILocalVariable(name: "url_program", scope: !337, file: !157, line: 648, type: !205)
!409 = !DILocalVariable(name: "__ptr", scope: !410, file: !157, line: 686, type: !205)
!410 = distinct !DILexicalBlock(scope: !337, file: !157, line: 686, column: 3)
!411 = !DILocalVariable(name: "__stream", scope: !410, file: !157, line: 686, type: !359)
!412 = !DILocalVariable(name: "__cnt", scope: !410, file: !157, line: 686, type: !203)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !157, line: 585, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 5)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !157, line: 586, type: !415, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !157, line: 595, type: !223, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !157, line: 620, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 6)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !303, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !415, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !223, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !19, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !157, line: 650, type: !415, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !424, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !424, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !157, line: 652, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 7)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !157, line: 653, type: !116, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !157, line: 654, type: !106, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !157, line: 655, type: !106, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !157, line: 656, type: !106, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !157, line: 657, type: !106, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !157, line: 663, type: !443, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !157, line: 664, type: !106, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 17)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 40)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 15)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 61)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !157, line: 679, type: !19, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !157, line: 683, type: !415, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !157, line: 688, type: !415, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !157, line: 691, type: !116, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !157, line: 839, type: !240, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !157, line: 840, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 22)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !157, line: 841, type: !472, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !157, line: 862, type: !223, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !157, line: 868, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 71)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !157, line: 875, type: !320, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 51)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 12)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !424, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !513, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !240, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !462, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !211, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !216, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !106, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !116, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !415, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !116, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "interactive_types", scope: !121, file: !2, line: 90, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 192, elements: !425)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !424, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !19, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !415, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !415, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !443, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !223, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "interactive_args", scope: !121, file: !2, line: 84, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 448, elements: !444)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !308, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 3072, elements: !514)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !561, line: 50, size: 256, elements: !562)
!561 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!562 = !{!563, !564, !565, !567}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !561, line: 52, baseType: !205, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !560, file: !561, line: 55, baseType: !158, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !561, line: 56, baseType: !566, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !560, file: !561, line: 57, baseType: !158, size: 32, offset: 192)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !570, line: 625, type: !240, isLocal: true, isDefinition: true)
!570 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !570, line: 639, type: !462, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !570, line: 456, type: !462, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !508, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !303, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !19, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !303, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 45)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 58)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 49)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !570, line: 498, type: !14, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !570, line: 511, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 46)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !570, line: 514, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 37)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !570, line: 576, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 186)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !570, line: 583, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 21)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !570, line: 589, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 56)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !570, line: 589, type: !492, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !570, line: 276, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 48)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !570, line: 276, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !570, line: 297, type: !508, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !570, line: 309, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 35)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !570, line: 309, type: !216, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !570, line: 398, type: !492, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !570, line: 398, type: !513, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !652, line: 3, type: !472, isLocal: true, isDefinition: true)
!652 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "Version", scope: !655, file: !652, line: 3, type: !205, isLocal: false, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C11, file: !652, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !656, splitDebugInlining: false, nameTableKind: None)
!656 = !{!650, !653}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !659, file: !660, line: 65, type: !681, isLocal: false, isDefinition: true)
!659 = distinct !DICompileUnit(language: DW_LANG_C11, file: !660, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !661, retainedTypes: !664, globals: !665, splitDebugInlining: false, nameTableKind: None)
!660 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!661 = !{!662}
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !663, line: 42, baseType: !125, size: 32, elements: !144)
!663 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!664 = !{!201, !205, !207}
!665 = !{!657, !666, !668, !670, !675, !677, !679}
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !660, line: 141, type: !443, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !660, line: 141, type: !320, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !660, line: 142, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 29)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !660, line: 160, type: !617, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !660, line: 165, type: !116, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !660, line: 170, type: !415, isLocal: true, isDefinition: true)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !682, line: 69, baseType: !683)
!682 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null}
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "file_name", scope: !688, file: !689, line: 36, type: !205, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closein.o -MD -MP -MF lib/.deps/libcoreutils_a-closein.Tpo -c lib/closein.c -o lib/.libcoreutils_a-closein.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !690, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!690 = !{!691, !693, !695, !697, !686}
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !689, line: 99, type: !443, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !689, line: 99, type: !216, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !689, line: 101, type: !443, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !689, line: 104, type: !19, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "file_name", scope: !701, file: !702, line: 45, type: !205, isLocal: true, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !703, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!703 = !{!704, !706, !708, !710, !699, !712}
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !702, line: 121, type: !443, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !702, line: 121, type: !513, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !702, line: 123, type: !443, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !702, line: 126, type: !19, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !701, file: !702, line: 55, type: !265, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !716, file: !717, line: 66, type: !683, isLocal: false, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !718, globals: !719, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!718 = !{!201, !207}
!719 = !{!720, !722, !746, !748, !750, !752, !714, !754, !756, !758, !760, !762}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !717, line: 272, type: !415, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "old_file_name", scope: !724, file: !717, line: 304, type: !205, isLocal: true, isDefinition: true)
!724 = distinct !DISubprogram(name: "verror_at_line", scope: !717, file: !717, line: 298, type: !725, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !716, retainedNodes: !739)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !158, !158, !205, !125, !205, !727}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !728, line: 52, baseType: !729)
!728 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !730, line: 12, baseType: !731)
!730 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !717, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !733)
!733 = !{!734, !735, !736, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !732, file: !717, baseType: !201, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !732, file: !717, baseType: !201, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !732, file: !717, baseType: !201, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !732, file: !717, baseType: !158, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !732, file: !717, baseType: !158, size: 32, offset: 224)
!739 = !{!740, !741, !742, !743, !744, !745}
!740 = !DILocalVariable(name: "status", arg: 1, scope: !724, file: !717, line: 298, type: !158)
!741 = !DILocalVariable(name: "errnum", arg: 2, scope: !724, file: !717, line: 298, type: !158)
!742 = !DILocalVariable(name: "file_name", arg: 3, scope: !724, file: !717, line: 298, type: !205)
!743 = !DILocalVariable(name: "line_number", arg: 4, scope: !724, file: !717, line: 298, type: !125)
!744 = !DILocalVariable(name: "message", arg: 5, scope: !724, file: !717, line: 298, type: !205)
!745 = !DILocalVariable(name: "args", arg: 6, scope: !724, file: !717, line: 298, type: !727)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "old_line_number", scope: !724, file: !717, line: 305, type: !125, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !717, line: 338, type: !223, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !717, line: 346, type: !116, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !717, line: 346, type: !303, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "error_message_count", scope: !716, file: !717, line: 69, type: !125, isLocal: false, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !716, file: !717, line: 295, type: !158, isLocal: false, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !717, line: 208, type: !443, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !717, line: 208, type: !617, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !717, line: 214, type: !415, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !766, line: 30, type: !443, isLocal: true, isDefinition: true)
!766 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !769, line: 399, type: !303, isLocal: true, isDefinition: true)
!769 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !769, line: 441, type: !101, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !769, line: 1080, type: !19, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !776, line: 226, type: !111, isLocal: true, isDefinition: true)
!776 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !776, line: 227, type: !111, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !776, line: 228, type: !9, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !776, line: 231, type: !111, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "default_tuning", scope: !785, file: !776, line: 134, type: !789, isLocal: true, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !776, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !786, globals: !788, splitDebugInlining: false, nameTableKind: None)
!786 = !{!188, !201, !787, !203}
!787 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!788 = !{!774, !777, !779, !781, !783}
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !791, line: 52, baseType: !792)
!791 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !791, line: 40, size: 160, elements: !793)
!793 = !{!794, !795, !796, !797, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !792, file: !791, line: 45, baseType: !787, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !792, file: !791, line: 46, baseType: !787, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !792, file: !791, line: 47, baseType: !787, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !792, file: !791, line: 48, baseType: !787, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !792, file: !791, line: 49, baseType: !265, size: 8, offset: 128)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "program_name", scope: !801, file: !802, line: 31, type: !205, isLocal: false, isDefinition: true)
!801 = distinct !DICompileUnit(language: DW_LANG_C11, file: !802, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !803, globals: !804, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!803 = !{!201, !200}
!804 = !{!799, !805, !807}
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !802, line: 46, type: !116, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !802, line: 49, type: !223, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "utf07FF", scope: !811, file: !812, line: 46, type: !839, isLocal: true, isDefinition: true)
!811 = distinct !DISubprogram(name: "proper_name_lite", scope: !812, file: !812, line: 38, type: !813, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !815, retainedNodes: !817)
!812 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!813 = !DISubroutineType(types: !814)
!814 = !{!205, !205, !205}
!815 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !816, splitDebugInlining: false, nameTableKind: None)
!816 = !{!809}
!817 = !{!818, !819, !820, !821, !826}
!818 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !811, file: !812, line: 38, type: !205)
!819 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !811, file: !812, line: 38, type: !205)
!820 = !DILocalVariable(name: "translation", scope: !811, file: !812, line: 40, type: !205)
!821 = !DILocalVariable(name: "w", scope: !811, file: !812, line: 47, type: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !823, line: 37, baseType: !824)
!823 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !192, line: 57, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !192, line: 42, baseType: !125)
!826 = !DILocalVariable(name: "mbs", scope: !811, file: !812, line: 48, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !828, line: 6, baseType: !829)
!828 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !830, line: 21, baseType: !831)
!830 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 13, size: 64, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !831, file: !830, line: 15, baseType: !158, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !831, file: !830, line: 20, baseType: !835, size: 32, offset: 32)
!835 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !831, file: !830, line: 16, size: 32, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !835, file: !830, line: 18, baseType: !125, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !835, file: !830, line: 19, baseType: !223, size: 32)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 16, elements: !304)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !842, line: 78, type: !116, isLocal: true, isDefinition: true)
!842 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !842, line: 79, type: !424, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !842, line: 80, type: !250, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !842, line: 81, type: !250, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !842, line: 82, type: !245, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !842, line: 83, type: !303, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !842, line: 84, type: !116, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !842, line: 85, type: !443, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !842, line: 86, type: !443, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !842, line: 87, type: !116, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !863, file: !842, line: 76, type: !935, isLocal: false, isDefinition: true)
!863 = distinct !DICompileUnit(language: DW_LANG_C11, file: !842, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !864, retainedTypes: !870, globals: !871, splitDebugInlining: false, nameTableKind: None)
!864 = !{!662, !865, !169}
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !663, line: 254, baseType: !125, size: 32, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!868 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!869 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!870 = !{!201, !158, !202, !203}
!871 = !{!840, !843, !845, !847, !849, !851, !853, !855, !857, !859, !861, !872, !876, !886, !888, !893, !895, !897, !899, !901, !924, !931, !933}
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !863, file: !842, line: 92, type: !874, isLocal: false, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 320, elements: !107)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !863, file: !842, line: 1040, type: !878, isLocal: false, isDefinition: true)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !842, line: 56, size: 448, elements: !879)
!879 = !{!880, !881, !882, !884, !885}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !878, file: !842, line: 59, baseType: !662, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !878, file: !842, line: 62, baseType: !158, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !878, file: !842, line: 66, baseType: !883, size: 256, offset: 64)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !117)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !878, file: !842, line: 69, baseType: !205, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !878, file: !842, line: 72, baseType: !205, size: 64, offset: 384)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !863, file: !842, line: 107, type: !878, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "slot0", scope: !863, file: !842, line: 831, type: !890, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 256)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !842, line: 321, type: !303, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !842, line: 357, type: !303, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !842, line: 358, type: !303, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !842, line: 199, type: !443, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "quote", scope: !903, file: !842, line: 228, type: !922, isLocal: true, isDefinition: true)
!903 = distinct !DISubprogram(name: "gettext_quote", scope: !842, file: !842, line: 197, type: !904, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !863, retainedNodes: !906)
!904 = !DISubroutineType(types: !905)
!905 = !{!205, !205, !662}
!906 = !{!907, !908, !909, !910, !911}
!907 = !DILocalVariable(name: "msgid", arg: 1, scope: !903, file: !842, line: 197, type: !205)
!908 = !DILocalVariable(name: "s", arg: 2, scope: !903, file: !842, line: 197, type: !662)
!909 = !DILocalVariable(name: "translation", scope: !903, file: !842, line: 199, type: !205)
!910 = !DILocalVariable(name: "w", scope: !903, file: !842, line: 229, type: !822)
!911 = !DILocalVariable(name: "mbs", scope: !903, file: !842, line: 230, type: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !828, line: 6, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !830, line: 21, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 13, size: 64, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !914, file: !830, line: 15, baseType: !158, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !914, file: !830, line: 20, baseType: !918, size: 32, offset: 32)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !914, file: !830, line: 16, size: 32, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !918, file: !830, line: 18, baseType: !125, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !918, file: !830, line: 19, baseType: !223, size: 32)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, elements: !923)
!923 = !{!305, !225}
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "slotvec", scope: !863, file: !842, line: 834, type: !926, isLocal: true, isDefinition: true)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !842, line: 823, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !927, file: !842, line: 825, baseType: !203, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !927, file: !842, line: 826, baseType: !200, size: 64, offset: 64)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "nslots", scope: !863, file: !842, line: 832, type: !158, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "slotvec0", scope: !863, file: !842, line: 833, type: !927, isLocal: true, isDefinition: true)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 704, elements: !236)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !938, line: 32, type: !303, isLocal: true, isDefinition: true)
!938 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !941, line: 67, type: !513, isLocal: true, isDefinition: true)
!941 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !941, line: 69, type: !443, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !941, line: 83, type: !443, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !941, line: 83, type: !223, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !941, line: 85, type: !303, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !941, line: 88, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 171)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !941, line: 88, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 34)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !941, line: 105, type: !240, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !941, line: 109, type: !964, isLocal: true, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !333)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !941, line: 113, type: !967, isLocal: true, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 28)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !941, line: 120, type: !634, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !941, line: 127, type: !974, isLocal: true, isDefinition: true)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !975)
!975 = !{!976}
!976 = !DISubrange(count: 36)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !941, line: 134, type: !467, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !941, line: 142, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 44)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !941, line: 150, type: !629, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !941, line: 159, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 52)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !941, line: 170, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 60)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !941, line: 248, type: !245, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !941, line: 248, type: !492, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !941, line: 254, type: !245, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !941, line: 254, type: !211, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !941, line: 254, type: !467, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !941, line: 259, type: !3, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !941, line: 259, type: !672, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1012, file: !1013, line: 26, type: !1015, isLocal: false, isDefinition: true)
!1012 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1013, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1014, splitDebugInlining: false, nameTableKind: None)
!1013 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1014 = !{!1010}
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 376, elements: !65)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1017 = distinct !DIGlobalVariable(name: "initialized", scope: !1018, file: !1019, line: 41, type: !265, isLocal: true, isDefinition: true)
!1018 = distinct !DISubprogram(name: "can_write_any_file", scope: !1019, file: !1019, line: 39, type: !1020, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1022, retainedNodes: !1027)
!1019 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!265}
!1022 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1019, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-write-any-file.o -MD -MP -MF lib/.deps/libcoreutils_a-write-any-file.Tpo -c lib/write-any-file.c -o lib/.libcoreutils_a-write-any-file.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1023, splitDebugInlining: false, nameTableKind: None)
!1023 = !{!1024, !1025}
!1024 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "can_write", scope: !1018, file: !1019, line: 42, type: !265, isLocal: true, isDefinition: true)
!1027 = !{!1028}
!1028 = !DILocalVariable(name: "can", scope: !1029, file: !1019, line: 46, type: !265)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !1019, line: 45, column: 5)
!1030 = distinct !DILexicalBlock(scope: !1018, file: !1019, line: 44, column: 7)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1033, file: !1034, line: 24, type: !1036, isLocal: false, isDefinition: true)
!1033 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1034, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!1034 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1035 = !{!1031}
!1036 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 34, type: !19, isLocal: true, isDefinition: true)
!1039 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 34, type: !443, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 34, type: !462, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 40, type: !672, isLocal: true, isDefinition: true)
!1046 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 40, type: !235, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 40, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 624, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 78)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 40, type: !216, isLocal: true, isDefinition: true)
!1056 = !DIFile(filename: "lib/c-file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3dfce754b72420a39e7e891cf0b31be")
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 40, type: !250, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 43, type: !106, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 46, type: !211, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 66, type: !216, isLocal: true, isDefinition: true)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 69, type: !964, isLocal: true, isDefinition: true)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 75, type: !415, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 105, type: !443, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1056, line: 110, type: !235, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !1075, line: 59, type: !111, isLocal: true, isDefinition: true)
!1075 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !1075, line: 59, type: !1078, isLocal: true, isDefinition: true)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 18)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !1075, line: 59, type: !1083, isLocal: true, isDefinition: true)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 536, elements: !1084)
!1084 = !{!1085}
!1085 = !DISubrange(count: 67)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1088, file: !1089, line: 506, type: !158, isLocal: true, isDefinition: true)
!1088 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1089, file: !1089, line: 485, type: !1090, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1092, retainedNodes: !1094)
!1089 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!158, !158, !158}
!1092 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1089, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1093, splitDebugInlining: false, nameTableKind: None)
!1093 = !{!1086}
!1094 = !{!1095, !1096, !1097, !1098, !1101}
!1095 = !DILocalVariable(name: "fd", arg: 1, scope: !1088, file: !1089, line: 485, type: !158)
!1096 = !DILocalVariable(name: "target", arg: 2, scope: !1088, file: !1089, line: 485, type: !158)
!1097 = !DILocalVariable(name: "result", scope: !1088, file: !1089, line: 487, type: !158)
!1098 = !DILocalVariable(name: "flags", scope: !1099, file: !1089, line: 530, type: !158)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !1089, line: 529, column: 5)
!1100 = distinct !DILexicalBlock(scope: !1088, file: !1089, line: 528, column: 7)
!1101 = !DILocalVariable(name: "saved_errno", scope: !1102, file: !1089, line: 533, type: !158)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !1089, line: 532, column: 9)
!1103 = distinct !DILexicalBlock(scope: !1099, file: !1089, line: 531, column: 11)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !1106, line: 108, type: !101, isLocal: true, isDefinition: true)
!1106 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "internal_state", scope: !1109, file: !1106, line: 97, type: !1112, isLocal: true, isDefinition: true)
!1109 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1106, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1110, globals: !1111, splitDebugInlining: false, nameTableKind: None)
!1110 = !{!201, !203, !207}
!1111 = !{!1104, !1107}
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !828, line: 6, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !830, line: 21, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 13, size: 64, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1114, file: !830, line: 15, baseType: !158, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1114, file: !830, line: 20, baseType: !1118, size: 32, offset: 32)
!1118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1114, file: !830, line: 16, size: 32, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1118, file: !830, line: 18, baseType: !125, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1118, file: !830, line: 19, baseType: !223, size: 32)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !1124, line: 35, type: !303, isLocal: true, isDefinition: true)
!1124 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !1124, line: 35, type: !424, isLocal: true, isDefinition: true)
!1127 = distinct !DICompileUnit(language: DW_LANG_C11, file: !570, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/remove.o -MD -MP -MF src/.deps/remove.Tpo -c src/remove.c -o src/.remove.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1128, retainedTypes: !1150, globals: !1151, splitDebugInlining: false, nameTableKind: None)
!1128 = !{!162, !123, !1129, !142, !1134, !1138}
!1129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 299, baseType: !158, size: 32, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!1132 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!1133 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!1134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !570, line: 38, baseType: !125, size: 32, elements: !1135)
!1135 = !{!1136, !1137}
!1136 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!1137 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!1138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1139, line: 97, baseType: !125, size: 32, elements: !1140)
!1139 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149}
!1141 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!1142 = !DIEnumerator(name: "DT_FIFO", value: 1)
!1143 = !DIEnumerator(name: "DT_CHR", value: 2)
!1144 = !DIEnumerator(name: "DT_DIR", value: 4)
!1145 = !DIEnumerator(name: "DT_BLK", value: 6)
!1146 = !DIEnumerator(name: "DT_REG", value: 8)
!1147 = !DIEnumerator(name: "DT_LNK", value: 10)
!1148 = !DIEnumerator(name: "DT_SOCK", value: 12)
!1149 = !DIEnumerator(name: "DT_WHT", value: 14)
!1150 = !{!201}
!1151 = !{!568, !1152, !1157, !1159, !571, !573, !575, !577, !579, !581, !583, !588, !593, !598, !600, !605, !610, !615, !620, !625, !627, !632, !637, !639, !644, !646, !648}
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !1154, isLocal: true, isDefinition: true)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 704, elements: !1155)
!1155 = !{!1156}
!1156 = !DISubrange(count: 88)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !250, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !1161, isLocal: true, isDefinition: true)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 480, elements: !994)
!1162 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1163, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-basename-lgpl.o -MD -MP -MF lib/.deps/libcoreutils_a-basename-lgpl.Tpo -c lib/basename-lgpl.c -o lib/.libcoreutils_a-basename-lgpl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1164, splitDebugInlining: false, nameTableKind: None)
!1163 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!1164 = !{!200}
!1165 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1166, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1150, splitDebugInlining: false, nameTableKind: None)
!1166 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
