; ModuleID = 'src/seq.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.operand = type { fp128, i64, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [104 x i8] c"Usage: %s [OPTION]... LAST\0A  or:  %s [OPTION]... FIRST LAST\0A  or:  %s [OPTION]... FIRST INCREMENT LAST\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [58 x i8] c"Print numbers from FIRST to LAST, in steps of INCREMENT.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"seq\00", align 1, !dbg !17

!162 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 15)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !2, line: 606, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 16)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !2, line: 612, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 17)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !2, line: 622, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 69)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !2, line: 668, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 33)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !2, line: 685, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 6)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !2, line: 688, type: !19, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "equal_width", scope: !64, file: !2, line: 55, type: !111, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !67, line: 736, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 75)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !207, file: !67, line: 575, type: !68, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "oputs_", scope: !67, file: !67, line: 573, type: !208, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !210)
!208 = !DISubroutineType(cc: DW_CC_nocall, types: !209)
!209 = !{null, !92, !92}
!210 = !{!211, !212, !213, !216, !217, !218, !219, !223, !224, !225, !226, !228, !279, !280, !281, !283, !284}
!211 = !DILocalVariable(name: "program", arg: 1, scope: !207, file: !67, line: 573, type: !92)
!212 = !DILocalVariable(name: "option", arg: 2, scope: !207, file: !67, line: 573, type: !92)
!213 = !DILocalVariable(name: "term", scope: !214, file: !67, line: 585, type: !92)
!214 = distinct !DILexicalBlock(scope: !215, file: !67, line: 582, column: 5)
!215 = distinct !DILexicalBlock(scope: !207, file: !67, line: 581, column: 7)
!216 = !DILocalVariable(name: "double_space", scope: !207, file: !67, line: 594, type: !111)
!217 = !DILocalVariable(name: "first_word", scope: !207, file: !67, line: 595, type: !92)
!218 = !DILocalVariable(name: "option_text", scope: !207, file: !67, line: 596, type: !92)
!219 = !DILocalVariable(name: "s", scope: !220, file: !67, line: 608, type: !92)
!220 = distinct !DILexicalBlock(scope: !221, file: !67, line: 605, column: 5)
!221 = distinct !DILexicalBlock(scope: !222, file: !67, line: 604, column: 12)
!222 = distinct !DILexicalBlock(scope: !207, file: !67, line: 597, column: 7)
!223 = !DILocalVariable(name: "spaces", scope: !220, file: !67, line: 609, type: !137)
!224 = !DILocalVariable(name: "anchor_len", scope: !207, file: !67, line: 620, type: !137)
!225 = !DILocalVariable(name: "desc_text", scope: !207, file: !67, line: 625, type: !92)
!226 = !DILocalVariable(name: "__ptr", scope: !227, file: !67, line: 644, type: !92)
!227 = distinct !DILexicalBlock(scope: !207, file: !67, line: 644, column: 3)
!228 = !DILocalVariable(name: "__stream", scope: !227, file: !67, line: 644, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !232)
!231 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !233, line: 49, size: 1728, elements: !234)
!233 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !250, !252, !253, !254, !256, !257, !259, !260, !263, !265, !268, !271, !272, !273, !274, !275}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !232, file: !233, line: 51, baseType: !68, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !232, file: !233, line: 54, baseType: !114, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !232, file: !233, line: 55, baseType: !114, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !232, file: !233, line: 56, baseType: !114, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !232, file: !233, line: 57, baseType: !114, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !232, file: !233, line: 58, baseType: !114, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !232, file: !233, line: 59, baseType: !114, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !232, file: !233, line: 60, baseType: !114, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !232, file: !233, line: 61, baseType: !114, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !232, file: !233, line: 64, baseType: !114, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !232, file: !233, line: 65, baseType: !114, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !232, file: !233, line: 66, baseType: !114, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !232, file: !233, line: 68, baseType: !248, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !233, line: 36, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !232, file: !233, line: 70, baseType: !251, size: 64, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !232, file: !233, line: 72, baseType: !68, size: 32, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !232, file: !233, line: 73, baseType: !68, size: 32, offset: 928)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !232, file: !233, line: 74, baseType: !255, size: 64, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !108)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !232, file: !233, line: 77, baseType: !136, size: 16, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !232, file: !233, line: 78, baseType: !258, size: 8, offset: 1040)
!258 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !232, file: !233, line: 79, baseType: !59, size: 8, offset: 1048)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !232, file: !233, line: 81, baseType: !261, size: 64, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !233, line: 43, baseType: null)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !232, file: !233, line: 89, baseType: !264, size: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !108)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !232, file: !233, line: 91, baseType: !266, size: 64, offset: 1216)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !233, line: 37, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !232, file: !233, line: 92, baseType: !269, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !233, line: 38, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !232, file: !233, line: 93, baseType: !251, size: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !232, file: !233, line: 94, baseType: !135, size: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !232, file: !233, line: 95, baseType: !137, size: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !232, file: !233, line: 96, baseType: !68, size: 32, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !232, file: !233, line: 98, baseType: !276, size: 160, offset: 1568)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 20)
!279 = !DILocalVariable(name: "__cnt", scope: !227, file: !67, line: 644, type: !137)
!280 = !DILocalVariable(name: "url_program", scope: !207, file: !67, line: 648, type: !92)
!281 = !DILocalVariable(name: "__ptr", scope: !282, file: !67, line: 686, type: !92)
!282 = distinct !DILexicalBlock(scope: !207, file: !67, line: 686, column: 3)
!283 = !DILocalVariable(name: "__stream", scope: !282, file: !67, line: 686, type: !229)
!284 = !DILocalVariable(name: "__cnt", scope: !282, file: !67, line: 686, type: !137)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !67, line: 585, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 5)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !67, line: 586, type: !287, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !67, line: 595, type: !19, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !67, line: 620, type: !193, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !67, line: 648, type: !183, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !67, line: 648, type: !287, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !67, line: 649, type: !19, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !67, line: 649, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 3)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !67, line: 650, type: !287, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !67, line: 651, type: !193, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !67, line: 651, type: !193, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !67, line: 652, type: !153, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !67, line: 653, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 8)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !67, line: 654, type: !143, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !67, line: 655, type: !143, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !67, line: 656, type: !143, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !67, line: 657, type: !143, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !67, line: 663, type: !153, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !67, line: 664, type: !143, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !67, line: 669, type: !173, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !67, line: 669, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 40)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !163, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 61)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !67, line: 679, type: !304, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !67, line: 683, type: !287, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !67, line: 688, type: !287, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !67, line: 691, type: !317, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !67, line: 839, type: !168, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !67, line: 840, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 22)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !67, line: 841, type: !163, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !67, line: 862, type: !19, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !67, line: 868, type: !24, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !67, line: 875, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 27)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 51)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 12)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !379, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !153, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !143, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !287, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !317, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "long_options", scope: !64, file: !2, line: 64, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1536, elements: !194)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !397, line: 50, size: 256, elements: !398)
!397 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!398 = !{!399, !400, !401, !403}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !396, file: !397, line: 52, baseType: !92, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !396, file: !397, line: 55, baseType: !68, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !397, line: 56, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !396, file: !397, line: 57, baseType: !68, size: 32, offset: 192)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !183, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "separator", scope: !64, file: !2, line: 58, type: !92, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 30)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !153, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 11)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 21)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 9)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 37)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !432, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !67, line: 952, type: !379, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "terminator", scope: !64, file: !2, line: 62, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 16, elements: !184)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 36)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !148, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 13)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !304, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !304, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "format_buf", scope: !460, file: !2, line: 375, type: !485, isLocal: true, isDefinition: true)
!460 = distinct !DISubprogram(name: "get_default_format", scope: !2, file: !2, line: 373, type: !461, scopeLine: 374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !470)
!461 = !DISubroutineType(types: !462)
!462 = !{!92, !463, !463, !463}
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "operand", file: !2, line: 143, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "operand", file: !2, line: 128, size: 256, elements: !465)
!465 = !{!466, !468, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !464, file: !2, line: 131, baseType: !467, size: 128)
!467 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !464, file: !2, line: 137, baseType: !137, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !464, file: !2, line: 141, baseType: !68, size: 32, offset: 192)
!470 = !{!471, !472, !473, !474, !475, !480, !481, !482}
!471 = !DILocalVariable(name: "first", arg: 1, scope: !460, file: !2, line: 373, type: !463)
!472 = !DILocalVariable(name: "step", arg: 2, scope: !460, file: !2, line: 373, type: !463)
!473 = !DILocalVariable(name: "last", arg: 3, scope: !460, file: !2, line: 373, type: !463)
!474 = !DILocalVariable(name: "prec", scope: !460, file: !2, line: 377, type: !68)
!475 = !DILocalVariable(name: "first_width", scope: !476, file: !2, line: 384, type: !137)
!476 = distinct !DILexicalBlock(scope: !477, file: !2, line: 382, column: 9)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 381, column: 11)
!478 = distinct !DILexicalBlock(scope: !479, file: !2, line: 380, column: 5)
!479 = distinct !DILexicalBlock(scope: !460, file: !2, line: 379, column: 7)
!480 = !DILocalVariable(name: "last_width", scope: !476, file: !2, line: 386, type: !137)
!481 = !DILocalVariable(name: "width", scope: !476, file: !2, line: 393, type: !137)
!482 = !DILocalVariable(name: "w", scope: !483, file: !2, line: 396, type: !68)
!483 = distinct !DILexicalBlock(scope: !484, file: !2, line: 395, column: 13)
!484 = distinct !DILexicalBlock(scope: !476, file: !2, line: 394, column: 15)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 28)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 397, type: !417, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !317, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 408, type: !19, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !2, line: 334, type: !183, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !499, line: 3, type: !163, isLocal: true, isDefinition: true)
!499 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "Version", scope: !502, file: !499, line: 3, type: !92, isLocal: false, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C11, file: !499, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !503, splitDebugInlining: false, nameTableKind: None)
!503 = !{!497, !500}
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "file_name", scope: !506, file: !507, line: 45, type: !92, isLocal: true, isDefinition: true)
!506 = distinct !DICompileUnit(language: DW_LANG_C11, file: !507, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !508, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!508 = !{!509, !511, !513, !515, !504, !517}
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !507, line: 121, type: !153, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !507, line: 121, type: !379, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !507, line: 123, type: !153, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !507, line: 126, type: !304, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !506, file: !507, line: 55, type: !111, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !521, file: !522, line: 66, type: !569, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C11, file: !522, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !523, globals: !524, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!523 = !{!135, !139}
!524 = !{!525, !527, !551, !553, !555, !557, !519, !559, !561, !563, !565, !567}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !522, line: 272, type: !287, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "old_file_name", scope: !529, file: !522, line: 304, type: !92, isLocal: true, isDefinition: true)
!529 = distinct !DISubprogram(name: "verror_at_line", scope: !522, file: !522, line: 298, type: !530, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !521, retainedNodes: !544)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !68, !68, !92, !74, !92, !532}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !533, line: 52, baseType: !534)
!533 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !535, line: 12, baseType: !536)
!535 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !522, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !538)
!538 = !{!539, !540, !541, !542, !543}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !537, file: !522, baseType: !135, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !537, file: !522, baseType: !135, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !537, file: !522, baseType: !135, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !537, file: !522, baseType: !68, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !537, file: !522, baseType: !68, size: 32, offset: 224)
!544 = !{!545, !546, !547, !548, !549, !550}
!545 = !DILocalVariable(name: "status", arg: 1, scope: !529, file: !522, line: 298, type: !68)
!546 = !DILocalVariable(name: "errnum", arg: 2, scope: !529, file: !522, line: 298, type: !68)
!547 = !DILocalVariable(name: "file_name", arg: 3, scope: !529, file: !522, line: 298, type: !92)
!548 = !DILocalVariable(name: "line_number", arg: 4, scope: !529, file: !522, line: 298, type: !74)
!549 = !DILocalVariable(name: "message", arg: 5, scope: !529, file: !522, line: 298, type: !92)
!550 = !DILocalVariable(name: "args", arg: 6, scope: !529, file: !522, line: 298, type: !532)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "old_line_number", scope: !529, file: !522, line: 305, type: !74, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !522, line: 338, type: !19, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !522, line: 346, type: !317, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !522, line: 346, type: !183, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "error_message_count", scope: !521, file: !522, line: 69, type: !74, isLocal: false, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !521, file: !522, line: 295, type: !68, isLocal: false, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !522, line: 208, type: !153, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !522, line: 208, type: !422, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !522, line: 214, type: !287, isLocal: true, isDefinition: true)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "program_name", scope: !574, file: !575, line: 31, type: !92, isLocal: false, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C11, file: !575, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !576, globals: !577, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!576 = !{!135, !114}
!577 = !{!572, !578, !580}
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !575, line: 46, type: !317, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !575, line: 49, type: !19, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "utf07FF", scope: !584, file: !585, line: 46, type: !441, isLocal: true, isDefinition: true)
!584 = distinct !DISubprogram(name: "proper_name_lite", scope: !585, file: !585, line: 38, type: !586, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !590)
!585 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!586 = !DISubroutineType(types: !587)
!587 = !{!92, !92, !92}
!588 = distinct !DICompileUnit(language: DW_LANG_C11, file: !585, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !589, splitDebugInlining: false, nameTableKind: None)
!589 = !{!582}
!590 = !{!591, !592, !593, !594, !599}
!591 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !584, file: !585, line: 38, type: !92)
!592 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !584, file: !585, line: 38, type: !92)
!593 = !DILocalVariable(name: "translation", scope: !584, file: !585, line: 40, type: !92)
!594 = !DILocalVariable(name: "w", scope: !584, file: !585, line: 47, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !596, line: 37, baseType: !597)
!596 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !97, line: 57, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !97, line: 42, baseType: !74)
!599 = !DILocalVariable(name: "mbs", scope: !584, file: !585, line: 48, type: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !601, line: 6, baseType: !602)
!601 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !603, line: 21, baseType: !604)
!603 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 13, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !604, file: !603, line: 15, baseType: !68, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !604, file: !603, line: 20, baseType: !608, size: 32, offset: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !603, line: 16, size: 32, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !608, file: !603, line: 18, baseType: !74, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !608, file: !603, line: 19, baseType: !19, size: 32)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !614, line: 78, type: !317, isLocal: true, isDefinition: true)
!614 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !614, line: 79, type: !193, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !614, line: 80, type: !451, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !614, line: 81, type: !451, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !614, line: 82, type: !276, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !614, line: 83, type: !183, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !614, line: 84, type: !317, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !614, line: 85, type: !153, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !614, line: 86, type: !153, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !614, line: 87, type: !317, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !635, file: !614, line: 76, type: !721, isLocal: false, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C11, file: !614, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !636, retainedTypes: !656, globals: !657, splitDebugInlining: false, nameTableKind: None)
!636 = !{!637, !651, !72}
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !638, line: 42, baseType: !74, size: 32, elements: !639)
!638 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!640 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!641 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!642 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!643 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!644 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!645 = !DIEnumerator(name: "c_quoting_style", value: 5)
!646 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!647 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!648 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!649 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!650 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !638, line: 254, baseType: !74, size: 32, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!654 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!655 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!656 = !{!135, !68, !136, !137}
!657 = !{!612, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !658, !662, !672, !674, !679, !681, !683, !685, !687, !710, !717, !719}
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !635, file: !614, line: 92, type: !660, isLocal: false, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 320, elements: !144)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !635, file: !614, line: 1040, type: !664, isLocal: false, isDefinition: true)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !614, line: 56, size: 448, elements: !665)
!665 = !{!666, !667, !668, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !664, file: !614, line: 59, baseType: !637, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !664, file: !614, line: 62, baseType: !68, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !664, file: !614, line: 66, baseType: !669, size: 256, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !318)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !664, file: !614, line: 69, baseType: !92, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !664, file: !614, line: 72, baseType: !92, size: 64, offset: 384)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !635, file: !614, line: 107, type: !664, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "slot0", scope: !635, file: !614, line: 831, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 256)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !614, line: 321, type: !183, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !614, line: 357, type: !183, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !614, line: 358, type: !183, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !614, line: 199, type: !153, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "quote", scope: !689, file: !614, line: 228, type: !708, isLocal: true, isDefinition: true)
!689 = distinct !DISubprogram(name: "gettext_quote", scope: !614, file: !614, line: 197, type: !690, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !635, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!92, !92, !637}
!692 = !{!693, !694, !695, !696, !697}
!693 = !DILocalVariable(name: "msgid", arg: 1, scope: !689, file: !614, line: 197, type: !92)
!694 = !DILocalVariable(name: "s", arg: 2, scope: !689, file: !614, line: 197, type: !637)
!695 = !DILocalVariable(name: "translation", scope: !689, file: !614, line: 199, type: !92)
!696 = !DILocalVariable(name: "w", scope: !689, file: !614, line: 229, type: !595)
!697 = !DILocalVariable(name: "mbs", scope: !689, file: !614, line: 230, type: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !601, line: 6, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !603, line: 21, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 13, size: 64, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !700, file: !603, line: 15, baseType: !68, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !700, file: !603, line: 20, baseType: !704, size: 32, offset: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !603, line: 16, size: 32, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !704, file: !603, line: 18, baseType: !74, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !704, file: !603, line: 19, baseType: !19, size: 32)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 64, elements: !709)
!709 = !{!185, !21}
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "slotvec", scope: !635, file: !614, line: 834, type: !712, isLocal: true, isDefinition: true)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !614, line: 823, size: 128, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !614, line: 825, baseType: !137, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !713, file: !614, line: 826, baseType: !114, size: 64, offset: 64)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "nslots", scope: !635, file: !614, line: 832, type: !68, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "slotvec0", scope: !635, file: !614, line: 833, type: !713, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 704, elements: !418)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !725, line: 67, type: !379, isLocal: true, isDefinition: true)
!725 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !725, line: 69, type: !153, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !153, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !19, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !725, line: 85, type: !183, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 171)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 34)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !725, line: 105, type: !168, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !725, line: 109, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 23)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !725, line: 113, type: !485, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !725, line: 120, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 32)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !725, line: 127, type: !444, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !725, line: 134, type: !336, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !725, line: 142, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 44)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !725, line: 150, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 48)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !725, line: 159, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 52)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !725, line: 170, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 60)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !276, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !358, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !276, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !158, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !336, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !3, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 29)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !801, file: !802, line: 26, type: !804, isLocal: false, isDefinition: true)
!801 = distinct !DICompileUnit(language: DW_LANG_C11, file: !802, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !803, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!803 = !{!799}
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 376, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 47)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "exit_failure", scope: !809, file: !810, line: 24, type: !812, isLocal: false, isDefinition: true)
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !810, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !811, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!811 = !{!807}
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !815, line: 34, type: !304, isLocal: true, isDefinition: true)
!815 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !815, line: 34, type: !153, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !815, line: 34, type: !173, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !822, file: !848, line: 58, type: !849, isLocal: true, isDefinition: true)
!822 = distinct !DICompileUnit(language: DW_LANG_C11, file: !823, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-c-strtold.o -MD -MP -MF lib/.deps/libcoreutils_a-c-strtold.Tpo -c lib/c-strtold.c -o lib/.libcoreutils_a-c-strtold.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !824, globals: !845, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!824 = !{!114, !825}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !826, line: 24, baseType: !827)
!826 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !828, line: 41, baseType: !829)
!828 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !828, line: 27, size: 1856, elements: !831)
!831 = !{!832, !836, !839, !842, !843}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !830, file: !828, line: 30, baseType: !833, size: 832)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 832, elements: !452)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !828, line: 30, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !830, file: !828, line: 33, baseType: !837, size: 64, offset: 832)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !830, file: !828, line: 34, baseType: !840, size: 64, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !830, file: !828, line: 35, baseType: !840, size: 64, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !830, file: !828, line: 38, baseType: !844, size: 832, offset: 1024)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 832, elements: !452)
!845 = !{!846, !820}
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !848, line: 66, type: !183, isLocal: true, isDefinition: true)
!848 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!849 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !825)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !852, line: 108, type: !59, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "internal_state", scope: !855, file: !852, line: 97, type: !858, isLocal: true, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !852, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !856, globals: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !{!135, !137, !139}
!857 = !{!850, !853}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !601, line: 6, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !603, line: 21, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 13, size: 64, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !860, file: !603, line: 15, baseType: !68, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !860, file: !603, line: 20, baseType: !864, size: 32, offset: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !603, line: 16, size: 32, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !864, file: !603, line: 18, baseType: !74, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !864, file: !603, line: 19, baseType: !19, size: 32)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !870, line: 121, type: !304, isLocal: true, isDefinition: true)
!870 = !DIFile(filename: "lib/xvasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "52fb1fd224f1e06f67bcb38ca55c75a7")
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !870, line: 124, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 41)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !878, line: 35, type: !183, isLocal: true, isDefinition: true)
!878 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !878, line: 35, type: !193, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !883, line: 202, type: !153, isLocal: true, isDefinition: true)
!883 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !886, file: !883, line: 211, type: !1070, isLocal: true, isDefinition: true)
!886 = distinct !DISubprogram(name: "printf_fetchargs", scope: !883, file: !883, line: 42, type: !887, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1061, retainedNodes: !1065)
!887 = !DISubroutineType(types: !888)
!888 = !{!68, !889, !899}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !890, line: 12, baseType: !891)
!890 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "7bd78a282b99fcfe41a9e3c566d14f7d")
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !883, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !893)
!893 = !{!894, !895, !896, !897, !898}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !892, file: !883, baseType: !135, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !892, file: !883, baseType: !135, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !892, file: !883, baseType: !135, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !892, file: !883, baseType: !68, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !892, file: !883, baseType: !68, size: 32, offset: 224)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !901, line: 185, baseType: !902)
!901 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 179, size: 1920, elements: !903)
!903 = !{!904, !905, !1059}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !902, file: !901, line: 181, baseType: !137, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !902, file: !901, line: 182, baseType: !906, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !901, line: 174, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 111, size: 256, elements: !909)
!909 = !{!910, !961}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !908, file: !901, line: 113, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !901, line: 108, baseType: !912)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !901, line: 47, baseType: !74, size: 32, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!914 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!915 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!916 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!917 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!918 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!919 = !DIEnumerator(name: "TYPE_INT", value: 5)
!920 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!921 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!922 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!923 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!924 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!925 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!926 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!927 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!928 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!929 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!930 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!931 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!932 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!933 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!934 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!935 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!936 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!937 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!938 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!939 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!940 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!941 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!942 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!943 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!944 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!945 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!946 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!947 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!948 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!949 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!950 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!951 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!952 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!953 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!954 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!955 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!956 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!957 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!958 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!959 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!960 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !908, file: !901, line: 172, baseType: !962, size: 128, offset: 128)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !908, file: !901, line: 114, size: 128, elements: !963)
!963 = !{!964, !965, !966, !968, !969, !970, !971, !972, !973, !975, !977, !981, !985, !988, !991, !994, !996, !999, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1023, !1024, !1027, !1028, !1033, !1034, !1036, !1038, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1057}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !962, file: !901, line: 116, baseType: !258, size: 8)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !962, file: !901, line: 117, baseType: !139, size: 8)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !962, file: !901, line: 118, baseType: !967, size: 16)
!967 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !962, file: !901, line: 119, baseType: !136, size: 16)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !962, file: !901, line: 120, baseType: !68, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !962, file: !901, line: 121, baseType: !74, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !962, file: !901, line: 122, baseType: !108, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !962, file: !901, line: 123, baseType: !98, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !962, file: !901, line: 124, baseType: !974, size: 64)
!974 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !962, file: !901, line: 125, baseType: !976, size: 64)
!976 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !962, file: !901, line: 126, baseType: !978, size: 8)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !979, line: 24, baseType: !980)
!979 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !97, line: 37, baseType: !258)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !962, file: !901, line: 127, baseType: !982, size: 8)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !983, line: 24, baseType: !984)
!983 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !97, line: 38, baseType: !139)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !962, file: !901, line: 128, baseType: !986, size: 16)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !979, line: 25, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !97, line: 39, baseType: !967)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !962, file: !901, line: 129, baseType: !989, size: 16)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !983, line: 25, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !97, line: 40, baseType: !136)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !962, file: !901, line: 130, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !979, line: 26, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !97, line: 41, baseType: !68)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !962, file: !901, line: 131, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !983, line: 26, baseType: !598)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !962, file: !901, line: 132, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !979, line: 27, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !97, line: 44, baseType: !108)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !962, file: !901, line: 133, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !983, line: 27, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !97, line: 45, baseType: !98)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !962, file: !901, line: 134, baseType: !1003, size: 8)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !95, line: 58, baseType: !258)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !962, file: !901, line: 135, baseType: !1005, size: 8)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !95, line: 71, baseType: !139)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !962, file: !901, line: 136, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !95, line: 60, baseType: !108)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !962, file: !901, line: 137, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !95, line: 73, baseType: !98)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !962, file: !901, line: 138, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !95, line: 61, baseType: !108)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !962, file: !901, line: 139, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !95, line: 74, baseType: !98)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !962, file: !901, line: 140, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !95, line: 62, baseType: !108)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !962, file: !901, line: 141, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !95, line: 75, baseType: !98)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !962, file: !901, line: 142, baseType: !1019, size: 32)
!1019 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !962, file: !901, line: 143, baseType: !1021, size: 64)
!1021 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !962, file: !901, line: 144, baseType: !467, size: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !962, file: !901, line: 145, baseType: !68, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !962, file: !901, line: 147, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1026, line: 20, baseType: !74)
!1026 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !962, file: !901, line: 149, baseType: !92, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !962, file: !901, line: 150, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1032, line: 24, baseType: !74)
!1032 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1bf0c51e90dd5eb05cdcc01afdea587a")
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !962, file: !901, line: 151, baseType: !135, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !962, file: !901, line: 152, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !962, file: !901, line: 153, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !962, file: !901, line: 154, baseType: !402, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !962, file: !901, line: 155, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !962, file: !901, line: 156, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !962, file: !901, line: 157, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !962, file: !901, line: 158, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !962, file: !901, line: 159, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !962, file: !901, line: 160, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !962, file: !901, line: 161, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !962, file: !901, line: 162, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !962, file: !901, line: 163, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !962, file: !901, line: 164, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !902, file: !901, line: 183, baseType: !1060, size: 1792, offset: 128)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 1792, elements: !154)
!1061 = distinct !DICompileUnit(language: DW_LANG_C11, file: !883, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-printf-args.o -MD -MP -MF lib/.deps/libcoreutils_a-printf-args.Tpo -c lib/printf-args.c -o lib/.libcoreutils_a-printf-args.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1062, retainedTypes: !1063, globals: !1064, splitDebugInlining: false, nameTableKind: None)
!1062 = !{!912}
!1063 = !{!135, !1031}
!1064 = !{!881, !884}
!1065 = !{!1066, !1067, !1068, !1069}
!1066 = !DILocalVariable(name: "args", arg: 1, scope: !886, file: !883, line: 42, type: !889)
!1067 = !DILocalVariable(name: "a", arg: 2, scope: !886, file: !883, line: 42, type: !899)
!1068 = !DILocalVariable(name: "i", scope: !886, file: !883, line: 44, type: !137)
!1069 = !DILocalVariable(name: "ap", scope: !886, file: !883, line: 45, type: !906)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 224, elements: !154)
!1071 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1072, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-cl-strtold.o -MD -MP -MF lib/.deps/libcoreutils_a-cl-strtold.Tpo -c lib/cl-strtold.c -o lib/.libcoreutils_a-cl-strtold.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1072 = !DIFile(filename: "lib/cl-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "08106583cc121226b1b473993ba401e0")
!1073 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1074, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1074 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1075 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1076, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-full-write.o -MD -MP -MF lib/.deps/libcoreutils_a-full-write.Tpo -c lib/full-write.c -o lib/.libcoreutils_a-full-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1077, splitDebugInlining: false, nameTableKind: None)
!1076 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!1077 = !{!92}
!1078 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1079, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1079 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1080 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1081, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-safe-write.o -MD -MP -MF lib/.deps/libcoreutils_a-safe-write.Tpo -c lib/safe-write.c -o lib/.libcoreutils_a-safe-write.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1082, retainedTypes: !1087, splitDebugInlining: false, nameTableKind: None)
!1081 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!1082 = !{!1083}
!1083 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1084, line: 36, baseType: !74, size: 32, elements: !1085)
!1084 = !DIFile(filename: "lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!1085 = !{!1086}
!1086 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!1087 = !{!137}
!1088 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1089, retainedTypes: !1093, globals: !1094, splitDebugInlining: false, nameTableKind: None)
!1089 = !{!1090}
!1090 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 40, baseType: !74, size: 32, elements: !1091)
!1091 = !{!1092}
!1092 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1093 = !{!135}
!1094 = !{!723, !726, !728, !730, !732, !734, !739, !744, !746, !751, !753, !758, !760, !762, !767, !772, !777, !782, !784, !786, !788, !790, !792, !794}
!1095 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1096, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1097, retainedTypes: !1127, splitDebugInlining: false, nameTableKind: None)
!1096 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1097 = !{!1098, !1110}
!1098 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1099, file: !1096, line: 188, baseType: !74, size: 32, elements: !1108)
!1099 = distinct !DISubprogram(name: "x2nrealloc", scope: !1096, file: !1096, line: 176, type: !1100, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1095, retainedNodes: !1103)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!135, !135, !1102, !137}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!1103 = !{!1104, !1105, !1106, !1107}
!1104 = !DILocalVariable(name: "p", arg: 1, scope: !1099, file: !1096, line: 176, type: !135)
!1105 = !DILocalVariable(name: "pn", arg: 2, scope: !1099, file: !1096, line: 176, type: !1102)
