; ModuleID = 'src/shred.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.Options = type { i8, i64, i64, i32, i8, i8, i8 }
%struct.mtop = type { i16, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.randint_source = type { ptr, i64, i64 }
%struct.randread_source = type { ptr, ptr, ptr, %union.anon.8 }
%union.anon.8 = type { %struct.isaac }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%union.anon.0 = type { [256 x i64] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }

!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 18)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1250, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 14)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1250, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 12)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1262, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 21)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1268, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 3)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1268, type: !96, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1275, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 2)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "randint_source", scope: !108, file: !2, line: 1169, type: !252, isLocal: true, isDefinition: true)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !254, line: 33, flags: DIFlagFwdDecl)
!254 = !DIFile(filename: "./lib/randint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "28ec191ae1fe18b14ea27fd20962a86a")
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !124, line: 736, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 75)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !262, file: !124, line: 575, type: !125, isLocal: true, isDefinition: true)
!262 = distinct !DISubprogram(name: "oputs_", scope: !124, file: !124, line: 573, type: !263, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !265)
!263 = !DISubroutineType(cc: DW_CC_nocall, types: !264)
!264 = !{null, !194, !194}
!265 = !{!266, !267, !268, !271, !273, !274, !275, !279, !280, !281, !282, !284, !334, !335, !336, !338, !339}
!266 = !DILocalVariable(name: "program", arg: 1, scope: !262, file: !124, line: 573, type: !194)
!267 = !DILocalVariable(name: "option", arg: 2, scope: !262, file: !124, line: 573, type: !194)
!268 = !DILocalVariable(name: "term", scope: !269, file: !124, line: 585, type: !194)
!269 = distinct !DILexicalBlock(scope: !270, file: !124, line: 582, column: 5)
!270 = distinct !DILexicalBlock(scope: !262, file: !124, line: 581, column: 7)
!271 = !DILocalVariable(name: "double_space", scope: !262, file: !124, line: 594, type: !272)
!272 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!273 = !DILocalVariable(name: "first_word", scope: !262, file: !124, line: 595, type: !194)
!274 = !DILocalVariable(name: "option_text", scope: !262, file: !124, line: 596, type: !194)
!275 = !DILocalVariable(name: "s", scope: !276, file: !124, line: 608, type: !194)
!276 = distinct !DILexicalBlock(scope: !277, file: !124, line: 605, column: 5)
!277 = distinct !DILexicalBlock(scope: !278, file: !124, line: 604, column: 12)
!278 = distinct !DILexicalBlock(scope: !262, file: !124, line: 597, column: 7)
!279 = !DILocalVariable(name: "spaces", scope: !276, file: !124, line: 609, type: !191)
!280 = !DILocalVariable(name: "anchor_len", scope: !262, file: !124, line: 620, type: !191)
!281 = !DILocalVariable(name: "desc_text", scope: !262, file: !124, line: 625, type: !194)
!282 = !DILocalVariable(name: "__ptr", scope: !283, file: !124, line: 644, type: !194)
!283 = distinct !DILexicalBlock(scope: !262, file: !124, line: 644, column: 3)
!284 = !DILocalVariable(name: "__stream", scope: !283, file: !124, line: 644, type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !287, line: 7, baseType: !288)
!287 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !289, line: 49, size: 1728, elements: !290)
!289 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !306, !308, !309, !310, !311, !312, !314, !315, !318, !320, !323, !326, !327, !328, !329, !330}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !288, file: !289, line: 51, baseType: !125, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !288, file: !289, line: 54, baseType: !189, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !288, file: !289, line: 55, baseType: !189, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !288, file: !289, line: 56, baseType: !189, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !288, file: !289, line: 57, baseType: !189, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !288, file: !289, line: 58, baseType: !189, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !288, file: !289, line: 59, baseType: !189, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !288, file: !289, line: 60, baseType: !189, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !288, file: !289, line: 61, baseType: !189, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !288, file: !289, line: 64, baseType: !189, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !288, file: !289, line: 65, baseType: !189, size: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !288, file: !289, line: 66, baseType: !189, size: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !288, file: !289, line: 68, baseType: !304, size: 64, offset: 768)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !289, line: 36, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !288, file: !289, line: 70, baseType: !307, size: 64, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !288, file: !289, line: 72, baseType: !125, size: 32, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !288, file: !289, line: 73, baseType: !125, size: 32, offset: 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !288, file: !289, line: 74, baseType: !186, size: 64, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !288, file: !289, line: 77, baseType: !190, size: 16, offset: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !288, file: !289, line: 78, baseType: !313, size: 8, offset: 1040)
!313 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !288, file: !289, line: 79, baseType: !91, size: 8, offset: 1048)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !288, file: !289, line: 81, baseType: !316, size: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !289, line: 43, baseType: null)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !288, file: !289, line: 89, baseType: !319, size: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !187, line: 153, baseType: !188)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !288, file: !289, line: 91, baseType: !321, size: 64, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !289, line: 37, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !288, file: !289, line: 92, baseType: !324, size: 64, offset: 1280)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !289, line: 38, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !288, file: !289, line: 93, baseType: !307, size: 64, offset: 1344)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !288, file: !289, line: 94, baseType: !181, size: 64, offset: 1408)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !288, file: !289, line: 95, baseType: !191, size: 64, offset: 1472)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !288, file: !289, line: 96, baseType: !125, size: 32, offset: 1536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !288, file: !289, line: 98, baseType: !331, size: 160, offset: 1568)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 20)
!334 = !DILocalVariable(name: "__cnt", scope: !283, file: !124, line: 644, type: !191)
!335 = !DILocalVariable(name: "url_program", scope: !262, file: !124, line: 648, type: !194)
!336 = !DILocalVariable(name: "__ptr", scope: !337, file: !124, line: 686, type: !194)
!337 = distinct !DILexicalBlock(scope: !262, file: !124, line: 686, column: 3)
!338 = !DILocalVariable(name: "__stream", scope: !337, file: !124, line: 686, type: !285)
!339 = !DILocalVariable(name: "__cnt", scope: !337, file: !124, line: 686, type: !191)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !124, line: 585, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 5)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !124, line: 586, type: !342, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !124, line: 595, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 4)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !124, line: 620, type: !21, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !247, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !342, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !349, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !240, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !124, line: 650, type: !342, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !21, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !21, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !124, line: 652, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 7)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !124, line: 653, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 8)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !124, line: 654, type: !96, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !124, line: 655, type: !96, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !124, line: 656, type: !96, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !124, line: 657, type: !96, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !124, line: 663, type: !370, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !124, line: 664, type: !96, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 17)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 40)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 15)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 61)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !124, line: 679, type: !240, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !124, line: 683, type: !342, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !124, line: 688, type: !342, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !124, line: 691, type: !375, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !124, line: 839, type: !215, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !124, line: 840, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 22)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !124, line: 841, type: !402, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !124, line: 862, type: !349, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !124, line: 868, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 71)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !124, line: 875, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 27)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 51)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !230, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !21, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 151, type: !21, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 11)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !342, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !225, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 155, type: !370, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !375, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !342, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !342, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !375, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "remove_methods", scope: !108, file: !2, line: 125, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 96, elements: !241)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !370, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !342, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !210, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "remove_args", scope: !108, file: !2, line: 120, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 256, elements: !350)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 984, type: !392, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 989, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 45)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !392, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 864, type: !422, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !2, line: 869, type: !436, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !235, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "patterns", scope: !108, file: !2, line: 697, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 1760, elements: !502)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!502 = !{!503}
!503 = !DISubrange(count: 55)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !220, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 476, type: !200, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 525, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 32)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !2, line: 546, type: !392, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 558, type: !517, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 19)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 580, type: !436, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 35)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 300, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 13)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !370, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !235, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !392, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1152, type: !9, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1159, type: !331, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1071, type: !529, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1095, type: !220, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1105, type: !235, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1109, type: !230, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "nameset", scope: !108, file: !2, line: 998, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 520, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 65)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 2816, elements: !453)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !558, line: 50, size: 256, elements: !559)
!558 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!559 = !{!560, !561, !562, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !557, file: !558, line: 52, baseType: !194, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !557, file: !558, line: 55, baseType: !125, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !557, file: !558, line: 56, baseType: !563, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !557, file: !558, line: 57, baseType: !125, size: 32, offset: 192)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !567, line: 3, type: !402, isLocal: true, isDefinition: true)
!567 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "Version", scope: !570, file: !567, line: 3, type: !194, isLocal: false, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C11, file: !567, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !571, splitDebugInlining: false, nameTableKind: None)
!571 = !{!565, !568}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !574, file: !575, line: 65, type: !596, isLocal: false, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C11, file: !575, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !576, retainedTypes: !579, globals: !580, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!576 = !{!577}
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !578, line: 42, baseType: !111, size: 32, elements: !131)
!578 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!579 = !{!181, !194, !196}
!580 = !{!572, !581, !583, !585, !590, !592, !594}
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !575, line: 141, type: !370, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !575, line: 141, type: !436, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !575, line: 142, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 29)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !575, line: 160, type: !235, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !575, line: 165, type: !375, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !575, line: 170, type: !342, isLocal: true, isDefinition: true)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !597, line: 69, baseType: !598)
!597 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null}
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "file_name", scope: !603, file: !604, line: 45, type: !194, isLocal: true, isDefinition: true)
!603 = distinct !DICompileUnit(language: DW_LANG_C11, file: !604, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !605, splitDebugInlining: false, nameTableKind: None)
!604 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!605 = !{!606, !608, !610, !612, !601, !614}
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !604, line: 121, type: !370, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !604, line: 121, type: !230, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !604, line: 123, type: !370, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !604, line: 126, type: !240, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !603, file: !604, line: 55, type: !272, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !618, file: !619, line: 66, type: !598, isLocal: false, isDefinition: true)
!618 = distinct !DICompileUnit(language: DW_LANG_C11, file: !619, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !620, globals: !621, splitDebugInlining: false, nameTableKind: None)
!619 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!620 = !{!181, !196}
!621 = !{!622, !624, !647, !649, !651, !653, !616, !655, !657, !659, !661, !663}
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !619, line: 272, type: !342, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "old_file_name", scope: !626, file: !619, line: 304, type: !194, isLocal: true, isDefinition: true)
!626 = distinct !DISubprogram(name: "verror_at_line", scope: !619, file: !619, line: 298, type: !627, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !618, retainedNodes: !640)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !125, !125, !194, !111, !194, !629}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !185, line: 52, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !631, line: 12, baseType: !632)
!631 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !619, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !634)
!634 = !{!635, !636, !637, !638, !639}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !633, file: !619, baseType: !181, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !633, file: !619, baseType: !181, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !633, file: !619, baseType: !181, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !633, file: !619, baseType: !125, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !633, file: !619, baseType: !125, size: 32, offset: 224)
!640 = !{!641, !642, !643, !644, !645, !646}
!641 = !DILocalVariable(name: "status", arg: 1, scope: !626, file: !619, line: 298, type: !125)
!642 = !DILocalVariable(name: "errnum", arg: 2, scope: !626, file: !619, line: 298, type: !125)
!643 = !DILocalVariable(name: "file_name", arg: 3, scope: !626, file: !619, line: 298, type: !194)
!644 = !DILocalVariable(name: "line_number", arg: 4, scope: !626, file: !619, line: 298, type: !111)
!645 = !DILocalVariable(name: "message", arg: 5, scope: !626, file: !619, line: 298, type: !194)
!646 = !DILocalVariable(name: "args", arg: 6, scope: !626, file: !619, line: 298, type: !629)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "old_line_number", scope: !626, file: !619, line: 305, type: !111, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !619, line: 338, type: !349, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !619, line: 346, type: !375, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !619, line: 346, type: !247, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "error_message_count", scope: !618, file: !619, line: 69, type: !111, isLocal: false, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !618, file: !619, line: 295, type: !125, isLocal: false, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !619, line: 208, type: !370, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !619, line: 208, type: !235, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !619, line: 214, type: !342, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !667, file: !668, line: 506, type: !125, isLocal: true, isDefinition: true)
!667 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !668, file: !668, line: 485, type: !669, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !671, retainedNodes: !673)
!668 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!669 = !DISubroutineType(types: !670)
!670 = !{!125, !125, !125}
!671 = distinct !DICompileUnit(language: DW_LANG_C11, file: !668, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !672, splitDebugInlining: false, nameTableKind: None)
!672 = !{!665}
!673 = !{!674, !675, !676, !677, !680}
!674 = !DILocalVariable(name: "fd", arg: 1, scope: !667, file: !668, line: 485, type: !125)
!675 = !DILocalVariable(name: "target", arg: 2, scope: !667, file: !668, line: 485, type: !125)
!676 = !DILocalVariable(name: "result", scope: !667, file: !668, line: 487, type: !125)
!677 = !DILocalVariable(name: "flags", scope: !678, file: !668, line: 530, type: !125)
!678 = distinct !DILexicalBlock(scope: !679, file: !668, line: 529, column: 5)
!679 = distinct !DILexicalBlock(scope: !667, file: !668, line: 528, column: 7)
!680 = !DILocalVariable(name: "saved_errno", scope: !681, file: !668, line: 533, type: !125)
!681 = distinct !DILexicalBlock(scope: !682, file: !668, line: 532, column: 9)
!682 = distinct !DILexicalBlock(scope: !678, file: !668, line: 531, column: 11)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !685, line: 161, type: !247, isLocal: true, isDefinition: true)
!685 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !685, line: 163, type: !91, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !685, line: 233, type: !21, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !685, line: 251, type: !21, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "power_letter", scope: !694, file: !685, line: 36, type: !726, isLocal: true, isDefinition: true)
!694 = distinct !DICompileUnit(language: DW_LANG_C11, file: !685, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-human.o -MD -MP -MF lib/.deps/libcoreutils_a-human.Tpo -c lib/human.c -o lib/.libcoreutils_a-human.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !695, retainedTypes: !706, globals: !707, splitDebugInlining: false, nameTableKind: None)
!695 = !{!696, !698}
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 47, baseType: !111, size: 32, elements: !166)
!697 = !DIFile(filename: "lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !699, line: 30, baseType: !111, size: 32, elements: !700)
!699 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!700 = !{!701, !702, !703, !704, !705}
!701 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!702 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!703 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!704 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!705 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!706 = !{!182, !181}
!707 = !{!683, !686, !688, !690, !692, !708, !710, !712, !714, !716, !718, !721, !724}
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !685, line: 417, type: !452, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !685, line: 418, type: !96, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !685, line: 438, type: !220, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !685, line: 398, type: !402, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !685, line: 398, type: !240, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "block_size_args", scope: !694, file: !685, line: 398, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 192, elements: !241)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !694, file: !685, line: 399, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 64, elements: !248)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !685, line: 408, type: !215, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 88, elements: !453)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "program_name", scope: !729, file: !730, line: 31, type: !194, isLocal: false, isDefinition: true)
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !730, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !731, globals: !732, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!731 = !{!181, !189}
!732 = !{!727, !733, !735}
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !730, line: 46, type: !375, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !730, line: 49, type: !349, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "utf07FF", scope: !739, file: !740, line: 46, type: !767, isLocal: true, isDefinition: true)
!739 = distinct !DISubprogram(name: "proper_name_lite", scope: !740, file: !740, line: 38, type: !741, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !743, retainedNodes: !745)
!740 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!741 = !DISubroutineType(types: !742)
!742 = !{!194, !194, !194}
!743 = distinct !DICompileUnit(language: DW_LANG_C11, file: !740, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !744, splitDebugInlining: false, nameTableKind: None)
!744 = !{!737}
!745 = !{!746, !747, !748, !749, !754}
!746 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !739, file: !740, line: 38, type: !194)
!747 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !739, file: !740, line: 38, type: !194)
!748 = !DILocalVariable(name: "translation", scope: !739, file: !740, line: 40, type: !194)
!749 = !DILocalVariable(name: "w", scope: !739, file: !740, line: 47, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !751, line: 37, baseType: !752)
!751 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !187, line: 57, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !187, line: 42, baseType: !111)
!754 = !DILocalVariable(name: "mbs", scope: !739, file: !740, line: 48, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !756, line: 6, baseType: !757)
!756 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !758, line: 21, baseType: !759)
!758 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 13, size: 64, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !759, file: !758, line: 15, baseType: !125, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !759, file: !758, line: 20, baseType: !763, size: 32, offset: 32)
!763 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !759, file: !758, line: 16, size: 32, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !763, file: !758, line: 18, baseType: !111, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !763, file: !758, line: 19, baseType: !349, size: 32)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 16, elements: !248)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !770, line: 78, type: !375, isLocal: true, isDefinition: true)
!770 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !770, line: 79, type: !21, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !770, line: 80, type: !529, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !770, line: 81, type: !529, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !770, line: 82, type: !331, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !770, line: 83, type: !247, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !770, line: 84, type: !375, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !770, line: 85, type: !370, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !770, line: 86, type: !370, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !770, line: 87, type: !375, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !791, file: !770, line: 76, type: !863, isLocal: false, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C11, file: !770, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !792, retainedTypes: !798, globals: !799, splitDebugInlining: false, nameTableKind: None)
!792 = !{!577, !793, !143}
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !578, line: 254, baseType: !111, size: 32, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!796 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!797 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!798 = !{!181, !125, !190, !191}
!799 = !{!768, !771, !773, !775, !777, !779, !781, !783, !785, !787, !789, !800, !804, !814, !816, !821, !823, !825, !827, !829, !852, !859, !861}
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !791, file: !770, line: 92, type: !802, isLocal: false, isDefinition: true)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 320, elements: !97)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !791, file: !770, line: 1040, type: !806, isLocal: false, isDefinition: true)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !770, line: 56, size: 448, elements: !807)
!807 = !{!808, !809, !810, !812, !813}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !806, file: !770, line: 59, baseType: !577, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !806, file: !770, line: 62, baseType: !125, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !806, file: !770, line: 66, baseType: !811, size: 256, offset: 64)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !376)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !806, file: !770, line: 69, baseType: !194, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !806, file: !770, line: 72, baseType: !194, size: 64, offset: 384)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !791, file: !770, line: 107, type: !806, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "slot0", scope: !791, file: !770, line: 831, type: !818, isLocal: true, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 256)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !770, line: 321, type: !247, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !770, line: 357, type: !247, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !770, line: 358, type: !247, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !770, line: 199, type: !370, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "quote", scope: !831, file: !770, line: 228, type: !850, isLocal: true, isDefinition: true)
!831 = distinct !DISubprogram(name: "gettext_quote", scope: !770, file: !770, line: 197, type: !832, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !791, retainedNodes: !834)
!832 = !DISubroutineType(types: !833)
!833 = !{!194, !194, !577}
!834 = !{!835, !836, !837, !838, !839}
!835 = !DILocalVariable(name: "msgid", arg: 1, scope: !831, file: !770, line: 197, type: !194)
!836 = !DILocalVariable(name: "s", arg: 2, scope: !831, file: !770, line: 197, type: !577)
!837 = !DILocalVariable(name: "translation", scope: !831, file: !770, line: 199, type: !194)
!838 = !DILocalVariable(name: "w", scope: !831, file: !770, line: 229, type: !750)
!839 = !DILocalVariable(name: "mbs", scope: !831, file: !770, line: 230, type: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !756, line: 6, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !758, line: 21, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 13, size: 64, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !842, file: !758, line: 15, baseType: !125, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !842, file: !758, line: 20, baseType: !846, size: 32, offset: 32)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !842, file: !758, line: 16, size: 32, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !846, file: !758, line: 18, baseType: !111, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !846, file: !758, line: 19, baseType: !349, size: 32)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !851)
!851 = !{!249, !351}
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "slotvec", scope: !791, file: !770, line: 834, type: !854, isLocal: true, isDefinition: true)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !770, line: 823, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !855, file: !770, line: 825, baseType: !191, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !855, file: !770, line: 826, baseType: !189, size: 64, offset: 64)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "nslots", scope: !791, file: !770, line: 832, type: !125, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "slotvec0", scope: !791, file: !770, line: 833, type: !855, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 704, elements: !453)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !866, line: 183, type: !240, isLocal: true, isDefinition: true)
!866 = !DIFile(filename: "lib/randread.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2a439877b8fd91186e97781a416043df")
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !866, line: 107, type: !529, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !866, line: 107, type: !402, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !866, line: 107, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 272, elements: !206)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !866, line: 108, type: !215, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !866, line: 108, type: !402, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !880, line: 67, type: !230, isLocal: true, isDefinition: true)
!880 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !880, line: 69, type: !370, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !880, line: 83, type: !370, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !880, line: 83, type: !349, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !880, line: 85, type: !247, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !880, line: 88, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 171)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !880, line: 88, type: !205, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !880, line: 105, type: !215, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !880, line: 109, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 23)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !880, line: 113, type: !905, isLocal: true, isDefinition: true)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 28)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !880, line: 120, type: !510, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !880, line: 127, type: !912, isLocal: true, isDefinition: true)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 36)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !880, line: 134, type: !397, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !880, line: 142, type: !919, isLocal: true, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 44)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !880, line: 150, type: !924, isLocal: true, isDefinition: true)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 48)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !880, line: 159, type: !929, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 52)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !880, line: 170, type: !46, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !880, line: 248, type: !331, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !880, line: 248, type: !422, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !880, line: 254, type: !331, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !880, line: 254, type: !225, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !880, line: 254, type: !397, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !880, line: 259, type: !3, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !880, line: 259, type: !587, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !950, file: !951, line: 26, type: !953, isLocal: false, isDefinition: true)
!950 = distinct !DICompileUnit(language: DW_LANG_C11, file: !951, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !952, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!952 = !{!948}
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 376, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 47)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "exit_failure", scope: !958, file: !959, line: 24, type: !961, isLocal: false, isDefinition: true)
!958 = distinct !DICompileUnit(language: DW_LANG_C11, file: !959, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !960, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!960 = !{!956}
!961 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !125)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !964, line: 34, type: !240, isLocal: true, isDefinition: true)
!964 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !964, line: 34, type: !370, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !964, line: 34, type: !392, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !971, line: 80, type: !370, isLocal: true, isDefinition: true)
!971 = !DIFile(filename: "lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !974, line: 108, type: !91, isLocal: true, isDefinition: true)
!974 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "internal_state", scope: !977, file: !974, line: 97, type: !980, isLocal: true, isDefinition: true)
!977 = distinct !DICompileUnit(language: DW_LANG_C11, file: !974, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !978, globals: !979, splitDebugInlining: false, nameTableKind: None)
!978 = !{!181, !191, !196}
!979 = !{!972, !975}
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !756, line: 6, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !758, line: 21, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 13, size: 64, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !982, file: !758, line: 15, baseType: !125, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !982, file: !758, line: 20, baseType: !986, size: 32, offset: 32)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !982, file: !758, line: 16, size: 32, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !986, file: !758, line: 18, baseType: !111, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !986, file: !758, line: 19, baseType: !349, size: 32)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !992, line: 35, type: !247, isLocal: true, isDefinition: true)
!992 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !992, line: 35, type: !21, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !997, line: 202, type: !370, isLocal: true, isDefinition: true)
!997 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !1000, file: !997, line: 211, type: !1186, isLocal: true, isDefinition: true)
!1000 = distinct !DISubprogram(name: "printf_fetchargs", scope: !997, file: !997, line: 42, type: !1001, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1177, retainedNodes: !1181)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!125, !1003, !1013}
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1004, line: 12, baseType: !1005)
!1004 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "7bd78a282b99fcfe41a9e3c566d14f7d")
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !997, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1006, file: !997, baseType: !181, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1006, file: !997, baseType: !181, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1006, file: !997, baseType: !181, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1006, file: !997, baseType: !125, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1006, file: !997, baseType: !125, size: 32, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !1015, line: 185, baseType: !1016)
!1015 = !DIFile(filename: "lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1015, line: 179, size: 1920, elements: !1017)
!1017 = !{!1018, !1019, !1175}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1016, file: !1015, line: 181, baseType: !191, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1016, file: !1015, line: 182, baseType: !1020, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !1015, line: 174, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1015, line: 111, size: 256, elements: !1023)
!1023 = !{!1024, !1075}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1022, file: !1015, line: 113, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !1015, line: 108, baseType: !1026)
!1026 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1015, line: 47, baseType: !111, size: 32, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1028 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1029 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1030 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1031 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1032 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1033 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1034 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1035 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1036 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1037 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1038 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1039 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1040 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1041 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1042 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1043 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1044 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1045 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1046 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1047 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1048 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1049 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1050 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1051 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1052 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1053 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1054 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1055 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1056 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1057 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1058 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1059 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1060 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1061 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1062 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1063 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1064 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1065 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1066 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1067 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1068 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1069 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1070 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1071 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1072 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1073 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1074 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1022, file: !1015, line: 172, baseType: !1076, size: 128, offset: 128)
!1076 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1022, file: !1015, line: 114, size: 128, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1082, !1083, !1084, !1085, !1086, !1087, !1089, !1091, !1095, !1099, !1102, !1105, !1108, !1110, !1113, !1116, !1119, !1121, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1140, !1143, !1144, !1149, !1150, !1152, !1154, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1076, file: !1015, line: 116, baseType: !313, size: 8)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1076, file: !1015, line: 117, baseType: !196, size: 8)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !1076, file: !1015, line: 118, baseType: !1081, size: 16)
!1081 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !1076, file: !1015, line: 119, baseType: !190, size: 16)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !1076, file: !1015, line: 120, baseType: !125, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !1076, file: !1015, line: 121, baseType: !111, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !1076, file: !1015, line: 122, baseType: !188, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !1076, file: !1015, line: 123, baseType: !193, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !1076, file: !1015, line: 124, baseType: !1088, size: 64)
!1088 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !1076, file: !1015, line: 125, baseType: !1090, size: 64)
!1090 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !1076, file: !1015, line: 126, baseType: !1092, size: 8)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1093, line: 24, baseType: !1094)
!1093 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !187, line: 37, baseType: !313)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !1076, file: !1015, line: 127, baseType: !1096, size: 8)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1097, line: 24, baseType: !1098)
!1097 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !187, line: 38, baseType: !196)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !1076, file: !1015, line: 128, baseType: !1100, size: 16)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1093, line: 25, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !187, line: 39, baseType: !1081)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !1076, file: !1015, line: 129, baseType: !1103, size: 16)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1097, line: 25, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !187, line: 40, baseType: !190)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !1076, file: !1015, line: 130, baseType: !1106, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1093, line: 26, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !187, line: 41, baseType: !125)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !1076, file: !1015, line: 131, baseType: !1109, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1097, line: 26, baseType: !753)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !1076, file: !1015, line: 132, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1093, line: 27, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !187, line: 44, baseType: !188)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !1076, file: !1015, line: 133, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1097, line: 27, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !187, line: 45, baseType: !193)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !1076, file: !1015, line: 134, baseType: !1117, size: 8)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !1118, line: 58, baseType: !313)
!1118 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !1076, file: !1015, line: 135, baseType: !1120, size: 8)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !1118, line: 71, baseType: !196)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !1076, file: !1015, line: 136, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !1118, line: 60, baseType: !188)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !1076, file: !1015, line: 137, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !1118, line: 73, baseType: !193)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !1076, file: !1015, line: 138, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !1118, line: 61, baseType: !188)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !1076, file: !1015, line: 139, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !1118, line: 74, baseType: !193)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !1076, file: !1015, line: 140, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !1118, line: 62, baseType: !188)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !1076, file: !1015, line: 141, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !1118, line: 75, baseType: !193)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !1076, file: !1015, line: 142, baseType: !1134, size: 32)
!1134 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !1076, file: !1015, line: 143, baseType: !1136, size: 64)
!1136 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !1076, file: !1015, line: 144, baseType: !1138, size: 128)
!1138 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !1076, file: !1015, line: 145, baseType: !125, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !1076, file: !1015, line: 147, baseType: !1141, size: 32)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1142, line: 20, baseType: !111)
!1142 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !1076, file: !1015, line: 149, baseType: !194, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !1076, file: !1015, line: 150, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !1148, line: 24, baseType: !111)
!1148 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_wchar_t.h", directory: "", checksumkind: CSK_MD5, checksum: "1bf0c51e90dd5eb05cdcc01afdea587a")
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !1076, file: !1015, line: 151, baseType: !181, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !1076, file: !1015, line: 152, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !1076, file: !1015, line: 153, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !1076, file: !1015, line: 154, baseType: !563, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !1076, file: !1015, line: 155, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !1076, file: !1015, line: 156, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !1076, file: !1015, line: 157, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !1076, file: !1015, line: 158, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !1076, file: !1015, line: 159, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !1076, file: !1015, line: 160, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !1076, file: !1015, line: 161, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !1076, file: !1015, line: 162, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !1076, file: !1015, line: 163, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !1076, file: !1015, line: 164, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !1016, file: !1015, line: 183, baseType: !1176, size: 1792, offset: 128)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 1792, elements: !371)
!1177 = distinct !DICompileUnit(language: DW_LANG_C11, file: !997, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-printf-args.o -MD -MP -MF lib/.deps/libcoreutils_a-printf-args.Tpo -c lib/printf-args.c -o lib/.libcoreutils_a-printf-args.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1178, retainedTypes: !1179, globals: !1180, splitDebugInlining: false, nameTableKind: None)
!1178 = !{!1026}
!1179 = !{!181, !1147}
!1180 = !{!995, !998}
!1181 = !{!1182, !1183, !1184, !1185}
!1182 = !DILocalVariable(name: "args", arg: 1, scope: !1000, file: !997, line: 42, type: !1003)
!1183 = !DILocalVariable(name: "a", arg: 2, scope: !1000, file: !997, line: 42, type: !1013)
!1184 = !DILocalVariable(name: "i", scope: !1000, file: !997, line: 44, type: !191)
!1185 = !DILocalVariable(name: "ap", scope: !1000, file: !997, line: 45, type: !1020)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 224, elements: !371)
!1187 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1188, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-basename-lgpl.o -MD -MP -MF lib/.deps/libcoreutils_a-basename-lgpl.Tpo -c lib/basename-lgpl.c -o lib/.libcoreutils_a-basename-lgpl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1189, splitDebugInlining: false, nameTableKind: None)
!1188 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!1189 = !{!189}
