; ModuleID = 'src/shuf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.linebuffer = type { i64, i64, ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.randint_source = type { ptr, i64, i64 }
%struct.randread_source = type { ptr, ptr, ptr, %union.anon.6 }
%union.anon.6 = type { %struct.isaac }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%union.anon.0 = type { [256 x i64] }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 33)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 503, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 17)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 528, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 2)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !212, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 530, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 3)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 556, type: !71, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 11)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 577, type: !212, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 19)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !98, line: 729, type: !34, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !98, line: 736, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 75)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !245, file: !98, line: 575, type: !99, isLocal: true, isDefinition: true)
!245 = distinct !DISubprogram(name: "oputs_", scope: !98, file: !98, line: 573, type: !246, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !248)
!246 = !DISubroutineType(cc: DW_CC_nocall, types: !247)
!247 = !{null, !151, !151}
!248 = !{!249, !250, !251, !254, !256, !257, !258, !262, !263, !264, !265, !267, !314, !315, !316, !318, !319}
!249 = !DILocalVariable(name: "program", arg: 1, scope: !245, file: !98, line: 573, type: !151)
!250 = !DILocalVariable(name: "option", arg: 2, scope: !245, file: !98, line: 573, type: !151)
!251 = !DILocalVariable(name: "term", scope: !252, file: !98, line: 585, type: !151)
!252 = distinct !DILexicalBlock(scope: !253, file: !98, line: 582, column: 5)
!253 = distinct !DILexicalBlock(scope: !245, file: !98, line: 581, column: 7)
!254 = !DILocalVariable(name: "double_space", scope: !245, file: !98, line: 594, type: !255)
!255 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!256 = !DILocalVariable(name: "first_word", scope: !245, file: !98, line: 595, type: !151)
!257 = !DILocalVariable(name: "option_text", scope: !245, file: !98, line: 596, type: !151)
!258 = !DILocalVariable(name: "s", scope: !259, file: !98, line: 608, type: !151)
!259 = distinct !DILexicalBlock(scope: !260, file: !98, line: 605, column: 5)
!260 = distinct !DILexicalBlock(scope: !261, file: !98, line: 604, column: 12)
!261 = distinct !DILexicalBlock(scope: !245, file: !98, line: 597, column: 7)
!262 = !DILocalVariable(name: "spaces", scope: !259, file: !98, line: 609, type: !148)
!263 = !DILocalVariable(name: "anchor_len", scope: !245, file: !98, line: 620, type: !148)
!264 = !DILocalVariable(name: "desc_text", scope: !245, file: !98, line: 625, type: !151)
!265 = !DILocalVariable(name: "__ptr", scope: !266, file: !98, line: 644, type: !151)
!266 = distinct !DILexicalBlock(scope: !245, file: !98, line: 644, column: 3)
!267 = !DILocalVariable(name: "__stream", scope: !266, file: !98, line: 644, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !270, line: 7, baseType: !271)
!270 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !272, line: 49, size: 1728, elements: !273)
!272 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !289, !291, !292, !293, !294, !295, !297, !298, !301, !303, !306, !309, !310, !311, !312, !313}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !271, file: !272, line: 51, baseType: !99, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !271, file: !272, line: 54, baseType: !145, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !271, file: !272, line: 55, baseType: !145, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !271, file: !272, line: 56, baseType: !145, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !271, file: !272, line: 57, baseType: !145, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !271, file: !272, line: 58, baseType: !145, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !271, file: !272, line: 59, baseType: !145, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !271, file: !272, line: 60, baseType: !145, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !271, file: !272, line: 61, baseType: !145, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !271, file: !272, line: 64, baseType: !145, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !271, file: !272, line: 65, baseType: !145, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !271, file: !272, line: 66, baseType: !145, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !271, file: !272, line: 68, baseType: !287, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !272, line: 36, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !271, file: !272, line: 70, baseType: !290, size: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !271, file: !272, line: 72, baseType: !99, size: 32, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !271, file: !272, line: 73, baseType: !99, size: 32, offset: 928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !271, file: !272, line: 74, baseType: !156, size: 64, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !271, file: !272, line: 77, baseType: !147, size: 16, offset: 1024)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !271, file: !272, line: 78, baseType: !296, size: 8, offset: 1040)
!296 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !271, file: !272, line: 79, baseType: !66, size: 8, offset: 1048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !271, file: !272, line: 81, baseType: !299, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !272, line: 43, baseType: null)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !271, file: !272, line: 89, baseType: !302, size: 64, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !157, line: 153, baseType: !158)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !271, file: !272, line: 91, baseType: !304, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !272, line: 37, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !271, file: !272, line: 92, baseType: !307, size: 64, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !272, line: 38, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !271, file: !272, line: 93, baseType: !290, size: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !271, file: !272, line: 94, baseType: !146, size: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !271, file: !272, line: 95, baseType: !148, size: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !271, file: !272, line: 96, baseType: !99, size: 32, offset: 1536)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !271, file: !272, line: 98, baseType: !172, size: 160, offset: 1568)
!314 = !DILocalVariable(name: "__cnt", scope: !266, file: !98, line: 644, type: !148)
!315 = !DILocalVariable(name: "url_program", scope: !245, file: !98, line: 648, type: !151)
!316 = !DILocalVariable(name: "__ptr", scope: !317, file: !98, line: 686, type: !151)
!317 = distinct !DILexicalBlock(scope: !245, file: !98, line: 686, column: 3)
!318 = !DILocalVariable(name: "__stream", scope: !317, file: !98, line: 686, type: !268)
!319 = !DILocalVariable(name: "__cnt", scope: !317, file: !98, line: 686, type: !148)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !98, line: 585, type: !19, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !98, line: 586, type: !19, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !98, line: 595, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 4)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !98, line: 620, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 6)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !98, line: 648, type: !212, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !98, line: 648, type: !19, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !98, line: 649, type: !326, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !98, line: 649, type: !219, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !98, line: 650, type: !19, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !98, line: 651, type: !331, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !98, line: 651, type: !331, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !98, line: 652, type: !167, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !98, line: 653, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !98, line: 654, type: !71, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !98, line: 655, type: !71, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !98, line: 656, type: !71, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !98, line: 657, type: !71, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !98, line: 663, type: !167, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !98, line: 664, type: !71, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !98, line: 669, type: !207, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !98, line: 669, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 40)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !98, line: 676, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 15)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !98, line: 676, type: !24, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !98, line: 679, type: !219, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !98, line: 683, type: !19, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !98, line: 688, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !98, line: 691, type: !352, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !98, line: 839, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 16)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !98, line: 840, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 22)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !98, line: 841, type: !376, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !98, line: 862, type: !326, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !98, line: 868, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 71)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !98, line: 875, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 27)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !98, line: 877, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 51)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !98, line: 877, type: !197, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !19, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !197, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !226, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !167, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !192, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !167, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !391, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !19, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !352, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 21)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !98, line: 952, type: !197, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 2560, elements: !72)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !448, line: 50, size: 256, elements: !449)
!448 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!449 = !{!450, !451, !452, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !448, line: 52, baseType: !151, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !447, file: !448, line: 55, baseType: !99, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !448, line: 56, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !447, file: !448, line: 57, baseType: !99, size: 32, offset: 192)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !457, line: 3, type: !376, isLocal: true, isDefinition: true)
!457 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "Version", scope: !460, file: !457, line: 3, type: !151, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !457, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !461, splitDebugInlining: false, nameTableKind: None)
!461 = !{!455, !458}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "file_name", scope: !464, file: !465, line: 45, type: !151, isLocal: true, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C11, file: !465, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !466, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!466 = !{!467, !469, !471, !473, !462, !475}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !167, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !197, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !465, line: 123, type: !167, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !465, line: 126, type: !219, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !464, file: !465, line: 55, type: !255, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !479, file: !480, line: 66, type: !527, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C11, file: !480, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!481 = !{!146, !153}
!482 = !{!483, !485, !509, !511, !513, !515, !477, !517, !519, !521, !523, !525}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !480, line: 272, type: !19, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "old_file_name", scope: !487, file: !480, line: 304, type: !151, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "verror_at_line", scope: !480, file: !480, line: 298, type: !488, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !502)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !99, !99, !151, !87, !151, !490}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !491, line: 52, baseType: !492)
!491 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !493, line: 12, baseType: !494)
!493 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !480, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !496)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !495, file: !480, baseType: !146, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !495, file: !480, baseType: !146, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !495, file: !480, baseType: !146, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !495, file: !480, baseType: !99, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !495, file: !480, baseType: !99, size: 32, offset: 224)
!502 = !{!503, !504, !505, !506, !507, !508}
!503 = !DILocalVariable(name: "status", arg: 1, scope: !487, file: !480, line: 298, type: !99)
!504 = !DILocalVariable(name: "errnum", arg: 2, scope: !487, file: !480, line: 298, type: !99)
!505 = !DILocalVariable(name: "file_name", arg: 3, scope: !487, file: !480, line: 298, type: !151)
!506 = !DILocalVariable(name: "line_number", arg: 4, scope: !487, file: !480, line: 298, type: !87)
!507 = !DILocalVariable(name: "message", arg: 5, scope: !487, file: !480, line: 298, type: !151)
!508 = !DILocalVariable(name: "args", arg: 6, scope: !487, file: !480, line: 298, type: !490)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "old_line_number", scope: !487, file: !480, line: 305, type: !87, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !480, line: 338, type: !326, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !352, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !212, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "error_message_count", scope: !479, file: !480, line: 69, type: !87, isLocal: false, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !479, file: !480, line: 295, type: !99, isLocal: false, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !167, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !440, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !480, line: 214, type: !19, isLocal: true, isDefinition: true)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !532, line: 40, type: !71, isLocal: true, isDefinition: true)
!532 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "program_name", scope: !535, file: !536, line: 31, type: !151, isLocal: false, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C11, file: !536, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !537, globals: !538, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!537 = !{!146, !145}
!538 = !{!533, !539, !541}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !536, line: 46, type: !352, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !536, line: 49, type: !326, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "utf07FF", scope: !545, file: !546, line: 46, type: !573, isLocal: true, isDefinition: true)
!545 = distinct !DISubprogram(name: "proper_name_lite", scope: !546, file: !546, line: 38, type: !547, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !549, retainedNodes: !551)
!546 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!547 = !DISubroutineType(types: !548)
!548 = !{!151, !151, !151}
!549 = distinct !DICompileUnit(language: DW_LANG_C11, file: !546, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !550, splitDebugInlining: false, nameTableKind: None)
!550 = !{!543}
!551 = !{!552, !553, !554, !555, !560}
!552 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !545, file: !546, line: 38, type: !151)
!553 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !545, file: !546, line: 38, type: !151)
!554 = !DILocalVariable(name: "translation", scope: !545, file: !546, line: 40, type: !151)
!555 = !DILocalVariable(name: "w", scope: !545, file: !546, line: 47, type: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !557, line: 37, baseType: !558)
!557 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !157, line: 57, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !157, line: 42, baseType: !87)
!560 = !DILocalVariable(name: "mbs", scope: !545, file: !546, line: 48, type: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !562, line: 6, baseType: !563)
!562 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !564, line: 21, baseType: !565)
!564 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 13, size: 64, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !565, file: !564, line: 15, baseType: !99, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !565, file: !564, line: 20, baseType: !569, size: 32, offset: 32)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !564, line: 16, size: 32, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !569, file: !564, line: 18, baseType: !87, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !569, file: !564, line: 19, baseType: !326, size: 32)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16, elements: !213)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !576, line: 78, type: !352, isLocal: true, isDefinition: true)
!576 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !576, line: 79, type: !331, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !576, line: 80, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 13)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !576, line: 81, type: !581, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !576, line: 82, type: !172, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !576, line: 83, type: !212, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !576, line: 84, type: !352, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !576, line: 85, type: !167, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !576, line: 86, type: !167, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !576, line: 87, type: !352, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !600, file: !576, line: 76, type: !674, isLocal: false, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C11, file: !576, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !601, retainedTypes: !609, globals: !610, splitDebugInlining: false, nameTableKind: None)
!601 = !{!602, !604, !129}
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !603, line: 42, baseType: !87, size: 32, elements: !105)
!603 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !603, line: 254, baseType: !87, size: 32, elements: !605)
!605 = !{!606, !607, !608}
!606 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!607 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!608 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!609 = !{!146, !99, !147, !148}
!610 = !{!574, !577, !579, !584, !586, !588, !590, !592, !594, !596, !598, !611, !615, !625, !627, !632, !634, !636, !638, !640, !663, !670, !672}
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !600, file: !576, line: 92, type: !613, isLocal: false, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 320, elements: !72)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !600, file: !576, line: 1040, type: !617, isLocal: false, isDefinition: true)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !576, line: 56, size: 448, elements: !618)
!618 = !{!619, !620, !621, !623, !624}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !617, file: !576, line: 59, baseType: !602, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !617, file: !576, line: 62, baseType: !99, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !617, file: !576, line: 66, baseType: !622, size: 256, offset: 64)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, elements: !353)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !617, file: !576, line: 69, baseType: !151, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !617, file: !576, line: 72, baseType: !151, size: 64, offset: 384)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !600, file: !576, line: 107, type: !617, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "slot0", scope: !600, file: !576, line: 831, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 256)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !576, line: 321, type: !212, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !576, line: 357, type: !212, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !576, line: 358, type: !212, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !576, line: 199, type: !167, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "quote", scope: !642, file: !576, line: 228, type: !661, isLocal: true, isDefinition: true)
!642 = distinct !DISubprogram(name: "gettext_quote", scope: !576, file: !576, line: 197, type: !643, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !600, retainedNodes: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!151, !151, !602}
!645 = !{!646, !647, !648, !649, !650}
!646 = !DILocalVariable(name: "msgid", arg: 1, scope: !642, file: !576, line: 197, type: !151)
!647 = !DILocalVariable(name: "s", arg: 2, scope: !642, file: !576, line: 197, type: !602)
!648 = !DILocalVariable(name: "translation", scope: !642, file: !576, line: 199, type: !151)
!649 = !DILocalVariable(name: "w", scope: !642, file: !576, line: 229, type: !556)
!650 = !DILocalVariable(name: "mbs", scope: !642, file: !576, line: 230, type: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !562, line: 6, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !564, line: 21, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 13, size: 64, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !653, file: !564, line: 15, baseType: !99, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !653, file: !564, line: 20, baseType: !657, size: 32, offset: 32)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !653, file: !564, line: 16, size: 32, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !657, file: !564, line: 18, baseType: !87, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !657, file: !564, line: 19, baseType: !326, size: 32)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !662)
!662 = !{!214, !328}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "slotvec", scope: !600, file: !576, line: 834, type: !665, isLocal: true, isDefinition: true)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !576, line: 823, size: 128, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !666, file: !576, line: 825, baseType: !148, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !666, file: !576, line: 826, baseType: !145, size: 64, offset: 64)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "nslots", scope: !600, file: !576, line: 832, type: !99, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "slotvec0", scope: !600, file: !576, line: 833, type: !666, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 704, elements: !227)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !678, line: 183, type: !219, isLocal: true, isDefinition: true)
!678 = !DIFile(filename: "lib/randread.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2a439877b8fd91186e97781a416043df")
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !678, line: 107, type: !581, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !678, line: 107, type: !376, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !678, line: 107, type: !685, isLocal: true, isDefinition: true)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 272, elements: !188)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !678, line: 108, type: !391, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !678, line: 108, type: !376, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !692, line: 192, type: !326, isLocal: true, isDefinition: true)
!692 = !DIFile(filename: "lib/read-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5e61a5e6b0c83d68cde0efd76e0ac088")
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !692, line: 192, type: !219, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !697, line: 67, type: !197, isLocal: true, isDefinition: true)
!697 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !697, line: 69, type: !167, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !697, line: 83, type: !167, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !697, line: 83, type: !326, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !697, line: 85, type: !212, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !697, line: 88, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 171)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !697, line: 88, type: !187, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !697, line: 105, type: !391, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !697, line: 109, type: !177, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !697, line: 113, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 28)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !697, line: 120, type: !182, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !697, line: 127, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 36)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !697, line: 134, type: !371, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !697, line: 142, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 44)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !697, line: 150, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 48)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !697, line: 159, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 52)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !697, line: 170, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 60)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !697, line: 248, type: !172, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !697, line: 248, type: !396, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !697, line: 254, type: !172, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !697, line: 254, type: !192, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !697, line: 254, type: !371, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !697, line: 259, type: !3, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !697, line: 259, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 29)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !770, file: !771, line: 26, type: !773, isLocal: false, isDefinition: true)
!770 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !772, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!772 = !{!768}
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 376, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 47)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "exit_failure", scope: !778, file: !779, line: 24, type: !781, isLocal: false, isDefinition: true)
!778 = distinct !DICompileUnit(language: DW_LANG_C11, file: !779, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !780, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!780 = !{!776}
!781 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !784, line: 34, type: !219, isLocal: true, isDefinition: true)
!784 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !784, line: 34, type: !167, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !784, line: 34, type: !207, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !791, line: 226, type: !76, isLocal: true, isDefinition: true)
!791 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !791, line: 227, type: !76, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !791, line: 228, type: !202, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !791, line: 231, type: !76, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "default_tuning", scope: !800, file: !791, line: 134, type: !804, isLocal: true, isDefinition: true)
!800 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !801, globals: !803, splitDebugInlining: false, nameTableKind: None)
!801 = !{!150, !146, !802, !148}
!802 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!803 = !{!789, !792, !794, !796, !798}
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !806, line: 52, baseType: !807)
!806 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !806, line: 40, size: 160, elements: !808)
!808 = !{!809, !810, !811, !812, !813}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !807, file: !806, line: 45, baseType: !802, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !807, file: !806, line: 46, baseType: !802, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !807, file: !806, line: 47, baseType: !802, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !807, file: !806, line: 48, baseType: !802, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !807, file: !806, line: 49, baseType: !255, size: 8, offset: 128)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !816, line: 108, type: !66, isLocal: true, isDefinition: true)
!816 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "internal_state", scope: !819, file: !816, line: 97, type: !822, isLocal: true, isDefinition: true)
!819 = distinct !DICompileUnit(language: DW_LANG_C11, file: !816, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, globals: !821, splitDebugInlining: false, nameTableKind: None)
!820 = !{!146, !148, !153}
!821 = !{!814, !817}
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !562, line: 6, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !564, line: 21, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 13, size: 64, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !824, file: !564, line: 15, baseType: !99, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !824, file: !564, line: 20, baseType: !828, size: 32, offset: 32)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !824, file: !564, line: 16, size: 32, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !828, file: !564, line: 18, baseType: !87, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !828, file: !564, line: 19, baseType: !326, size: 32)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !834, file: !835, line: 506, type: !99, isLocal: true, isDefinition: true)
!834 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !835, file: !835, line: 485, type: !836, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !838, retainedNodes: !840)
!835 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!836 = !DISubroutineType(types: !837)
!837 = !{!99, !99, !99}
!838 = distinct !DICompileUnit(language: DW_LANG_C11, file: !835, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !839, splitDebugInlining: false, nameTableKind: None)
!839 = !{!832}
!840 = !{!841, !842, !843, !844, !847}
!841 = !DILocalVariable(name: "fd", arg: 1, scope: !834, file: !835, line: 485, type: !99)
!842 = !DILocalVariable(name: "target", arg: 2, scope: !834, file: !835, line: 485, type: !99)
!843 = !DILocalVariable(name: "result", scope: !834, file: !835, line: 487, type: !99)
!844 = !DILocalVariable(name: "flags", scope: !845, file: !835, line: 530, type: !99)
!845 = distinct !DILexicalBlock(scope: !846, file: !835, line: 529, column: 5)
!846 = distinct !DILexicalBlock(scope: !834, file: !835, line: 528, column: 7)
!847 = !DILocalVariable(name: "saved_errno", scope: !848, file: !835, line: 533, type: !99)
!848 = distinct !DILexicalBlock(scope: !849, file: !835, line: 532, column: 9)
!849 = distinct !DILexicalBlock(scope: !845, file: !835, line: 531, column: 11)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !852, line: 35, type: !212, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !852, line: 35, type: !331, isLocal: true, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !856, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!857 = !{!858}
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 44, baseType: !87, size: 32, elements: !119)
!859 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!860 = distinct !DICompileUnit(language: DW_LANG_C11, file: !861, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!862 = distinct !DICompileUnit(language: DW_LANG_C11, file: !863, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !864, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!864 = !{!146}
!865 = distinct !DICompileUnit(language: DW_LANG_C11, file: !866, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fpurge.o -MD -MP -MF lib/.deps/libcoreutils_a-fpurge.Tpo -c lib/fpurge.c -o lib/.libcoreutils_a-fpurge.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!866 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!867 = distinct !DICompileUnit(language: DW_LANG_C11, file: !532, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-freopen-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-freopen-safer.Tpo -c lib/freopen-safer.c -o lib/.libcoreutils_a-freopen-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !868, splitDebugInlining: false, nameTableKind: None)
!868 = !{!530}
!869 = distinct !DICompileUnit(language: DW_LANG_C11, file: !870, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !864, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!871 = distinct !DICompileUnit(language: DW_LANG_C11, file: !872, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!872 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!873 = distinct !DICompileUnit(language: DW_LANG_C11, file: !874, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-umaxtostr.o -MD -MP -MF lib/.deps/libcoreutils_a-umaxtostr.Tpo -c lib/umaxtostr.c -o lib/.libcoreutils_a-umaxtostr.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !875, splitDebugInlining: false, nameTableKind: None)
!874 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !877, line: 102, baseType: !878)
!877 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !157, line: 73, baseType: !150)
!879 = distinct !DICompileUnit(language: DW_LANG_C11, file: !880, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-linebuffer.o -MD -MP -MF lib/.deps/libcoreutils_a-linebuffer.Tpo -c lib/linebuffer.c -o lib/.libcoreutils_a-linebuffer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !881, splitDebugInlining: false, nameTableKind: None)
!880 = !DIFile(filename: "lib/linebuffer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d85d9b8947aefddab7f1bb42f1d43333")
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!883 = distinct !DICompileUnit(language: DW_LANG_C11, file: !884, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-randint.o -MD -MP -MF lib/.deps/libcoreutils_a-randint.Tpo -c lib/randint.c -o lib/.libcoreutils_a-randint.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!884 = !DIFile(filename: "lib/randint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "11f435a81221ba750eb474b22ae06eb8")
!885 = distinct !DICompileUnit(language: DW_LANG_C11, file: !886, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-randperm.o -MD -MP -MF lib/.deps/libcoreutils_a-randperm.Tpo -c lib/randperm.c -o lib/.libcoreutils_a-randperm.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !864, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "lib/randperm.c", directory: "/src", checksumkind: CSK_MD5, checksum: "40d9ef006b04474ffd3ed51e1e91ea2b")
!887 = distinct !DICompileUnit(language: DW_LANG_C11, file: !678, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-randread.o -MD -MP -MF lib/.deps/libcoreutils_a-randread.Tpo -c lib/randread.c -o lib/.libcoreutils_a-randread.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !888, globals: !889, splitDebugInlining: false, nameTableKind: None)
!888 = !{!148}
!889 = !{!676, !679, !681, !683, !686, !688}
!890 = distinct !DICompileUnit(language: DW_LANG_C11, file: !891, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-rand-isaac.o -MD -MP -MF lib/.deps/libcoreutils_a-rand-isaac.Tpo -c lib/rand-isaac.c -o lib/.libcoreutils_a-rand-isaac.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !892, retainedTypes: !946, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "lib/rand-isaac.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d44161d8d093b6cf59f0cc9f71c527c2")
!892 = !{!893}
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !894, file: !891, line: 100, baseType: !87, size: 32, elements: !944)
!894 = distinct !DISubprogram(name: "isaac_refill", scope: !891, file: !891, line: 90, type: !895, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !890, retainedNodes: !911)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !897, !910}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !899, line: 56, size: 16576, elements: !900)
!899 = !DIFile(filename: "lib/rand-isaac.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4c70774edc5c86c3b7f59097e965130e")
!900 = !{!901, !907, !908, !909}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !898, file: !899, line: 58, baseType: !902, size: 16384)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 16384, elements: !630)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !899, line: 44, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !877, line: 52, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !157, line: 59, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !157, line: 45, baseType: !150)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !898, file: !899, line: 59, baseType: !903, size: 64, offset: 16384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !898, file: !899, line: 59, baseType: !903, size: 64, offset: 16448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !898, file: !899, line: 59, baseType: !903, size: 64, offset: 16512)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!911 = !{!912, !913, !914, !915, !916, !917, !918, !921, !922, !924, !925, !927, !928, !930, !931, !934, !935, !937, !938, !940, !941, !943}
!912 = !DILocalVariable(name: "s", arg: 1, scope: !894, file: !891, line: 90, type: !897)
!913 = !DILocalVariable(name: "result", arg: 2, scope: !894, file: !891, line: 90, type: !910)
!914 = !DILocalVariable(name: "a", scope: !894, file: !891, line: 93, type: !903)
!915 = !DILocalVariable(name: "b", scope: !894, file: !891, line: 94, type: !903)
!916 = !DILocalVariable(name: "m", scope: !894, file: !891, line: 97, type: !910)
!917 = !DILocalVariable(name: "r", scope: !894, file: !891, line: 98, type: !910)
!918 = !DILocalVariable(name: "x", scope: !919, file: !891, line: 118, type: !903)
!919 = distinct !DILexicalBlock(scope: !920, file: !891, line: 118, column: 7)
!920 = distinct !DILexicalBlock(scope: !894, file: !891, line: 117, column: 5)
!921 = !DILocalVariable(name: "y", scope: !919, file: !891, line: 118, type: !903)
!922 = !DILocalVariable(name: "x", scope: !923, file: !891, line: 119, type: !903)
!923 = distinct !DILexicalBlock(scope: !920, file: !891, line: 119, column: 7)
!924 = !DILocalVariable(name: "y", scope: !923, file: !891, line: 119, type: !903)
!925 = !DILocalVariable(name: "x", scope: !926, file: !891, line: 120, type: !903)
!926 = distinct !DILexicalBlock(scope: !920, file: !891, line: 120, column: 7)
!927 = !DILocalVariable(name: "y", scope: !926, file: !891, line: 120, type: !903)
!928 = !DILocalVariable(name: "x", scope: !929, file: !891, line: 121, type: !903)
!929 = distinct !DILexicalBlock(scope: !920, file: !891, line: 121, column: 7)
!930 = !DILocalVariable(name: "y", scope: !929, file: !891, line: 121, type: !903)
!931 = !DILocalVariable(name: "x", scope: !932, file: !891, line: 128, type: !903)
!932 = distinct !DILexicalBlock(scope: !933, file: !891, line: 128, column: 7)
!933 = distinct !DILexicalBlock(scope: !894, file: !891, line: 127, column: 5)
!934 = !DILocalVariable(name: "y", scope: !932, file: !891, line: 128, type: !903)
!935 = !DILocalVariable(name: "x", scope: !936, file: !891, line: 129, type: !903)
!936 = distinct !DILexicalBlock(scope: !933, file: !891, line: 129, column: 7)
!937 = !DILocalVariable(name: "y", scope: !936, file: !891, line: 129, type: !903)
!938 = !DILocalVariable(name: "x", scope: !939, file: !891, line: 130, type: !903)
!939 = distinct !DILexicalBlock(scope: !933, file: !891, line: 130, column: 7)
!940 = !DILocalVariable(name: "y", scope: !939, file: !891, line: 130, type: !903)
!941 = !DILocalVariable(name: "x", scope: !942, file: !891, line: 131, type: !903)
!942 = distinct !DILexicalBlock(scope: !933, file: !891, line: 131, column: 7)
!943 = !DILocalVariable(name: "y", scope: !942, file: !891, line: 131, type: !903)
!944 = !{!945}
!945 = !DIEnumerator(name: "HALF", value: 128)
!946 = !{!903}
!947 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-read-file.o -MD -MP -MF lib/.deps/libcoreutils_a-read-file.Tpo -c lib/read-file.c -o lib/.libcoreutils_a-read-file.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !948, globals: !949, splitDebugInlining: false, nameTableKind: None)
!948 = !{!146, !150}
!949 = !{!690, !693}
!950 = distinct !DICompileUnit(language: DW_LANG_C11, file: !697, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !951, retainedTypes: !864, globals: !955, splitDebugInlining: false, nameTableKind: None)
!951 = !{!952}
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 40, baseType: !87, size: 32, elements: !953)
!953 = !{!954}
!954 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!955 = !{!695, !698, !700, !702, !704, !706, !711, !713, !715, !717, !722, !724, !729, !731, !736, !741, !746, !751, !753, !755, !757, !759, !761, !763}
!956 = distinct !DICompileUnit(language: DW_LANG_C11, file: !957, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !958, retainedTypes: !990, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!958 = !{!959, !971}
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !960, file: !957, line: 188, baseType: !87, size: 32, elements: !969)
!960 = distinct !DISubprogram(name: "x2nrealloc", scope: !957, file: !957, line: 176, type: !961, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !956, retainedNodes: !964)
!961 = !DISubroutineType(types: !962)
!962 = !{!146, !146, !963, !148}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!964 = !{!965, !966, !967, !968}
!965 = !DILocalVariable(name: "p", arg: 1, scope: !960, file: !957, line: 176, type: !146)
!966 = !DILocalVariable(name: "pn", arg: 2, scope: !960, file: !957, line: 176, type: !963)
!967 = !DILocalVariable(name: "s", arg: 3, scope: !960, file: !957, line: 176, type: !148)
!968 = !DILocalVariable(name: "n", scope: !960, file: !957, line: 178, type: !148)
!969 = !{!970}
!970 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!971 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !972, file: !957, line: 228, baseType: !87, size: 32, elements: !969)
!972 = distinct !DISubprogram(name: "xpalloc", scope: !957, file: !957, line: 223, type: !973, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !956, retainedNodes: !980)
!973 = !DISubroutineType(types: !974)
!974 = !{!146, !146, !975, !976, !978, !976}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !977, line: 130, baseType: !978)
!977 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !979, line: 18, baseType: !158)
!979 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988, !989}
!981 = !DILocalVariable(name: "pa", arg: 1, scope: !972, file: !957, line: 223, type: !146)
!982 = !DILocalVariable(name: "pn", arg: 2, scope: !972, file: !957, line: 223, type: !975)
!983 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !972, file: !957, line: 223, type: !976)
!984 = !DILocalVariable(name: "n_max", arg: 4, scope: !972, file: !957, line: 223, type: !978)
!985 = !DILocalVariable(name: "s", arg: 5, scope: !972, file: !957, line: 223, type: !976)
!986 = !DILocalVariable(name: "n0", scope: !972, file: !957, line: 230, type: !976)
!987 = !DILocalVariable(name: "n", scope: !972, file: !957, line: 237, type: !976)
!988 = !DILocalVariable(name: "nbytes", scope: !972, file: !957, line: 248, type: !976)
!989 = !DILocalVariable(name: "adjusted_nbytes", scope: !972, file: !957, line: 252, type: !976)
!990 = !{!145, !146}
!991 = distinct !DICompileUnit(language: DW_LANG_C11, file: !784, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !992, splitDebugInlining: false, nameTableKind: None)
!992 = !{!782, !785, !787}
!993 = distinct !DICompileUnit(language: DW_LANG_C11, file: !994, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xstrtoumax.o -MD -MP -MF lib/.deps/libcoreutils_a-xstrtoumax.Tpo -c lib/xstrtoumax.c -o lib/.libcoreutils_a-xstrtoumax.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !995, retainedTypes: !998, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!995 = !{!996, !129}
!996 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !997, line: 30, baseType: !87, size: 32, elements: !88)
!997 = !DIFile(filename: "lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!998 = !{!99, !147, !145, !876}
!999 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1000, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fopen.o -MD -MP -MF lib/.deps/libcoreutils_a-fopen.Tpo -c lib/fopen.c -o lib/.libcoreutils_a-fopen.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !864, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1001 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1002, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1002 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1003 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1004, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fopen-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-fopen-safer.Tpo -c lib/fopen-safer.c -o lib/.libcoreutils_a-fopen-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1004 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1005 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1006, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-memset_explicit.o -MD -MP -MF lib/.deps/libcoreutils_a-memset_explicit.Tpo -c lib/memset_explicit.c -o lib/.libcoreutils_a-memset_explicit.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "lib/memset_explicit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5aa0e831d3f4d1a5017c23894634ef8c")
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1008, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-next-prime.o -MD -MP -MF lib/.deps/libcoreutils_a-next-prime.Tpo -c lib/next-prime.c -o lib/.libcoreutils_a-next-prime.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
