; ModuleID = 'src/stat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.calendar_month_name = type { ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.statx = type { i32, i32, i64, i32, i32, i32, i16, [1 x i16], i64, i64, i64, i64, %struct.statx_timestamp, %struct.statx_timestamp, %struct.statx_timestamp, %struct.statx_timestamp, i32, i32, i32, i32, i64, i64, [12 x i64] }
%struct.statx_timestamp = type { i64, i32, i32 }
%struct.print_args = type { ptr, %struct.timespec }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.mount_entry = type { ptr, ptr, ptr, ptr, i64, i8, ptr }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }

!137 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!139 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!140 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!141 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!142 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!143 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!144 = !DIEnumerator(name: "c_quoting_style", value: 5)
!145 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!146 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!147 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!148 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!149 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !151, file: !2, line: 1140, baseType: !107, size: 32, elements: !191)
!151 = distinct !DISubprogram(name: "print_it", scope: !2, file: !2, line: 1131, type: !152, scopeLine: 1135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !104, retainedNodes: !166)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !155, !117, !155, !157, !164}
!154 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!154, !160, !161, !4, !4, !117, !155, !164}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 18, baseType: !163)
!162 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!163 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !182, !183, !184, !187, !188}
!167 = !DILocalVariable(name: "format", arg: 1, scope: !151, file: !2, line: 1131, type: !155)
!168 = !DILocalVariable(name: "fd", arg: 2, scope: !151, file: !2, line: 1131, type: !117)
!169 = !DILocalVariable(name: "filename", arg: 3, scope: !151, file: !2, line: 1131, type: !155)
!170 = !DILocalVariable(name: "print_func", arg: 4, scope: !151, file: !2, line: 1132, type: !157)
!171 = !DILocalVariable(name: "data", arg: 5, scope: !151, file: !2, line: 1134, type: !164)
!172 = !DILocalVariable(name: "fail", scope: !151, file: !2, line: 1136, type: !154)
!173 = !DILocalVariable(name: "n_alloc", scope: !151, file: !2, line: 1147, type: !161)
!174 = !DILocalVariable(name: "dest", scope: !151, file: !2, line: 1148, type: !160)
!175 = !DILocalVariable(name: "b", scope: !176, file: !2, line: 1149, type: !155)
!176 = distinct !DILexicalBlock(scope: !151, file: !2, line: 1149, column: 3)
!177 = !DILocalVariable(name: "len", scope: !178, file: !2, line: 1155, type: !161)
!178 = distinct !DILexicalBlock(scope: !179, file: !2, line: 1154, column: 11)
!179 = distinct !DILexicalBlock(scope: !180, file: !2, line: 1152, column: 9)
!180 = distinct !DILexicalBlock(scope: !181, file: !2, line: 1150, column: 5)
!181 = distinct !DILexicalBlock(scope: !176, file: !2, line: 1149, column: 3)
!182 = !DILocalVariable(name: "fmt_char", scope: !178, file: !2, line: 1156, type: !4)
!183 = !DILocalVariable(name: "mod_char", scope: !178, file: !2, line: 1157, type: !4)
!184 = !DILocalVariable(name: "esc_value", scope: !185, file: !2, line: 1208, type: !117)
!185 = distinct !DILexicalBlock(scope: !186, file: !2, line: 1207, column: 13)
!186 = distinct !DILexicalBlock(scope: !179, file: !2, line: 1206, column: 15)
!187 = !DILocalVariable(name: "esc_length", scope: !185, file: !2, line: 1209, type: !117)
!188 = !DILocalVariable(name: "esc_value", scope: !189, file: !2, line: 1220, type: !117)
!189 = distinct !DILexicalBlock(scope: !190, file: !2, line: 1219, column: 13)
!190 = distinct !DILexicalBlock(scope: !186, file: !2, line: 1218, column: 20)
!191 = !{!192}
!192 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2)
!193 = !{!164, !160, !194, !117, !195, !161, !155, !196, !197, !206, !243, !246, !248}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "print_args", file: !2, line: 1281, size: 192, elements: !199)
!199 = !{!200, !242}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !198, file: !2, line: 1282, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !203, line: 44, size: 1024, elements: !204)
!203 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!204 = !{!205, !208, !210, !212, !214, !216, !218, !219, !220, !223, !225, !226, !228, !236, !237, !238}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !202, file: !203, line: 46, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !207, line: 145, baseType: !163)
!207 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !202, file: !203, line: 47, baseType: !209, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !207, line: 148, baseType: !163)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !202, file: !203, line: 48, baseType: !211, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !207, line: 150, baseType: !107)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !202, file: !203, line: 49, baseType: !213, size: 32, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !207, line: 151, baseType: !107)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !202, file: !203, line: 50, baseType: !215, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !207, line: 146, baseType: !107)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !202, file: !203, line: 51, baseType: !217, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !207, line: 147, baseType: !107)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !202, file: !203, line: 52, baseType: !206, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !202, file: !203, line: 53, baseType: !206, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !202, file: !203, line: 54, baseType: !221, size: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !207, line: 152, baseType: !222)
!222 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !202, file: !203, line: 55, baseType: !224, size: 32, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !207, line: 175, baseType: !117)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !202, file: !203, line: 56, baseType: !117, size: 32, offset: 480)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !202, file: !203, line: 57, baseType: !227, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !207, line: 180, baseType: !222)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !202, file: !203, line: 65, baseType: !229, size: 128, offset: 576)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !230, line: 11, size: 128, elements: !231)
!230 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !229, file: !230, line: 16, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !207, line: 160, baseType: !222)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !229, file: !230, line: 21, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !207, line: 197, baseType: !222)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !202, file: !203, line: 66, baseType: !229, size: 128, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !202, file: !203, line: 67, baseType: !229, size: 128, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !202, file: !203, line: 79, baseType: !239, size: 64, offset: 960)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 64, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 2)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !198, file: !2, line: 1283, baseType: !229, size: 128, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !244, line: 102, baseType: !245)
!244 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !207, line: 73, baseType: !163)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !247, line: 63, baseType: !221)
!247 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !250, file: !2, line: 879, baseType: !107)
!250 = distinct !DISubprogram(name: "print_statfs", scope: !2, file: !2, line: 861, type: !158, scopeLine: 864, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !104, retainedNodes: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !287, !288, !293, !294, !295, !297, !300}
!252 = !DILocalVariable(name: "pformat", arg: 1, scope: !250, file: !2, line: 861, type: !160)
!253 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !250, file: !2, line: 861, type: !161)
!254 = !DILocalVariable(name: "mod", arg: 3, scope: !250, file: !2, line: 861, type: !4)
!255 = !DILocalVariable(name: "m", arg: 4, scope: !250, file: !2, line: 861, type: !4)
!256 = !DILocalVariable(name: "fd", arg: 5, scope: !250, file: !2, line: 862, type: !117)
!257 = !DILocalVariable(name: "filename", arg: 6, scope: !250, file: !2, line: 862, type: !155)
!258 = !DILocalVariable(name: "data", arg: 7, scope: !250, file: !2, line: 863, type: !164)
!259 = !DILocalVariable(name: "statfsbuf", scope: !250, file: !2, line: 865, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !263, line: 24, size: 960, elements: !264)
!263 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/statfs.h", directory: "", checksumkind: CSK_MD5, checksum: "4c379ce582232e44e7b8fa7ccdecac58")
!264 = !{!265, !267, !268, !270, !271, !272, !274, !275, !280, !281, !282, !283}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !262, file: !263, line: 26, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !207, line: 192, baseType: !222)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !262, file: !263, line: 27, baseType: !266, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !262, file: !263, line: 29, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !207, line: 184, baseType: !163)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !262, file: !263, line: 30, baseType: !269, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !262, file: !263, line: 31, baseType: !269, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !262, file: !263, line: 32, baseType: !273, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !207, line: 188, baseType: !163)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !262, file: !263, line: 33, baseType: !273, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !262, file: !263, line: 41, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !207, line: 155, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 155, size: 64, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !277, file: !207, line: 155, baseType: !239, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !262, file: !263, line: 42, baseType: !266, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !262, file: !263, line: 43, baseType: !266, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !262, file: !263, line: 44, baseType: !266, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !262, file: !263, line: 45, baseType: !284, size: 256, offset: 704)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 256, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 4)
!287 = !DILocalVariable(name: "fail", scope: !250, file: !2, line: 866, type: !154)
!288 = !DILocalVariable(name: "p", scope: !289, file: !2, line: 884, type: !291)
!289 = distinct !DILexicalBlock(scope: !290, file: !2, line: 875, column: 7)
!290 = distinct !DILexicalBlock(scope: !250, file: !2, line: 869, column: 5)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!293 = !DILocalVariable(name: "fsid", scope: !289, file: !2, line: 888, type: !243)
!294 = !DILocalVariable(name: "words", scope: !289, file: !2, line: 889, type: !117)
!295 = !DILocalVariable(name: "i", scope: !296, file: !2, line: 890, type: !117)
!296 = distinct !DILexicalBlock(scope: !289, file: !2, line: 890, column: 9)
!297 = !DILocalVariable(name: "u", scope: !298, file: !2, line: 892, type: !243)
!298 = distinct !DILexicalBlock(scope: !299, file: !2, line: 891, column: 11)
!299 = distinct !DILexicalBlock(scope: !296, file: !2, line: 890, column: 9)
!300 = !DILocalVariable(name: "frsize", scope: !301, file: !2, line: 927, type: !243)
!301 = distinct !DILexicalBlock(scope: !290, file: !2, line: 926, column: 7)
!302 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !303, !308, !313, !318, !323, !328, !331, !336, !338, !343, !348, !353, !358, !360, !362, !364, !366, !368, !370, !375, !454, !456, !458, !461, !463, !465, !467, !469, !474, !476, !478, !480, !485, !490, !492, !494, !496, !498, !500, !502, !507, !512, !514, !519, !521, !523, !525, !102, !527, !532, !534, !539, !541, !543, !548, !553, !558, !563, !565, !567, !569, !571, !573, !575, !577, !579, !591, !593, !597, !599, !601, !603, !607, !609, !614, !619, !624, !626, !631, !636, !641, !646, !648, !650, !652, !654, !659, !662, !667, !672, !674, !676, !678, !680, !682, !684, !686, !688, !697, !699, !704, !735, !737, !739, !744, !773, !779, !781, !783, !785, !787, !792, !794, !796, !798, !800, !805, !807, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !842, !844, !846, !848, !850, !852, !854, !856, !858, !860, !862, !864, !866, !868, !870, !872, !874, !876, !878, !880, !882, !884, !886, !888, !890, !892, !894, !896, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922, !924, !926, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !956, !958, !960, !962, !964, !966, !968, !970, !972, !974, !976, !978, !980, !982, !984, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1028, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1080, !1082, !1084}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1878, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 544, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 68)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1883, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1480, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 185)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1901, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 1)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1902, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 10)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1902, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 24)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1906, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !240)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1911, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 6)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1924, type: !330, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1940, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 9)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1958, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 14)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1958, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 15)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1967, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 16)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "follow_links", scope: !104, file: !2, line: 228, type: !154, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !104, file: !2, line: 232, type: !154, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "decimal_point", scope: !104, file: !2, line: 239, type: !155, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !104, file: !2, line: 240, type: !161, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "dont_sync", scope: !104, file: !2, line: 1287, type: !154, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "force_sync", scope: !104, file: !2, line: 1290, type: !154, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !116, line: 736, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 75)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !377, file: !116, line: 575, type: !117, isLocal: true, isDefinition: true)
!377 = distinct !DISubprogram(name: "oputs_", scope: !116, file: !116, line: 573, type: !378, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !104, retainedNodes: !380)
!378 = !DISubroutineType(cc: DW_CC_nocall, types: !379)
!379 = !{null, !155, !155}
!380 = !{!381, !382, !383, !386, !387, !388, !389, !393, !394, !395, !396, !398, !448, !449, !450, !452, !453}
!381 = !DILocalVariable(name: "program", arg: 1, scope: !377, file: !116, line: 573, type: !155)
!382 = !DILocalVariable(name: "option", arg: 2, scope: !377, file: !116, line: 573, type: !155)
!383 = !DILocalVariable(name: "term", scope: !384, file: !116, line: 585, type: !155)
!384 = distinct !DILexicalBlock(scope: !385, file: !116, line: 582, column: 5)
!385 = distinct !DILexicalBlock(scope: !377, file: !116, line: 581, column: 7)
!386 = !DILocalVariable(name: "double_space", scope: !377, file: !116, line: 594, type: !154)
!387 = !DILocalVariable(name: "first_word", scope: !377, file: !116, line: 595, type: !155)
!388 = !DILocalVariable(name: "option_text", scope: !377, file: !116, line: 596, type: !155)
!389 = !DILocalVariable(name: "s", scope: !390, file: !116, line: 608, type: !155)
!390 = distinct !DILexicalBlock(scope: !391, file: !116, line: 605, column: 5)
!391 = distinct !DILexicalBlock(scope: !392, file: !116, line: 604, column: 12)
!392 = distinct !DILexicalBlock(scope: !377, file: !116, line: 597, column: 7)
!393 = !DILocalVariable(name: "spaces", scope: !390, file: !116, line: 609, type: !161)
!394 = !DILocalVariable(name: "anchor_len", scope: !377, file: !116, line: 620, type: !161)
!395 = !DILocalVariable(name: "desc_text", scope: !377, file: !116, line: 625, type: !155)
!396 = !DILocalVariable(name: "__ptr", scope: !397, file: !116, line: 644, type: !155)
!397 = distinct !DILexicalBlock(scope: !377, file: !116, line: 644, column: 3)
!398 = !DILocalVariable(name: "__stream", scope: !397, file: !116, line: 644, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !401, line: 7, baseType: !402)
!401 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !403, line: 49, size: 1728, elements: !404)
!403 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !420, !422, !423, !424, !425, !426, !428, !429, !432, !434, !437, !440, !441, !442, !443, !444}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !402, file: !403, line: 51, baseType: !117, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !402, file: !403, line: 54, baseType: !160, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !402, file: !403, line: 55, baseType: !160, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !402, file: !403, line: 56, baseType: !160, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !402, file: !403, line: 57, baseType: !160, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !402, file: !403, line: 58, baseType: !160, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !402, file: !403, line: 59, baseType: !160, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !402, file: !403, line: 60, baseType: !160, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !402, file: !403, line: 61, baseType: !160, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !402, file: !403, line: 64, baseType: !160, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !402, file: !403, line: 65, baseType: !160, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !402, file: !403, line: 66, baseType: !160, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !402, file: !403, line: 68, baseType: !418, size: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !403, line: 36, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !402, file: !403, line: 70, baseType: !421, size: 64, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !402, file: !403, line: 72, baseType: !117, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !402, file: !403, line: 73, baseType: !117, size: 32, offset: 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !402, file: !403, line: 74, baseType: !221, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !402, file: !403, line: 77, baseType: !195, size: 16, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !402, file: !403, line: 78, baseType: !427, size: 8, offset: 1040)
!427 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !402, file: !403, line: 79, baseType: !315, size: 8, offset: 1048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !402, file: !403, line: 81, baseType: !430, size: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !403, line: 43, baseType: null)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !402, file: !403, line: 89, baseType: !433, size: 64, offset: 1152)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !207, line: 153, baseType: !222)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !402, file: !403, line: 91, baseType: !435, size: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !403, line: 37, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !402, file: !403, line: 92, baseType: !438, size: 64, offset: 1280)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !403, line: 38, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !402, file: !403, line: 93, baseType: !421, size: 64, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !402, file: !403, line: 94, baseType: !194, size: 64, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !402, file: !403, line: 95, baseType: !161, size: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !402, file: !403, line: 96, baseType: !117, size: 32, offset: 1536)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !402, file: !403, line: 98, baseType: !445, size: 160, offset: 1568)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 20)
!448 = !DILocalVariable(name: "__cnt", scope: !397, file: !116, line: 644, type: !161)
!449 = !DILocalVariable(name: "url_program", scope: !377, file: !116, line: 648, type: !155)
!450 = !DILocalVariable(name: "__ptr", scope: !451, file: !116, line: 686, type: !155)
!451 = distinct !DILexicalBlock(scope: !377, file: !116, line: 686, column: 3)
!452 = !DILocalVariable(name: "__stream", scope: !451, file: !116, line: 686, type: !399)
!453 = !DILocalVariable(name: "__cnt", scope: !451, file: !116, line: 686, type: !161)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !116, line: 585, type: !19, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !116, line: 586, type: !19, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !116, line: 595, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !285)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !116, line: 620, type: !333, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !116, line: 648, type: !330, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !116, line: 648, type: !19, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !116, line: 649, type: !460, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !116, line: 649, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 3)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !116, line: 650, type: !19, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !116, line: 651, type: !333, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !116, line: 651, type: !333, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !116, line: 652, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 7)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !116, line: 653, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 8)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !116, line: 654, type: !320, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !116, line: 655, type: !320, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !116, line: 656, type: !320, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !116, line: 657, type: !320, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !116, line: 663, type: !482, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !116, line: 664, type: !320, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !116, line: 669, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 17)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !116, line: 669, type: !509, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 40)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !116, line: 676, type: !350, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !116, line: 676, type: !516, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 61)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !116, line: 679, type: !471, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !116, line: 683, type: !19, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !116, line: 688, type: !19, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !116, line: 691, type: !487, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "fmt_terse_fs", scope: !104, file: !2, line: 182, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 272, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 34)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !116, line: 839, type: !355, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !116, line: 840, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 22)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !116, line: 841, type: !350, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !116, line: 862, type: !460, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !116, line: 868, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 71)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !116, line: 875, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 27)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !116, line: 877, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 51)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !116, line: 877, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 12)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !560, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !560, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 218, type: !482, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 219, type: !482, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !2, line: 220, type: !333, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 221, type: !482, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !19, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !487, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "long_options", scope: !104, file: !2, line: 214, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 2304, elements: !341)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !584, line: 50, size: 256, elements: !585)
!584 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!585 = !{!586, !587, !588, !590}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !583, file: !584, line: 52, baseType: !155, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !583, file: !584, line: 55, baseType: !117, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !584, line: 56, baseType: !589, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !583, file: !584, line: 57, baseType: !117, size: 32, offset: 192)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !104, file: !2, line: 236, type: !155, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "cached_modes", scope: !104, file: !2, line: 209, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 96, elements: !472)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 206, type: !487, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !2, line: 206, type: !333, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 206, type: !482, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "cached_args", scope: !104, file: !2, line: 204, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 256, elements: !285)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1053, type: !345, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1062, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 65)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1671, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1376, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 172)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1692, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 58)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1702, type: !19, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1702, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 64)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1710, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 41)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1719, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 57)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1738, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 45)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1263, type: !330, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1265, type: !305, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1272, type: !24, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1171, type: !536, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1233, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 36)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "printf_flags", scope: !104, file: !2, line: 179, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 64, elements: !488)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "digits", scope: !104, file: !2, line: 171, type: !664, isLocal: true, isDefinition: true)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 88, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 11)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1524, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 29)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !19, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1568, type: !487, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !2, line: 692, type: !330, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 704, type: !460, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 704, type: !471, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 716, type: !460, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 716, type: !471, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 710, type: !471, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "modebuf", scope: !690, file: !2, line: 638, type: !560, isLocal: true, isDefinition: true)
!690 = distinct !DISubprogram(name: "human_access", scope: !2, file: !2, line: 636, type: !691, scopeLine: 637, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !104, retainedNodes: !695)
!691 = !DISubroutineType(types: !692)
!692 = !{!160, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!695 = !{!696}
!696 = !DILocalVariable(name: "statbuf", arg: 1, scope: !690, file: !2, line: 636, type: !693)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !2, line: 994, type: !330, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1005, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 26)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "mount_list", scope: !706, file: !2, line: 955, type: !715, isLocal: true, isDefinition: true)
!706 = distinct !DISubprogram(name: "find_bind_mount", scope: !2, file: !2, line: 951, type: !707, scopeLine: 952, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !104, retainedNodes: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!155, !155}
!709 = !{!710, !711, !712, !713, !730}
!710 = !DILocalVariable(name: "name", arg: 1, scope: !706, file: !2, line: 951, type: !155)
!711 = !DILocalVariable(name: "bind_mount", scope: !706, file: !2, line: 953, type: !155)
!712 = !DILocalVariable(name: "name_stats", scope: !706, file: !2, line: 964, type: !202)
!713 = !DILocalVariable(name: "me", scope: !714, file: !2, line: 968, type: !715)
!714 = distinct !DILexicalBlock(scope: !706, file: !2, line: 968, column: 3)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !717, line: 35, size: 448, elements: !718)
!717 = !DIFile(filename: "./lib/mountlist.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0b721ac4f5b5eea4f8f1c70f7145ac5d")
!718 = !{!719, !720, !721, !722, !723, !726, !727, !728, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !716, file: !717, line: 37, baseType: !160, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !716, file: !717, line: 38, baseType: !160, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !716, file: !717, line: 39, baseType: !160, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !716, file: !717, line: 41, baseType: !160, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !716, file: !717, line: 42, baseType: !724, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !725, line: 59, baseType: !206)
!725 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!726 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !716, file: !717, line: 43, baseType: !107, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !716, file: !717, line: 44, baseType: !107, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !716, file: !717, line: 45, baseType: !107, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !716, file: !717, line: 46, baseType: !715, size: 64, offset: 384)
!730 = !DILocalVariable(name: "dev_stats", scope: !731, file: !2, line: 973, type: !202)
!731 = distinct !DILexicalBlock(scope: !732, file: !2, line: 972, column: 9)
!732 = distinct !DILexicalBlock(scope: !733, file: !2, line: 970, column: 11)
!733 = distinct !DILexicalBlock(scope: !734, file: !2, line: 969, column: 5)
!734 = distinct !DILexicalBlock(scope: !714, file: !2, line: 968, column: 3)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !706, file: !2, line: 956, type: !154, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 960, type: !471, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 960, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 42)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "str", scope: !746, file: !2, line: 651, type: !516, isLocal: true, isDefinition: true)
!746 = distinct !DISubprogram(name: "human_time", scope: !2, file: !2, line: 646, type: !747, scopeLine: 647, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !104, retainedNodes: !749)
!747 = !DISubroutineType(cc: DW_CC_nocall, types: !748)
!748 = !{!160, !229}
!749 = !{!750, !751, !766, !767}
!750 = !DILocalVariable(name: "t", arg: 1, scope: !746, file: !2, line: 646, type: !229)
!751 = !DILocalVariable(name: "tm", scope: !746, file: !2, line: 658, type: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !753, line: 7, size: 448, elements: !754)
!753 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !752, file: !753, line: 9, baseType: !117, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !752, file: !753, line: 10, baseType: !117, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !752, file: !753, line: 11, baseType: !117, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !752, file: !753, line: 12, baseType: !117, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !752, file: !753, line: 13, baseType: !117, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !752, file: !753, line: 14, baseType: !117, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !752, file: !753, line: 15, baseType: !117, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !752, file: !753, line: 16, baseType: !117, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !752, file: !753, line: 17, baseType: !117, size: 32, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !752, file: !753, line: 20, baseType: !222, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !752, file: !753, line: 21, baseType: !155, size: 64, offset: 384)
!766 = !DILocalVariable(name: "ns", scope: !746, file: !2, line: 659, type: !117)
!767 = !DILocalVariable(name: "secbuf", scope: !768, file: !2, line: 664, type: !770)
!768 = distinct !DILexicalBlock(scope: !769, file: !2, line: 663, column: 5)
!769 = distinct !DILexicalBlock(scope: !746, file: !2, line: 660, column: 7)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 21)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "tz", scope: !746, file: !2, line: 655, type: !775, isLocal: true, isDefinition: true)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !776, line: 1039, baseType: !777)
!776 = !DIFile(filename: "./lib/time.h", directory: "/src")
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !776, line: 1039, flags: DIFlagFwdDecl)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 657, type: !471, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !2, line: 661, type: !325, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !2, line: 665, type: !487, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 789, type: !471, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 828, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 13)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !333, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !460, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !2, line: 698, type: !471, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 846, type: !14, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1108, type: !802, isLocal: true, isDefinition: true)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 35)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !19, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !2, line: 286, type: !19, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !2, line: 288, type: !19, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !2, line: 290, type: !19, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !2, line: 292, type: !460, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !345, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !2, line: 299, type: !19, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !2, line: 301, type: !482, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !350, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !2, line: 305, type: !340, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !2, line: 307, type: !19, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !2, line: 309, type: !482, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !460, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 313, type: !340, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !482, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !2, line: 317, type: !560, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !333, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !841, isLocal: true, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !665)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !2, line: 323, type: !19, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !340, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !320, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !2, line: 329, type: !19, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !2, line: 331, type: !19, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !2, line: 333, type: !460, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !2, line: 335, type: !340, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !482, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !560, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !333, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !2, line: 343, type: !487, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !333, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !2, line: 347, type: !482, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !482, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !841, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !2, line: 353, type: !340, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !2, line: 355, type: !340, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !2, line: 357, type: !460, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !333, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !333, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !2, line: 363, type: !19, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !2, line: 365, type: !333, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !2, line: 367, type: !460, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !2, line: 369, type: !320, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !19, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !2, line: 373, type: !19, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !2, line: 375, type: !460, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !333, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !2, line: 379, type: !19, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !2, line: 381, type: !487, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !487, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !2, line: 385, type: !340, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !2, line: 387, type: !19, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !2, line: 389, type: !560, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !460, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !19, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !2, line: 395, type: !19, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !2, line: 397, type: !482, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !2, line: 399, type: !19, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !2, line: 401, type: !320, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !487, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !333, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !2, line: 407, type: !320, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !333, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !2, line: 415, type: !19, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !2, line: 417, type: !333, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !460, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !2, line: 421, type: !333, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !333, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !2, line: 425, type: !482, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !19, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !2, line: 429, type: !333, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !2, line: 431, type: !504, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 433, type: !340, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !2, line: 435, type: !445, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !2, line: 437, type: !482, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 439, type: !482, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !333, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 443, type: !482, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !2, line: 445, type: !460, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !2, line: 447, type: !19, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !2, line: 449, type: !333, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !2, line: 451, type: !19, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 453, type: !19, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !2, line: 455, type: !340, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 457, type: !333, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 462, type: !320, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !333, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !2, line: 466, type: !333, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !2, line: 471, type: !482, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !2, line: 473, type: !841, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !2, line: 475, type: !482, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !19, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !2, line: 479, type: !340, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 481, type: !19, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !2, line: 483, type: !19, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 485, type: !333, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 487, type: !460, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 489, type: !340, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !333, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !2, line: 493, type: !841, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 495, type: !340, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !2, line: 497, type: !320, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !2, line: 499, type: !841, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !2, line: 501, type: !487, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !2, line: 503, type: !487, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !2, line: 505, type: !460, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !2, line: 507, type: !19, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !19, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !2, line: 511, type: !482, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !340, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !2, line: 515, type: !333, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !2, line: 517, type: !333, isLocal: true, isDefinition: true)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(scope: null, file: !2, line: 519, type: !333, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !2, line: 521, type: !333, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !2, line: 523, type: !487, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !2, line: 525, type: !333, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !2, line: 527, type: !460, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !460, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !2, line: 533, type: !340, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !2, line: 535, type: !19, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !2, line: 537, type: !482, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !2, line: 539, type: !482, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !2, line: 543, type: !19, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !19, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !2, line: 547, type: !333, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !2, line: 549, type: !333, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !2, line: 551, type: !333, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !2, line: 553, type: !460, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !2, line: 555, type: !460, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !2, line: 557, type: !482, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !2, line: 559, type: !460, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !482, isLocal: true, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !2, line: 563, type: !841, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "buf", scope: !1072, file: !2, line: 625, type: !669, isLocal: true, isDefinition: true)
!1072 = distinct !DISubprogram(name: "human_fstype", scope: !2, file: !2, line: 254, type: !1073, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !104, retainedNodes: !1075)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!155, !260}
!1075 = !{!1076, !1077}
!1076 = !DILocalVariable(name: "statfsbuf", arg: 1, scope: !1072, file: !2, line: 254, type: !260)
!1077 = !DILocalVariable(name: "type", scope: !1078, file: !2, line: 624, type: !163)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 623, column: 7)
!1079 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 260, column: 5)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !355, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1400, type: !550, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1402, type: !355, isLocal: true, isDefinition: true)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 392, elements: !1087)
!1087 = !{!1088}
!1088 = !DISubrange(count: 49)
!1089 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1090 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1091 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1092 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1093 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !1096, line: 38, type: !669, isLocal: true, isDefinition: true)
!1096 = !DIFile(filename: "src/find-mount-point.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02c11bacc56618f441de1ed8fb506d8b")
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !1096, line: 48, type: !1099, isLocal: true, isDefinition: true)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 30)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(scope: null, file: !1096, line: 64, type: !330, isLocal: true, isDefinition: true)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !1096, line: 66, type: !3, isLocal: true, isDefinition: true)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(scope: null, file: !1096, line: 81, type: !471, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !1096, line: 83, type: !350, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !1096, line: 105, type: !1112, isLocal: true, isDefinition: true)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 46)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !1117, line: 3, type: !350, isLocal: true, isDefinition: true)
!1117 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(name: "Version", scope: !1120, file: !1117, line: 3, type: !155, isLocal: false, isDefinition: true)
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1117, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1121, splitDebugInlining: false, nameTableKind: None)
!1121 = !{!1115, !1118}
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1124, file: !1125, line: 65, type: !1143, isLocal: false, isDefinition: true)
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1125, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1126, retainedTypes: !1129, globals: !1130, splitDebugInlining: false, nameTableKind: None)
!1125 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1126 = !{!1127}
!1127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !1128, line: 42, baseType: !107, size: 32, elements: !138)
!1128 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!1129 = !{!194, !155, !196}
!1130 = !{!1122, !1131, !1133, !1135, !1137, !1139, !1141}
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 141, type: !482, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 141, type: !550, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 142, type: !669, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 160, type: !770, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 165, type: !487, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1125, line: 170, type: !19, isLocal: true, isDefinition: true)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1144, line: 69, baseType: !1145)
!1144 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null}
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(name: "file_name", scope: !1150, file: !1151, line: 45, type: !155, isLocal: true, isDefinition: true)
!1150 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1151, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1152, splitDebugInlining: false, nameTableKind: None)
!1151 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1152 = !{!1153, !1155, !1157, !1159, !1148, !1161}
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !1151, line: 121, type: !482, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !1151, line: 121, type: !560, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !1151, line: 123, type: !482, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !1151, line: 126, type: !471, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1150, file: !1151, line: 55, type: !154, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1165, file: !1166, line: 66, type: !1145, isLocal: false, isDefinition: true)
!1165 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1166, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1167, globals: !1168, splitDebugInlining: false, nameTableKind: None)
!1166 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1167 = !{!194, !196}
!1168 = !{!1169, !1171, !1194, !1196, !1198, !1200, !1163, !1202, !1204, !1206, !1208, !1210}
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !1166, line: 272, type: !19, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1173, file: !1166, line: 304, type: !155, isLocal: true, isDefinition: true)
!1173 = distinct !DISubprogram(name: "verror_at_line", scope: !1166, file: !1166, line: 298, type: !1174, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1165, retainedNodes: !1187)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{null, !117, !117, !155, !107, !155, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !247, line: 52, baseType: !1177)
