; ModuleID = 'src/tail.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.pollfd = type { i32, i16, i16 }
%struct.File_spec = type { ptr, ptr, %struct.timespec, i64, i64, i32, i64, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct.inotify_event = type { i32, i32, i32, i32, [0 x i8] }
%struct.charbuffer = type { [8192 x i8], i64, ptr }
%struct.linebuffer = type { [8192 x i8], i64, i64, ptr }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

!175 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!176 = !{!177, !178}
!177 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!178 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 81, baseType: !175, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIEnumerator(name: "COPY_TO_EOF", value: -1)
!182 = !DIEnumerator(name: "COPY_A_BUFFER", value: -2)
!183 = !{!184, !175, !185, !186, !189, !191, !192, !193, !195, !199}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !187, line: 18, baseType: !188)
!187 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!188 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !196, line: 97, baseType: !197)
!196 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !198, line: 154, baseType: !175)
!198 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !200, line: 63, baseType: !201)
!200 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !198, line: 152, baseType: !202)
!202 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!203 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !61, !66, !71, !76, !81, !86, !91, !96, !101, !106, !204, !209, !321, !326, !328, !333, !338, !340, !342, !344, !346, !111, !348, !350, !352, !357, !362, !441, !443, !445, !450, !455, !457, !459, !461, !466, !468, !470, !472, !477, !482, !484, !486, !488, !490, !492, !494, !499, !504, !506, !511, !513, !515, !517, !519, !521, !526, !528, !530, !532, !537, !542, !547, !549, !551, !553, !555, !557, !559, !564, !566, !568, !573, !578, !583, !585, !587, !592, !597, !602, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !643, !655, !657, !661, !663, !665, !669, !671, !673, !675, !678, !680, !682, !684, !686, !688, !690, !692, !694, !696, !703, !705, !707, !709, !714, !716, !721, !723, !725, !727, !740, !745, !750, !752, !754, !759, !764, !766, !768, !770, !772, !774, !779, !781, !786, !788, !791, !793, !795, !800, !805, !807, !809, !811, !816, !818, !846, !848, !850, !855, !857, !860}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2396, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 2)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !211, file: !2, line: 2396, type: !184, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 2347, type: !212, scopeLine: 2348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !215)
!212 = !DISubroutineType(types: !213)
!213 = !{!175, !175, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!215 = !{!216, !217, !218, !219, !221, !226, !227, !228, !266, !267, !269, !271, !273, !275, !303, !304, !306, !308, !311, !314}
!216 = !DILocalVariable(name: "argc", arg: 1, scope: !211, file: !2, line: 2347, type: !175)
!217 = !DILocalVariable(name: "argv", arg: 2, scope: !211, file: !2, line: 2347, type: !214)
!218 = !DILocalVariable(name: "header_mode", scope: !211, file: !2, line: 2349, type: !119)
!219 = !DILocalVariable(name: "ok", scope: !211, file: !2, line: 2350, type: !220)
!220 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!221 = !DILocalVariable(name: "n_units", scope: !211, file: !2, line: 2353, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "count_t", file: !2, line: 85, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !224, line: 101, baseType: !225)
!224 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !198, line: 72, baseType: !202)
!226 = !DILocalVariable(name: "n_files", scope: !211, file: !2, line: 2354, type: !175)
!227 = !DILocalVariable(name: "file", scope: !211, file: !2, line: 2355, type: !214)
!228 = !DILocalVariable(name: "F", scope: !211, file: !2, line: 2356, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !2, line: 118, size: 832, elements: !231)
!231 = !{!232, !233, !234, !242, !245, !248, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !265}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !2, line: 121, baseType: !184, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prettyname", scope: !230, file: !2, line: 124, baseType: !189, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !230, file: !2, line: 127, baseType: !235, size: 128, offset: 128)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !236, line: 11, size: 128, elements: !237)
!236 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!237 = !{!238, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !235, file: !236, line: 16, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !198, line: 160, baseType: !202)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !235, file: !236, line: 21, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !198, line: 197, baseType: !202)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !230, file: !2, line: 128, baseType: !243, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !196, line: 59, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !198, line: 145, baseType: !188)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !230, file: !2, line: 129, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !196, line: 47, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !198, line: 148, baseType: !188)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !230, file: !2, line: 130, baseType: !249, size: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !196, line: 69, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !198, line: 150, baseType: !116)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !230, file: !2, line: 134, baseType: !199, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !230, file: !2, line: 139, baseType: !220, size: 8, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !230, file: !2, line: 142, baseType: !220, size: 8, offset: 520)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !230, file: !2, line: 146, baseType: !220, size: 8, offset: 528)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !230, file: !2, line: 149, baseType: !175, size: 32, offset: 544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !230, file: !2, line: 153, baseType: !175, size: 32, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !230, file: !2, line: 156, baseType: !175, size: 32, offset: 608)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !230, file: !2, line: 160, baseType: !175, size: 32, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !230, file: !2, line: 164, baseType: !175, size: 32, offset: 672)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !230, file: !2, line: 167, baseType: !261, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !262, line: 130, baseType: !263)
!262 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !264, line: 18, baseType: !202)
!264 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!265 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !230, file: !2, line: 171, baseType: !222, size: 64, offset: 768)
!266 = !DILocalVariable(name: "obsolete_option", scope: !211, file: !2, line: 2357, type: !220)
!267 = !DILocalVariable(name: "sleep_interval", scope: !211, file: !2, line: 2362, type: !268)
!268 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!269 = !DILocalVariable(name: "p", scope: !270, file: !2, line: 2373, type: !175)
!270 = distinct !DILexicalBlock(scope: !211, file: !2, line: 2372, column: 3)
!271 = !DILocalVariable(name: "found_hyphen", scope: !272, file: !2, line: 2402, type: !220)
!272 = distinct !DILexicalBlock(scope: !211, file: !2, line: 2401, column: 3)
!273 = !DILocalVariable(name: "i", scope: !274, file: !2, line: 2404, type: !175)
!274 = distinct !DILexicalBlock(scope: !272, file: !2, line: 2404, column: 5)
!275 = !DILocalVariable(name: "in_stat", scope: !276, file: !2, line: 2418, type: !278)
!276 = distinct !DILexicalBlock(scope: !277, file: !2, line: 2417, column: 7)
!277 = distinct !DILexicalBlock(scope: !272, file: !2, line: 2416, column: 9)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !279, line: 44, size: 1024, elements: !280)
!279 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!280 = !{!281, !282, !283, !284, !286, !288, !290, !291, !292, !293, !295, !296, !298, !299, !300, !301}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !278, file: !279, line: 46, baseType: !244, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !278, file: !279, line: 47, baseType: !247, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !278, file: !279, line: 48, baseType: !250, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !278, file: !279, line: 49, baseType: !285, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !198, line: 151, baseType: !116)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !278, file: !279, line: 50, baseType: !287, size: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !198, line: 146, baseType: !116)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !278, file: !279, line: 51, baseType: !289, size: 32, offset: 224)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !198, line: 147, baseType: !116)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !278, file: !279, line: 52, baseType: !244, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !278, file: !279, line: 53, baseType: !244, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !278, file: !279, line: 54, baseType: !201, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !278, file: !279, line: 55, baseType: !294, size: 32, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !198, line: 175, baseType: !175)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !278, file: !279, line: 56, baseType: !175, size: 32, offset: 480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !278, file: !279, line: 57, baseType: !297, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !198, line: 180, baseType: !202)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !278, file: !279, line: 65, baseType: !235, size: 128, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !278, file: !279, line: 66, baseType: !235, size: 128, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !278, file: !279, line: 67, baseType: !235, size: 128, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !278, file: !279, line: 79, baseType: !302, size: 64, offset: 960)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 64, elements: !207)
!303 = !DILocalVariable(name: "blocking_stdin", scope: !276, file: !2, line: 2419, type: !220)
!304 = !DILocalVariable(name: "i", scope: !305, file: !2, line: 2437, type: !175)
!305 = distinct !DILexicalBlock(scope: !211, file: !2, line: 2437, column: 3)
!306 = !DILocalVariable(name: "i", scope: !307, file: !2, line: 2449, type: !175)
!307 = distinct !DILexicalBlock(scope: !211, file: !2, line: 2449, column: 3)
!308 = !DILocalVariable(name: "out_stat", scope: !309, file: !2, line: 2456, type: !278)
!309 = distinct !DILexicalBlock(scope: !310, file: !2, line: 2453, column: 5)
!310 = distinct !DILexicalBlock(scope: !211, file: !2, line: 2452, column: 7)
!311 = !DILocalVariable(name: "wd", scope: !312, file: !2, line: 2510, type: !175)
!312 = distinct !DILexicalBlock(scope: !313, file: !2, line: 2509, column: 9)
!313 = distinct !DILexicalBlock(scope: !309, file: !2, line: 2508, column: 11)
!314 = !DILocalVariable(name: "ht", scope: !315, file: !2, line: 2519, type: !317)
!315 = distinct !DILexicalBlock(scope: !316, file: !2, line: 2512, column: 13)
!316 = distinct !DILexicalBlock(scope: !312, file: !2, line: 2511, column: 15)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !319, line: 56, baseType: !320)
!319 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !319, line: 54, flags: DIFlagFwdDecl)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2410, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 25)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2425, type: !83, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2440, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 15)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2458, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 16)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2525, type: !39, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "forever", scope: !113, file: !2, line: 187, type: !220, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "monitor_output", scope: !113, file: !2, line: 190, type: !220, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "from_start", scope: !113, file: !2, line: 193, type: !220, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "print_headers", scope: !113, file: !2, line: 196, type: !220, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !113, file: !2, line: 226, type: !220, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !113, file: !2, line: 234, type: !220, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !174, line: 729, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 56)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !174, line: 736, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 75)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !364, file: !174, line: 575, type: !175, isLocal: true, isDefinition: true)
!364 = distinct !DISubprogram(name: "oputs_", scope: !174, file: !174, line: 573, type: !365, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !367)
!365 = !DISubroutineType(cc: DW_CC_nocall, types: !366)
!366 = !{null, !189, !189}
!367 = !{!368, !369, !370, !373, !374, !375, !376, !380, !381, !382, !383, !385, !435, !436, !437, !439, !440}
!368 = !DILocalVariable(name: "program", arg: 1, scope: !364, file: !174, line: 573, type: !189)
!369 = !DILocalVariable(name: "option", arg: 2, scope: !364, file: !174, line: 573, type: !189)
!370 = !DILocalVariable(name: "term", scope: !371, file: !174, line: 585, type: !189)
!371 = distinct !DILexicalBlock(scope: !372, file: !174, line: 582, column: 5)
!372 = distinct !DILexicalBlock(scope: !364, file: !174, line: 581, column: 7)
!373 = !DILocalVariable(name: "double_space", scope: !364, file: !174, line: 594, type: !220)
!374 = !DILocalVariable(name: "first_word", scope: !364, file: !174, line: 595, type: !189)
!375 = !DILocalVariable(name: "option_text", scope: !364, file: !174, line: 596, type: !189)
!376 = !DILocalVariable(name: "s", scope: !377, file: !174, line: 608, type: !189)
!377 = distinct !DILexicalBlock(scope: !378, file: !174, line: 605, column: 5)
!378 = distinct !DILexicalBlock(scope: !379, file: !174, line: 604, column: 12)
!379 = distinct !DILexicalBlock(scope: !364, file: !174, line: 597, column: 7)
!380 = !DILocalVariable(name: "spaces", scope: !377, file: !174, line: 609, type: !186)
!381 = !DILocalVariable(name: "anchor_len", scope: !364, file: !174, line: 620, type: !186)
!382 = !DILocalVariable(name: "desc_text", scope: !364, file: !174, line: 625, type: !189)
!383 = !DILocalVariable(name: "__ptr", scope: !384, file: !174, line: 644, type: !189)
!384 = distinct !DILexicalBlock(scope: !364, file: !174, line: 644, column: 3)
!385 = !DILocalVariable(name: "__stream", scope: !384, file: !174, line: 644, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !388, line: 7, baseType: !389)
!388 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !390, line: 49, size: 1728, elements: !391)
!390 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407, !409, !410, !411, !412, !413, !415, !416, !419, !421, !424, !427, !428, !429, !430, !431}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !389, file: !390, line: 51, baseType: !175, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !389, file: !390, line: 54, baseType: !184, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !389, file: !390, line: 55, baseType: !184, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !389, file: !390, line: 56, baseType: !184, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !389, file: !390, line: 57, baseType: !184, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !389, file: !390, line: 58, baseType: !184, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !389, file: !390, line: 59, baseType: !184, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !389, file: !390, line: 60, baseType: !184, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !389, file: !390, line: 61, baseType: !184, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !389, file: !390, line: 64, baseType: !184, size: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !389, file: !390, line: 65, baseType: !184, size: 64, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !389, file: !390, line: 66, baseType: !184, size: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !389, file: !390, line: 68, baseType: !405, size: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !390, line: 36, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !389, file: !390, line: 70, baseType: !408, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !389, file: !390, line: 72, baseType: !175, size: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !389, file: !390, line: 73, baseType: !175, size: 32, offset: 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !389, file: !390, line: 74, baseType: !201, size: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !389, file: !390, line: 77, baseType: !185, size: 16, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !389, file: !390, line: 78, baseType: !414, size: 8, offset: 1040)
!414 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !389, file: !390, line: 79, baseType: !98, size: 8, offset: 1048)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !389, file: !390, line: 81, baseType: !417, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !390, line: 43, baseType: null)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !389, file: !390, line: 89, baseType: !420, size: 64, offset: 1152)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !198, line: 153, baseType: !202)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !389, file: !390, line: 91, baseType: !422, size: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !390, line: 37, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !389, file: !390, line: 92, baseType: !425, size: 64, offset: 1280)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !390, line: 38, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !389, file: !390, line: 93, baseType: !408, size: 64, offset: 1344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !389, file: !390, line: 94, baseType: !192, size: 64, offset: 1408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !389, file: !390, line: 95, baseType: !186, size: 64, offset: 1472)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !389, file: !390, line: 96, baseType: !175, size: 32, offset: 1536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !389, file: !390, line: 98, baseType: !432, size: 160, offset: 1568)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 20)
!435 = !DILocalVariable(name: "__cnt", scope: !384, file: !174, line: 644, type: !186)
!436 = !DILocalVariable(name: "url_program", scope: !364, file: !174, line: 648, type: !189)
!437 = !DILocalVariable(name: "__ptr", scope: !438, file: !174, line: 686, type: !189)
!438 = distinct !DILexicalBlock(scope: !364, file: !174, line: 686, column: 3)
!439 = !DILocalVariable(name: "__stream", scope: !438, file: !174, line: 686, type: !386)
!440 = !DILocalVariable(name: "__cnt", scope: !438, file: !174, line: 686, type: !186)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !174, line: 585, type: !19, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !174, line: 586, type: !19, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !174, line: 595, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 4)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !174, line: 620, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 6)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !174, line: 648, type: !206, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !174, line: 648, type: !19, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !174, line: 649, type: !447, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !174, line: 649, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 3)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !174, line: 650, type: !19, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !174, line: 651, type: !452, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !174, line: 651, type: !452, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !174, line: 652, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 7)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !174, line: 653, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 8)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !174, line: 654, type: !103, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !174, line: 655, type: !103, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !174, line: 656, type: !103, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !174, line: 657, type: !103, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !174, line: 663, type: !474, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !174, line: 664, type: !103, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !174, line: 669, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 17)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !174, line: 669, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 40)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !174, line: 676, type: !330, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !174, line: 676, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 61)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !174, line: 679, type: !463, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !174, line: 683, type: !19, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !174, line: 688, type: !19, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !174, line: 691, type: !479, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !174, line: 839, type: !335, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !174, line: 840, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 22)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !174, line: 841, type: !330, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !174, line: 862, type: !447, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !174, line: 868, type: !29, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !174, line: 875, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 27)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !174, line: 877, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 51)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !174, line: 877, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 12)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2110, type: !463, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "count_lines", scope: !113, file: !2, line: 180, type: !220, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2183, type: !523, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2203, type: !330, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2205, type: !108, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2206, type: !108, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2216, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 9)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2228, type: !354, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2246, type: !544, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2263, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 30)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 14)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 11)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !335, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !496, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 13)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2283, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 37)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2295, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 64)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2299, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 53)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2304, type: !539, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2304, type: !83, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 254, type: !452, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 255, type: !452, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !474, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 257, type: !452, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !432, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 260, type: !496, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !447, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !432, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !452, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !452, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 267, type: !474, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !330, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !479, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !335, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !19, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !479, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "long_options", scope: !113, file: !2, line: 252, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 4352, elements: !497)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !648, line: 50, size: 256, elements: !649)
!648 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!649 = !{!650, !651, !652, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !648, line: 52, baseType: !189, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !647, file: !648, line: 55, baseType: !175, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !648, line: 56, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !647, file: !648, line: 57, baseType: !175, size: 32, offset: 192)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !113, file: !2, line: 176, type: !220, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !113, file: !2, line: 113, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 64, elements: !207)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !580, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !19, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !113, file: !2, line: 108, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 192, elements: !464)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !113, file: !2, line: 213, type: !222, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "debug", scope: !113, file: !2, line: 237, type: !220, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "pids_alloc", scope: !113, file: !2, line: 220, type: !261, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "pids", scope: !113, file: !2, line: 219, type: !677, isLocal: true, isDefinition: true)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !113, file: !2, line: 231, type: !220, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "line_end", scope: !113, file: !2, line: 199, type: !4, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "follow_mode", scope: !113, file: !2, line: 184, type: !124, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "nbpids", scope: !113, file: !2, line: 218, type: !175, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2026, type: !534, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2041, type: !335, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2055, type: !39, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2055, type: !323, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2080, type: !496, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "first_file", scope: !698, file: !2, line: 462, type: !220, isLocal: true, isDefinition: true)
!698 = distinct !DISubprogram(name: "write_header", scope: !2, file: !2, line: 460, type: !699, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !189}
!701 = !{!702}
!702 = !DILocalVariable(name: "prettyname", arg: 1, scope: !698, file: !2, line: 460, type: !189)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !575, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !206, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !496, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 43)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !580, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 640, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 80)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 418, type: !570, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !3, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !711, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "whence_msgid", scope: !729, file: !2, line: 417, type: !739, isLocal: true, isDefinition: true)
!729 = distinct !DISubprogram(name: "xlseek", scope: !2, file: !2, line: 410, type: !730, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{!199, !175, !199, !175, !189}
!732 = !{!733, !734, !735, !736, !737, !738}
!733 = !DILocalVariable(name: "fd", arg: 1, scope: !729, file: !2, line: 410, type: !175)
!734 = !DILocalVariable(name: "offset", arg: 2, scope: !729, file: !2, line: 410, type: !199)
!735 = !DILocalVariable(name: "whence", arg: 3, scope: !729, file: !2, line: 410, type: !175)
!736 = !DILocalVariable(name: "prettyname", arg: 4, scope: !729, file: !2, line: 410, type: !189)
!737 = !DILocalVariable(name: "new_offset", scope: !729, file: !2, line: 412, type: !199)
!738 = !DILocalVariable(name: "joffset", scope: !729, file: !2, line: 422, type: !223)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 192, elements: !464)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 19)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 970, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 54)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !174, line: 952, type: !544, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1539, type: !206, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1549, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 36)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1552, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 28)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1573, type: !335, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1617, type: !335, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1629, type: !463, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1629, type: !108, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1650, type: !742, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1690, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 44)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1710, type: !761, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1727, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 46)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !432, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 320, elements: !502)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1009, type: !747, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1023, type: !534, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1039, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 47)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1046, type: !802, isLocal: true, isDefinition: true)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 52)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1068, type: !103, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1069, type: !323, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1080, type: !594, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1090, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 42)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1457, type: !742, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "debugged", scope: !820, file: !2, line: 1178, type: !220, isLocal: true, isDefinition: true)
!820 = distinct !DISubprogram(name: "tail_forever", scope: !2, file: !2, line: 1174, type: !821, scopeLine: 1175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !229, !175, !268}
!823 = !{!824, !825, !826, !827, !828, !830, !831, !833, !836, !837, !838, !839, !842, !843, !844, !845}
!824 = !DILocalVariable(name: "f", arg: 1, scope: !820, file: !2, line: 1174, type: !229)
!825 = !DILocalVariable(name: "n_files", arg: 2, scope: !820, file: !2, line: 1174, type: !175)
!826 = !DILocalVariable(name: "sleep_interval", arg: 3, scope: !820, file: !2, line: 1174, type: !268)
!827 = !DILocalVariable(name: "last", scope: !820, file: !2, line: 1176, type: !175)
!828 = !DILocalVariable(name: "blocking", scope: !829, file: !2, line: 1183, type: !220)
!829 = distinct !DILexicalBlock(scope: !820, file: !2, line: 1181, column: 5)
!830 = !DILocalVariable(name: "any_input", scope: !829, file: !2, line: 1194, type: !220)
!831 = !DILocalVariable(name: "i", scope: !832, file: !2, line: 1196, type: !175)
!832 = distinct !DILexicalBlock(scope: !829, file: !2, line: 1196, column: 7)
!833 = !DILocalVariable(name: "stats", scope: !834, file: !2, line: 1198, type: !278)
!834 = distinct !DILexicalBlock(scope: !835, file: !2, line: 1197, column: 9)
!835 = distinct !DILexicalBlock(scope: !832, file: !2, line: 1196, column: 7)
!836 = !DILocalVariable(name: "fd", scope: !834, file: !2, line: 1203, type: !175)
!837 = !DILocalVariable(name: "prettyname", scope: !834, file: !2, line: 1210, type: !189)
!838 = !DILocalVariable(name: "mode", scope: !834, file: !2, line: 1211, type: !249)
!839 = !DILocalVariable(name: "old_flags", scope: !840, file: !2, line: 1215, type: !175)
!840 = distinct !DILexicalBlock(scope: !841, file: !2, line: 1214, column: 13)
!841 = distinct !DILexicalBlock(scope: !834, file: !2, line: 1213, column: 15)
!842 = !DILocalVariable(name: "new_flags", scope: !840, file: !2, line: 1216, type: !175)
!843 = !DILocalVariable(name: "read_unchanged", scope: !834, file: !2, line: 1236, type: !220)
!844 = !DILocalVariable(name: "bytes_to_read", scope: !834, file: !2, line: 1301, type: !222)
!845 = !DILocalVariable(name: "nr", scope: !834, file: !2, line: 1309, type: !222)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1189, type: !432, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1189, type: !742, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1228, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 35)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1266, type: !575, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1266, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 408, elements: !540)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1345, type: !534, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!863 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!864 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!865 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!866 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!867 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!868 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!870 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !873, line: 64, type: !874, isLocal: true, isDefinition: true)
!873 = !DIFile(filename: "src/iopoll.c", directory: "/src", checksumkind: CSK_MD5, checksum: "994e71aa1d7ebbae5028422474ffd3c4")
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 26)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !873, line: 64, type: !589, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !873, line: 64, type: !881, isLocal: true, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 352, elements: !777)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !873, line: 88, type: !479, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !886, line: 3, type: !330, isLocal: true, isDefinition: true)
!886 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "Version", scope: !889, file: !886, line: 3, type: !189, isLocal: false, isDefinition: true)
!889 = distinct !DICompileUnit(language: DW_LANG_C11, file: !886, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !890, splitDebugInlining: false, nameTableKind: None)
!890 = !{!884, !887}
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !893, file: !894, line: 65, type: !918, isLocal: false, isDefinition: true)
!893 = distinct !DICompileUnit(language: DW_LANG_C11, file: !894, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !895, retainedTypes: !898, globals: !899, splitDebugInlining: false, nameTableKind: None)
!894 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!895 = !{!896}
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !897, line: 42, baseType: !116, size: 32, elements: !130)
!897 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!898 = !{!192, !189, !191}
!899 = !{!891, !900, !902, !904, !909, !914, !916}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !894, line: 141, type: !474, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !894, line: 141, type: !534, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !894, line: 142, type: !906, isLocal: true, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 29)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !894, line: 160, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 21)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !894, line: 165, type: !479, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !894, line: 170, type: !19, isLocal: true, isDefinition: true)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !919, line: 69, baseType: !920)
!919 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null}
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "file_name", scope: !925, file: !926, line: 45, type: !189, isLocal: true, isDefinition: true)
!925 = distinct !DICompileUnit(language: DW_LANG_C11, file: !926, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !927, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!927 = !{!928, !930, !932, !934, !923, !936}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !926, line: 121, type: !474, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !926, line: 121, type: !544, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !926, line: 123, type: !474, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !926, line: 126, type: !463, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !925, file: !926, line: 55, type: !220, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !940, file: !941, line: 66, type: !920, isLocal: false, isDefinition: true)
!940 = distinct !DICompileUnit(language: DW_LANG_C11, file: !941, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !942, globals: !943, splitDebugInlining: false, nameTableKind: None)
!941 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!942 = !{!192, !191}
!943 = !{!944, !946, !969, !971, !973, !975, !938, !977, !979, !981, !983, !985}
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !941, line: 272, type: !19, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "old_file_name", scope: !948, file: !941, line: 304, type: !189, isLocal: true, isDefinition: true)
!948 = distinct !DISubprogram(name: "verror_at_line", scope: !941, file: !941, line: 298, type: !949, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !940, retainedNodes: !962)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !175, !175, !189, !116, !189, !951}
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !200, line: 52, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !953, line: 12, baseType: !954)
!953 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !941, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !956)
!956 = !{!957, !958, !959, !960, !961}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !955, file: !941, baseType: !192, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !955, file: !941, baseType: !192, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !955, file: !941, baseType: !192, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !955, file: !941, baseType: !175, size: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !955, file: !941, baseType: !175, size: 32, offset: 224)
!962 = !{!963, !964, !965, !966, !967, !968}
!963 = !DILocalVariable(name: "status", arg: 1, scope: !948, file: !941, line: 298, type: !175)
!964 = !DILocalVariable(name: "errnum", arg: 2, scope: !948, file: !941, line: 298, type: !175)
!965 = !DILocalVariable(name: "file_name", arg: 3, scope: !948, file: !941, line: 298, type: !189)
!966 = !DILocalVariable(name: "line_number", arg: 4, scope: !948, file: !941, line: 298, type: !116)
!967 = !DILocalVariable(name: "message", arg: 5, scope: !948, file: !941, line: 298, type: !189)
!968 = !DILocalVariable(name: "args", arg: 6, scope: !948, file: !941, line: 298, type: !951)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "old_line_number", scope: !948, file: !941, line: 305, type: !116, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !941, line: 338, type: !447, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !941, line: 346, type: !479, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !941, line: 346, type: !206, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "error_message_count", scope: !940, file: !941, line: 69, type: !116, isLocal: false, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !940, file: !941, line: 295, type: !175, isLocal: false, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !941, line: 208, type: !474, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !941, line: 208, type: !911, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !941, line: 214, type: !19, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !989, file: !990, line: 506, type: !175, isLocal: true, isDefinition: true)
!989 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !990, file: !990, line: 485, type: !991, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !993, retainedNodes: !995)
!990 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!991 = !DISubroutineType(types: !992)
!992 = !{!175, !175, !175}
!993 = distinct !DICompileUnit(language: DW_LANG_C11, file: !990, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fcntl.o -MD -MP -MF lib/.deps/libcoreutils_a-fcntl.Tpo -c lib/fcntl.c -o lib/.libcoreutils_a-fcntl.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !994, splitDebugInlining: false, nameTableKind: None)
!994 = !{!987}
!995 = !{!996, !997, !998, !999, !1002}
!996 = !DILocalVariable(name: "fd", arg: 1, scope: !989, file: !990, line: 485, type: !175)
!997 = !DILocalVariable(name: "target", arg: 2, scope: !989, file: !990, line: 485, type: !175)
!998 = !DILocalVariable(name: "result", scope: !989, file: !990, line: 487, type: !175)
!999 = !DILocalVariable(name: "flags", scope: !1000, file: !990, line: 530, type: !175)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !990, line: 529, column: 5)
!1001 = distinct !DILexicalBlock(scope: !989, file: !990, line: 528, column: 7)
!1002 = !DILocalVariable(name: "saved_errno", scope: !1003, file: !990, line: 533, type: !175)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !990, line: 532, column: 9)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !990, line: 531, column: 11)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 226, type: !108, isLocal: true, isDefinition: true)
!1007 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 227, type: !108, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 228, type: !9, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 231, type: !108, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1016, file: !1007, line: 134, type: !1020, isLocal: true, isDefinition: true)
!1016 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1007, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hash.o -MD -MP -MF lib/.deps/libcoreutils_a-hash.Tpo -c lib/hash.c -o lib/.libcoreutils_a-hash.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1017, globals: !1019, splitDebugInlining: false, nameTableKind: None)
!1017 = !{!188, !192, !1018, !186}
!1018 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1019 = !{!1005, !1008, !1010, !1012, !1014}
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !1022, line: 52, baseType: !1023)
!1022 = !DIFile(filename: "lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !1022, line: 40, size: 160, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1023, file: !1022, line: 45, baseType: !1018, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1023, file: !1022, line: 46, baseType: !1018, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1023, file: !1022, line: 47, baseType: !1018, size: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1023, file: !1022, line: 48, baseType: !1018, size: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1023, file: !1022, line: 49, baseType: !220, size: 8, offset: 128)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !1032, line: 43, type: !335, isLocal: true, isDefinition: true)
!1032 = !DIFile(filename: "lib/posixver.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b586c85144b881c520e7e1ef1553b215")
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "program_name", scope: !1035, file: !1036, line: 31, type: !189, isLocal: false, isDefinition: true)
!1035 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1036, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1037, globals: !1038, splitDebugInlining: false, nameTableKind: None)
!1036 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1037 = !{!192, !184}
!1038 = !{!1033, !1039, !1041}
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 46, type: !479, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 49, type: !447, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1045, file: !1046, line: 46, type: !1073, isLocal: true, isDefinition: true)
!1045 = distinct !DISubprogram(name: "proper_name_lite", scope: !1046, file: !1046, line: 38, type: !1047, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1049, retainedNodes: !1051)
!1046 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!189, !189, !189}
!1049 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1046, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1050, splitDebugInlining: false, nameTableKind: None)
!1050 = !{!1043}
!1051 = !{!1052, !1053, !1054, !1055, !1060}
!1052 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1045, file: !1046, line: 38, type: !189)
!1053 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1045, file: !1046, line: 38, type: !189)
!1054 = !DILocalVariable(name: "translation", scope: !1045, file: !1046, line: 40, type: !189)
!1055 = !DILocalVariable(name: "w", scope: !1045, file: !1046, line: 47, type: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1057, line: 37, baseType: !1058)
!1057 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !198, line: 57, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !198, line: 42, baseType: !116)
!1060 = !DILocalVariable(name: "mbs", scope: !1045, file: !1046, line: 48, type: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1062, line: 6, baseType: !1063)
!1062 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1064, line: 21, baseType: !1065)
!1064 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1064, line: 13, size: 64, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1065, file: !1064, line: 15, baseType: !175, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1065, file: !1064, line: 20, baseType: !1069, size: 32, offset: 32)
!1069 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1065, file: !1064, line: 16, size: 32, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1069, file: !1064, line: 18, baseType: !116, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1069, file: !1064, line: 19, baseType: !447, size: 32)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 16, elements: !207)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 78, type: !479, isLocal: true, isDefinition: true)
!1076 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 79, type: !452, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 80, type: !589, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 81, type: !589, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 82, type: !432, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 83, type: !206, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 84, type: !479, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 85, type: !474, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 86, type: !474, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 87, type: !479, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1097, file: !1076, line: 76, type: !1169, isLocal: false, isDefinition: true)
!1097 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1076, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1098, retainedTypes: !1104, globals: !1105, splitDebugInlining: false, nameTableKind: None)
!1098 = !{!896, !1099, !142}
!1099 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !897, line: 254, baseType: !116, size: 32, elements: !1100)
!1100 = !{!1101, !1102, !1103}
!1101 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1102 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1103 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1104 = !{!192, !175, !185, !186}
!1105 = !{!1074, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1093, !1095, !1106, !1110, !1120, !1122, !1127, !1129, !1131, !1133, !1135, !1158, !1165, !1167}
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1097, file: !1076, line: 92, type: !1108, isLocal: false, isDefinition: true)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 320, elements: !104)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1097, file: !1076, line: 1040, type: !1112, isLocal: false, isDefinition: true)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1076, line: 56, size: 448, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1118, !1119}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1112, file: !1076, line: 59, baseType: !896, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !1076, line: 62, baseType: !175, size: 32, offset: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1112, file: !1076, line: 66, baseType: !1117, size: 256, offset: 64)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, elements: !480)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1112, file: !1076, line: 69, baseType: !189, size: 64, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1112, file: !1076, line: 72, baseType: !189, size: 64, offset: 384)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1097, file: !1076, line: 107, type: !1112, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "slot0", scope: !1097, file: !1076, line: 831, type: !1124, isLocal: true, isDefinition: true)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 256)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 321, type: !206, isLocal: true, isDefinition: true)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 357, type: !206, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 358, type: !206, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !1076, line: 199, type: !474, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(name: "quote", scope: !1137, file: !1076, line: 228, type: !1156, isLocal: true, isDefinition: true)
!1137 = distinct !DISubprogram(name: "gettext_quote", scope: !1076, file: !1076, line: 197, type: !1138, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1097, retainedNodes: !1140)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!189, !189, !896}
!1140 = !{!1141, !1142, !1143, !1144, !1145}
!1141 = !DILocalVariable(name: "msgid", arg: 1, scope: !1137, file: !1076, line: 197, type: !189)
!1142 = !DILocalVariable(name: "s", arg: 2, scope: !1137, file: !1076, line: 197, type: !896)
!1143 = !DILocalVariable(name: "translation", scope: !1137, file: !1076, line: 199, type: !189)
!1144 = !DILocalVariable(name: "w", scope: !1137, file: !1076, line: 229, type: !1056)
!1145 = !DILocalVariable(name: "mbs", scope: !1137, file: !1076, line: 230, type: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1062, line: 6, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1064, line: 21, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1064, line: 13, size: 64, elements: !1149)
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1148, file: !1064, line: 15, baseType: !175, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1148, file: !1064, line: 20, baseType: !1152, size: 32, offset: 32)
!1152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1148, file: !1064, line: 16, size: 32, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1152, file: !1064, line: 18, baseType: !116, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1152, file: !1064, line: 19, baseType: !447, size: 32)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 64, elements: !1157)
!1157 = !{!208, !449}
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(name: "slotvec", scope: !1097, file: !1076, line: 834, type: !1160, isLocal: true, isDefinition: true)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1076, line: 823, size: 128, elements: !1162)
!1162 = !{!1163, !1164}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !1076, line: 825, baseType: !186, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1161, file: !1076, line: 826, baseType: !184, size: 64, offset: 64)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(name: "nslots", scope: !1097, file: !1076, line: 832, type: !175, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
