; ModuleID = 'src/true.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating success.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"true\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !24

!162 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 15)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !3, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !127, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !9, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !9, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !140, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 22)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !163, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !108, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 71)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 27)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 51)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 12)
!210 = !{!211, !212, !213, !216, !218, !219, !220, !224, !225, !226, !227, !229, !282, !283, !284, !286, !287}
!211 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!212 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!213 = !DILocalVariable(name: "term", scope: !214, file: !69, line: 585, type: !72)
!214 = distinct !DILexicalBlock(scope: !215, file: !69, line: 582, column: 5)
!215 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!216 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !217)
!217 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!218 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!219 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!220 = !DILocalVariable(name: "s", scope: !221, file: !69, line: 608, type: !72)
!221 = distinct !DILexicalBlock(scope: !222, file: !69, line: 605, column: 5)
!222 = distinct !DILexicalBlock(scope: !223, file: !69, line: 604, column: 12)
!223 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!224 = !DILocalVariable(name: "spaces", scope: !221, file: !69, line: 609, type: !97)
!225 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !97)
!226 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!227 = !DILocalVariable(name: "__ptr", scope: !228, file: !69, line: 644, type: !72)
!228 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!229 = !DILocalVariable(name: "__stream", scope: !228, file: !69, line: 644, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !233)
!232 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !235)
!234 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !251, !253, !254, !255, !259, !260, !262, !263, !266, !268, !271, !274, !275, !276, !277, !278}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !233, file: !234, line: 51, baseType: !95, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !233, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !233, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !233, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !233, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !233, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !233, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !233, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !233, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !233, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !233, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !233, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !233, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !234, line: 36, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !233, file: !234, line: 70, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !233, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !233, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !233, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 152, baseType: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!258 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !233, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !233, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!261 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !233, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !233, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !234, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !233, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 153, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !233, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !234, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !233, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !234, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !233, file: !234, line: 93, baseType: !252, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !233, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !233, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !233, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !233, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocalVariable(name: "__cnt", scope: !228, file: !69, line: 644, type: !97)
!283 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !69, line: 686, type: !72)
!285 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !69, line: 686, type: !230)
!287 = !DILocalVariable(name: "__cnt", scope: !285, file: !69, line: 686, type: !97)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !290, line: 3, type: !163, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !290, line: 3, type: !72, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !290, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !294, splitDebugInlining: false, nameTableKind: None)
!294 = !{!288, !291}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 45, type: !72, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!299 = !{!300, !302, !304, !306, !295, !308}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !51, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !207, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !298, line: 123, type: !51, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !298, line: 126, type: !127, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 55, type: !217, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !312, file: !313, line: 66, type: !363, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !315, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!314 = !{!94, !100}
!315 = !{!316, !318, !342, !344, !346, !348, !310, !350, !352, !354, !356, !361}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !313, line: 272, type: !9, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "old_file_name", scope: !320, file: !313, line: 304, type: !72, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "verror_at_line", scope: !313, file: !313, line: 298, type: !321, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !335)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !95, !95, !72, !78, !72, !323}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !324, line: 52, baseType: !325)
!324 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !326, line: 12, baseType: !327)
!326 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !313, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !329)
!329 = !{!330, !331, !332, !333, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !328, file: !313, baseType: !94, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !328, file: !313, baseType: !94, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !328, file: !313, baseType: !94, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !328, file: !313, baseType: !95, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !328, file: !313, baseType: !95, size: 32, offset: 224)
!335 = !{!336, !337, !338, !339, !340, !341}
!336 = !DILocalVariable(name: "status", arg: 1, scope: !320, file: !313, line: 298, type: !95)
!337 = !DILocalVariable(name: "errnum", arg: 2, scope: !320, file: !313, line: 298, type: !95)
!338 = !DILocalVariable(name: "file_name", arg: 3, scope: !320, file: !313, line: 298, type: !72)
!339 = !DILocalVariable(name: "line_number", arg: 4, scope: !320, file: !313, line: 298, type: !78)
!340 = !DILocalVariable(name: "message", arg: 5, scope: !320, file: !313, line: 298, type: !72)
!341 = !DILocalVariable(name: "args", arg: 6, scope: !320, file: !313, line: 298, type: !323)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "old_line_number", scope: !320, file: !313, line: 305, type: !78, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !313, line: 338, type: !108, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !140, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !118, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "error_message_count", scope: !312, file: !313, line: 69, type: !78, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !312, file: !313, line: 295, type: !95, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !51, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 21)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !313, line: 214, type: !9, isLocal: true, isDefinition: true)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "program_name", scope: !368, file: !369, line: 31, type: !72, isLocal: false, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C11, file: !369, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!370 = !{!94, !93}
!371 = !{!366, !372, !374}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !369, line: 46, type: !140, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !369, line: 49, type: !108, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "utf07FF", scope: !378, file: !379, line: 46, type: !406, isLocal: true, isDefinition: true)
!378 = distinct !DISubprogram(name: "proper_name_lite", scope: !379, file: !379, line: 38, type: !380, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !382, retainedNodes: !384)
!379 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!380 = !DISubroutineType(types: !381)
!381 = !{!72, !72, !72}
!382 = distinct !DICompileUnit(language: DW_LANG_C11, file: !379, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !383, splitDebugInlining: false, nameTableKind: None)
!383 = !{!376}
!384 = !{!385, !386, !387, !388, !393}
!385 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !378, file: !379, line: 38, type: !72)
!386 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !378, file: !379, line: 38, type: !72)
!387 = !DILocalVariable(name: "translation", scope: !378, file: !379, line: 40, type: !72)
!388 = !DILocalVariable(name: "w", scope: !378, file: !379, line: 47, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !390, line: 37, baseType: !391)
!390 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !257, line: 57, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !257, line: 42, baseType: !78)
!393 = !DILocalVariable(name: "mbs", scope: !378, file: !379, line: 48, type: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !395, line: 6, baseType: !396)
!395 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !397, line: 21, baseType: !398)
!397 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 13, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !398, file: !397, line: 15, baseType: !95, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !398, file: !397, line: 20, baseType: !402, size: 32, offset: 32)
!402 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !398, file: !397, line: 16, size: 32, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !402, file: !397, line: 18, baseType: !78, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !402, file: !397, line: 19, baseType: !108, size: 32)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !119)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !409, line: 78, type: !140, isLocal: true, isDefinition: true)
!409 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !409, line: 79, type: !113, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !409, line: 80, type: !63, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !409, line: 81, type: !63, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !409, line: 82, type: !279, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !409, line: 83, type: !118, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !409, line: 84, type: !140, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !409, line: 85, type: !51, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !409, line: 86, type: !51, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !409, line: 87, type: !140, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !430, file: !409, line: 76, type: !516, isLocal: false, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !431, retainedTypes: !451, globals: !452, splitDebugInlining: false, nameTableKind: None)
!431 = !{!432, !446, !76}
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !433, line: 42, baseType: !78, size: 32, elements: !434)
!433 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!435 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!436 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!437 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!438 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!439 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!440 = !DIEnumerator(name: "c_quoting_style", value: 5)
!441 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!442 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!443 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!444 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!445 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !433, line: 254, baseType: !78, size: 32, elements: !447)
!447 = !{!448, !449, !450}
!448 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!449 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!450 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!451 = !{!94, !95, !96, !97}
!452 = !{!407, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !453, !457, !467, !469, !474, !476, !478, !480, !482, !505, !512, !514}
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !430, file: !409, line: 92, type: !455, isLocal: false, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 320, elements: !42)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !430, file: !409, line: 1040, type: !459, isLocal: false, isDefinition: true)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !409, line: 56, size: 448, elements: !460)
!460 = !{!461, !462, !463, !465, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !459, file: !409, line: 59, baseType: !432, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !459, file: !409, line: 62, baseType: !95, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !459, file: !409, line: 66, baseType: !464, size: 256, offset: 64)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !141)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !459, file: !409, line: 69, baseType: !72, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !459, file: !409, line: 72, baseType: !72, size: 64, offset: 384)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !430, file: !409, line: 107, type: !459, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "slot0", scope: !430, file: !409, line: 831, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 256)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !409, line: 321, type: !118, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !409, line: 357, type: !118, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !409, line: 358, type: !118, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !409, line: 199, type: !51, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "quote", scope: !484, file: !409, line: 228, type: !503, isLocal: true, isDefinition: true)
!484 = distinct !DISubprogram(name: "gettext_quote", scope: !409, file: !409, line: 197, type: !485, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !430, retainedNodes: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{!72, !72, !432}
!487 = !{!488, !489, !490, !491, !492}
!488 = !DILocalVariable(name: "msgid", arg: 1, scope: !484, file: !409, line: 197, type: !72)
!489 = !DILocalVariable(name: "s", arg: 2, scope: !484, file: !409, line: 197, type: !432)
!490 = !DILocalVariable(name: "translation", scope: !484, file: !409, line: 199, type: !72)
!491 = !DILocalVariable(name: "w", scope: !484, file: !409, line: 229, type: !389)
!492 = !DILocalVariable(name: "mbs", scope: !484, file: !409, line: 230, type: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !395, line: 6, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !397, line: 21, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 13, size: 64, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !495, file: !397, line: 15, baseType: !95, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !495, file: !397, line: 20, baseType: !499, size: 32, offset: 32)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !495, file: !397, line: 16, size: 32, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !499, file: !397, line: 18, baseType: !78, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !499, file: !397, line: 19, baseType: !108, size: 32)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !504)
!504 = !{!120, !110}
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "slotvec", scope: !430, file: !409, line: 834, type: !507, isLocal: true, isDefinition: true)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !409, line: 823, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !508, file: !409, line: 825, baseType: !97, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !508, file: !409, line: 826, baseType: !93, size: 64, offset: 64)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "nslots", scope: !430, file: !409, line: 832, type: !95, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "slotvec0", scope: !430, file: !409, line: 833, type: !508, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 704, elements: !518)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!518 = !{!519}
!519 = !DISubrange(count: 11)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !522, line: 67, type: !207, isLocal: true, isDefinition: true)
!522 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !522, line: 69, type: !51, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !522, line: 83, type: !51, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !522, line: 83, type: !108, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !522, line: 85, type: !118, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !522, line: 88, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 171)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !522, line: 88, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 34)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !522, line: 105, type: !178, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !522, line: 109, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 23)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !522, line: 113, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 28)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !522, line: 120, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 32)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !522, line: 127, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 36)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !522, line: 134, type: !158, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !522, line: 142, type: !14, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !522, line: 150, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 48)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !522, line: 159, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 52)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !522, line: 170, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 60)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !522, line: 248, type: !279, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !522, line: 248, type: !183, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !522, line: 254, type: !279, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !522, line: 254, type: !58, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !522, line: 254, type: !158, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !522, line: 259, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 39)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !522, line: 259, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 29)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !604, file: !605, line: 26, type: !607, isLocal: false, isDefinition: true)
!604 = distinct !DICompileUnit(language: DW_LANG_C11, file: !605, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !606, splitDebugInlining: false, nameTableKind: None)
!605 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!606 = !{!602}
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 47)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "exit_failure", scope: !612, file: !613, line: 24, type: !615, isLocal: false, isDefinition: true)
!612 = distinct !DICompileUnit(language: DW_LANG_C11, file: !613, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !614, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!614 = !{!610}
!615 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !618, line: 34, type: !127, isLocal: true, isDefinition: true)
!618 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !618, line: 34, type: !51, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !618, line: 34, type: !153, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !625, line: 108, type: !36, isLocal: true, isDefinition: true)
!625 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "internal_state", scope: !628, file: !625, line: 97, type: !631, isLocal: true, isDefinition: true)
!628 = distinct !DICompileUnit(language: DW_LANG_C11, file: !625, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !629, globals: !630, splitDebugInlining: false, nameTableKind: None)
!629 = !{!94, !97, !100}
!630 = !{!623, !626}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !395, line: 6, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !397, line: 21, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 13, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !633, file: !397, line: 15, baseType: !95, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !633, file: !397, line: 20, baseType: !637, size: 32, offset: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !633, file: !397, line: 16, size: 32, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !637, file: !397, line: 18, baseType: !78, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !637, file: !397, line: 19, baseType: !108, size: 32)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !643, line: 35, type: !118, isLocal: true, isDefinition: true)
!643 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !643, line: 35, type: !113, isLocal: true, isDefinition: true)
!646 = distinct !DICompileUnit(language: DW_LANG_C11, file: !647, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!648 = distinct !DICompileUnit(language: DW_LANG_C11, file: !522, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !649, retainedTypes: !653, globals: !654, splitDebugInlining: false, nameTableKind: None)
!649 = !{!650}
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !522, line: 40, baseType: !78, size: 32, elements: !651)
!651 = !{!652}
!652 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!653 = !{!94}
!654 = !{!520, !523, !525, !527, !529, !531, !536, !541, !543, !548, !553, !558, !563, !565, !567, !572, !577, !582, !584, !586, !588, !590, !592, !597}
!655 = distinct !DICompileUnit(language: DW_LANG_C11, file: !656, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !657, retainedTypes: !689, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!657 = !{!658, !670}
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !659, file: !656, line: 188, baseType: !78, size: 32, elements: !668)
!659 = distinct !DISubprogram(name: "x2nrealloc", scope: !656, file: !656, line: 176, type: !660, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !655, retainedNodes: !663)
!660 = !DISubroutineType(types: !661)
!661 = !{!94, !94, !662, !97}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!663 = !{!664, !665, !666, !667}
!664 = !DILocalVariable(name: "p", arg: 1, scope: !659, file: !656, line: 176, type: !94)
!665 = !DILocalVariable(name: "pn", arg: 2, scope: !659, file: !656, line: 176, type: !662)
!666 = !DILocalVariable(name: "s", arg: 3, scope: !659, file: !656, line: 176, type: !97)
!667 = !DILocalVariable(name: "n", scope: !659, file: !656, line: 178, type: !97)
!668 = !{!669}
!669 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !671, file: !656, line: 228, baseType: !78, size: 32, elements: !668)
!671 = distinct !DISubprogram(name: "xpalloc", scope: !656, file: !656, line: 223, type: !672, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !655, retainedNodes: !679)
!672 = !DISubroutineType(types: !673)
!673 = !{!94, !94, !674, !675, !677, !675}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !676, line: 130, baseType: !677)
!676 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !678, line: 18, baseType: !258)
!678 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688}
!680 = !DILocalVariable(name: "pa", arg: 1, scope: !671, file: !656, line: 223, type: !94)
!681 = !DILocalVariable(name: "pn", arg: 2, scope: !671, file: !656, line: 223, type: !674)
!682 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !671, file: !656, line: 223, type: !675)
!683 = !DILocalVariable(name: "n_max", arg: 4, scope: !671, file: !656, line: 223, type: !677)
!684 = !DILocalVariable(name: "s", arg: 5, scope: !671, file: !656, line: 223, type: !675)
!685 = !DILocalVariable(name: "n0", scope: !671, file: !656, line: 230, type: !675)
!686 = !DILocalVariable(name: "n", scope: !671, file: !656, line: 237, type: !675)
!687 = !DILocalVariable(name: "nbytes", scope: !671, file: !656, line: 248, type: !675)
!688 = !DILocalVariable(name: "adjusted_nbytes", scope: !671, file: !656, line: 252, type: !675)
!689 = !{!93, !94}
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !618, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !691, splitDebugInlining: false, nameTableKind: None)
!691 = !{!616, !619, !621}
!692 = distinct !DICompileUnit(language: DW_LANG_C11, file: !693, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!694 = distinct !DICompileUnit(language: DW_LANG_C11, file: !695, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !697, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !653, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!698 = distinct !DICompileUnit(language: DW_LANG_C11, file: !699, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !653, splitDebugInlining: false, nameTableKind: None)
!699 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !653, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !643, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !703, splitDebugInlining: false, nameTableKind: None)
!703 = !{!641, !644}
!704 = distinct !DICompileUnit(language: DW_LANG_C11, file: !705, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!706 = distinct !DICompileUnit(language: DW_LANG_C11, file: !707, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !653, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!708 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!709 = !{i32 7, !"Dwarf Version", i32 5}
!710 = !{i32 2, !"Debug Info Version", i32 3}
!711 = !{i32 1, !"wchar_size", i32 4}
!712 = !{i32 8, !"PIC Level", i32 2}
!713 = !{i32 7, !"PIE Level", i32 2}
!714 = !{i32 7, !"uwtable", i32 2}
!715 = !{i32 7, !"frame-pointer", i32 1}
!716 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!717 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !718, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !95}
!720 = !{!721}
!721 = !DILocalVariable(name: "status", arg: 1, scope: !717, file: !2, line: 36, type: !95)
!722 = !DILocation(line: 0, scope: !717)
!723 = !DILocation(line: 38, column: 3, scope: !717)
!724 = !{!725, !725, i64 0}
!725 = !{!"any pointer", !726, i64 0}
!726 = !{!"omnipotent char", !727, i64 0}
!727 = !{!"Simple C/C++ TBAA"}
!728 = !DILocation(line: 43, column: 3, scope: !717)
!729 = !DILocation(line: 47, column: 3, scope: !717)
!730 = !DILocation(line: 48, column: 3, scope: !717)
!731 = !DILocation(line: 49, column: 3, scope: !717)
!732 = !DILocation(line: 50, column: 3, scope: !717)
!733 = !DILocation(line: 51, column: 3, scope: !717)
!734 = !DISubprogram(name: "dcgettext", scope: !735, file: !735, line: 51, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!735 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!736 = !DISubroutineType(types: !737)
!737 = !{!93, !72, !72, !95}
!738 = !DISubprogram(name: "__printf_chk", scope: !739, file: !739, line: 95, type: !740, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!740 = !DISubroutineType(types: !741)
!741 = !{!95, !95, !742, null}
!742 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!743 = !DILocation(line: 0, scope: !68)
!744 = !DILocation(line: 581, column: 7, scope: !215)
!745 = !{!746, !746, i64 0}
!746 = !{!"int", !726, i64 0}
!747 = !DILocation(line: 581, column: 19, scope: !215)
!748 = !DILocation(line: 581, column: 7, scope: !68)
!749 = !DILocation(line: 585, column: 26, scope: !214)
!750 = !DILocation(line: 0, scope: !214)
!751 = !DILocation(line: 586, column: 23, scope: !214)
!752 = !DILocation(line: 586, column: 28, scope: !214)
!753 = !DILocation(line: 586, column: 32, scope: !214)
!754 = !{!726, !726, i64 0}
!755 = !DILocation(line: 586, column: 38, scope: !214)
!756 = !DILocalVariable(name: "__s1", arg: 1, scope: !757, file: !758, line: 1359, type: !72)
!757 = distinct !DISubprogram(name: "streq", scope: !758, file: !758, line: 1359, type: !759, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !761)
!758 = !DIFile(filename: "./lib/string.h", directory: "/src")
!759 = !DISubroutineType(types: !760)
!760 = !{!217, !72, !72}
!761 = !{!756, !762}
!762 = !DILocalVariable(name: "__s2", arg: 2, scope: !757, file: !758, line: 1359, type: !72)
!763 = !DILocation(line: 0, scope: !757, inlinedAt: !764)
!764 = distinct !DILocation(line: 586, column: 41, scope: !214)
!765 = !DILocation(line: 1361, column: 11, scope: !757, inlinedAt: !764)
!766 = !DILocation(line: 1361, column: 10, scope: !757, inlinedAt: !764)
!767 = !DILocation(line: 586, column: 19, scope: !214)
!768 = !DILocation(line: 587, column: 5, scope: !214)
!769 = !DILocation(line: 588, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!771 = !DILocation(line: 588, column: 7, scope: !68)
!772 = !DILocation(line: 590, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !770, file: !69, line: 589, column: 5)
!774 = !DILocation(line: 591, column: 7, scope: !773)
!775 = !DILocation(line: 595, column: 37, scope: !68)
!776 = !DILocation(line: 595, column: 35, scope: !68)
!777 = !DILocation(line: 596, column: 29, scope: !68)
!778 = !DILocation(line: 597, column: 8, scope: !223)
!779 = !DILocation(line: 597, column: 7, scope: !68)
!780 = !DILocation(line: 604, column: 24, scope: !222)
!781 = !DILocation(line: 604, column: 12, scope: !223)
!782 = !DILocation(line: 0, scope: !221)
!783 = !DILocation(line: 610, column: 16, scope: !221)
!784 = !DILocation(line: 610, column: 7, scope: !221)
!785 = !DILocation(line: 611, column: 21, scope: !221)
!786 = !{!787, !787, i64 0}
!787 = !{!"short", !726, i64 0}
!788 = !DILocation(line: 611, column: 19, scope: !221)
!789 = !DILocation(line: 611, column: 16, scope: !221)
!790 = !DILocation(line: 610, column: 30, scope: !221)
!791 = distinct !{!791, !784, !785, !792}
!792 = !{!"llvm.loop.mustprogress"}
!793 = !DILocation(line: 612, column: 18, scope: !794)
!794 = distinct !DILexicalBlock(scope: !221, file: !69, line: 612, column: 11)
!795 = !DILocation(line: 612, column: 11, scope: !221)
!796 = !DILocation(line: 620, column: 23, scope: !68)
!797 = !DILocation(line: 625, column: 39, scope: !68)
!798 = !DILocation(line: 626, column: 3, scope: !68)
!799 = !DILocation(line: 626, column: 10, scope: !68)
!800 = !DILocation(line: 626, column: 21, scope: !68)
!801 = !DILocation(line: 628, column: 44, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !69, line: 628, column: 11)
!803 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!804 = !DILocation(line: 628, column: 32, scope: !802)
!805 = !DILocation(line: 628, column: 49, scope: !802)
!806 = !DILocation(line: 628, column: 11, scope: !803)
!807 = !DILocation(line: 630, column: 11, scope: !808)
!808 = distinct !DILexicalBlock(scope: !803, file: !69, line: 630, column: 11)
!809 = !DILocation(line: 630, column: 11, scope: !803)
!810 = !DILocation(line: 632, column: 26, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !69, line: 632, column: 15)
!812 = distinct !DILexicalBlock(scope: !808, file: !69, line: 631, column: 9)
!813 = !DILocation(line: 632, column: 34, scope: !811)
!814 = !DILocation(line: 632, column: 37, scope: !811)
!815 = !DILocation(line: 632, column: 15, scope: !812)
!816 = !DILocation(line: 640, column: 16, scope: !803)
!817 = distinct !{!817, !798, !818, !792}
!818 = !DILocation(line: 641, column: 5, scope: !68)
!819 = !DILocation(line: 644, column: 3, scope: !68)
!820 = !DILocation(line: 0, scope: !757, inlinedAt: !821)
!821 = distinct !DILocation(line: 648, column: 31, scope: !68)
!822 = !{}
!823 = !DILocation(line: 0, scope: !757, inlinedAt: !824)
!824 = distinct !DILocation(line: 649, column: 31, scope: !68)
!825 = !DILocation(line: 0, scope: !757, inlinedAt: !826)
!826 = distinct !DILocation(line: 650, column: 31, scope: !68)
!827 = !DILocation(line: 0, scope: !757, inlinedAt: !828)
!828 = distinct !DILocation(line: 651, column: 31, scope: !68)
!829 = !DILocation(line: 0, scope: !757, inlinedAt: !830)
!830 = distinct !DILocation(line: 652, column: 31, scope: !68)
!831 = !DILocation(line: 0, scope: !757, inlinedAt: !832)
!832 = distinct !DILocation(line: 653, column: 31, scope: !68)
!833 = !DILocation(line: 0, scope: !757, inlinedAt: !834)
!834 = distinct !DILocation(line: 654, column: 31, scope: !68)
!835 = !DILocation(line: 0, scope: !757, inlinedAt: !836)
!836 = distinct !DILocation(line: 655, column: 31, scope: !68)
!837 = !DILocation(line: 0, scope: !757, inlinedAt: !838)
!838 = distinct !DILocation(line: 656, column: 31, scope: !68)
!839 = !DILocation(line: 0, scope: !757, inlinedAt: !840)
!840 = distinct !DILocation(line: 657, column: 31, scope: !68)
!841 = !DILocation(line: 663, column: 7, scope: !842)
!842 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!843 = !DILocation(line: 664, column: 7, scope: !842)
!844 = !DILocation(line: 664, column: 10, scope: !842)
!845 = !DILocation(line: 663, column: 7, scope: !68)
!846 = !DILocation(line: 669, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !842, file: !69, line: 665, column: 5)
!848 = !DILocation(line: 671, column: 5, scope: !847)
!849 = !DILocation(line: 676, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !842, file: !69, line: 673, column: 5)
!851 = !DILocation(line: 679, column: 3, scope: !68)
!852 = !DILocation(line: 683, column: 3, scope: !68)
!853 = !DILocation(line: 686, column: 3, scope: !68)
!854 = !DILocation(line: 688, column: 3, scope: !68)
!855 = !DILocation(line: 691, column: 3, scope: !68)
!856 = !DILocation(line: 695, column: 3, scope: !68)
!857 = !DILocation(line: 696, column: 1, scope: !68)
!858 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !859, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !861)
!859 = !DISubroutineType(cc: DW_CC_nocall, types: !860)
!860 = !{null, !72}
!861 = !{!862, !863, !870, !871, !873, !874}
!862 = !DILocalVariable(name: "program", arg: 1, scope: !858, file: !69, line: 836, type: !72)
!863 = !DILocalVariable(name: "infomap", scope: !858, file: !69, line: 838, type: !864)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 896, elements: !52)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !858, file: !69, line: 838, size: 128, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !866, file: !69, line: 838, baseType: !72, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !866, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!870 = !DILocalVariable(name: "node", scope: !858, file: !69, line: 848, type: !72)
!871 = !DILocalVariable(name: "map_prog", scope: !858, file: !69, line: 849, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!873 = !DILocalVariable(name: "lc_messages", scope: !858, file: !69, line: 861, type: !72)
!874 = !DILocalVariable(name: "url_program", scope: !858, file: !69, line: 874, type: !72)
!875 = !DILocation(line: 0, scope: !858)
!876 = !DILocation(line: 857, column: 3, scope: !858)
!877 = !DILocation(line: 861, column: 29, scope: !858)
!878 = !DILocation(line: 862, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !858, file: !69, line: 862, column: 7)
!880 = !DILocation(line: 862, column: 19, scope: !879)
!881 = !DILocation(line: 862, column: 22, scope: !879)
!882 = !DILocation(line: 862, column: 7, scope: !858)
!883 = !DILocation(line: 868, column: 7, scope: !884)
!884 = distinct !DILexicalBlock(scope: !879, file: !69, line: 863, column: 5)
!885 = !DILocation(line: 870, column: 5, scope: !884)
!886 = !DILocation(line: 875, column: 3, scope: !858)
!887 = !DILocation(line: 877, column: 3, scope: !858)
!888 = !DILocation(line: 879, column: 1, scope: !858)
!889 = !DISubprogram(name: "exit", scope: !890, file: !890, line: 624, type: !718, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!890 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!891 = !DISubprogram(name: "setlocale", scope: !892, file: !892, line: 122, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!892 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!893 = !DISubroutineType(types: !894)
!894 = !{!93, !95, !72}
!895 = !DISubprogram(name: "strncmp", scope: !896, file: !896, line: 159, type: !897, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!896 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!897 = !DISubroutineType(types: !898)
!898 = !{!95, !72, !72, !97}
!899 = !DISubprogram(name: "fputs_unlocked", scope: !324, file: !324, line: 691, type: !900, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!900 = !DISubroutineType(types: !901)
!901 = !{!95, !742, !902}
!902 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !230)
!903 = !DISubprogram(name: "getenv", scope: !890, file: !890, line: 641, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!904 = !DISubroutineType(types: !905)
!905 = !{!93, !72}
!906 = !DISubprogram(name: "strcmp", scope: !896, file: !896, line: 156, type: !907, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!907 = !DISubroutineType(types: !908)
!908 = !{!95, !72, !72}
!909 = !DISubprogram(name: "strspn", scope: !896, file: !896, line: 297, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!910 = !DISubroutineType(types: !911)
!911 = !{!99, !72, !72}
!912 = !DISubprogram(name: "strchr", scope: !896, file: !896, line: 246, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!913 = !DISubroutineType(types: !914)
!914 = !{!93, !72, !95}
!915 = !DISubprogram(name: "__ctype_b_loc", scope: !77, file: !77, line: 79, type: !916, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!916 = !DISubroutineType(types: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!921 = !DISubprogram(name: "strcspn", scope: !896, file: !896, line: 293, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!922 = !DISubprogram(name: "fwrite_unlocked", scope: !324, file: !324, line: 704, type: !923, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!923 = !DISubroutineType(types: !924)
!924 = !{!97, !925, !97, !97, !902}
!925 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!928 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !929, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !932)
!929 = !DISubroutineType(types: !930)
!930 = !{!95, !95, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!932 = !{!933, !934}
!933 = !DILocalVariable(name: "argc", arg: 1, scope: !928, file: !2, line: 55, type: !95)
!934 = !DILocalVariable(name: "argv", arg: 2, scope: !928, file: !2, line: 55, type: !931)
!935 = !DILocation(line: 0, scope: !928)
!936 = !DILocation(line: 59, column: 12, scope: !937)
!937 = distinct !DILexicalBlock(scope: !928, file: !2, line: 59, column: 7)
!938 = !DILocation(line: 59, column: 7, scope: !928)
!939 = !DILocation(line: 62, column: 25, scope: !940)
!940 = distinct !DILexicalBlock(scope: !937, file: !2, line: 60, column: 5)
!941 = !DILocation(line: 62, column: 7, scope: !940)
!942 = !DILocation(line: 63, column: 7, scope: !940)
!943 = !DILocation(line: 64, column: 7, scope: !940)
!944 = !DILocation(line: 65, column: 7, scope: !940)
!945 = !DILocation(line: 69, column: 7, scope: !940)
!946 = !DILocation(line: 71, column: 18, scope: !947)
!947 = distinct !DILexicalBlock(scope: !940, file: !2, line: 71, column: 11)
!948 = !DILocation(line: 0, scope: !757, inlinedAt: !949)
!949 = distinct !DILocation(line: 71, column: 11, scope: !947)
!950 = !DILocation(line: 1361, column: 11, scope: !757, inlinedAt: !949)
!951 = !DILocation(line: 1361, column: 10, scope: !757, inlinedAt: !949)
!952 = !DILocation(line: 71, column: 11, scope: !940)
!953 = !DILocation(line: 72, column: 9, scope: !947)
!954 = !DILocation(line: 0, scope: !757, inlinedAt: !955)
!955 = distinct !DILocation(line: 74, column: 11, scope: !956)
!956 = distinct !DILexicalBlock(scope: !940, file: !2, line: 74, column: 11)
!957 = !DILocation(line: 1361, column: 11, scope: !757, inlinedAt: !955)
!958 = !DILocation(line: 1361, column: 10, scope: !757, inlinedAt: !955)
!959 = !DILocation(line: 74, column: 11, scope: !940)
!960 = !DILocation(line: 75, column: 22, scope: !956)
!961 = !DILocation(line: 75, column: 58, scope: !956)
!962 = !DILocation(line: 75, column: 67, scope: !956)
!963 = !DILocation(line: 75, column: 9, scope: !956)
!964 = !DILocation(line: 79, column: 3, scope: !928)
!965 = !DISubprogram(name: "bindtextdomain", scope: !735, file: !735, line: 86, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!966 = !DISubroutineType(types: !967)
!967 = !{!93, !72, !72}
!968 = !DISubprogram(name: "textdomain", scope: !735, file: !735, line: 82, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!969 = !DISubprogram(name: "atexit", scope: !890, file: !890, line: 602, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!970 = !DISubroutineType(types: !971)
!971 = !{!95, !363}
!972 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !298, file: !298, line: 50, type: !973, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !974)
!973 = !DISubroutineType(types: !860)
!974 = !{!975}
!975 = !DILocalVariable(name: "file", arg: 1, scope: !972, file: !298, line: 50, type: !72)
!976 = !DILocation(line: 0, scope: !972)
!977 = !DILocation(line: 52, column: 13, scope: !972)
!978 = !DILocation(line: 53, column: 1, scope: !972)
!979 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !298, file: !298, line: 87, type: !980, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !217}
!982 = !{!983}
!983 = !DILocalVariable(name: "ignore", arg: 1, scope: !979, file: !298, line: 87, type: !217)
!984 = !DILocation(line: 0, scope: !979)
!985 = !DILocation(line: 89, column: 16, scope: !979)
!986 = !{!987, !987, i64 0}
!987 = !{!"_Bool", !726, i64 0}
!988 = !DILocation(line: 90, column: 1, scope: !979)
!989 = distinct !DISubprogram(name: "close_stdout", scope: !298, file: !298, line: 116, type: !364, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !990)
!990 = !{!991}
!991 = !DILocalVariable(name: "write_error", scope: !992, file: !298, line: 121, type: !72)
!992 = distinct !DILexicalBlock(scope: !993, file: !298, line: 120, column: 5)
!993 = distinct !DILexicalBlock(scope: !989, file: !298, line: 118, column: 7)
!994 = !DILocation(line: 118, column: 21, scope: !993)
!995 = !DILocation(line: 118, column: 7, scope: !993)
!996 = !DILocation(line: 118, column: 29, scope: !993)
!997 = !DILocation(line: 119, column: 7, scope: !993)
!998 = !DILocation(line: 119, column: 12, scope: !993)
!999 = !{i8 0, i8 2}
!1000 = !DILocation(line: 119, column: 25, scope: !993)
!1001 = !DILocation(line: 119, column: 28, scope: !993)
!1002 = !DILocation(line: 119, column: 34, scope: !993)
!1003 = !DILocation(line: 118, column: 7, scope: !989)
!1004 = !DILocation(line: 121, column: 33, scope: !992)
!1005 = !DILocation(line: 0, scope: !992)
!1006 = !DILocation(line: 122, column: 11, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !992, file: !298, line: 122, column: 11)
!1008 = !DILocation(line: 0, scope: !1007)
!1009 = !DILocation(line: 122, column: 11, scope: !992)
!1010 = !DILocation(line: 123, column: 9, scope: !1007)
!1011 = !DILocation(line: 126, column: 9, scope: !1007)
!1012 = !DILocation(line: 128, column: 14, scope: !992)
!1013 = !DILocation(line: 128, column: 7, scope: !992)
!1014 = !DILocation(line: 133, column: 42, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !989, file: !298, line: 133, column: 7)
!1016 = !DILocation(line: 133, column: 28, scope: !1015)
!1017 = !DILocation(line: 133, column: 50, scope: !1015)
!1018 = !DILocation(line: 133, column: 7, scope: !989)
!1019 = !DILocation(line: 134, column: 12, scope: !1015)
!1020 = !DILocation(line: 134, column: 5, scope: !1015)
!1021 = !DILocation(line: 135, column: 1, scope: !989)
!1022 = !DISubprogram(name: "__errno_location", scope: !1023, file: !1023, line: 37, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1023 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!1027 = !DISubprogram(name: "_exit", scope: !1028, file: !1028, line: 624, type: !718, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1028 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1029 = distinct !DISubprogram(name: "verror", scope: !313, file: !313, line: 251, type: !1030, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1032)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !95, !95, !72, !323}
!1032 = !{!1033, !1034, !1035, !1036}
!1033 = !DILocalVariable(name: "status", arg: 1, scope: !1029, file: !313, line: 251, type: !95)
!1034 = !DILocalVariable(name: "errnum", arg: 2, scope: !1029, file: !313, line: 251, type: !95)
!1035 = !DILocalVariable(name: "message", arg: 3, scope: !1029, file: !313, line: 251, type: !72)
!1036 = !DILocalVariable(name: "args", arg: 4, scope: !1029, file: !313, line: 251, type: !323)
!1037 = !DILocation(line: 0, scope: !1029)
!1038 = !DILocation(line: 261, column: 3, scope: !1029)
!1039 = !DILocation(line: 265, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1029, file: !313, line: 265, column: 7)
!1041 = !DILocation(line: 265, column: 7, scope: !1029)
!1042 = !DILocation(line: 266, column: 5, scope: !1040)
!1043 = !DILocation(line: 272, column: 7, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !313, line: 268, column: 5)
!1045 = !DILocation(line: 276, column: 3, scope: !1029)
!1046 = !{i64 0, i64 8, !724, i64 8, i64 8, !724, i64 16, i64 8, !724, i64 24, i64 4, !745, i64 28, i64 4, !745}
!1047 = !DILocation(line: 282, column: 1, scope: !1029)
!1048 = distinct !DISubprogram(name: "flush_stdout", scope: !313, file: !313, line: 163, type: !364, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1049)
!1049 = !{!1050}
!1050 = !DILocalVariable(name: "stdout_fd", scope: !1048, file: !313, line: 166, type: !95)
!1051 = !DILocation(line: 0, scope: !1048)
!1052 = !DILocalVariable(name: "fd", arg: 1, scope: !1053, file: !313, line: 145, type: !95)
!1053 = distinct !DISubprogram(name: "is_open", scope: !313, file: !313, line: 145, type: !1054, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1056)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!95, !95}
!1056 = !{!1052}
!1057 = !DILocation(line: 0, scope: !1053, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 182, column: 25, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1048, file: !313, line: 182, column: 7)
!1060 = !DILocation(line: 157, column: 15, scope: !1053, inlinedAt: !1058)
!1061 = !DILocation(line: 157, column: 12, scope: !1053, inlinedAt: !1058)
!1062 = !DILocation(line: 182, column: 7, scope: !1048)
!1063 = !DILocation(line: 184, column: 5, scope: !1059)
!1064 = !DILocation(line: 185, column: 1, scope: !1048)
!1065 = !DISubprogram(name: "__fprintf_chk", scope: !739, file: !739, line: 93, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!95, !1068, !95, !742, null}
!1068 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1071, file: !234, line: 51, baseType: !95, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1071, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1071, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1071, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1071, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1071, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1071, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1071, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1071, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1071, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1071, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1071, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1071, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1071, file: !234, line: 70, baseType: !1087, size: 64, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1071, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1071, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1071, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1071, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1071, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1071, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1071, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1071, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1071, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1071, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1071, file: !234, line: 93, baseType: !1087, size: 64, offset: 1344)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1071, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1071, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1071, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1071, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!1103 = distinct !DISubprogram(name: "error_tail", scope: !313, file: !313, line: 219, type: !1030, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1104)
!1104 = !{!1105, !1106, !1107, !1108}
!1105 = !DILocalVariable(name: "status", arg: 1, scope: !1103, file: !313, line: 219, type: !95)
!1106 = !DILocalVariable(name: "errnum", arg: 2, scope: !1103, file: !313, line: 219, type: !95)
!1107 = !DILocalVariable(name: "message", arg: 3, scope: !1103, file: !313, line: 219, type: !72)
!1108 = !DILocalVariable(name: "args", arg: 4, scope: !1103, file: !313, line: 219, type: !323)
!1109 = distinct !DIAssignID()
!1110 = !DILocation(line: 0, scope: !1103)
!1111 = !DILocation(line: 229, column: 13, scope: !1103)
!1112 = !DILocation(line: 135, column: 10, scope: !1113, inlinedAt: !1120)
!1113 = distinct !DISubprogram(name: "vfprintf", scope: !739, file: !739, line: 132, type: !1114, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1116)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!95, !1068, !742, !325}
!1116 = !{!1117, !1118, !1119}
!1117 = !DILocalVariable(name: "__stream", arg: 1, scope: !1113, file: !739, line: 132, type: !1068)
!1118 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1113, file: !739, line: 133, type: !742)
!1119 = !DILocalVariable(name: "__ap", arg: 3, scope: !1113, file: !739, line: 133, type: !325)
!1120 = distinct !DILocation(line: 229, column: 3, scope: !1103)
!1121 = !{!1122, !1124}
!1122 = distinct !{!1122, !1123, !"vfprintf.inline: argument 0"}
!1123 = distinct !{!1123, !"vfprintf.inline"}
!1124 = distinct !{!1124, !1123, !"vfprintf.inline: argument 1"}
!1125 = !DILocation(line: 229, column: 3, scope: !1103)
!1126 = !DILocation(line: 0, scope: !1113, inlinedAt: !1120)
!1127 = !DILocation(line: 232, column: 3, scope: !1103)
!1128 = !DILocation(line: 233, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1103, file: !313, line: 233, column: 7)
!1130 = !DILocation(line: 233, column: 7, scope: !1103)
!1131 = !DILocalVariable(name: "errbuf", scope: !1132, file: !313, line: 193, type: !1136)
!1132 = distinct !DISubprogram(name: "print_errno_message", scope: !313, file: !313, line: 188, type: !718, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1133)
!1133 = !{!1134, !1135, !1131}
!1134 = !DILocalVariable(name: "errnum", arg: 1, scope: !1132, file: !313, line: 188, type: !95)
!1135 = !DILocalVariable(name: "s", scope: !1132, file: !313, line: 190, type: !72)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 1024)
!1139 = !DILocation(line: 0, scope: !1132, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 234, column: 5, scope: !1129)
!1141 = !DILocation(line: 193, column: 3, scope: !1132, inlinedAt: !1140)
!1142 = !DILocation(line: 195, column: 7, scope: !1132, inlinedAt: !1140)
!1143 = !DILocation(line: 207, column: 9, scope: !1144, inlinedAt: !1140)
!1144 = distinct !DILexicalBlock(scope: !1132, file: !313, line: 207, column: 7)
!1145 = !DILocation(line: 207, column: 7, scope: !1132, inlinedAt: !1140)
!1146 = !DILocation(line: 208, column: 9, scope: !1144, inlinedAt: !1140)
!1147 = !DILocation(line: 208, column: 5, scope: !1144, inlinedAt: !1140)
!1148 = !DILocation(line: 214, column: 3, scope: !1132, inlinedAt: !1140)
!1149 = !DILocation(line: 216, column: 1, scope: !1132, inlinedAt: !1140)
!1150 = !DILocation(line: 234, column: 5, scope: !1129)
!1151 = !DILocation(line: 238, column: 3, scope: !1103)
!1152 = !DILocalVariable(name: "__c", arg: 1, scope: !1153, file: !1154, line: 101, type: !95)
!1153 = distinct !DISubprogram(name: "putc_unlocked", scope: !1154, file: !1154, line: 101, type: !1155, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1157)
!1154 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!95, !95, !1069}
!1157 = !{!1152, !1158}
!1158 = !DILocalVariable(name: "__stream", arg: 2, scope: !1153, file: !1154, line: 101, type: !1069)
!1159 = !DILocation(line: 0, scope: !1153, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 238, column: 3, scope: !1103)
!1161 = !DILocation(line: 103, column: 10, scope: !1153, inlinedAt: !1160)
!1162 = !{!1163, !725, i64 40}
