; ModuleID = 'src/tsort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.tokenbuffer = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.item = type { ptr, ptr, ptr, i8, i8, i64, ptr, ptr }
%struct.successor = type { ptr, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [100 x i8] c"Usage: %s [OPTION] [FILE]\0AWrite totally ordered list consistent with the partial ordering in FILE.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"tsort\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !111, !116, !47, !121, !123, !128, !130, !135, !137, !142, !225, !227, !229, !234, !236, !238, !240, !242, !247, !249, !251, !253, !258, !260, !262, !264, !266, !268, !270, !272, !274, !279, !284, !289, !291, !293, !295, !297, !302, !307, !309, !311, !316, !321, !326, !331, !333, !335, !337, !342, !344, !349, !354, !356, !358, !360, !365, !367, !369, !387, !389}
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 5)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 546, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 8)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 549, type: !14, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 14)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !125, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 17)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 574, type: !14, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !58, line: 729, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 56)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !144, file: !58, line: 575, type: !52, isLocal: true, isDefinition: true)
!144 = distinct !DISubprogram(name: "oputs_", scope: !58, file: !58, line: 573, type: !145, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !147)
!145 = !DISubroutineType(cc: DW_CC_nocall, types: !146)
!146 = !{null, !107, !107}
!147 = !{!148, !149, !150, !153, !155, !156, !157, !161, !162, !163, !164, !166, !219, !220, !221, !223, !224}
!148 = !DILocalVariable(name: "program", arg: 1, scope: !144, file: !58, line: 573, type: !107)
!149 = !DILocalVariable(name: "option", arg: 2, scope: !144, file: !58, line: 573, type: !107)
!150 = !DILocalVariable(name: "term", scope: !151, file: !58, line: 585, type: !107)
!151 = distinct !DILexicalBlock(scope: !152, file: !58, line: 582, column: 5)
!152 = distinct !DILexicalBlock(scope: !144, file: !58, line: 581, column: 7)
!153 = !DILocalVariable(name: "double_space", scope: !144, file: !58, line: 594, type: !154)
!154 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!155 = !DILocalVariable(name: "first_word", scope: !144, file: !58, line: 595, type: !107)
!156 = !DILocalVariable(name: "option_text", scope: !144, file: !58, line: 596, type: !107)
!157 = !DILocalVariable(name: "s", scope: !158, file: !58, line: 608, type: !107)
!158 = distinct !DILexicalBlock(scope: !159, file: !58, line: 605, column: 5)
!159 = distinct !DILexicalBlock(scope: !160, file: !58, line: 604, column: 12)
!160 = distinct !DILexicalBlock(scope: !144, file: !58, line: 597, column: 7)
!161 = !DILocalVariable(name: "spaces", scope: !158, file: !58, line: 609, type: !104)
!162 = !DILocalVariable(name: "anchor_len", scope: !144, file: !58, line: 620, type: !104)
!163 = !DILocalVariable(name: "desc_text", scope: !144, file: !58, line: 625, type: !107)
!164 = !DILocalVariable(name: "__ptr", scope: !165, file: !58, line: 644, type: !107)
!165 = distinct !DILexicalBlock(scope: !144, file: !58, line: 644, column: 3)
!166 = !DILocalVariable(name: "__stream", scope: !165, file: !58, line: 644, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !169, line: 7, baseType: !170)
!169 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !171, line: 49, size: 1728, elements: !172)
!171 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !188, !190, !191, !192, !196, !197, !199, !200, !203, !205, !208, !211, !212, !213, !214, !215}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !170, file: !171, line: 51, baseType: !52, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !170, file: !171, line: 54, baseType: !54, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !170, file: !171, line: 55, baseType: !54, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !170, file: !171, line: 56, baseType: !54, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !170, file: !171, line: 57, baseType: !54, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !170, file: !171, line: 58, baseType: !54, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !170, file: !171, line: 59, baseType: !54, size: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !170, file: !171, line: 60, baseType: !54, size: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !170, file: !171, line: 61, baseType: !54, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !170, file: !171, line: 64, baseType: !54, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !170, file: !171, line: 65, baseType: !54, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !170, file: !171, line: 66, baseType: !54, size: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !170, file: !171, line: 68, baseType: !186, size: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !171, line: 36, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !170, file: !171, line: 70, baseType: !189, size: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !170, file: !171, line: 72, baseType: !52, size: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !170, file: !171, line: 73, baseType: !52, size: 32, offset: 928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !170, file: !171, line: 74, baseType: !193, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !194, line: 152, baseType: !195)
!194 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!195 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !170, file: !171, line: 77, baseType: !103, size: 16, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !170, file: !171, line: 78, baseType: !198, size: 8, offset: 1040)
!198 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !170, file: !171, line: 79, baseType: !34, size: 8, offset: 1048)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !170, file: !171, line: 81, baseType: !201, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !171, line: 43, baseType: null)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !170, file: !171, line: 89, baseType: !204, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !194, line: 153, baseType: !195)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !170, file: !171, line: 91, baseType: !206, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !171, line: 37, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !170, file: !171, line: 92, baseType: !209, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !171, line: 38, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !170, file: !171, line: 93, baseType: !189, size: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !170, file: !171, line: 94, baseType: !102, size: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !170, file: !171, line: 95, baseType: !104, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !170, file: !171, line: 96, baseType: !52, size: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !170, file: !171, line: 98, baseType: !216, size: 160, offset: 1568)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 20)
!219 = !DILocalVariable(name: "__cnt", scope: !165, file: !58, line: 644, type: !104)
!220 = !DILocalVariable(name: "url_program", scope: !144, file: !58, line: 648, type: !107)
!221 = !DILocalVariable(name: "__ptr", scope: !222, file: !58, line: 686, type: !107)
!222 = distinct !DILexicalBlock(scope: !144, file: !58, line: 686, column: 3)
!223 = !DILocalVariable(name: "__stream", scope: !222, file: !58, line: 686, type: !167)
!224 = !DILocalVariable(name: "__cnt", scope: !222, file: !58, line: 686, type: !104)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !58, line: 585, type: !113, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !58, line: 586, type: !113, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !58, line: 595, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 4)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !58, line: 620, type: !19, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !58, line: 648, type: !14, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !58, line: 648, type: !113, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !58, line: 649, type: !231, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !58, line: 649, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !58, line: 650, type: !113, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !58, line: 651, type: !19, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !58, line: 651, type: !19, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !58, line: 652, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 7)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !58, line: 653, type: !118, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !58, line: 654, type: !39, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !58, line: 655, type: !39, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !58, line: 656, type: !39, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !58, line: 657, type: !39, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !58, line: 663, type: !255, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !58, line: 664, type: !39, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !58, line: 669, type: !132, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !58, line: 669, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 40)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !58, line: 676, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 15)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !58, line: 676, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 61)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !58, line: 679, type: !244, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !58, line: 683, type: !113, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !58, line: 688, type: !113, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !58, line: 691, type: !118, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !58, line: 839, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 16)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !58, line: 840, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 22)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !58, line: 841, type: !281, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !58, line: 862, type: !231, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !58, line: 868, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 71)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !58, line: 875, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 27)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !58, line: 877, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 51)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !58, line: 877, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 12)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !14, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !244, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !281, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 9)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !328, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 200, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 25)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 472, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 43)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !318, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 524, type: !281, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !19, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 432, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 54)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !118, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "n_strings", scope: !55, file: !2, line: 72, type: !104, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "head", scope: !55, file: !2, line: 63, type: !371, isLocal: true, isDefinition: true)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "item", file: !2, line: 51, size: 448, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !372, file: !2, line: 53, baseType: !107, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !372, file: !2, line: 54, baseType: !371, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !372, file: !2, line: 54, baseType: !371, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !372, file: !2, line: 55, baseType: !198, size: 8, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !372, file: !2, line: 56, baseType: !154, size: 8, offset: 200)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !372, file: !2, line: 57, baseType: !104, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "qlink", scope: !372, file: !2, line: 58, baseType: !371, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !372, file: !2, line: 59, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "successor", file: !2, line: 44, size: 128, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "suc", scope: !383, file: !2, line: 46, baseType: !371, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !2, line: 47, baseType: !382, size: 64, offset: 64)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "zeros", scope: !55, file: !2, line: 66, type: !371, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "loop", scope: !55, file: !2, line: 69, type: !371, isLocal: true, isDefinition: true)
!391 = !{!392, !393, !394}
!392 = !DILocalVariable(name: "argc", arg: 1, scope: !49, file: !2, line: 531, type: !52)
!393 = !DILocalVariable(name: "argv", arg: 2, scope: !49, file: !2, line: 531, type: !53)
!394 = !DILocalVariable(name: "c", scope: !395, file: !2, line: 549, type: !52)
!395 = distinct !DILexicalBlock(scope: !49, file: !2, line: 542, column: 5)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 768, elements: !245)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !399, line: 50, size: 256, elements: !400)
!399 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!400 = !{!401, !402, !403, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !399, line: 52, baseType: !107, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !398, file: !399, line: 55, baseType: !52, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !399, line: 56, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !398, file: !399, line: 57, baseType: !52, size: 32, offset: 192)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !408, line: 3, type: !281, isLocal: true, isDefinition: true)
!408 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "Version", scope: !411, file: !408, line: 3, type: !107, isLocal: false, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C11, file: !408, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !412, splitDebugInlining: false, nameTableKind: None)
!412 = !{!406, !409}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "file_name", scope: !415, file: !416, line: 45, type: !107, isLocal: true, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C11, file: !416, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !417, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!417 = !{!418, !420, !422, !424, !413, !426}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !416, line: 121, type: !255, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !416, line: 121, type: !328, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !416, line: 123, type: !255, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !416, line: 126, type: !244, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !415, file: !416, line: 55, type: !154, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !430, file: !431, line: 66, type: !481, isLocal: false, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C11, file: !431, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !432, globals: !433, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!432 = !{!102, !109}
!433 = !{!434, !436, !460, !462, !464, !466, !428, !468, !470, !472, !474, !479}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !431, line: 272, type: !113, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "old_file_name", scope: !438, file: !431, line: 304, type: !107, isLocal: true, isDefinition: true)
!438 = distinct !DISubprogram(name: "verror_at_line", scope: !431, file: !431, line: 298, type: !439, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !430, retainedNodes: !453)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !52, !52, !107, !64, !107, !441}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !442, line: 52, baseType: !443)
!442 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !444, line: 12, baseType: !445)
!444 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !431, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !447)
!447 = !{!448, !449, !450, !451, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !446, file: !431, baseType: !102, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !446, file: !431, baseType: !102, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !446, file: !431, baseType: !102, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !446, file: !431, baseType: !52, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !446, file: !431, baseType: !52, size: 32, offset: 224)
!453 = !{!454, !455, !456, !457, !458, !459}
!454 = !DILocalVariable(name: "status", arg: 1, scope: !438, file: !431, line: 298, type: !52)
!455 = !DILocalVariable(name: "errnum", arg: 2, scope: !438, file: !431, line: 298, type: !52)
!456 = !DILocalVariable(name: "file_name", arg: 3, scope: !438, file: !431, line: 298, type: !107)
!457 = !DILocalVariable(name: "line_number", arg: 4, scope: !438, file: !431, line: 298, type: !64)
!458 = !DILocalVariable(name: "message", arg: 5, scope: !438, file: !431, line: 298, type: !107)
!459 = !DILocalVariable(name: "args", arg: 6, scope: !438, file: !431, line: 298, type: !441)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "old_line_number", scope: !438, file: !431, line: 305, type: !64, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !431, line: 338, type: !231, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !431, line: 346, type: !118, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !431, line: 346, type: !14, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "error_message_count", scope: !430, file: !431, line: 69, type: !64, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !430, file: !431, line: 295, type: !52, isLocal: false, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !431, line: 208, type: !255, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !431, line: 208, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 21)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !431, line: 214, type: !113, isLocal: true, isDefinition: true)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !486, line: 40, type: !39, isLocal: true, isDefinition: true)
!486 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "program_name", scope: !489, file: !490, line: 31, type: !107, isLocal: false, isDefinition: true)
!489 = distinct !DICompileUnit(language: DW_LANG_C11, file: !490, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !491, globals: !492, splitDebugInlining: false, nameTableKind: None)
!490 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!491 = !{!102, !54}
!492 = !{!487, !493, !495}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !490, line: 46, type: !118, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !490, line: 49, type: !231, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "utf07FF", scope: !499, file: !500, line: 46, type: !527, isLocal: true, isDefinition: true)
!499 = distinct !DISubprogram(name: "proper_name_lite", scope: !500, file: !500, line: 38, type: !501, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !503, retainedNodes: !505)
!500 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!501 = !DISubroutineType(types: !502)
!502 = !{!107, !107, !107}
!503 = distinct !DICompileUnit(language: DW_LANG_C11, file: !500, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !504, splitDebugInlining: false, nameTableKind: None)
!504 = !{!497}
!505 = !{!506, !507, !508, !509, !514}
!506 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !499, file: !500, line: 38, type: !107)
!507 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !499, file: !500, line: 38, type: !107)
!508 = !DILocalVariable(name: "translation", scope: !499, file: !500, line: 40, type: !107)
!509 = !DILocalVariable(name: "w", scope: !499, file: !500, line: 47, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !511, line: 37, baseType: !512)
!511 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !194, line: 57, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !194, line: 42, baseType: !64)
!514 = !DILocalVariable(name: "mbs", scope: !499, file: !500, line: 48, type: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !516, line: 6, baseType: !517)
!516 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !518, line: 21, baseType: !519)
!518 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 13, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !519, file: !518, line: 15, baseType: !52, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !519, file: !518, line: 20, baseType: !523, size: 32, offset: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !518, line: 16, size: 32, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !523, file: !518, line: 18, baseType: !64, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !523, file: !518, line: 19, baseType: !231, size: 32)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16, elements: !15)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !530, line: 78, type: !118, isLocal: true, isDefinition: true)
!530 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !530, line: 79, type: !19, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !530, line: 80, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 13)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !530, line: 81, type: !535, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !530, line: 82, type: !216, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !530, line: 83, type: !14, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !530, line: 84, type: !118, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !530, line: 85, type: !255, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !530, line: 86, type: !255, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !530, line: 87, type: !118, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !554, file: !530, line: 76, type: !628, isLocal: false, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C11, file: !530, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !555, retainedTypes: !563, globals: !564, splitDebugInlining: false, nameTableKind: None)
!555 = !{!556, !558, !62}
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !557, line: 42, baseType: !64, size: 32, elements: !80)
!557 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !557, line: 254, baseType: !64, size: 32, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!561 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!562 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!563 = !{!102, !52, !103, !104}
!564 = !{!528, !531, !533, !538, !540, !542, !544, !546, !548, !550, !552, !565, !569, !579, !581, !586, !588, !590, !592, !594, !617, !624, !626}
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !554, file: !530, line: 92, type: !567, isLocal: false, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 320, elements: !40)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !554, file: !530, line: 1040, type: !571, isLocal: false, isDefinition: true)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !530, line: 56, size: 448, elements: !572)
!572 = !{!573, !574, !575, !577, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !571, file: !530, line: 59, baseType: !556, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !571, file: !530, line: 62, baseType: !52, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !571, file: !530, line: 66, baseType: !576, size: 256, offset: 64)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !119)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !571, file: !530, line: 69, baseType: !107, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !571, file: !530, line: 72, baseType: !107, size: 64, offset: 384)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !554, file: !530, line: 107, type: !571, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "slot0", scope: !554, file: !530, line: 831, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 256)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !530, line: 321, type: !14, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !530, line: 357, type: !14, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !530, line: 358, type: !14, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !530, line: 199, type: !255, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "quote", scope: !596, file: !530, line: 228, type: !615, isLocal: true, isDefinition: true)
!596 = distinct !DISubprogram(name: "gettext_quote", scope: !530, file: !530, line: 197, type: !597, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !554, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!107, !107, !556}
!599 = !{!600, !601, !602, !603, !604}
!600 = !DILocalVariable(name: "msgid", arg: 1, scope: !596, file: !530, line: 197, type: !107)
!601 = !DILocalVariable(name: "s", arg: 2, scope: !596, file: !530, line: 197, type: !556)
!602 = !DILocalVariable(name: "translation", scope: !596, file: !530, line: 199, type: !107)
!603 = !DILocalVariable(name: "w", scope: !596, file: !530, line: 229, type: !510)
!604 = !DILocalVariable(name: "mbs", scope: !596, file: !530, line: 230, type: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !516, line: 6, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !518, line: 21, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 13, size: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !607, file: !518, line: 15, baseType: !52, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !607, file: !518, line: 20, baseType: !611, size: 32, offset: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !607, file: !518, line: 16, size: 32, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !611, file: !518, line: 18, baseType: !64, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !611, file: !518, line: 19, baseType: !231, size: 32)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !616)
!616 = !{!16, !233}
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "slotvec", scope: !554, file: !530, line: 834, type: !619, isLocal: true, isDefinition: true)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !530, line: 823, size: 128, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !620, file: !530, line: 825, baseType: !104, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !620, file: !530, line: 826, baseType: !54, size: 64, offset: 64)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "nslots", scope: !554, file: !530, line: 832, type: !52, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "slotvec0", scope: !554, file: !530, line: 833, type: !620, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 704, elements: !630)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!630 = !{!631}
!631 = !DISubrange(count: 11)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !634, line: 67, type: !328, isLocal: true, isDefinition: true)
!634 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !634, line: 69, type: !255, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !634, line: 83, type: !255, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !634, line: 83, type: !231, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !634, line: 85, type: !14, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !634, line: 88, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 171)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !634, line: 88, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 34)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !634, line: 105, type: !299, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !634, line: 109, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 23)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !634, line: 113, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 28)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !634, line: 120, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 32)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !634, line: 127, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 36)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !634, line: 134, type: !276, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !634, line: 142, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 44)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !634, line: 150, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 48)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !634, line: 159, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 52)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !634, line: 170, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 60)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !634, line: 248, type: !216, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !634, line: 248, type: !304, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !634, line: 254, type: !216, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !634, line: 254, type: !125, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !634, line: 254, type: !276, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !634, line: 259, type: !3, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !634, line: 259, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 29)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !716, file: !717, line: 26, type: !719, isLocal: false, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!718 = !{!714}
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 376, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 47)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "exit_failure", scope: !724, file: !725, line: 24, type: !727, isLocal: false, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !726, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!726 = !{!722}
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !730, line: 34, type: !244, isLocal: true, isDefinition: true)
!730 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !730, line: 34, type: !255, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !730, line: 34, type: !132, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !737, line: 108, type: !34, isLocal: true, isDefinition: true)
!737 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "internal_state", scope: !740, file: !737, line: 97, type: !743, isLocal: true, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !737, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !741, globals: !742, splitDebugInlining: false, nameTableKind: None)
!741 = !{!102, !104, !109}
!742 = !{!735, !738}
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !516, line: 6, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !518, line: 21, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 13, size: 64, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !745, file: !518, line: 15, baseType: !52, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !745, file: !518, line: 20, baseType: !749, size: 32, offset: 32)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !745, file: !518, line: 16, size: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !749, file: !518, line: 18, baseType: !64, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !749, file: !518, line: 19, baseType: !231, size: 32)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !755, line: 35, type: !14, isLocal: true, isDefinition: true)
!755 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !755, line: 35, type: !19, isLocal: true, isDefinition: true)
!758 = distinct !DICompileUnit(language: DW_LANG_C11, file: !759, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fadvise.o -MD -MP -MF lib/.deps/libcoreutils_a-fadvise.Tpo -c lib/fadvise.c -o lib/.libcoreutils_a-fadvise.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !760, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!760 = !{!761}
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !762, line: 44, baseType: !64, size: 32, elements: !94)
!762 = !DIFile(filename: "lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!765 = distinct !DICompileUnit(language: DW_LANG_C11, file: !766, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !767, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!767 = !{!102}
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !486, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-freopen-safer.o -MD -MP -MF lib/.deps/libcoreutils_a-freopen-safer.Tpo -c lib/freopen-safer.c -o lib/.libcoreutils_a-freopen-safer.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !769, splitDebugInlining: false, nameTableKind: None)
!769 = !{!484}
!770 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !767, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !773, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-readtokens.o -MD -MP -MF lib/.deps/libcoreutils_a-readtokens.Tpo -c lib/readtokens.c -o lib/.libcoreutils_a-readtokens.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !776, retainedTypes: !780, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/readtokens.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bd27ae043f20cb5dd96b528a940c0bf9")
!776 = !{!777}
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !775, line: 50, baseType: !64, size: 32, elements: !778)
!778 = !{!779}
!779 = !DIEnumerator(name: "bits_per_word", value: 64)
!780 = !{!104, !102, !781}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!782 = distinct !DICompileUnit(language: DW_LANG_C11, file: !634, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !783, retainedTypes: !767, globals: !787, splitDebugInlining: false, nameTableKind: None)
!783 = !{!784}
!784 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !634, line: 40, baseType: !64, size: 32, elements: !785)
!785 = !{!786}
!786 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!787 = !{!632, !635, !637, !639, !641, !643, !648, !653, !655, !660, !665, !670, !675, !677, !682, !687, !692, !697, !699, !701, !703, !705, !707, !709}
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !789, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !790, retainedTypes: !822, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!790 = !{!791, !803}
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !792, file: !789, line: 188, baseType: !64, size: 32, elements: !801)
!792 = distinct !DISubprogram(name: "x2nrealloc", scope: !789, file: !789, line: 176, type: !793, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !796)
!793 = !DISubroutineType(types: !794)
!794 = !{!102, !102, !795, !104}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!796 = !{!797, !798, !799, !800}
!797 = !DILocalVariable(name: "p", arg: 1, scope: !792, file: !789, line: 176, type: !102)
!798 = !DILocalVariable(name: "pn", arg: 2, scope: !792, file: !789, line: 176, type: !795)
!799 = !DILocalVariable(name: "s", arg: 3, scope: !792, file: !789, line: 176, type: !104)
!800 = !DILocalVariable(name: "n", scope: !792, file: !789, line: 178, type: !104)
!801 = !{!802}
!802 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !804, file: !789, line: 228, baseType: !64, size: 32, elements: !801)
!804 = distinct !DISubprogram(name: "xpalloc", scope: !789, file: !789, line: 223, type: !805, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !812)
!805 = !DISubroutineType(types: !806)
!806 = !{!102, !102, !807, !808, !810, !808}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !809, line: 130, baseType: !810)
!809 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !811, line: 18, baseType: !195)
!811 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821}
!813 = !DILocalVariable(name: "pa", arg: 1, scope: !804, file: !789, line: 223, type: !102)
!814 = !DILocalVariable(name: "pn", arg: 2, scope: !804, file: !789, line: 223, type: !807)
!815 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !804, file: !789, line: 223, type: !808)
!816 = !DILocalVariable(name: "n_max", arg: 4, scope: !804, file: !789, line: 223, type: !810)
!817 = !DILocalVariable(name: "s", arg: 5, scope: !804, file: !789, line: 223, type: !808)
!818 = !DILocalVariable(name: "n0", scope: !804, file: !789, line: 230, type: !808)
!819 = !DILocalVariable(name: "n", scope: !804, file: !789, line: 237, type: !808)
!820 = !DILocalVariable(name: "nbytes", scope: !804, file: !789, line: 248, type: !808)
!821 = !DILocalVariable(name: "adjusted_nbytes", scope: !804, file: !789, line: 252, type: !808)
!822 = !{!54, !102}
!823 = distinct !DICompileUnit(language: DW_LANG_C11, file: !730, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !824, splitDebugInlining: false, nameTableKind: None)
!824 = !{!728, !731, !733}
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !826, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!827 = distinct !DICompileUnit(language: DW_LANG_C11, file: !828, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !767, splitDebugInlining: false, nameTableKind: None)
!828 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!829 = distinct !DICompileUnit(language: DW_LANG_C11, file: !755, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !830, splitDebugInlining: false, nameTableKind: None)
!830 = !{!753, !756}
!831 = distinct !DICompileUnit(language: DW_LANG_C11, file: !832, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!832 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!833 = distinct !DICompileUnit(language: DW_LANG_C11, file: !834, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !767, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!835 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!836 = !{i32 7, !"Dwarf Version", i32 5}
!837 = !{i32 2, !"Debug Info Version", i32 3}
!838 = !{i32 1, !"wchar_size", i32 4}
!839 = !{i32 8, !"PIC Level", i32 2}
!840 = !{i32 7, !"PIE Level", i32 2}
!841 = !{i32 7, !"uwtable", i32 2}
!842 = !{i32 7, !"frame-pointer", i32 1}
!843 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!844 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 75, type: !845, scopeLine: 76, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !847)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !52}
!847 = !{!848}
!848 = !DILocalVariable(name: "status", arg: 1, scope: !844, file: !2, line: 75, type: !52)
!849 = !DILocation(line: 0, scope: !844)
!850 = !DILocation(line: 77, column: 14, scope: !851)
!851 = distinct !DILexicalBlock(scope: !844, file: !2, line: 77, column: 7)
!852 = !DILocation(line: 77, column: 7, scope: !844)
!853 = !DILocation(line: 78, column: 5, scope: !854)
!854 = distinct !DILexicalBlock(scope: !851, file: !2, line: 78, column: 5)
!855 = !{!856, !856, i64 0}
!856 = !{!"any pointer", !857, i64 0}
!857 = !{!"omnipotent char", !858, i64 0}
!858 = !{!"Simple C/C++ TBAA"}
!859 = !DILocation(line: 81, column: 7, scope: !860)
!860 = distinct !DILexicalBlock(scope: !851, file: !2, line: 80, column: 5)
!861 = !DILocation(line: 729, column: 3, scope: !862, inlinedAt: !863)
!862 = distinct !DISubprogram(name: "emit_stdin_note", scope: !58, file: !58, line: 727, type: !482, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55)
!863 = distinct !DILocation(line: 86, column: 7, scope: !860)
!864 = !DILocation(line: 88, column: 7, scope: !860)
!865 = !DILocation(line: 91, column: 7, scope: !860)
!866 = !DILocation(line: 92, column: 7, scope: !860)
!867 = !DILocalVariable(name: "program", arg: 1, scope: !868, file: !58, line: 836, type: !107)
!868 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !58, file: !58, line: 836, type: !869, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !871)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !107}
!871 = !{!867, !872, !879, !880, !882, !883}
!872 = !DILocalVariable(name: "infomap", scope: !868, file: !58, line: 838, type: !873)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 896, elements: !256)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !868, file: !58, line: 838, size: 128, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !875, file: !58, line: 838, baseType: !107, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !875, file: !58, line: 838, baseType: !107, size: 64, offset: 64)
!879 = !DILocalVariable(name: "node", scope: !868, file: !58, line: 848, type: !107)
!880 = !DILocalVariable(name: "map_prog", scope: !868, file: !58, line: 849, type: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!882 = !DILocalVariable(name: "lc_messages", scope: !868, file: !58, line: 861, type: !107)
!883 = !DILocalVariable(name: "url_program", scope: !868, file: !58, line: 874, type: !107)
!884 = !DILocation(line: 0, scope: !868, inlinedAt: !885)
!885 = distinct !DILocation(line: 93, column: 7, scope: !860)
!886 = !{}
!887 = !DILocation(line: 857, column: 3, scope: !868, inlinedAt: !885)
!888 = !DILocation(line: 861, column: 29, scope: !868, inlinedAt: !885)
!889 = !DILocation(line: 862, column: 7, scope: !890, inlinedAt: !885)
!890 = distinct !DILexicalBlock(scope: !868, file: !58, line: 862, column: 7)
!891 = !DILocation(line: 862, column: 19, scope: !890, inlinedAt: !885)
!892 = !DILocation(line: 862, column: 22, scope: !890, inlinedAt: !885)
!893 = !DILocation(line: 862, column: 7, scope: !868, inlinedAt: !885)
!894 = !DILocation(line: 868, column: 7, scope: !895, inlinedAt: !885)
!895 = distinct !DILexicalBlock(scope: !890, file: !58, line: 863, column: 5)
!896 = !DILocation(line: 870, column: 5, scope: !895, inlinedAt: !885)
!897 = !DILocation(line: 875, column: 3, scope: !868, inlinedAt: !885)
!898 = !DILocation(line: 877, column: 3, scope: !868, inlinedAt: !885)
!899 = !DILocation(line: 96, column: 3, scope: !844)
!900 = !DISubprogram(name: "dcgettext", scope: !901, file: !901, line: 51, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!901 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!902 = !DISubroutineType(types: !903)
!903 = !{!54, !107, !107, !52}
!904 = !DISubprogram(name: "__fprintf_chk", scope: !905, file: !905, line: 93, type: !906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!905 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!906 = !DISubroutineType(types: !907)
!907 = !{!52, !908, !52, !909, null}
!908 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !167)
!909 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!910 = !DISubprogram(name: "__printf_chk", scope: !905, file: !905, line: 95, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!911 = !DISubroutineType(types: !912)
!912 = !{!52, !52, !909, null}
!913 = !DISubprogram(name: "fputs_unlocked", scope: !442, file: !442, line: 691, type: !914, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!914 = !DISubroutineType(types: !915)
!915 = !{!52, !909, !908}
!916 = !DILocation(line: 0, scope: !144)
!917 = !DILocation(line: 581, column: 7, scope: !152)
!918 = !{!919, !919, i64 0}
!919 = !{!"int", !857, i64 0}
!920 = !DILocation(line: 581, column: 19, scope: !152)
!921 = !DILocation(line: 581, column: 7, scope: !144)
!922 = !DILocation(line: 585, column: 26, scope: !151)
!923 = !DILocation(line: 0, scope: !151)
!924 = !DILocation(line: 586, column: 23, scope: !151)
!925 = !DILocation(line: 586, column: 28, scope: !151)
!926 = !DILocation(line: 586, column: 32, scope: !151)
!927 = !{!857, !857, i64 0}
!928 = !DILocation(line: 586, column: 38, scope: !151)
!929 = !DILocalVariable(name: "__s1", arg: 1, scope: !930, file: !931, line: 1359, type: !107)
!930 = distinct !DISubprogram(name: "streq", scope: !931, file: !931, line: 1359, type: !932, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !934)
!931 = !DIFile(filename: "./lib/string.h", directory: "/src")
!932 = !DISubroutineType(types: !933)
!933 = !{!154, !107, !107}
!934 = !{!929, !935}
!935 = !DILocalVariable(name: "__s2", arg: 2, scope: !930, file: !931, line: 1359, type: !107)
!936 = !DILocation(line: 0, scope: !930, inlinedAt: !937)
!937 = distinct !DILocation(line: 586, column: 41, scope: !151)
!938 = !DILocation(line: 1361, column: 11, scope: !930, inlinedAt: !937)
!939 = !DILocation(line: 1361, column: 10, scope: !930, inlinedAt: !937)
!940 = !DILocation(line: 586, column: 19, scope: !151)
!941 = !DILocation(line: 587, column: 5, scope: !151)
!942 = !DILocation(line: 588, column: 7, scope: !943)
!943 = distinct !DILexicalBlock(scope: !144, file: !58, line: 588, column: 7)
!944 = !DILocation(line: 588, column: 7, scope: !144)
!945 = !DILocation(line: 590, column: 7, scope: !946)
!946 = distinct !DILexicalBlock(scope: !943, file: !58, line: 589, column: 5)
!947 = !DILocation(line: 591, column: 7, scope: !946)
!948 = !DILocation(line: 595, column: 37, scope: !144)
!949 = !DILocation(line: 595, column: 35, scope: !144)
!950 = !DILocation(line: 596, column: 29, scope: !144)
!951 = !DILocation(line: 597, column: 8, scope: !160)
!952 = !DILocation(line: 597, column: 7, scope: !144)
!953 = !DILocation(line: 604, column: 24, scope: !159)
!954 = !DILocation(line: 604, column: 12, scope: !160)
!955 = !DILocation(line: 0, scope: !158)
!956 = !DILocation(line: 610, column: 16, scope: !158)
!957 = !DILocation(line: 610, column: 7, scope: !158)
!958 = !DILocation(line: 611, column: 21, scope: !158)
!959 = !{!960, !960, i64 0}
!960 = !{!"short", !857, i64 0}
!961 = !DILocation(line: 611, column: 19, scope: !158)
!962 = !DILocation(line: 611, column: 16, scope: !158)
!963 = !DILocation(line: 610, column: 30, scope: !158)
!964 = distinct !{!964, !957, !958, !965}
!965 = !{!"llvm.loop.mustprogress"}
!966 = !DILocation(line: 612, column: 18, scope: !967)
!967 = distinct !DILexicalBlock(scope: !158, file: !58, line: 612, column: 11)
!968 = !DILocation(line: 612, column: 11, scope: !158)
!969 = !DILocation(line: 620, column: 23, scope: !144)
!970 = !DILocation(line: 625, column: 39, scope: !144)
!971 = !DILocation(line: 626, column: 3, scope: !144)
!972 = !DILocation(line: 626, column: 10, scope: !144)
!973 = !DILocation(line: 626, column: 21, scope: !144)
!974 = !DILocation(line: 628, column: 44, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !58, line: 628, column: 11)
!976 = distinct !DILexicalBlock(scope: !144, file: !58, line: 627, column: 5)
!977 = !DILocation(line: 628, column: 32, scope: !975)
!978 = !DILocation(line: 628, column: 49, scope: !975)
!979 = !DILocation(line: 628, column: 11, scope: !976)
!980 = !DILocation(line: 630, column: 11, scope: !981)
!981 = distinct !DILexicalBlock(scope: !976, file: !58, line: 630, column: 11)
!982 = !DILocation(line: 630, column: 11, scope: !976)
!983 = !DILocation(line: 632, column: 26, scope: !984)
!984 = distinct !DILexicalBlock(scope: !985, file: !58, line: 632, column: 15)
!985 = distinct !DILexicalBlock(scope: !981, file: !58, line: 631, column: 9)
!986 = !DILocation(line: 632, column: 34, scope: !984)
!987 = !DILocation(line: 632, column: 37, scope: !984)
!988 = !DILocation(line: 632, column: 15, scope: !985)
!989 = !DILocation(line: 640, column: 16, scope: !976)
!990 = distinct !{!990, !971, !991, !965}
!991 = !DILocation(line: 641, column: 5, scope: !144)
!992 = !DILocation(line: 644, column: 3, scope: !144)
!993 = !DILocation(line: 0, scope: !930, inlinedAt: !994)
!994 = distinct !DILocation(line: 648, column: 31, scope: !144)
!995 = !DILocation(line: 0, scope: !930, inlinedAt: !996)
!996 = distinct !DILocation(line: 649, column: 31, scope: !144)
!997 = !DILocation(line: 0, scope: !930, inlinedAt: !998)
!998 = distinct !DILocation(line: 650, column: 31, scope: !144)
!999 = !DILocation(line: 0, scope: !930, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 651, column: 31, scope: !144)
!1001 = !DILocation(line: 0, scope: !930, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 652, column: 31, scope: !144)
!1003 = !DILocation(line: 0, scope: !930, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 653, column: 31, scope: !144)
!1005 = !DILocation(line: 0, scope: !930, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 654, column: 31, scope: !144)
!1007 = !DILocation(line: 0, scope: !930, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 655, column: 31, scope: !144)
!1009 = !DILocation(line: 0, scope: !930, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 656, column: 31, scope: !144)
!1011 = !DILocation(line: 0, scope: !930, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 657, column: 31, scope: !144)
!1013 = !DILocation(line: 663, column: 7, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !144, file: !58, line: 663, column: 7)
!1015 = !DILocation(line: 664, column: 7, scope: !1014)
!1016 = !DILocation(line: 664, column: 10, scope: !1014)
!1017 = !DILocation(line: 663, column: 7, scope: !144)
!1018 = !DILocation(line: 669, column: 7, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !58, line: 665, column: 5)
!1020 = !DILocation(line: 671, column: 5, scope: !1019)
!1021 = !DILocation(line: 676, column: 7, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1014, file: !58, line: 673, column: 5)
!1023 = !DILocation(line: 679, column: 3, scope: !144)
!1024 = !DILocation(line: 683, column: 3, scope: !144)
!1025 = !DILocation(line: 686, column: 3, scope: !144)
!1026 = !DILocation(line: 688, column: 3, scope: !144)
!1027 = !DILocation(line: 691, column: 3, scope: !144)
!1028 = !DILocation(line: 695, column: 3, scope: !144)
!1029 = !DILocation(line: 696, column: 1, scope: !144)
!1030 = !DISubprogram(name: "setlocale", scope: !1031, file: !1031, line: 122, type: !1032, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1031 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!54, !52, !107}
!1034 = !DISubprogram(name: "strncmp", scope: !1035, file: !1035, line: 159, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1035 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!52, !107, !107, !104}
!1038 = !DISubprogram(name: "exit", scope: !1039, file: !1039, line: 624, type: !845, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1039 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1040 = !DISubprogram(name: "getenv", scope: !1039, file: !1039, line: 641, type: !1041, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!54, !107}
!1043 = !DISubprogram(name: "strcmp", scope: !1035, file: !1035, line: 156, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!52, !107, !107}
!1046 = !DISubprogram(name: "strspn", scope: !1035, file: !1035, line: 297, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!106, !107, !107}
!1049 = !DISubprogram(name: "strchr", scope: !1035, file: !1035, line: 246, type: !1050, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!54, !107, !52}
!1052 = !DISubprogram(name: "__ctype_b_loc", scope: !63, file: !63, line: 79, type: !1053, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1055}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!1058 = !DISubprogram(name: "strcspn", scope: !1035, file: !1035, line: 293, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1059 = !DISubprogram(name: "fwrite_unlocked", scope: !442, file: !442, line: 704, type: !1060, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!104, !1062, !104, !104, !908}
!1062 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1065 = !DILocation(line: 0, scope: !49)
!1066 = !DILocation(line: 534, column: 21, scope: !49)
!1067 = !DILocation(line: 534, column: 3, scope: !49)
!1068 = !DILocation(line: 535, column: 3, scope: !49)
!1069 = !DILocation(line: 536, column: 3, scope: !49)
!1070 = !DILocation(line: 537, column: 3, scope: !49)
!1071 = !DILocation(line: 539, column: 3, scope: !49)
!1072 = !DILocation(line: 541, column: 3, scope: !49)
!1073 = !DILocation(line: 549, column: 15, scope: !395)
