; ModuleID = 'src/unlink.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s FILE\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [57 x i8] c"Call the unlink function to remove the specified FILE.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"unlink\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 15)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 61)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !143, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !117, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !117, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !156, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !56, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 22)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !180, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !124, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 71)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 27)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 51)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 12)
!227 = !{!228, !229, !230, !233, !235, !236, !237, !241, !242, !243, !244, !246, !300, !301, !302, !304, !305}
!228 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!229 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!230 = !DILocalVariable(name: "term", scope: !231, file: !69, line: 585, type: !72)
!231 = distinct !DILexicalBlock(scope: !232, file: !69, line: 582, column: 5)
!232 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!233 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !234)
!234 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!236 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!237 = !DILocalVariable(name: "s", scope: !238, file: !69, line: 608, type: !72)
!238 = distinct !DILexicalBlock(scope: !239, file: !69, line: 605, column: 5)
!239 = distinct !DILexicalBlock(scope: !240, file: !69, line: 604, column: 12)
!240 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!241 = !DILocalVariable(name: "spaces", scope: !238, file: !69, line: 609, type: !110)
!242 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !110)
!243 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!244 = !DILocalVariable(name: "__ptr", scope: !245, file: !69, line: 644, type: !72)
!245 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!246 = !DILocalVariable(name: "__stream", scope: !245, file: !69, line: 644, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !250)
!249 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !252)
!251 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!252 = !{!253, !254, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !269, !271, !272, !273, !277, !278, !280, !281, !284, !286, !289, !292, !293, !294, !295, !296}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !250, file: !251, line: 51, baseType: !108, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !250, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !250, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !250, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !250, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !250, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !250, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !250, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !250, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !250, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !250, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !250, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !250, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !251, line: 36, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !250, file: !251, line: 70, baseType: !270, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !250, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !250, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !250, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !275, line: 152, baseType: !276)
!275 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!276 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !250, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !250, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!279 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !250, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !250, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !251, line: 43, baseType: null)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !250, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !275, line: 153, baseType: !276)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !250, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !251, line: 37, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !250, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !251, line: 38, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !250, file: !251, line: 93, baseType: !270, size: 64, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !250, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !250, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !250, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !250, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 20)
!300 = !DILocalVariable(name: "__cnt", scope: !245, file: !69, line: 644, type: !110)
!301 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!302 = !DILocalVariable(name: "__ptr", scope: !303, file: !69, line: 686, type: !72)
!303 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!304 = !DILocalVariable(name: "__stream", scope: !303, file: !69, line: 686, type: !247)
!305 = !DILocalVariable(name: "__cnt", scope: !303, file: !69, line: 686, type: !110)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !308, line: 3, type: !180, isLocal: true, isDefinition: true)
!308 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "Version", scope: !311, file: !308, line: 3, type: !72, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C11, file: !308, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !312, splitDebugInlining: false, nameTableKind: None)
!312 = !{!306, !309}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "file_name", scope: !315, file: !316, line: 45, type: !72, isLocal: true, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C11, file: !316, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!316 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!317 = !{!318, !320, !322, !324, !313, !326}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !19, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !224, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !316, line: 123, type: !19, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !316, line: 126, type: !143, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !315, file: !316, line: 55, type: !234, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !330, file: !331, line: 66, type: !381, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C11, file: !331, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !332, globals: !333, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!332 = !{!107, !113}
!333 = !{!334, !336, !360, !362, !364, !366, !328, !368, !370, !372, !374, !379}
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !331, line: 272, type: !117, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "old_file_name", scope: !338, file: !331, line: 304, type: !72, isLocal: true, isDefinition: true)
!338 = distinct !DISubprogram(name: "verror_at_line", scope: !331, file: !331, line: 298, type: !339, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !353)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !108, !108, !72, !78, !72, !341}
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !342, line: 52, baseType: !343)
!342 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !344, line: 12, baseType: !345)
!344 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !331, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !347)
!347 = !{!348, !349, !350, !351, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !346, file: !331, baseType: !107, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !346, file: !331, baseType: !107, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !346, file: !331, baseType: !107, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !346, file: !331, baseType: !108, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !346, file: !331, baseType: !108, size: 32, offset: 224)
!353 = !{!354, !355, !356, !357, !358, !359}
!354 = !DILocalVariable(name: "status", arg: 1, scope: !338, file: !331, line: 298, type: !108)
!355 = !DILocalVariable(name: "errnum", arg: 2, scope: !338, file: !331, line: 298, type: !108)
!356 = !DILocalVariable(name: "file_name", arg: 3, scope: !338, file: !331, line: 298, type: !72)
!357 = !DILocalVariable(name: "line_number", arg: 4, scope: !338, file: !331, line: 298, type: !78)
!358 = !DILocalVariable(name: "message", arg: 5, scope: !338, file: !331, line: 298, type: !72)
!359 = !DILocalVariable(name: "args", arg: 6, scope: !338, file: !331, line: 298, type: !341)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "old_line_number", scope: !338, file: !331, line: 305, type: !78, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !331, line: 338, type: !124, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !156, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !134, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "error_message_count", scope: !330, file: !331, line: 69, type: !78, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !330, file: !331, line: 295, type: !108, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !19, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 21)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !331, line: 214, type: !117, isLocal: true, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !386, line: 60, type: !134, isLocal: true, isDefinition: true)
!386 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "long_options", scope: !389, file: !386, line: 34, type: !398, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !386, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !{!107}
!391 = !{!384, !392, !394, !396, !387}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !386, line: 112, type: !34, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !386, line: 36, type: !117, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !386, line: 37, type: !156, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 768, elements: !144)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !401, line: 50, size: 256, elements: !402)
!401 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!402 = !{!403, !404, !405, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !401, line: 52, baseType: !72, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !400, file: !401, line: 55, baseType: !108, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !401, line: 56, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !400, file: !401, line: 57, baseType: !108, size: 32, offset: 192)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "program_name", scope: !410, file: !411, line: 31, type: !72, isLocal: false, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, globals: !413, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!412 = !{!107, !255}
!413 = !{!408, !414, !416}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !411, line: 46, type: !156, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !411, line: 49, type: !124, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "utf07FF", scope: !420, file: !421, line: 46, type: !448, isLocal: true, isDefinition: true)
!420 = distinct !DISubprogram(name: "proper_name_lite", scope: !421, file: !421, line: 38, type: !422, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !424, retainedNodes: !426)
!421 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!422 = !DISubroutineType(types: !423)
!423 = !{!72, !72, !72}
!424 = distinct !DICompileUnit(language: DW_LANG_C11, file: !421, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !425, splitDebugInlining: false, nameTableKind: None)
!425 = !{!418}
!426 = !{!427, !428, !429, !430, !435}
!427 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !420, file: !421, line: 38, type: !72)
!428 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !420, file: !421, line: 38, type: !72)
!429 = !DILocalVariable(name: "translation", scope: !420, file: !421, line: 40, type: !72)
!430 = !DILocalVariable(name: "w", scope: !420, file: !421, line: 47, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !432, line: 37, baseType: !433)
!432 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !275, line: 57, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !275, line: 42, baseType: !78)
!435 = !DILocalVariable(name: "mbs", scope: !420, file: !421, line: 48, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !438)
!437 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !440)
!439 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !440, file: !439, line: 15, baseType: !108, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !440, file: !439, line: 20, baseType: !444, size: 32, offset: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !439, line: 16, size: 32, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !444, file: !439, line: 18, baseType: !78, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !444, file: !439, line: 19, baseType: !124, size: 32)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !135)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !451, line: 78, type: !156, isLocal: true, isDefinition: true)
!451 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !451, line: 79, type: !129, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !451, line: 80, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 13)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !451, line: 81, type: !456, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !451, line: 82, type: !297, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !451, line: 83, type: !134, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !451, line: 84, type: !156, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !451, line: 85, type: !19, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !451, line: 86, type: !19, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !451, line: 87, type: !156, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !475, file: !451, line: 76, type: !549, isLocal: false, isDefinition: true)
!475 = distinct !DICompileUnit(language: DW_LANG_C11, file: !451, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !476, retainedTypes: !484, globals: !485, splitDebugInlining: false, nameTableKind: None)
!476 = !{!477, !479, !91}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !478, line: 42, baseType: !78, size: 32, elements: !79)
!478 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !478, line: 254, baseType: !78, size: 32, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!482 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!483 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!484 = !{!107, !108, !109, !110}
!485 = !{!449, !452, !454, !459, !461, !463, !465, !467, !469, !471, !473, !486, !490, !500, !502, !507, !509, !511, !513, !515, !538, !545, !547}
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !475, file: !451, line: 92, type: !488, isLocal: false, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 320, elements: !40)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !475, file: !451, line: 1040, type: !492, isLocal: false, isDefinition: true)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !451, line: 56, size: 448, elements: !493)
!493 = !{!494, !495, !496, !498, !499}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !492, file: !451, line: 59, baseType: !477, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !451, line: 62, baseType: !108, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !492, file: !451, line: 66, baseType: !497, size: 256, offset: 64)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !157)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !492, file: !451, line: 69, baseType: !72, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !492, file: !451, line: 72, baseType: !72, size: 64, offset: 384)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !475, file: !451, line: 107, type: !492, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "slot0", scope: !475, file: !451, line: 831, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 256)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !451, line: 321, type: !134, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !451, line: 357, type: !134, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !451, line: 358, type: !134, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !451, line: 199, type: !19, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "quote", scope: !517, file: !451, line: 228, type: !536, isLocal: true, isDefinition: true)
!517 = distinct !DISubprogram(name: "gettext_quote", scope: !451, file: !451, line: 197, type: !518, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !475, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!72, !72, !477}
!520 = !{!521, !522, !523, !524, !525}
!521 = !DILocalVariable(name: "msgid", arg: 1, scope: !517, file: !451, line: 197, type: !72)
!522 = !DILocalVariable(name: "s", arg: 2, scope: !517, file: !451, line: 197, type: !477)
!523 = !DILocalVariable(name: "translation", scope: !517, file: !451, line: 199, type: !72)
!524 = !DILocalVariable(name: "w", scope: !517, file: !451, line: 229, type: !431)
!525 = !DILocalVariable(name: "mbs", scope: !517, file: !451, line: 230, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !528, file: !439, line: 15, baseType: !108, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !528, file: !439, line: 20, baseType: !532, size: 32, offset: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !439, line: 16, size: 32, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !532, file: !439, line: 18, baseType: !78, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !532, file: !439, line: 19, baseType: !124, size: 32)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !537)
!537 = !{!136, !126}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "slotvec", scope: !475, file: !451, line: 834, type: !540, isLocal: true, isDefinition: true)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !451, line: 823, size: 128, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !451, line: 825, baseType: !110, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !541, file: !451, line: 826, baseType: !255, size: 64, offset: 64)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "nslots", scope: !475, file: !451, line: 832, type: !108, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "slotvec0", scope: !475, file: !451, line: 833, type: !541, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 704, elements: !551)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!551 = !{!552}
!552 = !DISubrange(count: 11)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !555, line: 67, type: !224, isLocal: true, isDefinition: true)
!555 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !555, line: 69, type: !19, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !555, line: 83, type: !19, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !555, line: 83, type: !124, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !555, line: 85, type: !134, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !555, line: 88, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 171)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !555, line: 88, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 34)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !555, line: 105, type: !56, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !555, line: 109, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 23)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !555, line: 113, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 28)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !555, line: 120, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 32)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !555, line: 127, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 36)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !555, line: 134, type: !175, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !555, line: 142, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 44)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !555, line: 150, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 48)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !555, line: 159, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 52)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !555, line: 170, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 60)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !555, line: 248, type: !297, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !555, line: 248, type: !200, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !555, line: 254, type: !297, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !555, line: 254, type: !49, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !555, line: 254, type: !175, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !555, line: 259, type: !3, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !555, line: 259, type: !632, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 29)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !637, file: !638, line: 26, type: !640, isLocal: false, isDefinition: true)
!637 = distinct !DICompileUnit(language: DW_LANG_C11, file: !638, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !639, splitDebugInlining: false, nameTableKind: None)
!638 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!639 = !{!635}
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 47)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "exit_failure", scope: !645, file: !646, line: 24, type: !648, isLocal: false, isDefinition: true)
!645 = distinct !DICompileUnit(language: DW_LANG_C11, file: !646, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !647, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!647 = !{!643}
!648 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !651, line: 34, type: !143, isLocal: true, isDefinition: true)
!651 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !651, line: 34, type: !19, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !651, line: 34, type: !61, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !658, line: 108, type: !34, isLocal: true, isDefinition: true)
!658 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "internal_state", scope: !661, file: !658, line: 97, type: !664, isLocal: true, isDefinition: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C11, file: !658, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !662, globals: !663, splitDebugInlining: false, nameTableKind: None)
!662 = !{!107, !110, !113}
!663 = !{!656, !659}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !666, file: !439, line: 15, baseType: !108, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !666, file: !439, line: 20, baseType: !670, size: 32, offset: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !666, file: !439, line: 16, size: 32, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !670, file: !439, line: 18, baseType: !78, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !670, file: !439, line: 19, baseType: !124, size: 32)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !676, line: 35, type: !134, isLocal: true, isDefinition: true)
!676 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !676, line: 35, type: !129, isLocal: true, isDefinition: true)
!679 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!681 = distinct !DICompileUnit(language: DW_LANG_C11, file: !555, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !390, globals: !686, splitDebugInlining: false, nameTableKind: None)
!682 = !{!683}
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 40, baseType: !78, size: 32, elements: !684)
!684 = !{!685}
!685 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!686 = !{!553, !556, !558, !560, !562, !564, !569, !574, !576, !581, !586, !591, !596, !598, !603, !608, !613, !618, !620, !622, !624, !626, !628, !630}
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !689, retainedTypes: !721, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!689 = !{!690, !702}
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !691, file: !688, line: 188, baseType: !78, size: 32, elements: !700)
!691 = distinct !DISubprogram(name: "x2nrealloc", scope: !688, file: !688, line: 176, type: !692, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !687, retainedNodes: !695)
!692 = !DISubroutineType(types: !693)
!693 = !{!107, !107, !694, !110}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!695 = !{!696, !697, !698, !699}
!696 = !DILocalVariable(name: "p", arg: 1, scope: !691, file: !688, line: 176, type: !107)
!697 = !DILocalVariable(name: "pn", arg: 2, scope: !691, file: !688, line: 176, type: !694)
!698 = !DILocalVariable(name: "s", arg: 3, scope: !691, file: !688, line: 176, type: !110)
!699 = !DILocalVariable(name: "n", scope: !691, file: !688, line: 178, type: !110)
!700 = !{!701}
!701 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !703, file: !688, line: 228, baseType: !78, size: 32, elements: !700)
!703 = distinct !DISubprogram(name: "xpalloc", scope: !688, file: !688, line: 223, type: !704, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !687, retainedNodes: !711)
!704 = !DISubroutineType(types: !705)
!705 = !{!107, !107, !706, !707, !709, !707}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !708, line: 130, baseType: !709)
!708 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !710, line: 18, baseType: !276)
!710 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720}
!712 = !DILocalVariable(name: "pa", arg: 1, scope: !703, file: !688, line: 223, type: !107)
!713 = !DILocalVariable(name: "pn", arg: 2, scope: !703, file: !688, line: 223, type: !706)
!714 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !703, file: !688, line: 223, type: !707)
!715 = !DILocalVariable(name: "n_max", arg: 4, scope: !703, file: !688, line: 223, type: !709)
!716 = !DILocalVariable(name: "s", arg: 5, scope: !703, file: !688, line: 223, type: !707)
!717 = !DILocalVariable(name: "n0", scope: !703, file: !688, line: 230, type: !707)
!718 = !DILocalVariable(name: "n", scope: !703, file: !688, line: 237, type: !707)
!719 = !DILocalVariable(name: "nbytes", scope: !703, file: !688, line: 248, type: !707)
!720 = !DILocalVariable(name: "adjusted_nbytes", scope: !703, file: !688, line: 252, type: !707)
!721 = !{!255, !107}
!722 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !723, splitDebugInlining: false, nameTableKind: None)
!723 = !{!649, !652, !654}
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!732 = distinct !DICompileUnit(language: DW_LANG_C11, file: !733, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!734 = distinct !DICompileUnit(language: DW_LANG_C11, file: !676, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !735, splitDebugInlining: false, nameTableKind: None)
!735 = !{!674, !677}
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !737, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !739, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!740 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!741 = !{i32 7, !"Dwarf Version", i32 5}
!742 = !{i32 2, !"Debug Info Version", i32 3}
!743 = !{i32 1, !"wchar_size", i32 4}
!744 = !{i32 8, !"PIC Level", i32 2}
!745 = !{i32 7, !"PIE Level", i32 2}
!746 = !{i32 7, !"uwtable", i32 2}
!747 = !{i32 7, !"frame-pointer", i32 1}
!748 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!749 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !750, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !108}
!752 = !{!753}
!753 = !DILocalVariable(name: "status", arg: 1, scope: !749, file: !2, line: 37, type: !108)
!754 = !DILocation(line: 0, scope: !749)
!755 = !DILocation(line: 39, column: 14, scope: !756)
!756 = distinct !DILexicalBlock(scope: !749, file: !2, line: 39, column: 7)
!757 = !DILocation(line: 39, column: 7, scope: !749)
!758 = !DILocation(line: 40, column: 5, scope: !759)
!759 = distinct !DILexicalBlock(scope: !756, file: !2, line: 40, column: 5)
!760 = !{!761, !761, i64 0}
!761 = !{!"any pointer", !762, i64 0}
!762 = !{!"omnipotent char", !763, i64 0}
!763 = !{!"Simple C/C++ TBAA"}
!764 = !DILocation(line: 43, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !756, file: !2, line: 42, column: 5)
!766 = !DILocation(line: 46, column: 7, scope: !765)
!767 = !DILocation(line: 48, column: 7, scope: !765)
!768 = !DILocation(line: 49, column: 7, scope: !765)
!769 = !DILocalVariable(name: "program", arg: 1, scope: !770, file: !69, line: 836, type: !72)
!770 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !771, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !72}
!773 = !{!769, !774, !781, !782, !784, !785}
!774 = !DILocalVariable(name: "infomap", scope: !770, file: !69, line: 838, type: !775)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 896, elements: !20)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !770, file: !69, line: 838, size: 128, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !777, file: !69, line: 838, baseType: !72, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !777, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!781 = !DILocalVariable(name: "node", scope: !770, file: !69, line: 848, type: !72)
!782 = !DILocalVariable(name: "map_prog", scope: !770, file: !69, line: 849, type: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!784 = !DILocalVariable(name: "lc_messages", scope: !770, file: !69, line: 861, type: !72)
!785 = !DILocalVariable(name: "url_program", scope: !770, file: !69, line: 874, type: !72)
!786 = !DILocation(line: 0, scope: !770, inlinedAt: !787)
!787 = distinct !DILocation(line: 50, column: 7, scope: !765)
!788 = !{}
!789 = !DILocation(line: 857, column: 3, scope: !770, inlinedAt: !787)
!790 = !DILocation(line: 861, column: 29, scope: !770, inlinedAt: !787)
!791 = !DILocation(line: 862, column: 7, scope: !792, inlinedAt: !787)
!792 = distinct !DILexicalBlock(scope: !770, file: !69, line: 862, column: 7)
!793 = !DILocation(line: 862, column: 19, scope: !792, inlinedAt: !787)
!794 = !DILocation(line: 862, column: 22, scope: !792, inlinedAt: !787)
!795 = !DILocation(line: 862, column: 7, scope: !770, inlinedAt: !787)
!796 = !DILocation(line: 868, column: 7, scope: !797, inlinedAt: !787)
!797 = distinct !DILexicalBlock(scope: !792, file: !69, line: 863, column: 5)
!798 = !DILocation(line: 870, column: 5, scope: !797, inlinedAt: !787)
!799 = !DILocation(line: 875, column: 3, scope: !770, inlinedAt: !787)
!800 = !DILocation(line: 877, column: 3, scope: !770, inlinedAt: !787)
!801 = !DILocation(line: 52, column: 3, scope: !749)
!802 = !DISubprogram(name: "dcgettext", scope: !803, file: !803, line: 51, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!804 = !DISubroutineType(types: !805)
!805 = !{!255, !72, !72, !108}
!806 = !DISubprogram(name: "__fprintf_chk", scope: !807, file: !807, line: 93, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!808 = !DISubroutineType(types: !809)
!809 = !{!108, !810, !108, !811, null}
!810 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !247)
!811 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!812 = !DISubprogram(name: "__printf_chk", scope: !807, file: !807, line: 95, type: !813, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!813 = !DISubroutineType(types: !814)
!814 = !{!108, !108, !811, null}
!815 = !DISubprogram(name: "fputs_unlocked", scope: !342, file: !342, line: 691, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!816 = !DISubroutineType(types: !817)
!817 = !{!108, !811, !810}
!818 = !DILocation(line: 0, scope: !68)
!819 = !DILocation(line: 581, column: 7, scope: !232)
!820 = !{!821, !821, i64 0}
!821 = !{!"int", !762, i64 0}
!822 = !DILocation(line: 581, column: 19, scope: !232)
!823 = !DILocation(line: 581, column: 7, scope: !68)
!824 = !DILocation(line: 585, column: 26, scope: !231)
!825 = !DILocation(line: 0, scope: !231)
!826 = !DILocation(line: 586, column: 23, scope: !231)
!827 = !DILocation(line: 586, column: 28, scope: !231)
!828 = !DILocation(line: 586, column: 32, scope: !231)
!829 = !{!762, !762, i64 0}
!830 = !DILocation(line: 586, column: 38, scope: !231)
!831 = !DILocalVariable(name: "__s1", arg: 1, scope: !832, file: !833, line: 1359, type: !72)
!832 = distinct !DISubprogram(name: "streq", scope: !833, file: !833, line: 1359, type: !834, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !836)
!833 = !DIFile(filename: "./lib/string.h", directory: "/src")
!834 = !DISubroutineType(types: !835)
!835 = !{!234, !72, !72}
!836 = !{!831, !837}
!837 = !DILocalVariable(name: "__s2", arg: 2, scope: !832, file: !833, line: 1359, type: !72)
!838 = !DILocation(line: 0, scope: !832, inlinedAt: !839)
!839 = distinct !DILocation(line: 586, column: 41, scope: !231)
!840 = !DILocation(line: 1361, column: 11, scope: !832, inlinedAt: !839)
!841 = !DILocation(line: 1361, column: 10, scope: !832, inlinedAt: !839)
!842 = !DILocation(line: 586, column: 19, scope: !231)
!843 = !DILocation(line: 587, column: 5, scope: !231)
!844 = !DILocation(line: 588, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!846 = !DILocation(line: 588, column: 7, scope: !68)
!847 = !DILocation(line: 590, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !845, file: !69, line: 589, column: 5)
!849 = !DILocation(line: 591, column: 7, scope: !848)
!850 = !DILocation(line: 595, column: 37, scope: !68)
!851 = !DILocation(line: 595, column: 35, scope: !68)
!852 = !DILocation(line: 596, column: 29, scope: !68)
!853 = !DILocation(line: 597, column: 8, scope: !240)
!854 = !DILocation(line: 597, column: 7, scope: !68)
!855 = !DILocation(line: 604, column: 24, scope: !239)
!856 = !DILocation(line: 604, column: 12, scope: !240)
!857 = !DILocation(line: 0, scope: !238)
!858 = !DILocation(line: 610, column: 16, scope: !238)
!859 = !DILocation(line: 610, column: 7, scope: !238)
!860 = !DILocation(line: 611, column: 21, scope: !238)
!861 = !{!862, !862, i64 0}
!862 = !{!"short", !762, i64 0}
!863 = !DILocation(line: 611, column: 19, scope: !238)
!864 = !DILocation(line: 611, column: 16, scope: !238)
!865 = !DILocation(line: 610, column: 30, scope: !238)
!866 = distinct !{!866, !859, !860, !867}
!867 = !{!"llvm.loop.mustprogress"}
!868 = !DILocation(line: 612, column: 18, scope: !869)
!869 = distinct !DILexicalBlock(scope: !238, file: !69, line: 612, column: 11)
!870 = !DILocation(line: 612, column: 11, scope: !238)
!871 = !DILocation(line: 620, column: 23, scope: !68)
!872 = !DILocation(line: 625, column: 39, scope: !68)
!873 = !DILocation(line: 626, column: 3, scope: !68)
!874 = !DILocation(line: 626, column: 10, scope: !68)
!875 = !DILocation(line: 626, column: 21, scope: !68)
!876 = !DILocation(line: 628, column: 44, scope: !877)
!877 = distinct !DILexicalBlock(scope: !878, file: !69, line: 628, column: 11)
!878 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!879 = !DILocation(line: 628, column: 32, scope: !877)
!880 = !DILocation(line: 628, column: 49, scope: !877)
!881 = !DILocation(line: 628, column: 11, scope: !878)
!882 = !DILocation(line: 630, column: 11, scope: !883)
!883 = distinct !DILexicalBlock(scope: !878, file: !69, line: 630, column: 11)
!884 = !DILocation(line: 630, column: 11, scope: !878)
!885 = !DILocation(line: 632, column: 26, scope: !886)
!886 = distinct !DILexicalBlock(scope: !887, file: !69, line: 632, column: 15)
!887 = distinct !DILexicalBlock(scope: !883, file: !69, line: 631, column: 9)
!888 = !DILocation(line: 632, column: 34, scope: !886)
!889 = !DILocation(line: 632, column: 37, scope: !886)
!890 = !DILocation(line: 632, column: 15, scope: !887)
!891 = !DILocation(line: 640, column: 16, scope: !878)
!892 = distinct !{!892, !873, !893, !867}
!893 = !DILocation(line: 641, column: 5, scope: !68)
!894 = !DILocation(line: 644, column: 3, scope: !68)
!895 = !DILocation(line: 0, scope: !832, inlinedAt: !896)
!896 = distinct !DILocation(line: 648, column: 31, scope: !68)
!897 = !DILocation(line: 0, scope: !832, inlinedAt: !898)
!898 = distinct !DILocation(line: 649, column: 31, scope: !68)
!899 = !DILocation(line: 0, scope: !832, inlinedAt: !900)
!900 = distinct !DILocation(line: 650, column: 31, scope: !68)
!901 = !DILocation(line: 0, scope: !832, inlinedAt: !902)
!902 = distinct !DILocation(line: 651, column: 31, scope: !68)
!903 = !DILocation(line: 0, scope: !832, inlinedAt: !904)
!904 = distinct !DILocation(line: 652, column: 31, scope: !68)
!905 = !DILocation(line: 0, scope: !832, inlinedAt: !906)
!906 = distinct !DILocation(line: 653, column: 31, scope: !68)
!907 = !DILocation(line: 0, scope: !832, inlinedAt: !908)
!908 = distinct !DILocation(line: 654, column: 31, scope: !68)
!909 = !DILocation(line: 0, scope: !832, inlinedAt: !910)
!910 = distinct !DILocation(line: 655, column: 31, scope: !68)
!911 = !DILocation(line: 0, scope: !832, inlinedAt: !912)
!912 = distinct !DILocation(line: 656, column: 31, scope: !68)
!913 = !DILocation(line: 0, scope: !832, inlinedAt: !914)
!914 = distinct !DILocation(line: 657, column: 31, scope: !68)
!915 = !DILocation(line: 663, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!917 = !DILocation(line: 664, column: 7, scope: !916)
!918 = !DILocation(line: 664, column: 10, scope: !916)
!919 = !DILocation(line: 663, column: 7, scope: !68)
!920 = !DILocation(line: 669, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !69, line: 665, column: 5)
!922 = !DILocation(line: 671, column: 5, scope: !921)
!923 = !DILocation(line: 676, column: 7, scope: !924)
!924 = distinct !DILexicalBlock(scope: !916, file: !69, line: 673, column: 5)
!925 = !DILocation(line: 679, column: 3, scope: !68)
!926 = !DILocation(line: 683, column: 3, scope: !68)
!927 = !DILocation(line: 686, column: 3, scope: !68)
!928 = !DILocation(line: 688, column: 3, scope: !68)
!929 = !DILocation(line: 691, column: 3, scope: !68)
!930 = !DILocation(line: 695, column: 3, scope: !68)
!931 = !DILocation(line: 696, column: 1, scope: !68)
!932 = !DISubprogram(name: "setlocale", scope: !933, file: !933, line: 122, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!933 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!934 = !DISubroutineType(types: !935)
!935 = !{!255, !108, !72}
!936 = !DISubprogram(name: "strncmp", scope: !937, file: !937, line: 159, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!937 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!938 = !DISubroutineType(types: !939)
!939 = !{!108, !72, !72, !110}
!940 = !DISubprogram(name: "exit", scope: !941, file: !941, line: 624, type: !750, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!941 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!942 = !DISubprogram(name: "getenv", scope: !941, file: !941, line: 641, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!943 = !DISubroutineType(types: !944)
!944 = !{!255, !72}
!945 = !DISubprogram(name: "strcmp", scope: !937, file: !937, line: 156, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!946 = !DISubroutineType(types: !947)
!947 = !{!108, !72, !72}
!948 = !DISubprogram(name: "strspn", scope: !937, file: !937, line: 297, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!949 = !DISubroutineType(types: !950)
!950 = !{!112, !72, !72}
!951 = !DISubprogram(name: "strchr", scope: !937, file: !937, line: 246, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!952 = !DISubroutineType(types: !953)
!953 = !{!255, !72, !108}
!954 = !DISubprogram(name: "__ctype_b_loc", scope: !92, file: !92, line: 79, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!955 = !DISubroutineType(types: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!960 = !DISubprogram(name: "strcspn", scope: !937, file: !937, line: 293, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!961 = !DISubprogram(name: "fwrite_unlocked", scope: !342, file: !342, line: 704, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!962 = !DISubroutineType(types: !963)
!963 = !{!110, !964, !110, !110, !810}
!964 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!967 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 56, type: !968, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !971)
!968 = !DISubroutineType(types: !969)
!969 = !{!108, !108, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!971 = !{!972, !973}
!972 = !DILocalVariable(name: "argc", arg: 1, scope: !967, file: !2, line: 56, type: !108)
!973 = !DILocalVariable(name: "argv", arg: 2, scope: !967, file: !2, line: 56, type: !970)
!974 = !DILocation(line: 0, scope: !967)
!975 = !DILocation(line: 59, column: 21, scope: !967)
!976 = !DILocation(line: 59, column: 3, scope: !967)
!977 = !DILocation(line: 60, column: 3, scope: !967)
!978 = !DILocation(line: 61, column: 3, scope: !967)
!979 = !DILocation(line: 62, column: 3, scope: !967)
!980 = !DILocation(line: 64, column: 3, scope: !967)
!981 = !DILocation(line: 67, column: 36, scope: !967)
!982 = !DILocation(line: 67, column: 58, scope: !967)
!983 = !DILocation(line: 66, column: 3, scope: !967)
!984 = !DILocation(line: 70, column: 14, scope: !985)
!985 = distinct !DILexicalBlock(scope: !967, file: !2, line: 70, column: 7)
!986 = !DILocation(line: 70, column: 12, scope: !985)
!987 = !DILocation(line: 70, column: 7, scope: !967)
!988 = !DILocation(line: 72, column: 7, scope: !989)
!989 = distinct !DILexicalBlock(scope: !985, file: !2, line: 71, column: 5)
!990 = !DILocation(line: 73, column: 7, scope: !989)
!991 = !DILocation(line: 70, column: 21, scope: !985)
!992 = !DILocation(line: 76, column: 18, scope: !993)
!993 = distinct !DILexicalBlock(scope: !967, file: !2, line: 76, column: 7)
!994 = !DILocation(line: 76, column: 7, scope: !967)
!995 = !DILocation(line: 78, column: 7, scope: !996)
!996 = distinct !DILexicalBlock(scope: !993, file: !2, line: 77, column: 5)
!997 = !DILocation(line: 79, column: 7, scope: !996)
!998 = !DILocation(line: 82, column: 15, scope: !999)
!999 = distinct !DILexicalBlock(scope: !967, file: !2, line: 82, column: 7)
!1000 = !DILocation(line: 82, column: 7, scope: !999)
!1001 = !DILocation(line: 82, column: 29, scope: !999)
!1002 = !DILocation(line: 82, column: 7, scope: !967)
!1003 = !DILocation(line: 83, column: 5, scope: !999)
!1004 = !DILocation(line: 85, column: 3, scope: !967)
!1005 = !DISubprogram(name: "bindtextdomain", scope: !803, file: !803, line: 86, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!255, !72, !72}
!1008 = !DISubprogram(name: "textdomain", scope: !803, file: !803, line: 82, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1009 = !DISubprogram(name: "atexit", scope: !941, file: !941, line: 602, type: !1010, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!108, !381}
!1012 = !DISubprogram(name: "unlink", scope: !1013, file: !1013, line: 858, type: !1014, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1013 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!108, !72}
!1016 = !DISubprogram(name: "__errno_location", scope: !1017, file: !1017, line: 37, type: !1018, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1017 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!406}
!1020 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !316, file: !316, line: 50, type: !771, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1021)
!1021 = !{!1022}
!1022 = !DILocalVariable(name: "file", arg: 1, scope: !1020, file: !316, line: 50, type: !72)
!1023 = !DILocation(line: 0, scope: !1020)
!1024 = !DILocation(line: 52, column: 13, scope: !1020)
!1025 = !DILocation(line: 53, column: 1, scope: !1020)
!1026 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !316, file: !316, line: 87, type: !1027, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1029)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !234}
!1029 = !{!1030}
!1030 = !DILocalVariable(name: "ignore", arg: 1, scope: !1026, file: !316, line: 87, type: !234)
!1031 = !DILocation(line: 0, scope: !1026)
!1032 = !DILocation(line: 89, column: 16, scope: !1026)
!1033 = !{!1034, !1034, i64 0}
!1034 = !{!"_Bool", !762, i64 0}
!1035 = !DILocation(line: 90, column: 1, scope: !1026)
!1036 = distinct !DISubprogram(name: "close_stdout", scope: !316, file: !316, line: 116, type: !382, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1037)
!1037 = !{!1038}
!1038 = !DILocalVariable(name: "write_error", scope: !1039, file: !316, line: 121, type: !72)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !316, line: 120, column: 5)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !316, line: 118, column: 7)
!1041 = !DILocation(line: 118, column: 21, scope: !1040)
!1042 = !DILocation(line: 118, column: 7, scope: !1040)
!1043 = !DILocation(line: 118, column: 29, scope: !1040)
!1044 = !DILocation(line: 119, column: 7, scope: !1040)
!1045 = !DILocation(line: 119, column: 12, scope: !1040)
!1046 = !{i8 0, i8 2}
!1047 = !DILocation(line: 119, column: 25, scope: !1040)
!1048 = !DILocation(line: 119, column: 28, scope: !1040)
!1049 = !DILocation(line: 119, column: 34, scope: !1040)
!1050 = !DILocation(line: 118, column: 7, scope: !1036)
!1051 = !DILocation(line: 121, column: 33, scope: !1039)
!1052 = !DILocation(line: 0, scope: !1039)
!1053 = !DILocation(line: 122, column: 11, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1039, file: !316, line: 122, column: 11)
!1055 = !DILocation(line: 0, scope: !1054)
!1056 = !DILocation(line: 122, column: 11, scope: !1039)
!1057 = !DILocation(line: 123, column: 9, scope: !1054)
!1058 = !DILocation(line: 126, column: 9, scope: !1054)
!1059 = !DILocation(line: 128, column: 14, scope: !1039)
!1060 = !DILocation(line: 128, column: 7, scope: !1039)
!1061 = !DILocation(line: 133, column: 42, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1036, file: !316, line: 133, column: 7)
!1063 = !DILocation(line: 133, column: 28, scope: !1062)
!1064 = !DILocation(line: 133, column: 50, scope: !1062)
!1065 = !DILocation(line: 133, column: 7, scope: !1036)
!1066 = !DILocation(line: 134, column: 12, scope: !1062)
!1067 = !DILocation(line: 134, column: 5, scope: !1062)
!1068 = !DILocation(line: 135, column: 1, scope: !1036)
!1069 = !DISubprogram(name: "_exit", scope: !1013, file: !1013, line: 624, type: !750, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1070 = distinct !DISubprogram(name: "verror", scope: !331, file: !331, line: 251, type: !1071, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1073)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !108, !108, !72, !341}
!1073 = !{!1074, !1075, !1076, !1077}
!1074 = !DILocalVariable(name: "status", arg: 1, scope: !1070, file: !331, line: 251, type: !108)
!1075 = !DILocalVariable(name: "errnum", arg: 2, scope: !1070, file: !331, line: 251, type: !108)
!1076 = !DILocalVariable(name: "message", arg: 3, scope: !1070, file: !331, line: 251, type: !72)
!1077 = !DILocalVariable(name: "args", arg: 4, scope: !1070, file: !331, line: 251, type: !341)
!1078 = !DILocation(line: 0, scope: !1070)
!1079 = !DILocation(line: 261, column: 3, scope: !1070)
!1080 = !DILocation(line: 265, column: 7, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1070, file: !331, line: 265, column: 7)
!1082 = !DILocation(line: 265, column: 7, scope: !1070)
!1083 = !DILocation(line: 266, column: 5, scope: !1081)
!1084 = !DILocation(line: 272, column: 7, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !331, line: 268, column: 5)
!1086 = !DILocation(line: 276, column: 3, scope: !1070)
!1087 = !{i64 0, i64 8, !760, i64 8, i64 8, !760, i64 16, i64 8, !760, i64 24, i64 4, !820, i64 28, i64 4, !820}
!1088 = !DILocation(line: 282, column: 1, scope: !1070)
!1089 = distinct !DISubprogram(name: "flush_stdout", scope: !331, file: !331, line: 163, type: !382, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1090)
!1090 = !{!1091}
!1091 = !DILocalVariable(name: "stdout_fd", scope: !1089, file: !331, line: 166, type: !108)
!1092 = !DILocation(line: 0, scope: !1089)
!1093 = !DILocalVariable(name: "fd", arg: 1, scope: !1094, file: !331, line: 145, type: !108)
!1094 = distinct !DISubprogram(name: "is_open", scope: !331, file: !331, line: 145, type: !1095, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1097)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!108, !108}
!1097 = !{!1093}
!1098 = !DILocation(line: 0, scope: !1094, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 182, column: 25, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1089, file: !331, line: 182, column: 7)
!1101 = !DILocation(line: 157, column: 15, scope: !1094, inlinedAt: !1099)
!1102 = !DILocation(line: 157, column: 12, scope: !1094, inlinedAt: !1099)
!1103 = !DILocation(line: 182, column: 7, scope: !1089)
!1104 = !DILocation(line: 184, column: 5, scope: !1100)
!1105 = !DILocation(line: 185, column: 1, scope: !1089)
!1106 = distinct !DISubprogram(name: "error_tail", scope: !331, file: !331, line: 219, type: !1071, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1107)
!1107 = !{!1108, !1109, !1110, !1111}
!1108 = !DILocalVariable(name: "status", arg: 1, scope: !1106, file: !331, line: 219, type: !108)
!1109 = !DILocalVariable(name: "errnum", arg: 2, scope: !1106, file: !331, line: 219, type: !108)
!1110 = !DILocalVariable(name: "message", arg: 3, scope: !1106, file: !331, line: 219, type: !72)
!1111 = !DILocalVariable(name: "args", arg: 4, scope: !1106, file: !331, line: 219, type: !341)
!1112 = distinct !DIAssignID()
!1113 = !DILocation(line: 0, scope: !1106)
!1114 = !DILocation(line: 229, column: 13, scope: !1106)
!1115 = !DILocation(line: 135, column: 10, scope: !1116, inlinedAt: !1158)
!1116 = distinct !DISubprogram(name: "vfprintf", scope: !807, file: !807, line: 132, type: !1117, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1154)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!108, !1119, !811, !343}
!1119 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1122, file: !251, line: 51, baseType: !108, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1122, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1122, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1122, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1122, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1122, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1122, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1122, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1122, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1122, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1122, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1122, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1122, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1122, file: !251, line: 70, baseType: !1138, size: 64, offset: 832)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1122, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1122, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1122, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1122, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1122, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1122, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1122, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1122, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1122, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1122, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1122, file: !251, line: 93, baseType: !1138, size: 64, offset: 1344)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1122, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1122, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1122, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1122, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!1154 = !{!1155, !1156, !1157}
!1155 = !DILocalVariable(name: "__stream", arg: 1, scope: !1116, file: !807, line: 132, type: !1119)
!1156 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1116, file: !807, line: 133, type: !811)
!1157 = !DILocalVariable(name: "__ap", arg: 3, scope: !1116, file: !807, line: 133, type: !343)
!1158 = distinct !DILocation(line: 229, column: 3, scope: !1106)
!1159 = !{!1160, !1162}
!1160 = distinct !{!1160, !1161, !"vfprintf.inline: argument 0"}
!1161 = distinct !{!1161, !"vfprintf.inline"}
!1162 = distinct !{!1162, !1161, !"vfprintf.inline: argument 1"}
