; ModuleID = 'src/users.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i64, %struct.timespec, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !71, line: 676, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 61)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !71, line: 679, type: !151, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !71, line: 683, type: !128, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !71, line: 688, type: !128, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !71, line: 691, type: !167, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !71, line: 839, type: !63, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !71, line: 840, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 22)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !71, line: 841, type: !191, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !71, line: 862, type: !135, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !71, line: 868, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 71)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !71, line: 875, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 27)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 51)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 12)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !151, isLocal: true, isDefinition: true)
!240 = !{!241, !242, !243, !246, !248, !249, !250, !254, !255, !256, !257, !259, !312, !313, !314, !316, !317}
!241 = !DILocalVariable(name: "program", arg: 1, scope: !70, file: !71, line: 573, type: !74)
!242 = !DILocalVariable(name: "option", arg: 2, scope: !70, file: !71, line: 573, type: !74)
!243 = !DILocalVariable(name: "term", scope: !244, file: !71, line: 585, type: !74)
!244 = distinct !DILexicalBlock(scope: !245, file: !71, line: 582, column: 5)
!245 = distinct !DILexicalBlock(scope: !70, file: !71, line: 581, column: 7)
!246 = !DILocalVariable(name: "double_space", scope: !70, file: !71, line: 594, type: !247)
!247 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!248 = !DILocalVariable(name: "first_word", scope: !70, file: !71, line: 595, type: !74)
!249 = !DILocalVariable(name: "option_text", scope: !70, file: !71, line: 596, type: !74)
!250 = !DILocalVariable(name: "s", scope: !251, file: !71, line: 608, type: !74)
!251 = distinct !DILexicalBlock(scope: !252, file: !71, line: 605, column: 5)
!252 = distinct !DILexicalBlock(scope: !253, file: !71, line: 604, column: 12)
!253 = distinct !DILexicalBlock(scope: !70, file: !71, line: 597, column: 7)
!254 = !DILocalVariable(name: "spaces", scope: !251, file: !71, line: 609, type: !119)
!255 = !DILocalVariable(name: "anchor_len", scope: !70, file: !71, line: 620, type: !119)
!256 = !DILocalVariable(name: "desc_text", scope: !70, file: !71, line: 625, type: !74)
!257 = !DILocalVariable(name: "__ptr", scope: !258, file: !71, line: 644, type: !74)
!258 = distinct !DILexicalBlock(scope: !70, file: !71, line: 644, column: 3)
!259 = !DILocalVariable(name: "__stream", scope: !258, file: !71, line: 644, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !262, line: 7, baseType: !263)
!262 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !264, line: 49, size: 1728, elements: !265)
!264 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !281, !283, !284, !285, !289, !290, !292, !293, !296, !298, !301, !304, !305, !306, !307, !308}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !264, line: 51, baseType: !117, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !264, line: 54, baseType: !124, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !264, line: 55, baseType: !124, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !264, line: 56, baseType: !124, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !264, line: 57, baseType: !124, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !264, line: 58, baseType: !124, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !264, line: 59, baseType: !124, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !264, line: 60, baseType: !124, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !264, line: 61, baseType: !124, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !264, line: 64, baseType: !124, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !264, line: 65, baseType: !124, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !264, line: 66, baseType: !124, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !264, line: 68, baseType: !279, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !264, line: 36, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !264, line: 70, baseType: !282, size: 64, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !264, line: 72, baseType: !117, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !264, line: 73, baseType: !117, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !264, line: 74, baseType: !286, size: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !287, line: 152, baseType: !288)
!287 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!288 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !264, line: 77, baseType: !118, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !264, line: 78, baseType: !291, size: 8, offset: 1040)
!291 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !264, line: 79, baseType: !41, size: 8, offset: 1048)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !264, line: 81, baseType: !294, size: 64, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !264, line: 43, baseType: null)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !264, line: 89, baseType: !297, size: 64, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !287, line: 153, baseType: !288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !264, line: 91, baseType: !299, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !264, line: 37, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !264, line: 92, baseType: !302, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !264, line: 38, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !264, line: 93, baseType: !282, size: 64, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !264, line: 94, baseType: !116, size: 64, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !264, line: 95, baseType: !119, size: 64, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !264, line: 96, baseType: !117, size: 32, offset: 1536)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !264, line: 98, baseType: !309, size: 160, offset: 1568)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 20)
!312 = !DILocalVariable(name: "__cnt", scope: !258, file: !71, line: 644, type: !119)
!313 = !DILocalVariable(name: "url_program", scope: !70, file: !71, line: 648, type: !74)
!314 = !DILocalVariable(name: "__ptr", scope: !315, file: !71, line: 686, type: !74)
!315 = distinct !DILexicalBlock(scope: !70, file: !71, line: 686, column: 3)
!316 = !DILocalVariable(name: "__stream", scope: !315, file: !71, line: 686, type: !260)
!317 = !DILocalVariable(name: "__cnt", scope: !315, file: !71, line: 686, type: !119)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !320, line: 3, type: !191, isLocal: true, isDefinition: true)
!320 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "Version", scope: !323, file: !320, line: 3, type: !74, isLocal: false, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C11, file: !320, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!324 = !{!318, !321}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "file_name", scope: !327, file: !328, line: 45, type: !74, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C11, file: !328, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!329 = !{!330, !332, !334, !336, !325, !338}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !162, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !235, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !328, line: 123, type: !162, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !328, line: 126, type: !151, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !327, file: !328, line: 55, type: !247, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !342, file: !343, line: 66, type: !393, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C11, file: !343, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, globals: !345, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!344 = !{!116, !122}
!345 = !{!346, !348, !372, !374, !376, !378, !340, !380, !382, !384, !386, !391}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !343, line: 272, type: !128, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "old_file_name", scope: !350, file: !343, line: 304, type: !74, isLocal: true, isDefinition: true)
!350 = distinct !DISubprogram(name: "verror_at_line", scope: !343, file: !343, line: 298, type: !351, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !365)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !117, !117, !74, !80, !74, !353}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !354, line: 52, baseType: !355)
!354 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !356, line: 12, baseType: !357)
!356 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !343, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !359)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !358, file: !343, baseType: !116, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !358, file: !343, baseType: !116, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !358, file: !343, baseType: !116, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !358, file: !343, baseType: !117, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !358, file: !343, baseType: !117, size: 32, offset: 224)
!365 = !{!366, !367, !368, !369, !370, !371}
!366 = !DILocalVariable(name: "status", arg: 1, scope: !350, file: !343, line: 298, type: !117)
!367 = !DILocalVariable(name: "errnum", arg: 2, scope: !350, file: !343, line: 298, type: !117)
!368 = !DILocalVariable(name: "file_name", arg: 3, scope: !350, file: !343, line: 298, type: !74)
!369 = !DILocalVariable(name: "line_number", arg: 4, scope: !350, file: !343, line: 298, type: !80)
!370 = !DILocalVariable(name: "message", arg: 5, scope: !350, file: !343, line: 298, type: !74)
!371 = !DILocalVariable(name: "args", arg: 6, scope: !350, file: !343, line: 298, type: !353)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "old_line_number", scope: !350, file: !343, line: 305, type: !80, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !343, line: 338, type: !135, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !167, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !142, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "error_message_count", scope: !342, file: !343, line: 69, type: !80, isLocal: false, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !342, file: !343, line: 295, type: !117, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !162, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !388, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 21)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !343, line: 214, type: !128, isLocal: true, isDefinition: true)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !398, line: 60, type: !142, isLocal: true, isDefinition: true)
!398 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "long_options", scope: !401, file: !398, line: 34, type: !410, isLocal: true, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C11, file: !398, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, globals: !403, splitDebugInlining: false, nameTableKind: None)
!402 = !{!116}
!403 = !{!396, !404, !406, !408, !399}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !398, line: 112, type: !41, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !398, line: 36, type: !128, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !398, line: 37, type: !167, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 768, elements: !152)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !413, line: 50, size: 256, elements: !414)
!413 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!414 = !{!415, !416, !417, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !413, line: 52, baseType: !74, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !412, file: !413, line: 55, baseType: !117, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !413, line: 56, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !412, file: !413, line: 57, baseType: !117, size: 32, offset: 192)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "program_name", scope: !422, file: !423, line: 31, type: !74, isLocal: false, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C11, file: !423, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !424, globals: !425, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!424 = !{!116, !124}
!425 = !{!420, !426, !428}
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !423, line: 46, type: !167, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !423, line: 49, type: !135, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "utf07FF", scope: !432, file: !433, line: 46, type: !460, isLocal: true, isDefinition: true)
!432 = distinct !DISubprogram(name: "proper_name_lite", scope: !433, file: !433, line: 38, type: !434, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !436, retainedNodes: !438)
!433 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!434 = !DISubroutineType(types: !435)
!435 = !{!74, !74, !74}
!436 = distinct !DICompileUnit(language: DW_LANG_C11, file: !433, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !437, splitDebugInlining: false, nameTableKind: None)
!437 = !{!430}
!438 = !{!439, !440, !441, !442, !447}
!439 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !432, file: !433, line: 38, type: !74)
!440 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !432, file: !433, line: 38, type: !74)
!441 = !DILocalVariable(name: "translation", scope: !432, file: !433, line: 40, type: !74)
!442 = !DILocalVariable(name: "w", scope: !432, file: !433, line: 47, type: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !444, line: 37, baseType: !445)
!444 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !287, line: 57, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !287, line: 42, baseType: !80)
!447 = !DILocalVariable(name: "mbs", scope: !432, file: !433, line: 48, type: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !449, line: 6, baseType: !450)
!449 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !451, line: 21, baseType: !452)
!451 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 64, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !452, file: !451, line: 15, baseType: !117, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !452, file: !451, line: 20, baseType: !456, size: 32, offset: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !451, line: 16, size: 32, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !456, file: !451, line: 18, baseType: !80, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !456, file: !451, line: 19, baseType: !135, size: 32)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16, elements: !143)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !463, line: 78, type: !167, isLocal: true, isDefinition: true)
!463 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !463, line: 79, type: !26, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !463, line: 80, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 13)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !463, line: 81, type: !468, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !463, line: 82, type: !309, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !463, line: 83, type: !142, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !463, line: 84, type: !167, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !463, line: 85, type: !162, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !463, line: 86, type: !162, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !463, line: 87, type: !167, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !487, file: !463, line: 76, type: !561, isLocal: false, isDefinition: true)
!487 = distinct !DICompileUnit(language: DW_LANG_C11, file: !463, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !488, retainedTypes: !496, globals: !497, splitDebugInlining: false, nameTableKind: None)
!488 = !{!489, !491, !86}
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !490, line: 42, baseType: !80, size: 32, elements: !103)
!490 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !490, line: 254, baseType: !80, size: 32, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!494 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!495 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!496 = !{!116, !117, !118, !119}
!497 = !{!461, !464, !466, !471, !473, !475, !477, !479, !481, !483, !485, !498, !502, !512, !514, !519, !521, !523, !525, !527, !550, !557, !559}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !487, file: !463, line: 92, type: !500, isLocal: false, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !47)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !487, file: !463, line: 1040, type: !504, isLocal: false, isDefinition: true)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !463, line: 56, size: 448, elements: !505)
!505 = !{!506, !507, !508, !510, !511}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !504, file: !463, line: 59, baseType: !489, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !463, line: 62, baseType: !117, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !504, file: !463, line: 66, baseType: !509, size: 256, offset: 64)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 256, elements: !168)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !504, file: !463, line: 69, baseType: !74, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !504, file: !463, line: 72, baseType: !74, size: 64, offset: 384)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !487, file: !463, line: 107, type: !504, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "slot0", scope: !487, file: !463, line: 831, type: !516, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 256)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !463, line: 321, type: !142, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !463, line: 357, type: !142, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !463, line: 358, type: !142, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !463, line: 199, type: !162, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "quote", scope: !529, file: !463, line: 228, type: !548, isLocal: true, isDefinition: true)
!529 = distinct !DISubprogram(name: "gettext_quote", scope: !463, file: !463, line: 197, type: !530, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !487, retainedNodes: !532)
!530 = !DISubroutineType(types: !531)
!531 = !{!74, !74, !489}
!532 = !{!533, !534, !535, !536, !537}
!533 = !DILocalVariable(name: "msgid", arg: 1, scope: !529, file: !463, line: 197, type: !74)
!534 = !DILocalVariable(name: "s", arg: 2, scope: !529, file: !463, line: 197, type: !489)
!535 = !DILocalVariable(name: "translation", scope: !529, file: !463, line: 199, type: !74)
!536 = !DILocalVariable(name: "w", scope: !529, file: !463, line: 229, type: !443)
!537 = !DILocalVariable(name: "mbs", scope: !529, file: !463, line: 230, type: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !449, line: 6, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !451, line: 21, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 64, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !540, file: !451, line: 15, baseType: !117, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !540, file: !451, line: 20, baseType: !544, size: 32, offset: 32)
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !540, file: !451, line: 16, size: 32, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !544, file: !451, line: 18, baseType: !80, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !544, file: !451, line: 19, baseType: !135, size: 32)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !549)
!549 = !{!144, !137}
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "slotvec", scope: !487, file: !463, line: 834, type: !552, isLocal: true, isDefinition: true)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !463, line: 823, size: 128, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !553, file: !463, line: 825, baseType: !119, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !553, file: !463, line: 826, baseType: !124, size: 64, offset: 64)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "nslots", scope: !487, file: !463, line: 832, type: !117, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "slotvec0", scope: !487, file: !463, line: 833, type: !553, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 704, elements: !563)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!563 = !{!564}
!564 = !DISubrange(count: 11)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !567, line: 347, type: !19, isLocal: true, isDefinition: true)
!567 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !567, line: 398, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 9)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !567, line: 399, type: !142, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !567, line: 446, type: !162, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !567, line: 447, type: !41, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !581, line: 98, type: !582, isLocal: true, isDefinition: true)
!581 = !DIFile(filename: "lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 29)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !581, line: 99, type: !582, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !581, line: 100, type: !388, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !581, line: 40, type: !468, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !581, line: 40, type: !151, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !595, line: 67, type: !235, isLocal: true, isDefinition: true)
!595 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !595, line: 69, type: !162, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !595, line: 83, type: !162, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !595, line: 83, type: !135, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !595, line: 85, type: !142, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !595, line: 88, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 171)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !595, line: 88, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 34)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !595, line: 105, type: !63, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !595, line: 109, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 23)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !595, line: 113, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 28)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !595, line: 120, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 32)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !595, line: 127, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 36)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !595, line: 134, type: !186, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !595, line: 142, type: !640, isLocal: true, isDefinition: true)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 44)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !595, line: 150, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 48)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !595, line: 159, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 52)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !595, line: 170, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 60)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !595, line: 248, type: !309, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !595, line: 248, type: !211, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !595, line: 254, type: !309, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !595, line: 254, type: !19, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !595, line: 254, type: !186, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !595, line: 259, type: !3, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !595, line: 259, type: !582, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !674, file: !675, line: 26, type: !677, isLocal: false, isDefinition: true)
!674 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !676, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!676 = !{!672}
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 47)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "exit_failure", scope: !682, file: !683, line: 24, type: !685, isLocal: false, isDefinition: true)
!682 = distinct !DICompileUnit(language: DW_LANG_C11, file: !683, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !684, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!684 = !{!680}
!685 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !688, line: 34, type: !151, isLocal: true, isDefinition: true)
!688 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !688, line: 34, type: !162, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !688, line: 34, type: !58, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !695, line: 108, type: !41, isLocal: true, isDefinition: true)
!695 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "internal_state", scope: !698, file: !695, line: 97, type: !701, isLocal: true, isDefinition: true)
!698 = distinct !DICompileUnit(language: DW_LANG_C11, file: !695, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !699, globals: !700, splitDebugInlining: false, nameTableKind: None)
!699 = !{!116, !119, !122}
!700 = !{!693, !696}
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !449, line: 6, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !451, line: 21, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 64, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !703, file: !451, line: 15, baseType: !117, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !703, file: !451, line: 20, baseType: !707, size: 32, offset: 32)
!707 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !703, file: !451, line: 16, size: 32, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !707, file: !451, line: 18, baseType: !80, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !707, file: !451, line: 19, baseType: !135, size: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !713, line: 35, type: !142, isLocal: true, isDefinition: true)
!713 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !713, line: 35, type: !26, isLocal: true, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!718 = distinct !DICompileUnit(language: DW_LANG_C11, file: !567, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-readutmp.o -MD -MP -MF lib/.deps/libcoreutils_a-readutmp.Tpo -c lib/readutmp.c -o lib/.libcoreutils_a-readutmp.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !722, globals: !756, splitDebugInlining: false, nameTableKind: None)
!719 = !{!720}
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !721, line: 305, baseType: !80, size: 32, elements: !81)
!721 = !DIFile(filename: "lib/readutmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "dbf57f6f8baa17fafca98ee518780aad")
!722 = !{!116, !124, !723, !754, !119}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !726, line: 55, size: 3200, elements: !727)
!726 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!727 = !{!728, !730, !732, !733, !734, !735, !736, !741, !742, !750, !753}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !725, file: !726, line: 57, baseType: !729, size: 16)
!729 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !725, file: !726, line: 58, baseType: !731, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !287, line: 154, baseType: !117)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !725, file: !726, line: 59, baseType: !628, size: 256, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !725, file: !726, line: 61, baseType: !135, size: 32, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !725, file: !726, line: 63, baseType: !628, size: 256, offset: 352)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !725, file: !726, line: 65, baseType: !516, size: 2048, offset: 608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !725, file: !726, line: 67, baseType: !737, size: 32, offset: 2656)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !726, line: 42, size: 32, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !737, file: !726, line: 45, baseType: !729, size: 16)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !737, file: !726, line: 46, baseType: !729, size: 16, offset: 16)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !725, file: !726, line: 81, baseType: !288, size: 64, offset: 2688)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !725, file: !726, line: 82, baseType: !743, size: 128, offset: 2752)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !744, line: 8, size: 128, elements: !745)
!744 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!745 = !{!746, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !743, file: !744, line: 14, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !287, line: 160, baseType: !288)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !743, file: !744, line: 15, baseType: !749, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !287, line: 162, baseType: !288)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !725, file: !726, line: 84, baseType: !751, size: 128, offset: 2880)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 128, elements: !136)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !287, line: 41, baseType: !117)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !725, file: !726, line: 85, baseType: !309, size: 160, offset: 3008)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !755, line: 87, baseType: !288)
!755 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!756 = !{!565, !568, !573, !575, !577, !579, !585, !587, !589, !591}
!757 = distinct !DICompileUnit(language: DW_LANG_C11, file: !595, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !758, retainedTypes: !402, globals: !762, splitDebugInlining: false, nameTableKind: None)
!758 = !{!759}
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !595, line: 40, baseType: !80, size: 32, elements: !760)
!760 = !{!761}
!761 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!762 = !{!593, !596, !598, !600, !602, !604, !609, !614, !616, !621, !626, !631, !636, !638, !643, !648, !653, !658, !660, !662, !664, !666, !668, !670}
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !765, retainedTypes: !797, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!765 = !{!766, !778}
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !767, file: !764, line: 188, baseType: !80, size: 32, elements: !776)
!767 = distinct !DISubprogram(name: "x2nrealloc", scope: !764, file: !764, line: 176, type: !768, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !763, retainedNodes: !771)
!768 = !DISubroutineType(types: !769)
!769 = !{!116, !116, !770, !119}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!771 = !{!772, !773, !774, !775}
!772 = !DILocalVariable(name: "p", arg: 1, scope: !767, file: !764, line: 176, type: !116)
!773 = !DILocalVariable(name: "pn", arg: 2, scope: !767, file: !764, line: 176, type: !770)
!774 = !DILocalVariable(name: "s", arg: 3, scope: !767, file: !764, line: 176, type: !119)
!775 = !DILocalVariable(name: "n", scope: !767, file: !764, line: 178, type: !119)
!776 = !{!777}
!777 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!778 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !779, file: !764, line: 228, baseType: !80, size: 32, elements: !776)
!779 = distinct !DISubprogram(name: "xpalloc", scope: !764, file: !764, line: 223, type: !780, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !763, retainedNodes: !787)
!780 = !DISubroutineType(types: !781)
!781 = !{!116, !116, !782, !783, !785, !783}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !784, line: 130, baseType: !785)
!784 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !786, line: 18, baseType: !288)
!786 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796}
!788 = !DILocalVariable(name: "pa", arg: 1, scope: !779, file: !764, line: 223, type: !116)
!789 = !DILocalVariable(name: "pn", arg: 2, scope: !779, file: !764, line: 223, type: !782)
!790 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !779, file: !764, line: 223, type: !783)
!791 = !DILocalVariable(name: "n_max", arg: 4, scope: !779, file: !764, line: 223, type: !785)
!792 = !DILocalVariable(name: "s", arg: 5, scope: !779, file: !764, line: 223, type: !783)
!793 = !DILocalVariable(name: "n0", scope: !779, file: !764, line: 230, type: !783)
!794 = !DILocalVariable(name: "n", scope: !779, file: !764, line: 237, type: !783)
!795 = !DILocalVariable(name: "nbytes", scope: !779, file: !764, line: 248, type: !783)
!796 = !DILocalVariable(name: "adjusted_nbytes", scope: !779, file: !764, line: 252, type: !783)
!797 = !{!124, !116}
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !799, splitDebugInlining: false, nameTableKind: None)
!799 = !{!686, !689, !691}
!800 = distinct !DICompileUnit(language: DW_LANG_C11, file: !801, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fopen.o -MD -MP -MF lib/.deps/libcoreutils_a-fopen.Tpo -c lib/fopen.c -o lib/.libcoreutils_a-fopen.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!802 = distinct !DICompileUnit(language: DW_LANG_C11, file: !803, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!803 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!804 = distinct !DICompileUnit(language: DW_LANG_C11, file: !805, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!806 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!808 = distinct !DICompileUnit(language: DW_LANG_C11, file: !809, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, splitDebugInlining: false, nameTableKind: None)
!809 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!810 = distinct !DICompileUnit(language: DW_LANG_C11, file: !811, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, splitDebugInlining: false, nameTableKind: None)
!811 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !813, splitDebugInlining: false, nameTableKind: None)
!813 = !{!711, !714}
!814 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!816 = distinct !DICompileUnit(language: DW_LANG_C11, file: !817, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!818 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!819 = !{i32 7, !"Dwarf Version", i32 5}
!820 = !{i32 2, !"Debug Info Version", i32 3}
!821 = !{i32 1, !"wchar_size", i32 4}
!822 = !{i32 8, !"PIC Level", i32 2}
!823 = !{i32 7, !"PIE Level", i32 2}
!824 = !{i32 7, !"uwtable", i32 2}
!825 = !{i32 7, !"frame-pointer", i32 1}
!826 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!827 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 96, type: !828, scopeLine: 97, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !117}
!830 = !{!831}
!831 = !DILocalVariable(name: "status", arg: 1, scope: !827, file: !2, line: 96, type: !117)
!832 = !DILocation(line: 0, scope: !827)
!833 = !DILocation(line: 98, column: 14, scope: !834)
!834 = distinct !DILexicalBlock(scope: !827, file: !2, line: 98, column: 7)
!835 = !DILocation(line: 98, column: 7, scope: !827)
!836 = !DILocation(line: 99, column: 5, scope: !837)
!837 = distinct !DILexicalBlock(scope: !834, file: !2, line: 99, column: 5)
!838 = !{!839, !839, i64 0}
!839 = !{!"any pointer", !840, i64 0}
!840 = !{!"omnipotent char", !841, i64 0}
!841 = !{!"Simple C/C++ TBAA"}
!842 = !DILocation(line: 102, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !834, file: !2, line: 101, column: 5)
!844 = !DILocation(line: 103, column: 7, scope: !843)
!845 = !DILocation(line: 109, column: 7, scope: !843)
!846 = !DILocation(line: 110, column: 7, scope: !843)
!847 = !DILocalVariable(name: "program", arg: 1, scope: !848, file: !71, line: 836, type: !74)
!848 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !71, file: !71, line: 836, type: !849, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !74}
!851 = !{!847, !852, !859, !860, !862, !863}
!852 = !DILocalVariable(name: "infomap", scope: !848, file: !71, line: 838, type: !853)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 896, elements: !163)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !848, file: !71, line: 838, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !855, file: !71, line: 838, baseType: !74, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !855, file: !71, line: 838, baseType: !74, size: 64, offset: 64)
!859 = !DILocalVariable(name: "node", scope: !848, file: !71, line: 848, type: !74)
!860 = !DILocalVariable(name: "map_prog", scope: !848, file: !71, line: 849, type: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!862 = !DILocalVariable(name: "lc_messages", scope: !848, file: !71, line: 861, type: !74)
!863 = !DILocalVariable(name: "url_program", scope: !848, file: !71, line: 874, type: !74)
!864 = !DILocation(line: 0, scope: !848, inlinedAt: !865)
!865 = distinct !DILocation(line: 111, column: 7, scope: !843)
!866 = !{}
!867 = !DILocation(line: 857, column: 3, scope: !848, inlinedAt: !865)
!868 = !DILocation(line: 861, column: 29, scope: !848, inlinedAt: !865)
!869 = !DILocation(line: 862, column: 7, scope: !870, inlinedAt: !865)
!870 = distinct !DILexicalBlock(scope: !848, file: !71, line: 862, column: 7)
!871 = !DILocation(line: 862, column: 19, scope: !870, inlinedAt: !865)
!872 = !DILocation(line: 862, column: 22, scope: !870, inlinedAt: !865)
!873 = !DILocation(line: 862, column: 7, scope: !848, inlinedAt: !865)
!874 = !DILocation(line: 868, column: 7, scope: !875, inlinedAt: !865)
!875 = distinct !DILexicalBlock(scope: !870, file: !71, line: 863, column: 5)
!876 = !DILocation(line: 870, column: 5, scope: !875, inlinedAt: !865)
!877 = !DILocation(line: 875, column: 3, scope: !848, inlinedAt: !865)
!878 = !DILocation(line: 877, column: 3, scope: !848, inlinedAt: !865)
!879 = !DILocation(line: 113, column: 3, scope: !827)
!880 = !DISubprogram(name: "dcgettext", scope: !881, file: !881, line: 51, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!881 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!882 = !DISubroutineType(types: !883)
!883 = !{!124, !74, !74, !117}
!884 = !DISubprogram(name: "__fprintf_chk", scope: !885, file: !885, line: 93, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!885 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!886 = !DISubroutineType(types: !887)
!887 = !{!117, !888, !117, !889, null}
!888 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !260)
!889 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!890 = !DISubprogram(name: "__printf_chk", scope: !885, file: !885, line: 95, type: !891, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!891 = !DISubroutineType(types: !892)
!892 = !{!117, !117, !889, null}
!893 = !DILocation(line: 0, scope: !70)
!894 = !DILocation(line: 581, column: 7, scope: !245)
!895 = !{!896, !896, i64 0}
!896 = !{!"int", !840, i64 0}
!897 = !DILocation(line: 581, column: 19, scope: !245)
!898 = !DILocation(line: 581, column: 7, scope: !70)
!899 = !DILocation(line: 585, column: 26, scope: !244)
!900 = !DILocation(line: 0, scope: !244)
!901 = !DILocation(line: 586, column: 23, scope: !244)
!902 = !DILocation(line: 586, column: 28, scope: !244)
!903 = !DILocation(line: 586, column: 32, scope: !244)
!904 = !{!840, !840, i64 0}
!905 = !DILocation(line: 586, column: 38, scope: !244)
!906 = !DILocalVariable(name: "__s1", arg: 1, scope: !907, file: !908, line: 1359, type: !74)
!907 = distinct !DISubprogram(name: "streq", scope: !908, file: !908, line: 1359, type: !909, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !911)
!908 = !DIFile(filename: "./lib/string.h", directory: "/src")
!909 = !DISubroutineType(types: !910)
!910 = !{!247, !74, !74}
!911 = !{!906, !912}
!912 = !DILocalVariable(name: "__s2", arg: 2, scope: !907, file: !908, line: 1359, type: !74)
!913 = !DILocation(line: 0, scope: !907, inlinedAt: !914)
!914 = distinct !DILocation(line: 586, column: 41, scope: !244)
!915 = !DILocation(line: 1361, column: 11, scope: !907, inlinedAt: !914)
!916 = !DILocation(line: 1361, column: 10, scope: !907, inlinedAt: !914)
!917 = !DILocation(line: 586, column: 19, scope: !244)
!918 = !DILocation(line: 587, column: 5, scope: !244)
!919 = !DILocation(line: 588, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !70, file: !71, line: 588, column: 7)
!921 = !DILocation(line: 588, column: 7, scope: !70)
!922 = !DILocation(line: 590, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !920, file: !71, line: 589, column: 5)
!924 = !DILocation(line: 591, column: 7, scope: !923)
!925 = !DILocation(line: 595, column: 37, scope: !70)
!926 = !DILocation(line: 595, column: 35, scope: !70)
!927 = !DILocation(line: 596, column: 29, scope: !70)
!928 = !DILocation(line: 597, column: 8, scope: !253)
!929 = !DILocation(line: 597, column: 7, scope: !70)
!930 = !DILocation(line: 604, column: 24, scope: !252)
!931 = !DILocation(line: 604, column: 12, scope: !253)
!932 = !DILocation(line: 0, scope: !251)
!933 = !DILocation(line: 610, column: 16, scope: !251)
!934 = !DILocation(line: 610, column: 7, scope: !251)
!935 = !DILocation(line: 611, column: 21, scope: !251)
!936 = !{!937, !937, i64 0}
!937 = !{!"short", !840, i64 0}
!938 = !DILocation(line: 611, column: 19, scope: !251)
!939 = !DILocation(line: 611, column: 16, scope: !251)
!940 = !DILocation(line: 610, column: 30, scope: !251)
!941 = distinct !{!941, !934, !935, !942}
!942 = !{!"llvm.loop.mustprogress"}
!943 = !DILocation(line: 612, column: 18, scope: !944)
!944 = distinct !DILexicalBlock(scope: !251, file: !71, line: 612, column: 11)
!945 = !DILocation(line: 612, column: 11, scope: !251)
!946 = !DILocation(line: 620, column: 23, scope: !70)
!947 = !DILocation(line: 625, column: 39, scope: !70)
!948 = !DILocation(line: 626, column: 3, scope: !70)
!949 = !DILocation(line: 626, column: 10, scope: !70)
!950 = !DILocation(line: 626, column: 21, scope: !70)
!951 = !DILocation(line: 628, column: 44, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !71, line: 628, column: 11)
!953 = distinct !DILexicalBlock(scope: !70, file: !71, line: 627, column: 5)
!954 = !DILocation(line: 628, column: 32, scope: !952)
!955 = !DILocation(line: 628, column: 49, scope: !952)
!956 = !DILocation(line: 628, column: 11, scope: !953)
!957 = !DILocation(line: 630, column: 11, scope: !958)
!958 = distinct !DILexicalBlock(scope: !953, file: !71, line: 630, column: 11)
!959 = !DILocation(line: 630, column: 11, scope: !953)
!960 = !DILocation(line: 632, column: 26, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !71, line: 632, column: 15)
!962 = distinct !DILexicalBlock(scope: !958, file: !71, line: 631, column: 9)
!963 = !DILocation(line: 632, column: 34, scope: !961)
!964 = !DILocation(line: 632, column: 37, scope: !961)
!965 = !DILocation(line: 632, column: 15, scope: !962)
!966 = !DILocation(line: 640, column: 16, scope: !953)
!967 = distinct !{!967, !948, !968, !942}
!968 = !DILocation(line: 641, column: 5, scope: !70)
!969 = !DILocation(line: 644, column: 3, scope: !70)
!970 = !DILocation(line: 0, scope: !907, inlinedAt: !971)
!971 = distinct !DILocation(line: 648, column: 31, scope: !70)
!972 = !DILocation(line: 0, scope: !907, inlinedAt: !973)
!973 = distinct !DILocation(line: 649, column: 31, scope: !70)
!974 = !DILocation(line: 0, scope: !907, inlinedAt: !975)
!975 = distinct !DILocation(line: 650, column: 31, scope: !70)
!976 = !DILocation(line: 0, scope: !907, inlinedAt: !977)
!977 = distinct !DILocation(line: 651, column: 31, scope: !70)
!978 = !DILocation(line: 0, scope: !907, inlinedAt: !979)
!979 = distinct !DILocation(line: 652, column: 31, scope: !70)
!980 = !DILocation(line: 0, scope: !907, inlinedAt: !981)
!981 = distinct !DILocation(line: 653, column: 31, scope: !70)
!982 = !DILocation(line: 0, scope: !907, inlinedAt: !983)
!983 = distinct !DILocation(line: 654, column: 31, scope: !70)
!984 = !DILocation(line: 0, scope: !907, inlinedAt: !985)
!985 = distinct !DILocation(line: 655, column: 31, scope: !70)
!986 = !DILocation(line: 0, scope: !907, inlinedAt: !987)
!987 = distinct !DILocation(line: 656, column: 31, scope: !70)
!988 = !DILocation(line: 0, scope: !907, inlinedAt: !989)
!989 = distinct !DILocation(line: 657, column: 31, scope: !70)
!990 = !DILocation(line: 663, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !70, file: !71, line: 663, column: 7)
!992 = !DILocation(line: 664, column: 7, scope: !991)
!993 = !DILocation(line: 664, column: 10, scope: !991)
!994 = !DILocation(line: 663, column: 7, scope: !70)
!995 = !DILocation(line: 669, column: 7, scope: !996)
!996 = distinct !DILexicalBlock(scope: !991, file: !71, line: 665, column: 5)
!997 = !DILocation(line: 671, column: 5, scope: !996)
!998 = !DILocation(line: 676, column: 7, scope: !999)
!999 = distinct !DILexicalBlock(scope: !991, file: !71, line: 673, column: 5)
!1000 = !DILocation(line: 679, column: 3, scope: !70)
!1001 = !DILocation(line: 683, column: 3, scope: !70)
!1002 = !DILocation(line: 686, column: 3, scope: !70)
!1003 = !DILocation(line: 688, column: 3, scope: !70)
!1004 = !DILocation(line: 691, column: 3, scope: !70)
!1005 = !DILocation(line: 695, column: 3, scope: !70)
!1006 = !DILocation(line: 696, column: 1, scope: !70)
!1007 = !DISubprogram(name: "setlocale", scope: !1008, file: !1008, line: 122, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1008 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!124, !117, !74}
!1011 = !DISubprogram(name: "strncmp", scope: !1012, file: !1012, line: 159, type: !1013, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1012 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!117, !74, !74, !119}
!1015 = !DISubprogram(name: "fputs_unlocked", scope: !354, file: !354, line: 691, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!117, !889, !888}
!1018 = !DISubprogram(name: "exit", scope: !1019, file: !1019, line: 624, type: !828, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1019 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1020 = !DISubprogram(name: "getenv", scope: !1019, file: !1019, line: 641, type: !1021, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!124, !74}
!1023 = !DISubprogram(name: "strcmp", scope: !1012, file: !1012, line: 156, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!117, !74, !74}
!1026 = !DISubprogram(name: "strspn", scope: !1012, file: !1012, line: 297, type: !1027, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!121, !74, !74}
!1029 = !DISubprogram(name: "strchr", scope: !1012, file: !1012, line: 246, type: !1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!124, !74, !117}
!1032 = !DISubprogram(name: "__ctype_b_loc", scope: !87, file: !87, line: 79, type: !1033, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!1038 = !DISubprogram(name: "strcspn", scope: !1012, file: !1012, line: 293, type: !1027, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1039 = !DISubprogram(name: "fwrite_unlocked", scope: !354, file: !354, line: 704, type: !1040, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!119, !1042, !119, !119, !888}
!1042 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1045 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 117, type: !1046, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!117, !117, !123}
!1048 = !{!1049, !1050}
!1049 = !DILocalVariable(name: "argc", arg: 1, scope: !1045, file: !2, line: 117, type: !117)
!1050 = !DILocalVariable(name: "argv", arg: 2, scope: !1045, file: !2, line: 117, type: !123)
!1051 = !DILocation(line: 0, scope: !1045)
!1052 = !DILocation(line: 120, column: 21, scope: !1045)
!1053 = !DILocation(line: 120, column: 3, scope: !1045)
!1054 = !DILocation(line: 121, column: 3, scope: !1045)
!1055 = !DILocation(line: 122, column: 3, scope: !1045)
!1056 = !DILocation(line: 123, column: 3, scope: !1045)
!1057 = !DILocation(line: 125, column: 3, scope: !1045)
!1058 = !DILocation(line: 128, column: 36, scope: !1045)
!1059 = !DILocation(line: 128, column: 58, scope: !1045)
!1060 = !DILocation(line: 127, column: 3, scope: !1045)
!1061 = !DILocation(line: 131, column: 18, scope: !1045)
!1062 = !DILocation(line: 131, column: 16, scope: !1045)
!1063 = !DILocation(line: 131, column: 3, scope: !1045)
!1064 = !DILocation(line: 134, column: 7, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1045, file: !2, line: 132, column: 5)
!1066 = !DILocation(line: 135, column: 7, scope: !1065)
!1067 = !DILocation(line: 138, column: 14, scope: !1065)
!1068 = !DILocation(line: 138, column: 7, scope: !1065)
!1069 = !DILocation(line: 139, column: 7, scope: !1065)
!1070 = !DILocation(line: 142, column: 7, scope: !1065)
!1071 = !DILocation(line: 143, column: 7, scope: !1065)
!1072 = !DILocation(line: 146, column: 3, scope: !1045)
!1073 = !DISubprogram(name: "bindtextdomain", scope: !881, file: !881, line: 86, type: !1074, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!124, !74, !74}
!1076 = !DISubprogram(name: "textdomain", scope: !881, file: !881, line: 82, type: !1021, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1077 = !DISubprogram(name: "atexit", scope: !1019, file: !1019, line: 602, type: !1078, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!117, !393}
!1080 = distinct !DISubprogram(name: "users", scope: !2, file: !2, line: 82, type: !1081, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1083)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !74, !117}
!1083 = !{!1084, !1085, !1086, !1089}
!1084 = !DILocalVariable(name: "filename", arg: 1, scope: !1080, file: !2, line: 82, type: !74)
!1085 = !DILocalVariable(name: "options", arg: 2, scope: !1080, file: !2, line: 82, type: !117)
!1086 = !DILocalVariable(name: "n_users", scope: !1080, file: !2, line: 84, type: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1088, line: 130, baseType: !785)
!1088 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1089 = !DILocalVariable(name: "utmp_buf", scope: !1080, file: !2, line: 85, type: !1090)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !79, line: 92, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !79, line: 65, size: 576, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1105, !1108, !1109, !1110}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1092, file: !79, line: 69, baseType: !124, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1092, file: !79, line: 70, baseType: !124, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1092, file: !79, line: 71, baseType: !124, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1092, file: !79, line: 72, baseType: !124, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !1092, file: !79, line: 74, baseType: !1099, size: 128, offset: 256)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1100, line: 11, size: 128, elements: !1101)
!1100 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1099, file: !1100, line: 16, baseType: !747, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1099, file: !1100, line: 21, baseType: !1104, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !287, line: 197, baseType: !288)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1092, file: !79, line: 75, baseType: !1106, size: 32, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1107, line: 97, baseType: !731)
!1107 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1092, file: !79, line: 76, baseType: !1106, size: 32, offset: 416)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1092, file: !79, line: 77, baseType: !729, size: 16, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1092, file: !79, line: 79, baseType: !1111, size: 64, offset: 480)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1092, file: !79, line: 79, size: 64, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1111, file: !79, line: 79, baseType: !117, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1111, file: !79, line: 79, baseType: !117, size: 32, offset: 32)
!1115 = distinct !DIAssignID()
!1116 = !DILocation(line: 0, scope: !1080)
!1117 = distinct !DIAssignID()
!1118 = !DILocation(line: 84, column: 3, scope: !1080)
!1119 = !DILocation(line: 85, column: 3, scope: !1080)
!1120 = !DILocation(line: 86, column: 11, scope: !1080)
!1121 = !DILocation(line: 87, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1080, file: !2, line: 87, column: 7)
!1123 = !DILocation(line: 87, column: 58, scope: !1122)
!1124 = !DILocation(line: 87, column: 7, scope: !1080)
!1125 = !DILocation(line: 88, column: 5, scope: !1122)
!1126 = !DILocation(line: 90, column: 23, scope: !1080)
!1127 = !{!1128, !1128, i64 0}
!1128 = !{!"long", !840, i64 0}
!1129 = !DILocation(line: 90, column: 32, scope: !1080)
!1130 = !DILocalVariable(name: "n", arg: 1, scope: !1131, file: !2, line: 45, type: !1087)
!1131 = distinct !DISubprogram(name: "list_entries_users", scope: !2, file: !2, line: 45, type: !1132, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1136)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !1087, !1134}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1136 = !{!1130, !1137, !1138, !1139, !1140, !1144, !1146, !1149}
!1137 = !DILocalVariable(name: "this", arg: 2, scope: !1131, file: !2, line: 45, type: !1134)
!1138 = !DILocalVariable(name: "u", scope: !1131, file: !2, line: 47, type: !123)
!1139 = !DILocalVariable(name: "n_entries", scope: !1131, file: !2, line: 48, type: !1087)
!1140 = !DILocalVariable(name: "trimmed_name", scope: !1141, file: !2, line: 54, type: !124)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !2, line: 53, column: 9)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !2, line: 52, column: 11)
