; ModuleID = 'src/wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__mbstate_t = type { i32, %union.anon.2 }
%union.anon.2 = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.Tokens = type { i64, ptr, ptr, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, ptr, ptr, ptr, ptr, %union.anon, i64, %union.anon.0, %union.anon.0, ptr, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.fstatus = type { i32, %struct.stat }
%struct.wc_lines = type { i32, i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.argv_iterator = type { ptr, i64, ptr, i64, ptr, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct._obstack_chunk = type { ptr, ptr, [0 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 814, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 16)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 6)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 848, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 11)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !175, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 880, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 17)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 4)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 52)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 886, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 890, type: !217, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 27)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 906, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 31)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "stdin_only", scope: !234, file: !2, line: 921, type: !425, isLocal: true, isDefinition: true)
!234 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 792, type: !235, scopeLine: 793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !238)
!235 = !DISubroutineType(types: !236)
!236 = !{!101, !101, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!238 = !{!239, !240, !241, !242, !248, !249, !250, !293, !353, !356, !359, !361, !364, !416, !417, !418, !419, !420, !422}
!239 = !DILocalVariable(name: "argc", arg: 1, scope: !234, file: !2, line: 792, type: !101)
!240 = !DILocalVariable(name: "argv", arg: 2, scope: !234, file: !2, line: 792, type: !237)
!241 = !DILocalVariable(name: "optc", scope: !234, file: !2, line: 794, type: !101)
!242 = !DILocalVariable(name: "nfiles", scope: !234, file: !2, line: 795, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !244, line: 130, baseType: !245)
!244 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !246, line: 18, baseType: !247)
!246 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!247 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!248 = !DILocalVariable(name: "files", scope: !234, file: !2, line: 796, type: !237)
!249 = !DILocalVariable(name: "files_from", scope: !234, file: !2, line: 797, type: !164)
!250 = !DILocalVariable(name: "fstatus", scope: !234, file: !2, line: 798, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !2, line: 85, size: 1088, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !252, file: !2, line: 89, baseType: !101, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !252, file: !2, line: 92, baseType: !256, size: 1024, offset: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !257, line: 44, size: 1024, elements: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!258 = !{!259, !262, !264, !266, !268, !270, !272, !273, !274, !276, !278, !279, !281, !289, !290, !291}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !256, file: !257, line: 46, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !261, line: 145, baseType: !168)
!261 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !256, file: !257, line: 47, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !261, line: 148, baseType: !168)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !256, file: !257, line: 48, baseType: !265, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !261, line: 150, baseType: !94)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !256, file: !257, line: 49, baseType: !267, size: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !261, line: 151, baseType: !94)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !256, file: !257, line: 50, baseType: !269, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !261, line: 146, baseType: !94)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !256, file: !257, line: 51, baseType: !271, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !261, line: 147, baseType: !94)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !256, file: !257, line: 52, baseType: !260, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !256, file: !257, line: 53, baseType: !260, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !256, file: !257, line: 54, baseType: !275, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !261, line: 152, baseType: !247)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !256, file: !257, line: 55, baseType: !277, size: 32, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !261, line: 175, baseType: !101)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !256, file: !257, line: 56, baseType: !101, size: 32, offset: 480)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !256, file: !257, line: 57, baseType: !280, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !261, line: 180, baseType: !247)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !256, file: !257, line: 65, baseType: !282, size: 128, offset: 576)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !283, line: 11, size: 128, elements: !284)
!283 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!284 = !{!285, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !282, file: !283, line: 16, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !261, line: 160, baseType: !247)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !282, file: !283, line: 21, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !261, line: 197, baseType: !247)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !256, file: !257, line: 66, baseType: !282, size: 128, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !256, file: !257, line: 67, baseType: !282, size: 128, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !256, file: !257, line: 79, baseType: !292, size: 64, offset: 960)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !218)
!293 = !DILocalVariable(name: "tok", scope: !234, file: !2, line: 799, type: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !295, line: 32, size: 2304, elements: !296)
!295 = !DIFile(filename: "./lib/readtokens0.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bcc2e7cb98b6844cbfd13d7bab31a60d")
!296 = !{!297, !298, !299, !301, !351, !352}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !294, file: !295, line: 34, baseType: !166, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !294, file: !295, line: 35, baseType: !237, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !294, file: !295, line: 36, baseType: !300, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !294, file: !295, line: 37, baseType: !302, size: 704, offset: 192)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !303, line: 210, size: 704, elements: !304)
!303 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!304 = !{!305, !306, !316, !317, !318, !319, !324, !325, !336, !347, !348, !349, !350}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !302, file: !303, line: 212, baseType: !166, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !302, file: !303, line: 213, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !303, line: 203, size: 128, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !308, file: !303, line: 205, baseType: !164, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !308, file: !303, line: 206, baseType: !307, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !308, file: !303, line: 207, baseType: !313, offset: 128)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: -1)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !302, file: !303, line: 214, baseType: !164, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !302, file: !303, line: 215, baseType: !164, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !302, file: !303, line: 216, baseType: !164, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !302, file: !303, line: 221, baseType: !320, size: 64, offset: 320)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !303, line: 217, size: 64, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !320, file: !303, line: 219, baseType: !166, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !320, file: !303, line: 220, baseType: !161, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !302, file: !303, line: 222, baseType: !166, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !302, file: !303, line: 229, baseType: !326, size: 64, offset: 448)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !303, line: 225, size: 64, elements: !327)
!327 = !{!328, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !326, file: !303, line: 227, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!161, !166}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !326, file: !303, line: 228, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!161, !161, !166}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !302, file: !303, line: 234, baseType: !337, size: 64, offset: 512)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !303, line: 230, size: 64, elements: !338)
!338 = !{!339, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !337, file: !303, line: 232, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !161}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !337, file: !303, line: 233, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !161, !161}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !302, file: !303, line: 236, baseType: !161, size: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !302, file: !303, line: 237, baseType: !94, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !302, file: !303, line: 238, baseType: !94, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !302, file: !303, line: 242, baseType: !94, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !294, file: !295, line: 38, baseType: !302, size: 704, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !294, file: !295, line: 39, baseType: !302, size: 704, offset: 1600)
!353 = !DILocalVariable(name: "i", scope: !354, file: !2, line: 864, type: !101)
!354 = distinct !DILexicalBlock(scope: !355, file: !2, line: 864, column: 5)
!355 = distinct !DILexicalBlock(scope: !234, file: !2, line: 863, column: 7)
!356 = !DILocalVariable(name: "i", scope: !357, file: !2, line: 867, type: !101)
!357 = distinct !DILexicalBlock(scope: !358, file: !2, line: 867, column: 5)
!358 = distinct !DILexicalBlock(scope: !234, file: !2, line: 866, column: 7)
!359 = !DILocalVariable(name: "read_tokens", scope: !234, file: !2, line: 870, type: !360)
!360 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!361 = !DILocalVariable(name: "ai", scope: !234, file: !2, line: 871, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !141, line: 32, flags: DIFlagFwdDecl)
!364 = !DILocalVariable(name: "stream", scope: !365, file: !2, line: 874, type: !367)
!365 = distinct !DILexicalBlock(scope: !366, file: !2, line: 873, column: 5)
!366 = distinct !DILexicalBlock(scope: !234, file: !2, line: 872, column: 7)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !369, line: 7, baseType: !370)
!369 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !371, line: 49, size: 1728, elements: !372)
!371 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !388, !390, !391, !392, !393, !394, !396, !397, !400, !402, !405, !408, !409, !410, !411, !412}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !370, file: !371, line: 51, baseType: !101, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !370, file: !371, line: 54, baseType: !164, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !370, file: !371, line: 55, baseType: !164, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !370, file: !371, line: 56, baseType: !164, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !370, file: !371, line: 57, baseType: !164, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !370, file: !371, line: 58, baseType: !164, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !370, file: !371, line: 59, baseType: !164, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !370, file: !371, line: 60, baseType: !164, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !370, file: !371, line: 61, baseType: !164, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !370, file: !371, line: 64, baseType: !164, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !370, file: !371, line: 65, baseType: !164, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !370, file: !371, line: 66, baseType: !164, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !370, file: !371, line: 68, baseType: !386, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !371, line: 36, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !370, file: !371, line: 70, baseType: !389, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !370, file: !371, line: 72, baseType: !101, size: 32, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !370, file: !371, line: 73, baseType: !101, size: 32, offset: 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !370, file: !371, line: 74, baseType: !275, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !370, file: !371, line: 77, baseType: !165, size: 16, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !370, file: !371, line: 78, baseType: !395, size: 8, offset: 1040)
!395 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !370, file: !371, line: 79, baseType: !76, size: 8, offset: 1048)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !370, file: !371, line: 81, baseType: !398, size: 64, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !371, line: 43, baseType: null)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !370, file: !371, line: 89, baseType: !401, size: 64, offset: 1152)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !261, line: 153, baseType: !247)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !370, file: !371, line: 91, baseType: !403, size: 64, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !371, line: 37, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !370, file: !371, line: 92, baseType: !406, size: 64, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !371, line: 38, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !370, file: !371, line: 93, baseType: !389, size: 64, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !370, file: !371, line: 94, baseType: !161, size: 64, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !370, file: !371, line: 95, baseType: !166, size: 64, offset: 1472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !370, file: !371, line: 96, baseType: !101, size: 32, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !370, file: !371, line: 98, baseType: !413, size: 160, offset: 1568)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 20)
!416 = !DILocalVariable(name: "st", scope: !365, file: !2, line: 898, type: !256)
!417 = !DILocalVariable(name: "ok", scope: !234, file: !2, line: 936, type: !360)
!418 = !DILocalVariable(name: "ai_err", scope: !234, file: !2, line: 937, type: !140)
!419 = !DILocalVariable(name: "file_name", scope: !234, file: !2, line: 938, type: !164)
!420 = !DILocalVariable(name: "i", scope: !421, file: !2, line: 939, type: !101)
!421 = distinct !DILexicalBlock(scope: !234, file: !2, line: 939, column: 3)
!422 = !DILocalVariable(name: "skip_file", scope: !423, file: !2, line: 941, type: !360)
!423 = distinct !DILexicalBlock(scope: !424, file: !2, line: 940, column: 5)
!424 = distinct !DILexicalBlock(scope: !421, file: !2, line: 939, column: 3)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !77)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 946, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 72)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !24, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 30)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !195, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !2, line: 985, type: !442, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 15)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 12)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1017, type: !447, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1023, type: !202, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1029, type: !447, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !180, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "wc_isprint", scope: !91, file: !2, line: 51, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 2048, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 256)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "wc_isspace", scope: !91, file: !2, line: 52, type: !460, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "debug", scope: !91, file: !2, line: 54, type: !360, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "total_lines", scope: !91, file: !2, line: 58, type: !469, isLocal: true, isDefinition: true)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !470, line: 102, baseType: !471)
!470 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !261, line: 73, baseType: !168)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "total_words", scope: !91, file: !2, line: 59, type: !469, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "total_chars", scope: !91, file: !2, line: 60, type: !469, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "total_bytes", scope: !91, file: !2, line: 61, type: !469, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "total_lines_overflow", scope: !91, file: !2, line: 62, type: !360, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "total_words_overflow", scope: !91, file: !2, line: 63, type: !360, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "total_chars_overflow", scope: !91, file: !2, line: 64, type: !360, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "total_bytes_overflow", scope: !91, file: !2, line: 65, type: !360, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "max_line_length", scope: !91, file: !2, line: 66, type: !488, isLocal: true, isDefinition: true)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !470, line: 101, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !261, line: 72, baseType: !247)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "print_lines", scope: !91, file: !2, line: 69, type: !360, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "print_words", scope: !91, file: !2, line: 69, type: !360, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "print_chars", scope: !91, file: !2, line: 69, type: !360, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "print_bytes", scope: !91, file: !2, line: 69, type: !360, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "print_linelength", scope: !91, file: !2, line: 70, type: !360, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "number_width", scope: !91, file: !2, line: 73, type: !101, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !91, file: !2, line: 76, type: !360, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !91, file: !2, line: 82, type: !360, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !100, line: 729, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 56)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !513, file: !100, line: 575, type: !101, isLocal: true, isDefinition: true)
!513 = distinct !DISubprogram(name: "oputs_", scope: !100, file: !100, line: 573, type: !514, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !516)
!514 = !DISubroutineType(cc: DW_CC_nocall, types: !515)
!515 = !{null, !169, !169}
!516 = !{!517, !518, !519, !522, !523, !524, !525, !529, !530, !531, !532, !534, !535, !536, !537, !539, !540}
!517 = !DILocalVariable(name: "program", arg: 1, scope: !513, file: !100, line: 573, type: !169)
!518 = !DILocalVariable(name: "option", arg: 2, scope: !513, file: !100, line: 573, type: !169)
!519 = !DILocalVariable(name: "term", scope: !520, file: !100, line: 585, type: !169)
!520 = distinct !DILexicalBlock(scope: !521, file: !100, line: 582, column: 5)
!521 = distinct !DILexicalBlock(scope: !513, file: !100, line: 581, column: 7)
!522 = !DILocalVariable(name: "double_space", scope: !513, file: !100, line: 594, type: !360)
!523 = !DILocalVariable(name: "first_word", scope: !513, file: !100, line: 595, type: !169)
!524 = !DILocalVariable(name: "option_text", scope: !513, file: !100, line: 596, type: !169)
!525 = !DILocalVariable(name: "s", scope: !526, file: !100, line: 608, type: !169)
!526 = distinct !DILexicalBlock(scope: !527, file: !100, line: 605, column: 5)
!527 = distinct !DILexicalBlock(scope: !528, file: !100, line: 604, column: 12)
!528 = distinct !DILexicalBlock(scope: !513, file: !100, line: 597, column: 7)
!529 = !DILocalVariable(name: "spaces", scope: !526, file: !100, line: 609, type: !166)
!530 = !DILocalVariable(name: "anchor_len", scope: !513, file: !100, line: 620, type: !166)
!531 = !DILocalVariable(name: "desc_text", scope: !513, file: !100, line: 625, type: !169)
!532 = !DILocalVariable(name: "__ptr", scope: !533, file: !100, line: 644, type: !169)
!533 = distinct !DILexicalBlock(scope: !513, file: !100, line: 644, column: 3)
!534 = !DILocalVariable(name: "__stream", scope: !533, file: !100, line: 644, type: !367)
!535 = !DILocalVariable(name: "__cnt", scope: !533, file: !100, line: 644, type: !166)
!536 = !DILocalVariable(name: "url_program", scope: !513, file: !100, line: 648, type: !169)
!537 = !DILocalVariable(name: "__ptr", scope: !538, file: !100, line: 686, type: !169)
!538 = distinct !DILexicalBlock(scope: !513, file: !100, line: 686, column: 3)
!539 = !DILocalVariable(name: "__stream", scope: !538, file: !100, line: 686, type: !367)
!540 = !DILocalVariable(name: "__cnt", scope: !538, file: !100, line: 686, type: !166)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !100, line: 585, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 5)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !100, line: 586, type: !543, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !100, line: 595, type: !207, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !100, line: 620, type: !180, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !217, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !543, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !207, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !24, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !100, line: 650, type: !543, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !180, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !180, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !100, line: 652, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 7)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !100, line: 653, type: !185, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !100, line: 654, type: !81, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !100, line: 655, type: !81, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !100, line: 656, type: !81, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !100, line: 657, type: !81, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !100, line: 663, type: !568, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !100, line: 664, type: !81, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !202, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 40)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !442, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 61)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !100, line: 679, type: !24, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !100, line: 683, type: !543, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !100, line: 688, type: !543, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !100, line: 691, type: !185, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !100, line: 839, type: !175, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !100, line: 840, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 22)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !100, line: 841, type: !442, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !100, line: 862, type: !207, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !100, line: 868, type: !9, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !100, line: 875, type: !224, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !34, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !447, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !180, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !180, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !180, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !180, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !180, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !447, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !175, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !543, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !185, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "longopts", scope: !91, file: !2, line: 104, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 2816, elements: !196)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !649, line: 50, size: 256, elements: !650)
!649 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!650 = !{!651, !652, !653, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !648, file: !649, line: 52, baseType: !169, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !648, file: !649, line: 55, baseType: !101, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !648, file: !649, line: 56, baseType: !654, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !648, file: !649, line: 57, baseType: !101, size: 32, offset: 192)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "total_types", scope: !91, file: !2, line: 130, type: !658, isLocal: true, isDefinition: true)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 128, elements: !208)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !543, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !568, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !543, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !180, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "total_args", scope: !91, file: !2, line: 126, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 320, elements: !544)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "total_mode", scope: !91, file: !2, line: 135, type: !134, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !2, line: 378, type: !442, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "use_neon", scope: !678, file: !2, line: 322, type: !395, isLocal: true, isDefinition: true)
!678 = distinct !DISubprogram(name: "wc_lines", scope: !2, file: !2, line: 305, type: !679, scopeLine: 306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !687)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !101}
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wc_lines", file: !682, line: 2, size: 192, elements: !683)
!682 = !DIFile(filename: "src/wc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f73f6c91eb8849cde32b7f2c7fc10330")
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !681, file: !682, line: 2, baseType: !101, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !681, file: !682, line: 2, baseType: !488, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !681, file: !682, line: 2, baseType: !488, size: 64, offset: 128)
!687 = !{!688, !689, !690, !691, !692, !697, !701, !702, !703, !707}
!688 = !DILocalVariable(name: "fd", arg: 1, scope: !678, file: !2, line: 305, type: !101)
!689 = !DILocalVariable(name: "lines", scope: !678, file: !2, line: 329, type: !488)
!690 = !DILocalVariable(name: "bytes", scope: !678, file: !2, line: 329, type: !488)
!691 = !DILocalVariable(name: "long_lines", scope: !678, file: !2, line: 330, type: !360)
!692 = !DILocalVariable(name: "buf", scope: !693, file: !2, line: 334, type: !694)
!693 = distinct !DILexicalBlock(scope: !678, file: !2, line: 333, column: 5)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097160, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 262145)
!697 = !DILocalVariable(name: "bytes_read", scope: !693, file: !2, line: 335, type: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !699, line: 77, baseType: !700)
!699 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !261, line: 194, baseType: !247)
!701 = !DILocalVariable(name: "end", scope: !693, file: !2, line: 340, type: !164)
!702 = !DILocalVariable(name: "buflines", scope: !693, file: !2, line: 341, type: !243)
!703 = !DILocalVariable(name: "p", scope: !704, file: !2, line: 346, type: !164)
!704 = distinct !DILexicalBlock(scope: !705, file: !2, line: 346, column: 11)
!705 = distinct !DILexicalBlock(scope: !706, file: !2, line: 344, column: 9)
!706 = distinct !DILexicalBlock(scope: !693, file: !2, line: 343, column: 11)
!707 = !DILocalVariable(name: "p", scope: !708, file: !2, line: 353, type: !164)
!708 = distinct !DILexicalBlock(scope: !709, file: !2, line: 353, column: 11)
!709 = distinct !DILexicalBlock(scope: !706, file: !2, line: 350, column: 9)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !180, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 28)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 26)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !724, line: 68, type: !207, isLocal: true, isDefinition: true)
!724 = !DIFile(filename: "./lib/cpu-supports.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9be339edc1bd703a3f96b2a763524c18")
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !724, line: 68, type: !543, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !724, line: 69, type: !543, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !724, line: 69, type: !180, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !724, line: 70, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 9)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !724, line: 70, type: !81, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !724, line: 71, type: !185, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !724, line: 71, type: !733, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !724, line: 72, type: !568, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !724, line: 72, type: !195, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !724, line: 73, type: !195, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !724, line: 73, type: !447, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !724, line: 75, type: !568, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !724, line: 76, type: !180, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !724, line: 76, type: !568, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !758, file: !2, line: 268, type: !773, isLocal: true, isDefinition: true)
!758 = distinct !DISubprogram(name: "write_counts", scope: !2, file: !2, line: 261, type: !759, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !761)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !469, !469, !469, !469, !488, !169}
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769}
!762 = !DILocalVariable(name: "lines", arg: 1, scope: !758, file: !2, line: 261, type: !469)
!763 = !DILocalVariable(name: "words", arg: 2, scope: !758, file: !2, line: 262, type: !469)
!764 = !DILocalVariable(name: "chars", arg: 3, scope: !758, file: !2, line: 263, type: !469)
!765 = !DILocalVariable(name: "bytes", arg: 4, scope: !758, file: !2, line: 264, type: !469)
!766 = !DILocalVariable(name: "linelength", arg: 5, scope: !758, file: !2, line: 265, type: !488)
!767 = !DILocalVariable(name: "file", arg: 6, scope: !758, file: !2, line: 266, type: !169)
!768 = !DILocalVariable(name: "format_int", scope: !758, file: !2, line: 269, type: !169)
!769 = !DILocalVariable(name: "buf", scope: !758, file: !2, line: 270, type: !770)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 21)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 40, elements: !544)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !207, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !100, line: 952, type: !447, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!779 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!780 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!781 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!782 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!783 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!784 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !787, line: 3, type: !442, isLocal: true, isDefinition: true)
!787 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "Version", scope: !790, file: !787, line: 3, type: !169, isLocal: false, isDefinition: true)
!790 = distinct !DICompileUnit(language: DW_LANG_C11, file: !787, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !791, splitDebugInlining: false, nameTableKind: None)
!791 = !{!785, !788}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !794, file: !795, line: 65, type: !816, isLocal: false, isDefinition: true)
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !795, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-argmatch.o -MD -MP -MF lib/.deps/libcoreutils_a-argmatch.Tpo -c lib/argmatch.c -o lib/.libcoreutils_a-argmatch.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !796, retainedTypes: !799, globals: !800, splitDebugInlining: false, nameTableKind: None)
!795 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!796 = !{!797}
!797 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !798, line: 42, baseType: !94, size: 32, elements: !122)
!798 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!799 = !{!161, !169, !171}
!800 = !{!792, !801, !803, !805, !810, !812, !814}
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !795, line: 141, type: !568, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !795, line: 141, type: !224, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !795, line: 142, type: !807, isLocal: true, isDefinition: true)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 29)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !795, line: 160, type: !770, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !795, line: 165, type: !185, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !795, line: 170, type: !543, isLocal: true, isDefinition: true)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !817, line: 69, baseType: !818)
!817 = !DIFile(filename: "lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null}
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "file_name", scope: !823, file: !824, line: 45, type: !169, isLocal: true, isDefinition: true)
!823 = distinct !DICompileUnit(language: DW_LANG_C11, file: !824, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !825, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!825 = !{!826, !828, !830, !832, !821, !834}
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !824, line: 121, type: !568, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !824, line: 121, type: !447, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !824, line: 123, type: !568, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !824, line: 126, type: !24, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !823, file: !824, line: 55, type: !360, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !838, file: !839, line: 25, type: !360, isLocal: false, isDefinition: true)
!838 = distinct !DICompileUnit(language: DW_LANG_C11, file: !839, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-cpu-supports.o -MD -MP -MF lib/.deps/libcoreutils_a-cpu-supports.Tpo -c lib/cpu-supports.c -o lib/.libcoreutils_a-cpu-supports.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !840, splitDebugInlining: false, nameTableKind: None)
!839 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!840 = !{!836, !841, !856, !858, !863}
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "hwcaps", scope: !843, file: !839, line: 45, type: !169, isLocal: true, isDefinition: true)
!843 = distinct !DISubprogram(name: "hwcap_allowed", scope: !839, file: !839, line: 28, type: !844, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !838, retainedNodes: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{!360, !169}
!846 = !{!847, !848, !853, !854, !855}
!847 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !843, file: !839, line: 28, type: !169)
!848 = !DILocalVariable(name: "tunables_start", scope: !849, file: !839, line: 50, type: !169)
!849 = distinct !DILexicalBlock(scope: !850, file: !839, line: 49, column: 9)
!850 = distinct !DILexicalBlock(scope: !851, file: !839, line: 48, column: 11)
!851 = distinct !DILexicalBlock(scope: !852, file: !839, line: 47, column: 5)
!852 = distinct !DILexicalBlock(scope: !843, file: !839, line: 46, column: 7)
!853 = !DILocalVariable(name: "last_hwcaps", scope: !849, file: !839, line: 51, type: !169)
!854 = !DILocalVariable(name: "sentinel", scope: !843, file: !839, line: 67, type: !169)
!855 = !DILocalVariable(name: "cap", scope: !843, file: !839, line: 70, type: !169)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !839, line: 48, type: !442, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !839, line: 52, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 18)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !839, line: 55, type: !76, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !867, file: !868, line: 66, type: !818, isLocal: false, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C11, file: !868, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !869, globals: !870, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!869 = !{!161, !171}
!870 = !{!871, !873, !896, !898, !900, !902, !865, !904, !906, !908, !910, !912}
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !868, line: 272, type: !543, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "old_file_name", scope: !875, file: !868, line: 304, type: !169, isLocal: true, isDefinition: true)
!875 = distinct !DISubprogram(name: "verror_at_line", scope: !868, file: !868, line: 298, type: !876, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !867, retainedNodes: !889)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !101, !101, !169, !94, !169, !878}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !699, line: 52, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !880, line: 12, baseType: !881)
!880 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !868, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !883)
!883 = !{!884, !885, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !882, file: !868, baseType: !161, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !882, file: !868, baseType: !161, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !882, file: !868, baseType: !161, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !882, file: !868, baseType: !101, size: 32, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !882, file: !868, baseType: !101, size: 32, offset: 224)
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DILocalVariable(name: "status", arg: 1, scope: !875, file: !868, line: 298, type: !101)
!891 = !DILocalVariable(name: "errnum", arg: 2, scope: !875, file: !868, line: 298, type: !101)
!892 = !DILocalVariable(name: "file_name", arg: 3, scope: !875, file: !868, line: 298, type: !169)
!893 = !DILocalVariable(name: "line_number", arg: 4, scope: !875, file: !868, line: 298, type: !94)
!894 = !DILocalVariable(name: "message", arg: 5, scope: !875, file: !868, line: 298, type: !169)
!895 = !DILocalVariable(name: "args", arg: 6, scope: !875, file: !868, line: 298, type: !878)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "old_line_number", scope: !875, file: !868, line: 305, type: !94, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !868, line: 338, type: !207, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !868, line: 346, type: !185, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !868, line: 346, type: !217, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "error_message_count", scope: !867, file: !868, line: 69, type: !94, isLocal: false, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !867, file: !868, line: 295, type: !101, isLocal: false, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !868, line: 208, type: !568, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !868, line: 208, type: !770, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !868, line: 214, type: !543, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !916, line: 108, type: !76, isLocal: true, isDefinition: true)
!916 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "internal_state", scope: !919, file: !916, line: 97, type: !922, isLocal: true, isDefinition: true)
!919 = distinct !DICompileUnit(language: DW_LANG_C11, file: !916, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !920, globals: !921, splitDebugInlining: false, nameTableKind: None)
!920 = !{!161, !166, !171}
!921 = !{!914, !917}
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !923, line: 6, baseType: !924)
!923 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !925, line: 21, baseType: !926)
!925 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !925, line: 13, size: 64, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !926, file: !925, line: 15, baseType: !101, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !926, file: !925, line: 20, baseType: !930, size: 32, offset: 32)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !926, file: !925, line: 16, size: 32, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !930, file: !925, line: 18, baseType: !94, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !930, file: !925, line: 19, baseType: !207, size: 32)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !936, line: 182, type: !190, isLocal: true, isDefinition: true)
!936 = !DIFile(filename: "lib/physmem.c", directory: "/src", checksumkind: CSK_MD5, checksum: "df355a32f7975afeeeba505b6287e039")
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !936, line: 205, type: !202, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !936, line: 209, type: !86, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "program_name", scope: !943, file: !944, line: 31, type: !169, isLocal: false, isDefinition: true)
!943 = distinct !DICompileUnit(language: DW_LANG_C11, file: !944, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !945, globals: !946, splitDebugInlining: false, nameTableKind: None)
!944 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!945 = !{!161, !164}
!946 = !{!941, !947, !949}
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !944, line: 46, type: !185, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !944, line: 49, type: !207, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "utf07FF", scope: !953, file: !954, line: 46, type: !979, isLocal: true, isDefinition: true)
!953 = distinct !DISubprogram(name: "proper_name_lite", scope: !954, file: !954, line: 38, type: !955, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !957, retainedNodes: !959)
!954 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!955 = !DISubroutineType(types: !956)
!956 = !{!169, !169, !169}
!957 = distinct !DICompileUnit(language: DW_LANG_C11, file: !954, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !958, splitDebugInlining: false, nameTableKind: None)
!958 = !{!951}
!959 = !{!960, !961, !962, !963, !968}
!960 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !953, file: !954, line: 38, type: !169)
!961 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !953, file: !954, line: 38, type: !169)
!962 = !DILocalVariable(name: "translation", scope: !953, file: !954, line: 40, type: !169)
!963 = !DILocalVariable(name: "w", scope: !953, file: !954, line: 47, type: !964)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !965, line: 37, baseType: !966)
!965 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !261, line: 57, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !261, line: 42, baseType: !94)
!968 = !DILocalVariable(name: "mbs", scope: !953, file: !954, line: 48, type: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !923, line: 6, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !925, line: 21, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !925, line: 13, size: 64, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !971, file: !925, line: 15, baseType: !101, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !971, file: !925, line: 20, baseType: !975, size: 32, offset: 32)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !971, file: !925, line: 16, size: 32, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !975, file: !925, line: 18, baseType: !94, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !975, file: !925, line: 19, baseType: !207, size: 32)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 16, elements: !218)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !982, line: 78, type: !185, isLocal: true, isDefinition: true)
!982 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !982, line: 79, type: !180, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !982, line: 80, type: !987, isLocal: true, isDefinition: true)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 13)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !982, line: 81, type: !987, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !982, line: 82, type: !413, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !982, line: 83, type: !217, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !982, line: 84, type: !185, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !982, line: 85, type: !568, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !982, line: 86, type: !568, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !982, line: 87, type: !185, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1006, file: !982, line: 76, type: !1076, isLocal: false, isDefinition: true)
!1006 = distinct !DICompileUnit(language: DW_LANG_C11, file: !982, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !1007, retainedTypes: !1013, globals: !1014, splitDebugInlining: false, nameTableKind: None)
!1007 = !{!797, !1008, !105}
!1008 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !798, line: 254, baseType: !94, size: 32, elements: !1009)
!1009 = !{!1010, !1011, !1012}
!1010 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1011 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1012 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1013 = !{!161, !101, !165, !166}
!1014 = !{!980, !983, !985, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1015, !1019, !1029, !1031, !1034, !1036, !1038, !1040, !1042, !1065, !1072, !1074}
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1006, file: !982, line: 92, type: !1017, isLocal: false, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 320, elements: !82)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1006, file: !982, line: 1040, type: !1021, isLocal: false, isDefinition: true)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !982, line: 56, size: 448, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1027, !1028}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1021, file: !982, line: 59, baseType: !797, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1021, file: !982, line: 62, baseType: !101, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1021, file: !982, line: 66, baseType: !1026, size: 256, offset: 64)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !186)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1021, file: !982, line: 69, baseType: !169, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1021, file: !982, line: 72, baseType: !169, size: 64, offset: 384)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1006, file: !982, line: 107, type: !1021, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "slot0", scope: !1006, file: !982, line: 831, type: !1033, isLocal: true, isDefinition: true)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !461)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !982, line: 321, type: !217, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !982, line: 357, type: !217, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !982, line: 358, type: !217, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !982, line: 199, type: !568, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "quote", scope: !1044, file: !982, line: 228, type: !1063, isLocal: true, isDefinition: true)
!1044 = distinct !DISubprogram(name: "gettext_quote", scope: !982, file: !982, line: 197, type: !1045, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1006, retainedNodes: !1047)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!169, !169, !797}
!1047 = !{!1048, !1049, !1050, !1051, !1052}
!1048 = !DILocalVariable(name: "msgid", arg: 1, scope: !1044, file: !982, line: 197, type: !169)
!1049 = !DILocalVariable(name: "s", arg: 2, scope: !1044, file: !982, line: 197, type: !797)
!1050 = !DILocalVariable(name: "translation", scope: !1044, file: !982, line: 199, type: !169)
!1051 = !DILocalVariable(name: "w", scope: !1044, file: !982, line: 229, type: !964)
!1052 = !DILocalVariable(name: "mbs", scope: !1044, file: !982, line: 230, type: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !923, line: 6, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !925, line: 21, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !925, line: 13, size: 64, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1055, file: !925, line: 15, baseType: !101, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1055, file: !925, line: 20, baseType: !1059, size: 32, offset: 32)
!1059 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1055, file: !925, line: 16, size: 32, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1059, file: !925, line: 18, baseType: !94, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1059, file: !925, line: 19, baseType: !207, size: 32)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !1064)
!1064 = !{!219, !209}
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(name: "slotvec", scope: !1006, file: !982, line: 834, type: !1067, isLocal: true, isDefinition: true)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !982, line: 823, size: 128, elements: !1069)
!1069 = !{!1070, !1071}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1068, file: !982, line: 825, baseType: !166, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1068, file: !982, line: 826, baseType: !164, size: 64, offset: 64)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "nslots", scope: !1006, file: !982, line: 832, type: !101, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1006, file: !982, line: 833, type: !1068, isLocal: true, isDefinition: true)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 704, elements: !196)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 67, type: !447, isLocal: true, isDefinition: true)
!1079 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 69, type: !568, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 83, type: !568, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 83, type: !207, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 85, type: !217, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 88, type: !1090, isLocal: true, isDefinition: true)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1091)
!1091 = !{!1092}
!1092 = !DISubrange(count: 171)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 88, type: !1095, isLocal: true, isDefinition: true)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 34)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 105, type: !175, isLocal: true, isDefinition: true)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 109, type: !1102, isLocal: true, isDefinition: true)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 23)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 113, type: !714, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 120, type: !1109, isLocal: true, isDefinition: true)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 32)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 127, type: !1114, isLocal: true, isDefinition: true)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 36)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 134, type: !589, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 142, type: !1121, isLocal: true, isDefinition: true)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1122)
!1122 = !{!1123}
!1123 = !DISubrange(count: 44)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 150, type: !1126, isLocal: true, isDefinition: true)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1127)
!1127 = !{!1128}
!1128 = !DISubrange(count: 48)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 159, type: !212, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 170, type: !1133, isLocal: true, isDefinition: true)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1134)
!1134 = !{!1135}
!1135 = !DISubrange(count: 60)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 248, type: !413, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 248, type: !611, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 254, type: !413, isLocal: true, isDefinition: true)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 254, type: !190, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 254, type: !589, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 259, type: !3, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !1079, line: 259, type: !807, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1152, file: !1153, line: 26, type: !1155, isLocal: false, isDefinition: true)
!1152 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1153, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !1154, splitDebugInlining: false, nameTableKind: None)
!1153 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1154 = !{!1150}
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 376, elements: !1156)
!1156 = !{!1157}
!1157 = !DISubrange(count: 47)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !1160, line: 34, type: !24, isLocal: true, isDefinition: true)
!1160 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !1160, line: 34, type: !568, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !1160, line: 34, type: !202, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
