; ModuleID = 'src/whoami.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [85 x i8] c"Print the user name associated with the current effective user ID.\0ASame as id -un.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"whoami\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 61)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !67, line: 679, type: !131, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !67, line: 683, type: !105, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !67, line: 688, type: !105, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !67, line: 691, type: !144, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !67, line: 839, type: !186, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 16)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !67, line: 840, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 22)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !67, line: 841, type: !168, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !67, line: 862, type: !112, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !67, line: 868, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 71)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !67, line: 875, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 27)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 51)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 12)
!218 = !{!219, !220, !221, !224, !226, !227, !228, !232, !233, !234, !235, !237, !290, !291, !292, !294, !295}
!219 = !DILocalVariable(name: "program", arg: 1, scope: !66, file: !67, line: 573, type: !70)
!220 = !DILocalVariable(name: "option", arg: 2, scope: !66, file: !67, line: 573, type: !70)
!221 = !DILocalVariable(name: "term", scope: !222, file: !67, line: 585, type: !70)
!222 = distinct !DILexicalBlock(scope: !223, file: !67, line: 582, column: 5)
!223 = distinct !DILexicalBlock(scope: !66, file: !67, line: 581, column: 7)
!224 = !DILocalVariable(name: "double_space", scope: !66, file: !67, line: 594, type: !225)
!225 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!226 = !DILocalVariable(name: "first_word", scope: !66, file: !67, line: 595, type: !70)
!227 = !DILocalVariable(name: "option_text", scope: !66, file: !67, line: 596, type: !70)
!228 = !DILocalVariable(name: "s", scope: !229, file: !67, line: 608, type: !70)
!229 = distinct !DILexicalBlock(scope: !230, file: !67, line: 605, column: 5)
!230 = distinct !DILexicalBlock(scope: !231, file: !67, line: 604, column: 12)
!231 = distinct !DILexicalBlock(scope: !66, file: !67, line: 597, column: 7)
!232 = !DILocalVariable(name: "spaces", scope: !229, file: !67, line: 609, type: !99)
!233 = !DILocalVariable(name: "anchor_len", scope: !66, file: !67, line: 620, type: !99)
!234 = !DILocalVariable(name: "desc_text", scope: !66, file: !67, line: 625, type: !70)
!235 = !DILocalVariable(name: "__ptr", scope: !236, file: !67, line: 644, type: !70)
!236 = distinct !DILexicalBlock(scope: !66, file: !67, line: 644, column: 3)
!237 = !DILocalVariable(name: "__stream", scope: !236, file: !67, line: 644, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !241)
!240 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !243)
!242 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!243 = !{!244, !245, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !260, !262, !263, !264, !267, !268, !270, !271, !274, !276, !279, !282, !283, !284, !285, !286}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !242, line: 51, baseType: !97, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !241, file: !242, line: 54, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !241, file: !242, line: 55, baseType: !246, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !241, file: !242, line: 56, baseType: !246, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !241, file: !242, line: 57, baseType: !246, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !241, file: !242, line: 58, baseType: !246, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !241, file: !242, line: 59, baseType: !246, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !241, file: !242, line: 60, baseType: !246, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !241, file: !242, line: 61, baseType: !246, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !241, file: !242, line: 64, baseType: !246, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !241, file: !242, line: 65, baseType: !246, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !241, file: !242, line: 66, baseType: !246, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !241, file: !242, line: 68, baseType: !258, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !242, line: 36, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !241, file: !242, line: 70, baseType: !261, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !241, file: !242, line: 72, baseType: !97, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !242, line: 73, baseType: !97, size: 32, offset: 928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !241, file: !242, line: 74, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !95, line: 152, baseType: !266)
!266 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !241, file: !242, line: 77, baseType: !98, size: 16, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !241, file: !242, line: 78, baseType: !269, size: 8, offset: 1040)
!269 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !241, file: !242, line: 79, baseType: !34, size: 8, offset: 1048)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !242, line: 81, baseType: !272, size: 64, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !242, line: 43, baseType: null)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !242, line: 89, baseType: !275, size: 64, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !95, line: 153, baseType: !266)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !241, file: !242, line: 91, baseType: !277, size: 64, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !242, line: 37, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !241, file: !242, line: 92, baseType: !280, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !242, line: 38, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !241, file: !242, line: 93, baseType: !261, size: 64, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !241, file: !242, line: 94, baseType: !91, size: 64, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !241, file: !242, line: 95, baseType: !99, size: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !241, file: !242, line: 96, baseType: !97, size: 32, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !241, file: !242, line: 98, baseType: !287, size: 160, offset: 1568)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 20)
!290 = !DILocalVariable(name: "__cnt", scope: !236, file: !67, line: 644, type: !99)
!291 = !DILocalVariable(name: "url_program", scope: !66, file: !67, line: 648, type: !70)
!292 = !DILocalVariable(name: "__ptr", scope: !293, file: !67, line: 686, type: !70)
!293 = distinct !DILexicalBlock(scope: !66, file: !67, line: 686, column: 3)
!294 = !DILocalVariable(name: "__stream", scope: !293, file: !67, line: 686, type: !238)
!295 = !DILocalVariable(name: "__cnt", scope: !293, file: !67, line: 686, type: !99)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !298, line: 3, type: !168, isLocal: true, isDefinition: true)
!298 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "Version", scope: !301, file: !298, line: 3, type: !70, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-format-extra-args -Wno-implicit-const-int-float-conversion -Wno-tautological-constant-out-of-range-compare -g -O2 -MT src/version.o -MD -MP -MF src/.deps/version.Tpo -c src/version.c -o src/.version.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !302, splitDebugInlining: false, nameTableKind: None)
!302 = !{!296, !299}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "file_name", scope: !305, file: !306, line: 45, type: !70, isLocal: true, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C11, file: !306, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-closeout.o -MD -MP -MF lib/.deps/libcoreutils_a-closeout.Tpo -c lib/closeout.c -o lib/.libcoreutils_a-closeout.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !307, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!307 = !{!308, !310, !312, !314, !303, !316}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !306, line: 121, type: !19, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !306, line: 121, type: !215, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !306, line: 123, type: !19, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !306, line: 126, type: !131, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !305, file: !306, line: 55, type: !225, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !320, file: !321, line: 66, type: !371, isLocal: false, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C11, file: !321, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-error.o -MD -MP -MF lib/.deps/libcoreutils_a-error.Tpo -c lib/error.c -o lib/.libcoreutils_a-error.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !322, globals: !323, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!322 = !{!91, !101}
!323 = !{!324, !326, !350, !352, !354, !356, !318, !358, !360, !362, !364, !369}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !321, line: 272, type: !105, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "old_file_name", scope: !328, file: !321, line: 304, type: !70, isLocal: true, isDefinition: true)
!328 = distinct !DISubprogram(name: "verror_at_line", scope: !321, file: !321, line: 298, type: !329, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !343)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !97, !97, !70, !76, !70, !331}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !332, line: 52, baseType: !333)
!332 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !334, line: 12, baseType: !335)
!334 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stdarg___gnuc_va_list.h", directory: "", checksumkind: CSK_MD5, checksum: "edb3f2eab991638e4dc94f6e55e3530f")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !321, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !337)
!337 = !{!338, !339, !340, !341, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !336, file: !321, baseType: !91, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !336, file: !321, baseType: !91, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !336, file: !321, baseType: !91, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !336, file: !321, baseType: !97, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !336, file: !321, baseType: !97, size: 32, offset: 224)
!343 = !{!344, !345, !346, !347, !348, !349}
!344 = !DILocalVariable(name: "status", arg: 1, scope: !328, file: !321, line: 298, type: !97)
!345 = !DILocalVariable(name: "errnum", arg: 2, scope: !328, file: !321, line: 298, type: !97)
!346 = !DILocalVariable(name: "file_name", arg: 3, scope: !328, file: !321, line: 298, type: !70)
!347 = !DILocalVariable(name: "line_number", arg: 4, scope: !328, file: !321, line: 298, type: !76)
!348 = !DILocalVariable(name: "message", arg: 5, scope: !328, file: !321, line: 298, type: !70)
!349 = !DILocalVariable(name: "args", arg: 6, scope: !328, file: !321, line: 298, type: !331)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "old_line_number", scope: !328, file: !321, line: 305, type: !76, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !321, line: 338, type: !112, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !321, line: 346, type: !144, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !321, line: 346, type: !122, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "error_message_count", scope: !320, file: !321, line: 69, type: !76, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !320, file: !321, line: 295, type: !97, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !321, line: 208, type: !19, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !321, line: 208, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 21)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !321, line: 214, type: !105, isLocal: true, isDefinition: true)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !376, line: 60, type: !122, isLocal: true, isDefinition: true)
!376 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "long_options", scope: !379, file: !376, line: 34, type: !388, isLocal: true, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C11, file: !376, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-long-options.o -MD -MP -MF lib/.deps/libcoreutils_a-long-options.Tpo -c lib/long-options.c -o lib/.libcoreutils_a-long-options.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, globals: !381, splitDebugInlining: false, nameTableKind: None)
!380 = !{!91}
!381 = !{!374, !382, !384, !386, !377}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !376, line: 112, type: !34, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !376, line: 36, type: !105, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !376, line: 37, type: !144, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 768, elements: !132)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !391, line: 50, size: 256, elements: !392)
!391 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!392 = !{!393, !394, !395, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !391, line: 52, baseType: !70, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !390, file: !391, line: 55, baseType: !97, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !391, line: 56, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !390, file: !391, line: 57, baseType: !97, size: 32, offset: 192)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "program_name", scope: !400, file: !401, line: 31, type: !70, isLocal: false, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C11, file: !401, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-progname.o -MD -MP -MF lib/.deps/libcoreutils_a-progname.Tpo -c lib/progname.c -o lib/.libcoreutils_a-progname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, globals: !403, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!402 = !{!91, !246}
!403 = !{!398, !404, !406}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !401, line: 46, type: !144, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !401, line: 49, type: !112, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "utf07FF", scope: !410, file: !411, line: 46, type: !438, isLocal: true, isDefinition: true)
!410 = distinct !DISubprogram(name: "proper_name_lite", scope: !411, file: !411, line: 38, type: !412, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !416)
!411 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!412 = !DISubroutineType(types: !413)
!413 = !{!70, !70, !70}
!414 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-propername-lite.o -MD -MP -MF lib/.deps/libcoreutils_a-propername-lite.Tpo -c lib/propername-lite.c -o lib/.libcoreutils_a-propername-lite.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !415, splitDebugInlining: false, nameTableKind: None)
!415 = !{!408}
!416 = !{!417, !418, !419, !420, !425}
!417 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !410, file: !411, line: 38, type: !70)
!418 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !410, file: !411, line: 38, type: !70)
!419 = !DILocalVariable(name: "translation", scope: !410, file: !411, line: 40, type: !70)
!420 = !DILocalVariable(name: "w", scope: !410, file: !411, line: 47, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !422, line: 37, baseType: !423)
!422 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !95, line: 57, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 42, baseType: !76)
!425 = !DILocalVariable(name: "mbs", scope: !410, file: !411, line: 48, type: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !427, line: 6, baseType: !428)
!427 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !429, line: 21, baseType: !430)
!429 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 13, size: 64, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !430, file: !429, line: 15, baseType: !97, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !430, file: !429, line: 20, baseType: !434, size: 32, offset: 32)
!434 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !430, file: !429, line: 16, size: 32, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !434, file: !429, line: 18, baseType: !76, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !434, file: !429, line: 19, baseType: !112, size: 32)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16, elements: !123)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !441, line: 78, type: !144, isLocal: true, isDefinition: true)
!441 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !441, line: 79, type: !117, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !441, line: 80, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 13)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !441, line: 81, type: !446, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !441, line: 82, type: !287, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !441, line: 83, type: !122, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !441, line: 84, type: !144, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !441, line: 85, type: !19, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !441, line: 86, type: !19, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !441, line: 87, type: !144, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !465, file: !441, line: 76, type: !551, isLocal: false, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C11, file: !441, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-quotearg.o -MD -MP -MF lib/.deps/libcoreutils_a-quotearg.Tpo -c lib/quotearg.c -o lib/.libcoreutils_a-quotearg.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !466, retainedTypes: !486, globals: !487, splitDebugInlining: false, nameTableKind: None)
!466 = !{!467, !481, !74}
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !468, line: 42, baseType: !76, size: 32, elements: !469)
!468 = !DIFile(filename: "lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!470 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!471 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!472 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!473 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!474 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!475 = !DIEnumerator(name: "c_quoting_style", value: 5)
!476 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!477 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!478 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!479 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!480 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !468, line: 254, baseType: !76, size: 32, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!484 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!485 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!486 = !{!91, !97, !98, !99}
!487 = !{!439, !442, !444, !449, !451, !453, !455, !457, !459, !461, !463, !488, !492, !502, !504, !509, !511, !513, !515, !517, !540, !547, !549}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !465, file: !441, line: 92, type: !490, isLocal: false, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 320, elements: !40)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !465, file: !441, line: 1040, type: !494, isLocal: false, isDefinition: true)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !441, line: 56, size: 448, elements: !495)
!495 = !{!496, !497, !498, !500, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !494, file: !441, line: 59, baseType: !467, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !494, file: !441, line: 62, baseType: !97, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !494, file: !441, line: 66, baseType: !499, size: 256, offset: 64)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !145)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !494, file: !441, line: 69, baseType: !70, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !494, file: !441, line: 72, baseType: !70, size: 64, offset: 384)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !465, file: !441, line: 107, type: !494, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "slot0", scope: !465, file: !441, line: 831, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 256)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !441, line: 321, type: !122, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !441, line: 357, type: !122, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !441, line: 358, type: !122, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !441, line: 199, type: !19, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "quote", scope: !519, file: !441, line: 228, type: !538, isLocal: true, isDefinition: true)
!519 = distinct !DISubprogram(name: "gettext_quote", scope: !441, file: !441, line: 197, type: !520, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !465, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!70, !70, !467}
!522 = !{!523, !524, !525, !526, !527}
!523 = !DILocalVariable(name: "msgid", arg: 1, scope: !519, file: !441, line: 197, type: !70)
!524 = !DILocalVariable(name: "s", arg: 2, scope: !519, file: !441, line: 197, type: !467)
!525 = !DILocalVariable(name: "translation", scope: !519, file: !441, line: 199, type: !70)
!526 = !DILocalVariable(name: "w", scope: !519, file: !441, line: 229, type: !421)
!527 = !DILocalVariable(name: "mbs", scope: !519, file: !441, line: 230, type: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !427, line: 6, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !429, line: 21, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 13, size: 64, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !530, file: !429, line: 15, baseType: !97, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !530, file: !429, line: 20, baseType: !534, size: 32, offset: 32)
!534 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !530, file: !429, line: 16, size: 32, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !534, file: !429, line: 18, baseType: !76, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !534, file: !429, line: 19, baseType: !112, size: 32)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !539)
!539 = !{!124, !114}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "slotvec", scope: !465, file: !441, line: 834, type: !542, isLocal: true, isDefinition: true)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !441, line: 823, size: 128, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !543, file: !441, line: 825, baseType: !99, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !543, file: !441, line: 826, baseType: !246, size: 64, offset: 64)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "nslots", scope: !465, file: !441, line: 832, type: !97, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "slotvec0", scope: !465, file: !441, line: 833, type: !543, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 704, elements: !553)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!553 = !{!554}
!554 = !DISubrange(count: 11)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !557, line: 67, type: !215, isLocal: true, isDefinition: true)
!557 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !557, line: 69, type: !19, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !557, line: 83, type: !19, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !557, line: 83, type: !112, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !557, line: 85, type: !122, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !557, line: 88, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 171)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !557, line: 88, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 34)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !557, line: 105, type: !186, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !557, line: 109, type: !9, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !557, line: 113, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 28)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !557, line: 120, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 32)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !557, line: 127, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 36)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !557, line: 134, type: !163, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !557, line: 142, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 44)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !557, line: 150, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 48)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !557, line: 159, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 52)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !557, line: 170, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 60)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !557, line: 248, type: !287, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !557, line: 248, type: !191, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !557, line: 254, type: !287, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !557, line: 254, type: !49, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !557, line: 254, type: !163, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !557, line: 259, type: !3, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !557, line: 259, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 29)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !636, file: !637, line: 26, type: !639, isLocal: false, isDefinition: true)
!636 = distinct !DICompileUnit(language: DW_LANG_C11, file: !637, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc-fsf.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc-fsf.Tpo -c lib/version-etc-fsf.c -o lib/.libcoreutils_a-version-etc-fsf.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !638, splitDebugInlining: false, nameTableKind: None)
!637 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!638 = !{!634}
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 376, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 47)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "exit_failure", scope: !644, file: !645, line: 24, type: !647, isLocal: false, isDefinition: true)
!644 = distinct !DICompileUnit(language: DW_LANG_C11, file: !645, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-exitfail.o -MD -MP -MF lib/.deps/libcoreutils_a-exitfail.Tpo -c lib/exitfail.c -o lib/.libcoreutils_a-exitfail.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !646, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!646 = !{!642}
!647 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !97)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !650, line: 34, type: !131, isLocal: true, isDefinition: true)
!650 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !650, line: 34, type: !19, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !650, line: 34, type: !54, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !657, line: 108, type: !34, isLocal: true, isDefinition: true)
!657 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "internal_state", scope: !660, file: !657, line: 97, type: !663, isLocal: true, isDefinition: true)
!660 = distinct !DICompileUnit(language: DW_LANG_C11, file: !657, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-mbrtoc32.o -MD -MP -MF lib/.deps/libcoreutils_a-mbrtoc32.Tpo -c lib/mbrtoc32.c -o lib/.libcoreutils_a-mbrtoc32.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !661, globals: !662, splitDebugInlining: false, nameTableKind: None)
!661 = !{!91, !99, !101}
!662 = !{!655, !658}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !427, line: 6, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !429, line: 21, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 13, size: 64, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !665, file: !429, line: 15, baseType: !97, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !665, file: !429, line: 20, baseType: !669, size: 32, offset: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !665, file: !429, line: 16, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !669, file: !429, line: 18, baseType: !76, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !669, file: !429, line: 19, baseType: !112, size: 32)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !675, line: 35, type: !122, isLocal: true, isDefinition: true)
!675 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !675, line: 35, type: !117, isLocal: true, isDefinition: true)
!678 = distinct !DICompileUnit(language: DW_LANG_C11, file: !679, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-getprogname.o -MD -MP -MF lib/.deps/libcoreutils_a-getprogname.Tpo -c lib/getprogname.c -o lib/.libcoreutils_a-getprogname.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!679 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!680 = distinct !DICompileUnit(language: DW_LANG_C11, file: !557, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-version-etc.o -MD -MP -MF lib/.deps/libcoreutils_a-version-etc.Tpo -c lib/version-etc.c -o lib/.libcoreutils_a-version-etc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !681, retainedTypes: !380, globals: !685, splitDebugInlining: false, nameTableKind: None)
!681 = !{!682}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !557, line: 40, baseType: !76, size: 32, elements: !683)
!683 = !{!684}
!684 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!685 = !{!555, !558, !560, !562, !564, !566, !571, !576, !578, !580, !585, !590, !595, !597, !602, !607, !612, !617, !619, !621, !623, !625, !627, !629}
!686 = distinct !DICompileUnit(language: DW_LANG_C11, file: !687, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xmalloc.o -MD -MP -MF lib/.deps/libcoreutils_a-xmalloc.Tpo -c lib/xmalloc.c -o lib/.libcoreutils_a-xmalloc.o.bc", runtimeVersion: 0, emissionKind: FullDebug, enums: !688, retainedTypes: !720, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!688 = !{!689, !701}
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !690, file: !687, line: 188, baseType: !76, size: 32, elements: !699)
!690 = distinct !DISubprogram(name: "x2nrealloc", scope: !687, file: !687, line: 176, type: !691, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !686, retainedNodes: !694)
!691 = !DISubroutineType(types: !692)
!692 = !{!91, !91, !693, !99}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!694 = !{!695, !696, !697, !698}
!695 = !DILocalVariable(name: "p", arg: 1, scope: !690, file: !687, line: 176, type: !91)
!696 = !DILocalVariable(name: "pn", arg: 2, scope: !690, file: !687, line: 176, type: !693)
!697 = !DILocalVariable(name: "s", arg: 3, scope: !690, file: !687, line: 176, type: !99)
!698 = !DILocalVariable(name: "n", scope: !690, file: !687, line: 178, type: !99)
!699 = !{!700}
!700 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !702, file: !687, line: 228, baseType: !76, size: 32, elements: !699)
!702 = distinct !DISubprogram(name: "xpalloc", scope: !687, file: !687, line: 223, type: !703, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !686, retainedNodes: !710)
!703 = !DISubroutineType(types: !704)
!704 = !{!91, !91, !705, !706, !708, !706}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !707, line: 130, baseType: !708)
!707 = !DIFile(filename: "lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !709, line: 18, baseType: !266)
!709 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_ptrdiff_t.h", directory: "", checksumkind: CSK_MD5, checksum: "21e0c40f3315797d915cc7ea60040a98")
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719}
!711 = !DILocalVariable(name: "pa", arg: 1, scope: !702, file: !687, line: 223, type: !91)
!712 = !DILocalVariable(name: "pn", arg: 2, scope: !702, file: !687, line: 223, type: !705)
!713 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !702, file: !687, line: 223, type: !706)
!714 = !DILocalVariable(name: "n_max", arg: 4, scope: !702, file: !687, line: 223, type: !708)
!715 = !DILocalVariable(name: "s", arg: 5, scope: !702, file: !687, line: 223, type: !706)
!716 = !DILocalVariable(name: "n0", scope: !702, file: !687, line: 230, type: !706)
!717 = !DILocalVariable(name: "n", scope: !702, file: !687, line: 237, type: !706)
!718 = !DILocalVariable(name: "nbytes", scope: !702, file: !687, line: 248, type: !706)
!719 = !DILocalVariable(name: "adjusted_nbytes", scope: !702, file: !687, line: 252, type: !706)
!720 = !{!246, !91}
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !650, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-xalloc-die.o -MD -MP -MF lib/.deps/libcoreutils_a-xalloc-die.Tpo -c lib/xalloc-die.c -o lib/.libcoreutils_a-xalloc-die.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !722, splitDebugInlining: false, nameTableKind: None)
!722 = !{!648, !651, !653}
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-close-stream.o -MD -MP -MF lib/.deps/libcoreutils_a-close-stream.Tpo -c lib/close-stream.c -o lib/.libcoreutils_a-close-stream.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !726, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fclose.o -MD -MP -MF lib/.deps/libcoreutils_a-fclose.Tpo -c lib/fclose.c -o lib/.libcoreutils_a-fclose.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fflush.o -MD -MP -MF lib/.deps/libcoreutils_a-fflush.Tpo -c lib/fflush.c -o lib/.libcoreutils_a-fflush.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !730, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-fseeko.o -MD -MP -MF lib/.deps/libcoreutils_a-fseeko.Tpo -c lib/fseeko.c -o lib/.libcoreutils_a-fseeko.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !732, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-reallocarray.o -MD -MP -MF lib/.deps/libcoreutils_a-reallocarray.Tpo -c lib/reallocarray.c -o lib/.libcoreutils_a-reallocarray.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!733 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-hard-locale.o -MD -MP -MF lib/.deps/libcoreutils_a-hard-locale.Tpo -c lib/hard-locale.c -o lib/.libcoreutils_a-hard-locale.o.bc", runtimeVersion: 0, emissionKind: FullDebug, globals: !734, splitDebugInlining: false, nameTableKind: None)
!734 = !{!673, !676}
!735 = distinct !DICompileUnit(language: DW_LANG_C11, file: !736, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null.Tpo -c lib/setlocale_null.c -o lib/.libcoreutils_a-setlocale_null.o.bc", runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!736 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!737 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)", isOptimized: true, flags: "/usr/lib/llvm-18/bin/clang -emit-llvm -I . -I ./lib -I lib -I ./lib -I src -I ./src -Wno-cast-qual -Wno-conversion -Wno-float-equal -Wno-sign-compare -Wno-undef -Wno-unused-function -Wno-unused-parameter -Wno-float-conversion -Wimplicit-fallthrough -Wno-pedantic -Wno-string-plus-int -Wno-tautological-constant-out-of-range-compare -Wno-sign-conversion -Wno-type-limits -Wno-unused-const-variable -Wno-error -g -O2 -MT lib/libcoreutils_a-setlocale_null-unlocked.o -MD -MP -MF lib/.deps/libcoreutils_a-setlocale_null-unlocked.Tpo -c lib/setlocale_null-unlocked.c -o lib/.libcoreutils_a-setlocale_null-unlocked.o.bc", runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!739 = !{!"Ubuntu clang version 18.1.8 (++20240731024944+3b5b5c1ec4a3-1~exp1~20240731145000.144)"}
!740 = !{i32 7, !"Dwarf Version", i32 5}
!741 = !{i32 2, !"Debug Info Version", i32 3}
!742 = !{i32 1, !"wchar_size", i32 4}
!743 = !{i32 8, !"PIC Level", i32 2}
!744 = !{i32 7, !"PIE Level", i32 2}
!745 = !{i32 7, !"uwtable", i32 2}
!746 = !{i32 7, !"frame-pointer", i32 1}
!747 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!748 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !749, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !751)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !97}
!751 = !{!752}
!752 = !DILocalVariable(name: "status", arg: 1, scope: !748, file: !2, line: 36, type: !97)
!753 = !DILocation(line: 0, scope: !748)
!754 = !DILocation(line: 38, column: 14, scope: !755)
!755 = distinct !DILexicalBlock(scope: !748, file: !2, line: 38, column: 7)
!756 = !DILocation(line: 38, column: 7, scope: !748)
!757 = !DILocation(line: 39, column: 5, scope: !758)
!758 = distinct !DILexicalBlock(scope: !755, file: !2, line: 39, column: 5)
!759 = !{!760, !760, i64 0}
!760 = !{!"any pointer", !761, i64 0}
!761 = !{!"omnipotent char", !762, i64 0}
!762 = !{!"Simple C/C++ TBAA"}
!763 = !DILocation(line: 42, column: 7, scope: !764)
!764 = distinct !DILexicalBlock(scope: !755, file: !2, line: 41, column: 5)
!765 = !DILocation(line: 43, column: 7, scope: !764)
!766 = !DILocation(line: 48, column: 7, scope: !764)
!767 = !DILocation(line: 49, column: 7, scope: !764)
!768 = !DILocalVariable(name: "program", arg: 1, scope: !769, file: !67, line: 836, type: !70)
!769 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !67, file: !67, line: 836, type: !770, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !70}
!772 = !{!768, !773, !780, !781, !783, !784}
!773 = !DILocalVariable(name: "infomap", scope: !769, file: !67, line: 838, type: !774)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 896, elements: !20)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !769, file: !67, line: 838, size: 128, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !776, file: !67, line: 838, baseType: !70, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !776, file: !67, line: 838, baseType: !70, size: 64, offset: 64)
!780 = !DILocalVariable(name: "node", scope: !769, file: !67, line: 848, type: !70)
!781 = !DILocalVariable(name: "map_prog", scope: !769, file: !67, line: 849, type: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!783 = !DILocalVariable(name: "lc_messages", scope: !769, file: !67, line: 861, type: !70)
!784 = !DILocalVariable(name: "url_program", scope: !769, file: !67, line: 874, type: !70)
!785 = !DILocation(line: 0, scope: !769, inlinedAt: !786)
!786 = distinct !DILocation(line: 50, column: 7, scope: !764)
!787 = !{}
!788 = !DILocation(line: 857, column: 3, scope: !769, inlinedAt: !786)
!789 = !DILocation(line: 861, column: 29, scope: !769, inlinedAt: !786)
!790 = !DILocation(line: 862, column: 7, scope: !791, inlinedAt: !786)
!791 = distinct !DILexicalBlock(scope: !769, file: !67, line: 862, column: 7)
!792 = !DILocation(line: 862, column: 19, scope: !791, inlinedAt: !786)
!793 = !DILocation(line: 862, column: 22, scope: !791, inlinedAt: !786)
!794 = !DILocation(line: 862, column: 7, scope: !769, inlinedAt: !786)
!795 = !DILocation(line: 868, column: 7, scope: !796, inlinedAt: !786)
!796 = distinct !DILexicalBlock(scope: !791, file: !67, line: 863, column: 5)
!797 = !DILocation(line: 870, column: 5, scope: !796, inlinedAt: !786)
!798 = !DILocation(line: 875, column: 3, scope: !769, inlinedAt: !786)
!799 = !DILocation(line: 877, column: 3, scope: !769, inlinedAt: !786)
!800 = !DILocation(line: 52, column: 3, scope: !748)
!801 = !DISubprogram(name: "dcgettext", scope: !802, file: !802, line: 51, type: !803, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!802 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!803 = !DISubroutineType(types: !804)
!804 = !{!246, !70, !70, !97}
!805 = !DISubprogram(name: "__fprintf_chk", scope: !806, file: !806, line: 93, type: !807, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!806 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!807 = !DISubroutineType(types: !808)
!808 = !{!97, !809, !97, !810, null}
!809 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!810 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!811 = !DISubprogram(name: "__printf_chk", scope: !806, file: !806, line: 95, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!812 = !DISubroutineType(types: !813)
!813 = !{!97, !97, !810, null}
!814 = !DISubprogram(name: "fputs_unlocked", scope: !332, file: !332, line: 691, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!97, !810, !809}
!817 = !DILocation(line: 0, scope: !66)
!818 = !DILocation(line: 581, column: 7, scope: !223)
!819 = !{!820, !820, i64 0}
!820 = !{!"int", !761, i64 0}
!821 = !DILocation(line: 581, column: 19, scope: !223)
!822 = !DILocation(line: 581, column: 7, scope: !66)
!823 = !DILocation(line: 585, column: 26, scope: !222)
!824 = !DILocation(line: 0, scope: !222)
!825 = !DILocation(line: 586, column: 23, scope: !222)
!826 = !DILocation(line: 586, column: 28, scope: !222)
!827 = !DILocation(line: 586, column: 32, scope: !222)
!828 = !{!761, !761, i64 0}
!829 = !DILocation(line: 586, column: 38, scope: !222)
!830 = !DILocalVariable(name: "__s1", arg: 1, scope: !831, file: !832, line: 1359, type: !70)
!831 = distinct !DISubprogram(name: "streq", scope: !832, file: !832, line: 1359, type: !833, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !835)
!832 = !DIFile(filename: "./lib/string.h", directory: "/src")
!833 = !DISubroutineType(types: !834)
!834 = !{!225, !70, !70}
!835 = !{!830, !836}
!836 = !DILocalVariable(name: "__s2", arg: 2, scope: !831, file: !832, line: 1359, type: !70)
!837 = !DILocation(line: 0, scope: !831, inlinedAt: !838)
!838 = distinct !DILocation(line: 586, column: 41, scope: !222)
!839 = !DILocation(line: 1361, column: 11, scope: !831, inlinedAt: !838)
!840 = !DILocation(line: 1361, column: 10, scope: !831, inlinedAt: !838)
!841 = !DILocation(line: 586, column: 19, scope: !222)
!842 = !DILocation(line: 587, column: 5, scope: !222)
!843 = !DILocation(line: 588, column: 7, scope: !844)
!844 = distinct !DILexicalBlock(scope: !66, file: !67, line: 588, column: 7)
!845 = !DILocation(line: 588, column: 7, scope: !66)
!846 = !DILocation(line: 590, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !844, file: !67, line: 589, column: 5)
!848 = !DILocation(line: 591, column: 7, scope: !847)
!849 = !DILocation(line: 595, column: 37, scope: !66)
!850 = !DILocation(line: 595, column: 35, scope: !66)
!851 = !DILocation(line: 596, column: 29, scope: !66)
!852 = !DILocation(line: 597, column: 8, scope: !231)
!853 = !DILocation(line: 597, column: 7, scope: !66)
!854 = !DILocation(line: 604, column: 24, scope: !230)
!855 = !DILocation(line: 604, column: 12, scope: !231)
!856 = !DILocation(line: 0, scope: !229)
!857 = !DILocation(line: 610, column: 16, scope: !229)
!858 = !DILocation(line: 610, column: 7, scope: !229)
!859 = !DILocation(line: 611, column: 21, scope: !229)
!860 = !{!861, !861, i64 0}
!861 = !{!"short", !761, i64 0}
!862 = !DILocation(line: 611, column: 19, scope: !229)
!863 = !DILocation(line: 611, column: 16, scope: !229)
!864 = !DILocation(line: 610, column: 30, scope: !229)
!865 = distinct !{!865, !858, !859, !866}
!866 = !{!"llvm.loop.mustprogress"}
!867 = !DILocation(line: 612, column: 18, scope: !868)
!868 = distinct !DILexicalBlock(scope: !229, file: !67, line: 612, column: 11)
!869 = !DILocation(line: 612, column: 11, scope: !229)
!870 = !DILocation(line: 620, column: 23, scope: !66)
!871 = !DILocation(line: 625, column: 39, scope: !66)
!872 = !DILocation(line: 626, column: 3, scope: !66)
!873 = !DILocation(line: 626, column: 10, scope: !66)
!874 = !DILocation(line: 626, column: 21, scope: !66)
!875 = !DILocation(line: 628, column: 44, scope: !876)
!876 = distinct !DILexicalBlock(scope: !877, file: !67, line: 628, column: 11)
!877 = distinct !DILexicalBlock(scope: !66, file: !67, line: 627, column: 5)
!878 = !DILocation(line: 628, column: 32, scope: !876)
!879 = !DILocation(line: 628, column: 49, scope: !876)
!880 = !DILocation(line: 628, column: 11, scope: !877)
!881 = !DILocation(line: 630, column: 11, scope: !882)
!882 = distinct !DILexicalBlock(scope: !877, file: !67, line: 630, column: 11)
!883 = !DILocation(line: 630, column: 11, scope: !877)
!884 = !DILocation(line: 632, column: 26, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !67, line: 632, column: 15)
!886 = distinct !DILexicalBlock(scope: !882, file: !67, line: 631, column: 9)
!887 = !DILocation(line: 632, column: 34, scope: !885)
!888 = !DILocation(line: 632, column: 37, scope: !885)
!889 = !DILocation(line: 632, column: 15, scope: !886)
!890 = !DILocation(line: 640, column: 16, scope: !877)
!891 = distinct !{!891, !872, !892, !866}
!892 = !DILocation(line: 641, column: 5, scope: !66)
!893 = !DILocation(line: 644, column: 3, scope: !66)
!894 = !DILocation(line: 0, scope: !831, inlinedAt: !895)
!895 = distinct !DILocation(line: 648, column: 31, scope: !66)
!896 = !DILocation(line: 0, scope: !831, inlinedAt: !897)
!897 = distinct !DILocation(line: 649, column: 31, scope: !66)
!898 = !DILocation(line: 0, scope: !831, inlinedAt: !899)
!899 = distinct !DILocation(line: 650, column: 31, scope: !66)
!900 = !DILocation(line: 0, scope: !831, inlinedAt: !901)
!901 = distinct !DILocation(line: 651, column: 31, scope: !66)
!902 = !DILocation(line: 0, scope: !831, inlinedAt: !903)
!903 = distinct !DILocation(line: 652, column: 31, scope: !66)
!904 = !DILocation(line: 0, scope: !831, inlinedAt: !905)
!905 = distinct !DILocation(line: 653, column: 31, scope: !66)
!906 = !DILocation(line: 0, scope: !831, inlinedAt: !907)
!907 = distinct !DILocation(line: 654, column: 31, scope: !66)
!908 = !DILocation(line: 0, scope: !831, inlinedAt: !909)
!909 = distinct !DILocation(line: 655, column: 31, scope: !66)
!910 = !DILocation(line: 0, scope: !831, inlinedAt: !911)
!911 = distinct !DILocation(line: 656, column: 31, scope: !66)
!912 = !DILocation(line: 0, scope: !831, inlinedAt: !913)
!913 = distinct !DILocation(line: 657, column: 31, scope: !66)
!914 = !DILocation(line: 663, column: 7, scope: !915)
!915 = distinct !DILexicalBlock(scope: !66, file: !67, line: 663, column: 7)
!916 = !DILocation(line: 664, column: 7, scope: !915)
!917 = !DILocation(line: 664, column: 10, scope: !915)
!918 = !DILocation(line: 663, column: 7, scope: !66)
!919 = !DILocation(line: 669, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !915, file: !67, line: 665, column: 5)
!921 = !DILocation(line: 671, column: 5, scope: !920)
!922 = !DILocation(line: 676, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !915, file: !67, line: 673, column: 5)
!924 = !DILocation(line: 679, column: 3, scope: !66)
!925 = !DILocation(line: 683, column: 3, scope: !66)
!926 = !DILocation(line: 686, column: 3, scope: !66)
!927 = !DILocation(line: 688, column: 3, scope: !66)
!928 = !DILocation(line: 691, column: 3, scope: !66)
!929 = !DILocation(line: 695, column: 3, scope: !66)
!930 = !DILocation(line: 696, column: 1, scope: !66)
!931 = !DISubprogram(name: "setlocale", scope: !932, file: !932, line: 122, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!932 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!933 = !DISubroutineType(types: !934)
!934 = !{!246, !97, !70}
!935 = !DISubprogram(name: "strncmp", scope: !936, file: !936, line: 159, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!936 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!937 = !DISubroutineType(types: !938)
!938 = !{!97, !70, !70, !99}
!939 = !DISubprogram(name: "exit", scope: !940, file: !940, line: 624, type: !749, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!940 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!941 = !DISubprogram(name: "getenv", scope: !940, file: !940, line: 641, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!942 = !DISubroutineType(types: !943)
!943 = !{!246, !70}
!944 = !DISubprogram(name: "strcmp", scope: !936, file: !936, line: 156, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!945 = !DISubroutineType(types: !946)
!946 = !{!97, !70, !70}
!947 = !DISubprogram(name: "strspn", scope: !936, file: !936, line: 297, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!948 = !DISubroutineType(types: !949)
!949 = !{!96, !70, !70}
!950 = !DISubprogram(name: "strchr", scope: !936, file: !936, line: 246, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!951 = !DISubroutineType(types: !952)
!952 = !{!246, !70, !97}
!953 = !DISubprogram(name: "__ctype_b_loc", scope: !75, file: !75, line: 79, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!954 = !DISubroutineType(types: !955)
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!959 = !DISubprogram(name: "strcspn", scope: !936, file: !936, line: 293, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!960 = !DISubprogram(name: "fwrite_unlocked", scope: !332, file: !332, line: 704, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!961 = !DISubroutineType(types: !962)
!962 = !{!99, !963, !99, !99, !809}
!963 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!966 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 56, type: !967, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !970)
!967 = !DISubroutineType(types: !968)
!968 = !{!97, !97, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!970 = !{!971, !972, !973, !977, !978}
!971 = !DILocalVariable(name: "argc", arg: 1, scope: !966, file: !2, line: 56, type: !97)
!972 = !DILocalVariable(name: "argv", arg: 2, scope: !966, file: !2, line: 56, type: !969)
!973 = !DILocalVariable(name: "NO_UID", scope: !966, file: !2, line: 58, type: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !975, line: 79, baseType: !976)
!975 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !95, line: 146, baseType: !76)
!977 = !DILocalVariable(name: "uid", scope: !966, file: !2, line: 79, type: !974)
!978 = !DILocalVariable(name: "pw", scope: !966, file: !2, line: 80, type: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !981, line: 49, size: 384, elements: !982)
!981 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!982 = !{!983, !984, !985, !986, !988, !989, !990}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !980, file: !981, line: 51, baseType: !246, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !980, file: !981, line: 52, baseType: !246, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !980, file: !981, line: 54, baseType: !976, size: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !980, file: !981, line: 55, baseType: !987, size: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !95, line: 147, baseType: !76)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !980, file: !981, line: 56, baseType: !246, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !980, file: !981, line: 57, baseType: !246, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !980, file: !981, line: 58, baseType: !246, size: 64, offset: 320)
!991 = !DILocation(line: 0, scope: !966)
!992 = !DILocation(line: 61, column: 21, scope: !966)
!993 = !DILocation(line: 61, column: 3, scope: !966)
!994 = !DILocation(line: 62, column: 3, scope: !966)
!995 = !DILocation(line: 63, column: 3, scope: !966)
!996 = !DILocation(line: 64, column: 3, scope: !966)
!997 = !DILocation(line: 66, column: 3, scope: !966)
!998 = !DILocation(line: 69, column: 36, scope: !966)
!999 = !DILocation(line: 69, column: 58, scope: !966)
!1000 = !DILocation(line: 68, column: 3, scope: !966)
!1001 = !DILocation(line: 72, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !966, file: !2, line: 72, column: 7)
!1003 = !DILocation(line: 72, column: 14, scope: !1002)
!1004 = !DILocation(line: 72, column: 7, scope: !966)
!1005 = !DILocation(line: 74, column: 7, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !2, line: 73, column: 5)
!1007 = !DILocation(line: 75, column: 7, scope: !1006)
!1008 = !DILocation(line: 78, column: 3, scope: !966)
!1009 = !DILocation(line: 78, column: 9, scope: !966)
!1010 = !DILocation(line: 79, column: 15, scope: !966)
!1011 = !DILocation(line: 80, column: 27, scope: !966)
!1012 = !DILocation(line: 80, column: 37, scope: !966)
!1013 = !DILocation(line: 80, column: 40, scope: !966)
!1014 = !DILocation(line: 80, column: 23, scope: !966)
!1015 = !DILocation(line: 80, column: 55, scope: !966)
!1016 = !DILocation(line: 81, column: 8, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !966, file: !2, line: 81, column: 7)
!1018 = !DILocation(line: 81, column: 7, scope: !966)
!1019 = !DILocation(line: 82, column: 5, scope: !1017)
!1020 = !DILocation(line: 84, column: 13, scope: !966)
!1021 = !{!1022, !760, i64 0}
!1022 = !{!"passwd", !760, i64 0, !760, i64 8, !820, i64 16, !820, i64 20, !760, i64 24, !760, i64 32, !760, i64 40}
!1023 = !DILocation(line: 84, column: 3, scope: !966)
!1024 = !DILocation(line: 85, column: 3, scope: !966)
!1025 = !DISubprogram(name: "bindtextdomain", scope: !802, file: !802, line: 86, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!246, !70, !70}
!1028 = !DISubprogram(name: "textdomain", scope: !802, file: !802, line: 82, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1029 = !DISubprogram(name: "atexit", scope: !940, file: !940, line: 602, type: !1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!97, !371}
!1032 = !DISubprogram(name: "__errno_location", scope: !1033, file: !1033, line: 37, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1033 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!396}
!1036 = !DISubprogram(name: "geteuid", scope: !1037, file: !1037, line: 700, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1037 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!976}
!1040 = !DISubprogram(name: "getpwuid", scope: !981, file: !981, line: 110, type: !1041, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!979, !976}
!1043 = !DISubprogram(name: "puts", scope: !332, file: !332, line: 661, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!97, !70}
!1046 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !306, file: !306, line: 50, type: !770, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !1047)
!1047 = !{!1048}
!1048 = !DILocalVariable(name: "file", arg: 1, scope: !1046, file: !306, line: 50, type: !70)
!1049 = !DILocation(line: 0, scope: !1046)
!1050 = !DILocation(line: 52, column: 13, scope: !1046)
!1051 = !DILocation(line: 53, column: 1, scope: !1046)
!1052 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !306, file: !306, line: 87, type: !1053, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !225}
!1055 = !{!1056}
!1056 = !DILocalVariable(name: "ignore", arg: 1, scope: !1052, file: !306, line: 87, type: !225)
!1057 = !DILocation(line: 0, scope: !1052)
!1058 = !DILocation(line: 89, column: 16, scope: !1052)
!1059 = !{!1060, !1060, i64 0}
!1060 = !{!"_Bool", !761, i64 0}
!1061 = !DILocation(line: 90, column: 1, scope: !1052)
!1062 = distinct !DISubprogram(name: "close_stdout", scope: !306, file: !306, line: 116, type: !372, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !1063)
!1063 = !{!1064}
!1064 = !DILocalVariable(name: "write_error", scope: !1065, file: !306, line: 121, type: !70)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !306, line: 120, column: 5)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !306, line: 118, column: 7)
!1067 = !DILocation(line: 118, column: 21, scope: !1066)
!1068 = !DILocation(line: 118, column: 7, scope: !1066)
!1069 = !DILocation(line: 118, column: 29, scope: !1066)
!1070 = !DILocation(line: 119, column: 7, scope: !1066)
!1071 = !DILocation(line: 119, column: 12, scope: !1066)
!1072 = !{i8 0, i8 2}
!1073 = !DILocation(line: 119, column: 25, scope: !1066)
!1074 = !DILocation(line: 119, column: 28, scope: !1066)
!1075 = !DILocation(line: 119, column: 34, scope: !1066)
!1076 = !DILocation(line: 118, column: 7, scope: !1062)
!1077 = !DILocation(line: 121, column: 33, scope: !1065)
!1078 = !DILocation(line: 0, scope: !1065)
!1079 = !DILocation(line: 122, column: 11, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1065, file: !306, line: 122, column: 11)
!1081 = !DILocation(line: 0, scope: !1080)
!1082 = !DILocation(line: 122, column: 11, scope: !1065)
!1083 = !DILocation(line: 123, column: 9, scope: !1080)
!1084 = !DILocation(line: 126, column: 9, scope: !1080)
!1085 = !DILocation(line: 128, column: 14, scope: !1065)
!1086 = !DILocation(line: 128, column: 7, scope: !1065)
!1087 = !DILocation(line: 133, column: 42, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1062, file: !306, line: 133, column: 7)
!1089 = !DILocation(line: 133, column: 28, scope: !1088)
!1090 = !DILocation(line: 133, column: 50, scope: !1088)
!1091 = !DILocation(line: 133, column: 7, scope: !1062)
!1092 = !DILocation(line: 134, column: 12, scope: !1088)
!1093 = !DILocation(line: 134, column: 5, scope: !1088)
!1094 = !DILocation(line: 135, column: 1, scope: !1062)
!1095 = !DISubprogram(name: "_exit", scope: !1037, file: !1037, line: 624, type: !749, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1096 = distinct !DISubprogram(name: "verror", scope: !321, file: !321, line: 251, type: !1097, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1099)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !97, !97, !70, !331}
!1099 = !{!1100, !1101, !1102, !1103}
!1100 = !DILocalVariable(name: "status", arg: 1, scope: !1096, file: !321, line: 251, type: !97)
!1101 = !DILocalVariable(name: "errnum", arg: 2, scope: !1096, file: !321, line: 251, type: !97)
!1102 = !DILocalVariable(name: "message", arg: 3, scope: !1096, file: !321, line: 251, type: !70)
!1103 = !DILocalVariable(name: "args", arg: 4, scope: !1096, file: !321, line: 251, type: !331)
!1104 = !DILocation(line: 0, scope: !1096)
!1105 = !DILocation(line: 261, column: 3, scope: !1096)
!1106 = !DILocation(line: 265, column: 7, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1096, file: !321, line: 265, column: 7)
!1108 = !DILocation(line: 265, column: 7, scope: !1096)
!1109 = !DILocation(line: 266, column: 5, scope: !1107)
!1110 = !DILocation(line: 272, column: 7, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1107, file: !321, line: 268, column: 5)
!1112 = !DILocation(line: 276, column: 3, scope: !1096)
!1113 = !{i64 0, i64 8, !759, i64 8, i64 8, !759, i64 16, i64 8, !759, i64 24, i64 4, !819, i64 28, i64 4, !819}
!1114 = !DILocation(line: 282, column: 1, scope: !1096)
!1115 = distinct !DISubprogram(name: "flush_stdout", scope: !321, file: !321, line: 163, type: !372, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1116)
!1116 = !{!1117}
!1117 = !DILocalVariable(name: "stdout_fd", scope: !1115, file: !321, line: 166, type: !97)
!1118 = !DILocation(line: 0, scope: !1115)
!1119 = !DILocalVariable(name: "fd", arg: 1, scope: !1120, file: !321, line: 145, type: !97)
!1120 = distinct !DISubprogram(name: "is_open", scope: !321, file: !321, line: 145, type: !1121, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!97, !97}
!1123 = !{!1119}
!1124 = !DILocation(line: 0, scope: !1120, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 182, column: 25, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1115, file: !321, line: 182, column: 7)
!1127 = !DILocation(line: 157, column: 15, scope: !1120, inlinedAt: !1125)
!1128 = !DILocation(line: 157, column: 12, scope: !1120, inlinedAt: !1125)
!1129 = !DILocation(line: 182, column: 7, scope: !1115)
!1130 = !DILocation(line: 184, column: 5, scope: !1126)
!1131 = !DILocation(line: 185, column: 1, scope: !1115)
!1132 = distinct !DISubprogram(name: "error_tail", scope: !321, file: !321, line: 219, type: !1097, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1133)
!1133 = !{!1134, !1135, !1136, !1137}
!1134 = !DILocalVariable(name: "status", arg: 1, scope: !1132, file: !321, line: 219, type: !97)
!1135 = !DILocalVariable(name: "errnum", arg: 2, scope: !1132, file: !321, line: 219, type: !97)
!1136 = !DILocalVariable(name: "message", arg: 3, scope: !1132, file: !321, line: 219, type: !70)
!1137 = !DILocalVariable(name: "args", arg: 4, scope: !1132, file: !321, line: 219, type: !331)
!1138 = distinct !DIAssignID()
!1139 = !DILocation(line: 0, scope: !1132)
!1140 = !DILocation(line: 229, column: 13, scope: !1132)
!1141 = !DILocation(line: 135, column: 10, scope: !1142, inlinedAt: !1184)
!1142 = distinct !DISubprogram(name: "vfprintf", scope: !806, file: !806, line: 132, type: !1143, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1180)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!97, !1145, !810, !333}
!1145 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1148, file: !242, line: 51, baseType: !97, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1148, file: !242, line: 54, baseType: !246, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1148, file: !242, line: 55, baseType: !246, size: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1148, file: !242, line: 56, baseType: !246, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1148, file: !242, line: 57, baseType: !246, size: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1148, file: !242, line: 58, baseType: !246, size: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1148, file: !242, line: 59, baseType: !246, size: 64, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1148, file: !242, line: 60, baseType: !246, size: 64, offset: 448)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1148, file: !242, line: 61, baseType: !246, size: 64, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1148, file: !242, line: 64, baseType: !246, size: 64, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1148, file: !242, line: 65, baseType: !246, size: 64, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1148, file: !242, line: 66, baseType: !246, size: 64, offset: 704)
