; ModuleID = 'src/[.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [85 x i8] c"Usage: test EXPRESSION\0A  or:  test\0A  or:  [ EXPRESSION ]\0A  or:  [ ]\0A  or:  [ OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"Exit with the status determined by EXPRESSION.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"[\00", align 1

!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "binop", file: !6, line: 58, baseType: !7, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!29 = !DIEnumerator(name: "EQ_STRING_BINOP", value: 0)
!30 = !DIEnumerator(name: "GT_STRING_BINOP", value: 1)
!31 = !DIEnumerator(name: "LT_STRING_BINOP", value: 2)
!32 = !DIEnumerator(name: "NE_STRING_BINOP", value: 3)
!33 = !DIEnumerator(name: "EQ_BINOP", value: 4)
!34 = !DIEnumerator(name: "GE_BINOP", value: 5)
!35 = !DIEnumerator(name: "GT_BINOP", value: 6)
!36 = !DIEnumerator(name: "LE_BINOP", value: 7)
!37 = !DIEnumerator(name: "LT_BINOP", value: 8)
!38 = !DIEnumerator(name: "NE_BINOP", value: 9)
!39 = !DIEnumerator(name: "EF_BINOP", value: 10)
!40 = !DIEnumerator(name: "NT_BINOP", value: 11)
!41 = !DIEnumerator(name: "OT_BINOP", value: 12)
!42 = !{!43, !45, !46, !47, !48, !51, !53, !54}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!50 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !55, line: 10, baseType: !56)
!55 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !57, line: 160, baseType: !58)
!57 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!58 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!59 = !{!60, !62, !0, !64}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "pos", scope: !2, file: !6, line: 78, type: !46, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "argc", scope: !2, file: !6, line: 79, type: !46, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !66, file: !67, line: 575, type: !46, isLocal: true, isDefinition: true)
!66 = distinct !DISubprogram(name: "oputs_", scope: !67, file: !67, line: 573, type: !68, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !70)
!67 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!68 = !DISubroutineType(types: !69)
!69 = !{null, !51, !51}
!70 = !{!71, !72, !73, !76, !78, !79, !80, !84, !85, !86, !87, !89, !143, !144, !145, !147, !148}
!71 = !DILocalVariable(name: "program", arg: 1, scope: !66, file: !67, line: 573, type: !51)
!72 = !DILocalVariable(name: "option", arg: 2, scope: !66, file: !67, line: 573, type: !51)
!73 = !DILocalVariable(name: "term", scope: !74, file: !67, line: 585, type: !51)
!74 = distinct !DILexicalBlock(scope: !75, file: !67, line: 582, column: 5)
!75 = distinct !DILexicalBlock(scope: !66, file: !67, line: 581, column: 7)
!76 = !DILocalVariable(name: "double_space", scope: !66, file: !67, line: 594, type: !77)
!77 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!78 = !DILocalVariable(name: "first_word", scope: !66, file: !67, line: 595, type: !51)
!79 = !DILocalVariable(name: "option_text", scope: !66, file: !67, line: 596, type: !51)
!80 = !DILocalVariable(name: "s", scope: !81, file: !67, line: 608, type: !51)
!81 = distinct !DILexicalBlock(scope: !82, file: !67, line: 605, column: 5)
!82 = distinct !DILexicalBlock(scope: !83, file: !67, line: 604, column: 12)
!83 = distinct !DILexicalBlock(scope: !66, file: !67, line: 597, column: 7)
!84 = !DILocalVariable(name: "spaces", scope: !81, file: !67, line: 609, type: !48)
!85 = !DILocalVariable(name: "anchor_len", scope: !66, file: !67, line: 620, type: !48)
!86 = !DILocalVariable(name: "desc_text", scope: !66, file: !67, line: 625, type: !51)
!87 = !DILocalVariable(name: "__ptr", scope: !88, file: !67, line: 644, type: !51)
!88 = distinct !DILexicalBlock(scope: !66, file: !67, line: 644, column: 3)
!89 = !DILocalVariable(name: "__stream", scope: !88, file: !67, line: 644, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !92, line: 7, baseType: !93)
!92 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !94, line: 49, size: 1728, elements: !95)
!94 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !111, !113, !114, !115, !117, !118, !120, !124, !127, !129, !132, !135, !136, !137, !138, !139}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !93, file: !94, line: 51, baseType: !46, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !93, file: !94, line: 54, baseType: !43, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !93, file: !94, line: 55, baseType: !43, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !93, file: !94, line: 56, baseType: !43, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !93, file: !94, line: 57, baseType: !43, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !93, file: !94, line: 58, baseType: !43, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !93, file: !94, line: 59, baseType: !43, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !93, file: !94, line: 60, baseType: !43, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !93, file: !94, line: 61, baseType: !43, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !93, file: !94, line: 64, baseType: !43, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !93, file: !94, line: 65, baseType: !43, size: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !93, file: !94, line: 66, baseType: !43, size: 64, offset: 704)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !93, file: !94, line: 68, baseType: !109, size: 64, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !94, line: 36, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !93, file: !94, line: 70, baseType: !112, size: 64, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !93, file: !94, line: 72, baseType: !46, size: 32, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !93, file: !94, line: 73, baseType: !46, size: 32, offset: 928)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !93, file: !94, line: 74, baseType: !116, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 152, baseType: !58)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !93, file: !94, line: 77, baseType: !47, size: 16, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !93, file: !94, line: 78, baseType: !119, size: 8, offset: 1040)
!119 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !93, file: !94, line: 79, baseType: !121, size: 8, offset: 1048)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 1)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !93, file: !94, line: 81, baseType: !125, size: 64, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !94, line: 43, baseType: null)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !93, file: !94, line: 89, baseType: !128, size: 64, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 153, baseType: !58)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !93, file: !94, line: 91, baseType: !130, size: 64, offset: 1216)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !94, line: 37, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !93, file: !94, line: 92, baseType: !133, size: 64, offset: 1280)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !94, line: 38, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !93, file: !94, line: 93, baseType: !112, size: 64, offset: 1344)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !93, file: !94, line: 94, baseType: !45, size: 64, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !93, file: !94, line: 95, baseType: !48, size: 64, offset: 1472)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !93, file: !94, line: 96, baseType: !46, size: 32, offset: 1536)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !93, file: !94, line: 98, baseType: !140, size: 160, offset: 1568)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 20)
!143 = !DILocalVariable(name: "__cnt", scope: !88, file: !67, line: 644, type: !48)
!144 = !DILocalVariable(name: "url_program", scope: !66, file: !67, line: 648, type: !51)
!145 = !DILocalVariable(name: "__ptr", scope: !146, file: !67, line: 686, type: !51)
!146 = distinct !DILexicalBlock(scope: !66, file: !67, line: 686, column: 3)
!147 = !DILocalVariable(name: "__stream", scope: !146, file: !67, line: 686, type: !90)
!148 = !DILocalVariable(name: "__cnt", scope: !146, file: !67, line: 686, type: !48)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "Version", scope: !152, file: !153, line: 3, type: !51, isLocal: false, isDefinition: true)
!152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !153, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !154, splitDebugInlining: false, nameTableKind: None)
!153 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!154 = !{!150}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "file_name", scope: !157, file: !158, line: 45, type: !51, isLocal: true, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !159, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!159 = !{!155, !160}
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !157, file: !158, line: 55, type: !77, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !164, file: !165, line: 66, type: !200, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !166, globals: !167, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!166 = !{!45, !53}
!167 = !{!168, !194, !162, !196, !198}
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "old_file_name", scope: !170, file: !165, line: 304, type: !51, isLocal: true, isDefinition: true)
!170 = distinct !DISubprogram(name: "verror_at_line", scope: !165, file: !165, line: 298, type: !171, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !164, retainedNodes: !187)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !46, !46, !51, !7, !51, !173}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !174, line: 52, baseType: !175)
!174 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !176, line: 32, baseType: !177)
!176 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !178, baseType: !179)
!178 = !DIFile(filename: "lib/error.c", directory: "/src")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !180, size: 256, elements: !181)
!180 = !DINamespace(name: "std", scope: null)
!181 = !{!182, !183, !184, !185, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !179, file: !178, baseType: !45, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !179, file: !178, baseType: !45, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !179, file: !178, baseType: !45, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !179, file: !178, baseType: !46, size: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !179, file: !178, baseType: !46, size: 32, offset: 224)
!187 = !{!188, !189, !190, !191, !192, !193}
!188 = !DILocalVariable(name: "status", arg: 1, scope: !170, file: !165, line: 298, type: !46)
!189 = !DILocalVariable(name: "errnum", arg: 2, scope: !170, file: !165, line: 298, type: !46)
!190 = !DILocalVariable(name: "file_name", arg: 3, scope: !170, file: !165, line: 298, type: !51)
!191 = !DILocalVariable(name: "line_number", arg: 4, scope: !170, file: !165, line: 298, type: !7)
!192 = !DILocalVariable(name: "message", arg: 5, scope: !170, file: !165, line: 298, type: !51)
!193 = !DILocalVariable(name: "args", arg: 6, scope: !170, file: !165, line: 298, type: !173)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "old_line_number", scope: !170, file: !165, line: 305, type: !7, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "error_message_count", scope: !164, file: !165, line: 69, type: !7, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !164, file: !165, line: 295, type: !46, isLocal: false, isDefinition: true)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "program_name", scope: !205, file: !206, line: 31, type: !51, isLocal: false, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !207, globals: !208, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!207 = !{!43}
!208 = !{!203}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "utf07FF", scope: !211, file: !212, line: 46, type: !242, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "proper_name_lite", scope: !212, file: !212, line: 38, type: !213, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !217)
!212 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!213 = !DISubroutineType(types: !214)
!214 = !{!51, !51, !51}
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !216, splitDebugInlining: false, nameTableKind: None)
!216 = !{!209}
!217 = !{!218, !219, !220, !221, !226}
!218 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !211, file: !212, line: 38, type: !51)
!219 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !211, file: !212, line: 38, type: !51)
!220 = !DILocalVariable(name: "translation", scope: !211, file: !212, line: 40, type: !51)
!221 = !DILocalVariable(name: "w", scope: !211, file: !212, line: 47, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !223, line: 37, baseType: !224)
!223 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !57, line: 57, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 42, baseType: !7)
!226 = !DILocalVariable(name: "mbs", scope: !211, file: !212, line: 48, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !229)
!228 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !231)
!230 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !231, file: !230, line: 15, baseType: !46, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !231, file: !230, line: 20, baseType: !235, size: 32, offset: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !230, line: 16, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !235, file: !230, line: 18, baseType: !7, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !235, file: !230, line: 19, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 4)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 16, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !247, file: !248, line: 76, type: !330, isLocal: false, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !269, globals: !270, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!249 = !{!250, !264, !12}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !251, line: 42, baseType: !7, size: 32, elements: !252)
!251 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!253 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!254 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!255 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!256 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!257 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!258 = !DIEnumerator(name: "c_quoting_style", value: 5)
!259 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!260 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!261 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!262 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!263 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !251, line: 254, baseType: !7, size: 32, elements: !265)
!265 = !{!266, !267, !268}
!266 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!267 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!268 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!269 = !{!46, !47, !48}
!270 = !{!245, !271, !277, !289, !291, !296, !319, !326, !328}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !247, file: !248, line: 92, type: !273, isLocal: false, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 320, elements: !275)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!275 = !{!276}
!276 = !DISubrange(count: 10)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !247, file: !248, line: 1040, type: !279, isLocal: false, isDefinition: true)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !248, line: 56, size: 448, elements: !280)
!280 = !{!281, !282, !283, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !279, file: !248, line: 59, baseType: !250, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !248, line: 62, baseType: !46, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !279, file: !248, line: 66, baseType: !284, size: 256, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !279, file: !248, line: 69, baseType: !51, size: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !279, file: !248, line: 72, baseType: !51, size: 64, offset: 384)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !247, file: !248, line: 107, type: !279, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "slot0", scope: !247, file: !248, line: 831, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 256)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "quote", scope: !298, file: !248, line: 228, type: !317, isLocal: true, isDefinition: true)
!298 = distinct !DISubprogram(name: "gettext_quote", scope: !248, file: !248, line: 197, type: !299, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !301)
!299 = !DISubroutineType(types: !300)
!300 = !{!51, !51, !250}
!301 = !{!302, !303, !304, !305, !306}
!302 = !DILocalVariable(name: "msgid", arg: 1, scope: !298, file: !248, line: 197, type: !51)
!303 = !DILocalVariable(name: "s", arg: 2, scope: !298, file: !248, line: 197, type: !250)
!304 = !DILocalVariable(name: "translation", scope: !298, file: !248, line: 199, type: !51)
!305 = !DILocalVariable(name: "w", scope: !298, file: !248, line: 229, type: !222)
!306 = !DILocalVariable(name: "mbs", scope: !298, file: !248, line: 230, type: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !309, file: !230, line: 15, baseType: !46, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !309, file: !230, line: 20, baseType: !313, size: 32, offset: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !230, line: 16, size: 32, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !313, file: !230, line: 18, baseType: !7, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !313, file: !230, line: 19, baseType: !239, size: 32)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !318)
!318 = !{!244, !241}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "slotvec", scope: !247, file: !248, line: 834, type: !321, isLocal: true, isDefinition: true)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !248, line: 823, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !322, file: !248, line: 825, baseType: !48, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !322, file: !248, line: 826, baseType: !43, size: 64, offset: 64)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "nslots", scope: !247, file: !248, line: 832, type: !46, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "slotvec0", scope: !247, file: !248, line: 833, type: !322, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 704, elements: !332)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!332 = !{!333}
!333 = !DISubrange(count: 11)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !336, file: !337, line: 26, type: !339, isLocal: false, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !338, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!338 = !{!334}
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 47)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "exit_failure", scope: !344, file: !345, line: 24, type: !347, isLocal: false, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !346, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!346 = !{!342}
!347 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "internal_state", scope: !350, file: !351, line: 97, type: !354, isLocal: true, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, globals: !353, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!352 = !{!45, !48, !53}
!353 = !{!348}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !356, file: !230, line: 15, baseType: !46, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !356, file: !230, line: 20, baseType: !360, size: 32, offset: 32)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !356, file: !230, line: 16, size: 32, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !360, file: !230, line: 18, baseType: !7, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !360, file: !230, line: 19, baseType: !239, size: 32)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !368, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !370, line: 102, baseType: !371)
!370 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !57, line: 73, baseType: !50)
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!373 = !DIFile(filename: "lib/strintcmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cbb3801b0b03f23f2fd643484b645368")
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !376, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!375 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!376 = !{!377}
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !375, line: 40, baseType: !7, size: 32, elements: !378)
!378 = !{!379}
!379 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!380 = !{!45}
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !383, retainedTypes: !414, splitDebugInlining: false, nameTableKind: None)
!382 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!383 = !{!384, !396}
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !385, file: !382, line: 188, baseType: !7, size: 32, elements: !394)
!385 = distinct !DISubprogram(name: "x2nrealloc", scope: !382, file: !382, line: 176, type: !386, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !381, retainedNodes: !389)
!386 = !DISubroutineType(types: !387)
!387 = !{!45, !45, !388, !48}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!389 = !{!390, !391, !392, !393}
!390 = !DILocalVariable(name: "p", arg: 1, scope: !385, file: !382, line: 176, type: !45)
!391 = !DILocalVariable(name: "pn", arg: 2, scope: !385, file: !382, line: 176, type: !388)
!392 = !DILocalVariable(name: "s", arg: 3, scope: !385, file: !382, line: 176, type: !48)
!393 = !DILocalVariable(name: "n", scope: !385, file: !382, line: 178, type: !48)
!394 = !{!395}
!395 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !397, file: !382, line: 228, baseType: !7, size: 32, elements: !394)
!397 = distinct !DISubprogram(name: "xpalloc", scope: !382, file: !382, line: 223, type: !398, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !381, retainedNodes: !404)
!398 = !DISubroutineType(types: !399)
!399 = !{!45, !45, !400, !401, !403, !401}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !402, line: 130, baseType: !403)
!402 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !49, line: 35, baseType: !58)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413}
!405 = !DILocalVariable(name: "pa", arg: 1, scope: !397, file: !382, line: 223, type: !45)
!406 = !DILocalVariable(name: "pn", arg: 2, scope: !397, file: !382, line: 223, type: !400)
!407 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !397, file: !382, line: 223, type: !401)
!408 = !DILocalVariable(name: "n_max", arg: 4, scope: !397, file: !382, line: 223, type: !403)
!409 = !DILocalVariable(name: "s", arg: 5, scope: !397, file: !382, line: 223, type: !401)
!410 = !DILocalVariable(name: "n0", scope: !397, file: !382, line: 230, type: !401)
!411 = !DILocalVariable(name: "n", scope: !397, file: !382, line: 237, type: !401)
!412 = !DILocalVariable(name: "nbytes", scope: !397, file: !382, line: 248, type: !401)
!413 = !DILocalVariable(name: "adjusted_nbytes", scope: !397, file: !382, line: 252, type: !401)
!414 = !{!43, !45, !77, !58, !50}
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !427, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!427 = !{!77, !50, !45}
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!434 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!435 = !{i32 7, !"Dwarf Version", i32 5}
!436 = !{i32 2, !"Debug Info Version", i32 3}
!437 = !{i32 1, !"wchar_size", i32 4}
!438 = !{i32 1, !"branch-target-enforcement", i32 0}
!439 = !{i32 1, !"sign-return-address", i32 0}
!440 = !{i32 1, !"sign-return-address-all", i32 0}
!441 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!442 = !{i32 7, !"PIC Level", i32 2}
!443 = !{i32 7, !"PIE Level", i32 2}
!444 = !{i32 7, !"uwtable", i32 1}
!445 = !{i32 7, !"frame-pointer", i32 1}
!446 = distinct !DISubprogram(name: "usage", scope: !6, file: !6, line: 661, type: !447, scopeLine: 662, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !46}
!449 = !{!450}
!450 = !DILocalVariable(name: "status", arg: 1, scope: !446, file: !6, line: 661, type: !46)
!451 = !DILocation(line: 0, scope: !446)
!452 = !DILocation(line: 663, column: 14, scope: !453)
!453 = distinct !DILexicalBlock(scope: !446, file: !6, line: 663, column: 7)
!454 = !DILocation(line: 663, column: 7, scope: !446)
!455 = !DILocation(line: 664, column: 5, scope: !456)
!456 = distinct !DILexicalBlock(scope: !453, file: !6, line: 664, column: 5)
!457 = !{!458, !458, i64 0}
!458 = !{!"any pointer", !459, i64 0}
!459 = !{!"omnipotent char", !460, i64 0}
!460 = !{!"Simple C/C++ TBAA"}
!461 = !DILocation(line: 667, column: 7, scope: !462)
!462 = distinct !DILexicalBlock(scope: !453, file: !6, line: 666, column: 5)
!463 = !DILocation(line: 674, column: 7, scope: !462)
!464 = !DILocation(line: 678, column: 7, scope: !462)
!465 = !DILocation(line: 679, column: 7, scope: !462)
!466 = !DILocation(line: 680, column: 7, scope: !462)
!467 = !DILocation(line: 685, column: 7, scope: !462)
!468 = !DILocation(line: 692, column: 7, scope: !462)
!469 = !DILocation(line: 695, column: 7, scope: !462)
!470 = !DILocation(line: 698, column: 7, scope: !462)
!471 = !DILocation(line: 701, column: 7, scope: !462)
!472 = !DILocation(line: 704, column: 7, scope: !462)
!473 = !DILocation(line: 710, column: 7, scope: !462)
!474 = !DILocation(line: 713, column: 7, scope: !462)
!475 = !DILocation(line: 716, column: 7, scope: !462)
!476 = !DILocation(line: 719, column: 7, scope: !462)
!477 = !DILocation(line: 722, column: 7, scope: !462)
!478 = !DILocation(line: 725, column: 7, scope: !462)
!479 = !DILocation(line: 728, column: 7, scope: !462)
!480 = !DILocation(line: 731, column: 7, scope: !462)
!481 = !DILocation(line: 734, column: 7, scope: !462)
!482 = !DILocation(line: 737, column: 7, scope: !462)
!483 = !DILocation(line: 740, column: 7, scope: !462)
!484 = !DILocation(line: 743, column: 7, scope: !462)
!485 = !DILocation(line: 746, column: 7, scope: !462)
!486 = !DILocation(line: 749, column: 7, scope: !462)
!487 = !DILocation(line: 752, column: 7, scope: !462)
!488 = !DILocation(line: 755, column: 7, scope: !462)
!489 = !DILocation(line: 758, column: 7, scope: !462)
!490 = !DILocation(line: 761, column: 7, scope: !462)
!491 = !DILocation(line: 764, column: 7, scope: !462)
!492 = !DILocation(line: 767, column: 7, scope: !462)
!493 = !DILocation(line: 770, column: 7, scope: !462)
!494 = !DILocation(line: 773, column: 7, scope: !462)
!495 = !DILocation(line: 776, column: 7, scope: !462)
!496 = !DILocation(line: 779, column: 7, scope: !462)
!497 = !DILocation(line: 782, column: 7, scope: !462)
!498 = !DILocation(line: 785, column: 7, scope: !462)
!499 = !DILocation(line: 788, column: 7, scope: !462)
!500 = !DILocation(line: 791, column: 7, scope: !462)
!501 = !DILocation(line: 794, column: 7, scope: !462)
!502 = !DILocation(line: 797, column: 7, scope: !462)
!503 = !DILocation(line: 800, column: 7, scope: !462)
!504 = !DILocation(line: 803, column: 7, scope: !462)
!505 = !DILocation(line: 806, column: 7, scope: !462)
!506 = !DILocation(line: 812, column: 7, scope: !462)
!507 = !DILocation(line: 817, column: 7, scope: !462)
!508 = !DILocation(line: 821, column: 7, scope: !462)
!509 = !DILocalVariable(name: "program", arg: 1, scope: !510, file: !67, line: 836, type: !51)
!510 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !67, file: !67, line: 836, type: !511, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !51}
!513 = !{!509, !514, !523, !524, !526, !527}
!514 = !DILocalVariable(name: "infomap", scope: !510, file: !67, line: 838, type: !515)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 896, elements: !521)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !510, file: !67, line: 838, size: 128, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !517, file: !67, line: 838, baseType: !51, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !517, file: !67, line: 838, baseType: !51, size: 64, offset: 64)
!521 = !{!522}
!522 = !DISubrange(count: 7)
!523 = !DILocalVariable(name: "node", scope: !510, file: !67, line: 848, type: !51)
!524 = !DILocalVariable(name: "map_prog", scope: !510, file: !67, line: 849, type: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!526 = !DILocalVariable(name: "lc_messages", scope: !510, file: !67, line: 861, type: !51)
!527 = !DILocalVariable(name: "url_program", scope: !510, file: !67, line: 874, type: !51)
!528 = !DILocation(line: 0, scope: !510, inlinedAt: !529)
!529 = distinct !DILocation(line: 822, column: 7, scope: !462)
!530 = !DILocation(line: 838, column: 3, scope: !510, inlinedAt: !529)
!531 = !DILocation(line: 838, column: 67, scope: !510, inlinedAt: !529)
!532 = !DILocation(line: 849, column: 36, scope: !510, inlinedAt: !529)
!533 = !DILocation(line: 851, column: 3, scope: !510, inlinedAt: !529)
!534 = !DILocalVariable(name: "__s1", arg: 1, scope: !535, file: !536, line: 1359, type: !51)
!535 = distinct !DISubprogram(name: "streq", scope: !536, file: !536, line: 1359, type: !537, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!536 = !DIFile(filename: "./lib/string.h", directory: "/src")
!537 = !DISubroutineType(types: !538)
!538 = !{!77, !51, !51}
!539 = !{!534, !540}
!540 = !DILocalVariable(name: "__s2", arg: 2, scope: !535, file: !536, line: 1359, type: !51)
!541 = !DILocation(line: 0, scope: !535, inlinedAt: !542)
!542 = distinct !DILocation(line: 851, column: 33, scope: !510, inlinedAt: !529)
!543 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !542)
!544 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !542)
!545 = !DILocation(line: 852, column: 13, scope: !510, inlinedAt: !529)
!546 = !DILocation(line: 851, column: 20, scope: !510, inlinedAt: !529)
!547 = !{!548, !458, i64 0}
!548 = !{!"infomap", !458, i64 0, !458, i64 8}
!549 = !DILocation(line: 851, column: 10, scope: !510, inlinedAt: !529)
!550 = !DILocation(line: 851, column: 28, scope: !510, inlinedAt: !529)
!551 = distinct !{!551, !533, !545, !552}
!552 = !{!"llvm.loop.mustprogress"}
!553 = !DILocation(line: 854, column: 17, scope: !554, inlinedAt: !529)
!554 = distinct !DILexicalBlock(scope: !510, file: !67, line: 854, column: 7)
!555 = !{!548, !458, i64 8}
!556 = !DILocation(line: 854, column: 7, scope: !554, inlinedAt: !529)
!557 = !DILocation(line: 854, column: 7, scope: !510, inlinedAt: !529)
!558 = !DILocation(line: 857, column: 3, scope: !510, inlinedAt: !529)
!559 = !DILocation(line: 861, column: 29, scope: !510, inlinedAt: !529)
!560 = !DILocation(line: 862, column: 7, scope: !561, inlinedAt: !529)
!561 = distinct !DILexicalBlock(scope: !510, file: !67, line: 862, column: 7)
!562 = !DILocation(line: 862, column: 19, scope: !561, inlinedAt: !529)
!563 = !DILocation(line: 862, column: 22, scope: !561, inlinedAt: !529)
!564 = !DILocation(line: 862, column: 7, scope: !510, inlinedAt: !529)
!565 = !DILocation(line: 868, column: 7, scope: !566, inlinedAt: !529)
!566 = distinct !DILexicalBlock(scope: !561, file: !67, line: 863, column: 5)
!567 = !DILocation(line: 870, column: 5, scope: !566, inlinedAt: !529)
!568 = !DILocation(line: 0, scope: !535, inlinedAt: !569)
!569 = distinct !DILocation(line: 874, column: 29, scope: !510, inlinedAt: !529)
!570 = !DILocation(line: 875, column: 3, scope: !510, inlinedAt: !529)
!571 = !DILocation(line: 877, column: 3, scope: !510, inlinedAt: !529)
!572 = !DILocation(line: 879, column: 1, scope: !510, inlinedAt: !529)
!573 = !DILocation(line: 824, column: 3, scope: !446)
!574 = !DISubprogram(name: "dcgettext", scope: !575, file: !575, line: 51, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!575 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!576 = !DISubroutineType(types: !577)
!577 = !{!43, !51, !51, !46}
!578 = !{}
!579 = !DISubprogram(name: "fputs_unlocked", scope: !174, file: !174, line: 691, type: !580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!580 = !DISubroutineType(types: !581)
!581 = !{!46, !582, !583}
!582 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!583 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!584 = !DILocation(line: 0, scope: !66)
!585 = !DILocation(line: 581, column: 7, scope: !75)
!586 = !{!587, !587, i64 0}
!587 = !{!"int", !459, i64 0}
!588 = !DILocation(line: 581, column: 19, scope: !75)
!589 = !DILocation(line: 581, column: 7, scope: !66)
!590 = !DILocation(line: 585, column: 26, scope: !74)
!591 = !DILocation(line: 0, scope: !74)
!592 = !DILocation(line: 586, column: 23, scope: !74)
!593 = !DILocation(line: 586, column: 28, scope: !74)
!594 = !DILocation(line: 586, column: 32, scope: !74)
!595 = !{!459, !459, i64 0}
!596 = !DILocation(line: 586, column: 38, scope: !74)
!597 = !DILocation(line: 0, scope: !535, inlinedAt: !598)
!598 = distinct !DILocation(line: 586, column: 41, scope: !74)
!599 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !598)
!600 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !598)
!601 = !DILocation(line: 586, column: 19, scope: !74)
!602 = !DILocation(line: 587, column: 5, scope: !74)
!603 = !DILocation(line: 588, column: 7, scope: !604)
!604 = distinct !DILexicalBlock(scope: !66, file: !67, line: 588, column: 7)
!605 = !DILocation(line: 588, column: 7, scope: !66)
!606 = !DILocation(line: 590, column: 7, scope: !607)
!607 = distinct !DILexicalBlock(scope: !604, file: !67, line: 589, column: 5)
!608 = !DILocation(line: 591, column: 7, scope: !607)
!609 = !DILocation(line: 595, column: 37, scope: !66)
!610 = !DILocation(line: 595, column: 35, scope: !66)
!611 = !DILocation(line: 596, column: 29, scope: !66)
!612 = !DILocation(line: 597, column: 8, scope: !83)
!613 = !DILocation(line: 597, column: 7, scope: !66)
!614 = !DILocation(line: 604, column: 24, scope: !82)
!615 = !DILocation(line: 604, column: 12, scope: !83)
!616 = !DILocation(line: 0, scope: !81)
!617 = !DILocation(line: 610, column: 16, scope: !81)
!618 = !DILocation(line: 610, column: 7, scope: !81)
!619 = !DILocation(line: 611, column: 21, scope: !81)
!620 = !{!621, !621, i64 0}
!621 = !{!"short", !459, i64 0}
!622 = !DILocation(line: 611, column: 19, scope: !81)
!623 = !DILocation(line: 611, column: 16, scope: !81)
!624 = !DILocation(line: 610, column: 30, scope: !81)
!625 = distinct !{!625, !618, !619, !552}
!626 = !DILocation(line: 612, column: 18, scope: !627)
!627 = distinct !DILexicalBlock(scope: !81, file: !67, line: 612, column: 11)
!628 = !DILocation(line: 612, column: 11, scope: !81)
!629 = !DILocation(line: 620, column: 23, scope: !66)
!630 = !DILocation(line: 625, column: 39, scope: !66)
!631 = !DILocation(line: 626, column: 3, scope: !66)
!632 = !DILocation(line: 626, column: 10, scope: !66)
!633 = !DILocation(line: 626, column: 21, scope: !66)
!634 = !DILocation(line: 628, column: 44, scope: !635)
!635 = distinct !DILexicalBlock(scope: !636, file: !67, line: 628, column: 11)
!636 = distinct !DILexicalBlock(scope: !66, file: !67, line: 627, column: 5)
!637 = !DILocation(line: 628, column: 32, scope: !635)
!638 = !DILocation(line: 628, column: 49, scope: !635)
!639 = !DILocation(line: 628, column: 11, scope: !636)
!640 = !DILocation(line: 630, column: 11, scope: !641)
!641 = distinct !DILexicalBlock(scope: !636, file: !67, line: 630, column: 11)
!642 = !DILocation(line: 630, column: 11, scope: !636)
!643 = !DILocation(line: 632, column: 26, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !67, line: 632, column: 15)
!645 = distinct !DILexicalBlock(scope: !641, file: !67, line: 631, column: 9)
!646 = !DILocation(line: 632, column: 34, scope: !644)
!647 = !DILocation(line: 632, column: 37, scope: !644)
!648 = !DILocation(line: 632, column: 15, scope: !645)
!649 = !DILocation(line: 636, column: 29, scope: !650)
!650 = distinct !DILexicalBlock(scope: !645, file: !67, line: 636, column: 15)
!651 = !DILocation(line: 640, column: 16, scope: !636)
!652 = distinct !{!652, !631, !653, !552}
!653 = !DILocation(line: 641, column: 5, scope: !66)
!654 = !DILocation(line: 644, column: 3, scope: !66)
!655 = !DILocation(line: 0, scope: !535, inlinedAt: !656)
!656 = distinct !DILocation(line: 648, column: 31, scope: !66)
!657 = !DILocation(line: 663, column: 7, scope: !658)
!658 = distinct !DILexicalBlock(scope: !66, file: !67, line: 663, column: 7)
!659 = !DILocation(line: 664, column: 7, scope: !658)
!660 = !DILocation(line: 664, column: 10, scope: !658)
!661 = !DILocation(line: 663, column: 7, scope: !66)
!662 = !DILocation(line: 669, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !658, file: !67, line: 665, column: 5)
!664 = !DILocation(line: 671, column: 5, scope: !663)
!665 = !DILocation(line: 676, column: 7, scope: !666)
!666 = distinct !DILexicalBlock(scope: !658, file: !67, line: 673, column: 5)
!667 = !DILocation(line: 679, column: 3, scope: !66)
!668 = !DILocation(line: 683, column: 3, scope: !66)
!669 = !DILocation(line: 686, column: 3, scope: !66)
!670 = !DILocation(line: 688, column: 3, scope: !66)
!671 = !DILocation(line: 691, column: 3, scope: !66)
!672 = !DILocation(line: 695, column: 3, scope: !66)
!673 = !DILocation(line: 696, column: 1, scope: !66)
!674 = !DISubprogram(name: "setlocale", scope: !675, file: !675, line: 122, type: !676, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!675 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!676 = !DISubroutineType(types: !677)
!677 = !{!43, !46, !51}
!678 = !DISubprogram(name: "getenv", scope: !679, file: !679, line: 641, type: !680, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!679 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!680 = !DISubroutineType(types: !681)
!681 = !{!43, !51}
!682 = !DISubprogram(name: "fwrite_unlocked", scope: !174, file: !174, line: 704, type: !683, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!683 = !DISubroutineType(types: !684)
!684 = !{!48, !685, !48, !48, !583}
!685 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!688 = distinct !DISubprogram(name: "main", scope: !6, file: !6, line: 843, type: !689, scopeLine: 844, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !691)
!689 = !DISubroutineType(types: !690)
!690 = !{!46, !46, !149}
!691 = !{!692, !693, !694}
!692 = !DILocalVariable(name: "margc", arg: 1, scope: !688, file: !6, line: 843, type: !46)
!693 = !DILocalVariable(name: "margv", arg: 2, scope: !688, file: !6, line: 843, type: !149)
!694 = !DILocalVariable(name: "value", scope: !688, file: !6, line: 845, type: !77)
!695 = !DILocation(line: 0, scope: !688)
!696 = !DILocation(line: 856, column: 21, scope: !688)
!697 = !DILocation(line: 856, column: 3, scope: !688)
!698 = !DILocation(line: 857, column: 3, scope: !688)
!699 = !DILocation(line: 858, column: 3, scope: !688)
!700 = !DILocation(line: 859, column: 3, scope: !688)
!701 = !DILocalVariable(name: "status", arg: 1, scope: !702, file: !67, line: 102, type: !46)
!702 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !67, file: !67, line: 102, type: !447, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !703)
!703 = !{!701}
!704 = !DILocation(line: 0, scope: !702, inlinedAt: !705)
!705 = distinct !DILocation(line: 861, column: 3, scope: !688)
!706 = !DILocation(line: 105, column: 18, scope: !707, inlinedAt: !705)
!707 = distinct !DILexicalBlock(scope: !702, file: !67, line: 104, column: 7)
!708 = !DILocation(line: 862, column: 3, scope: !688)
!709 = !DILocation(line: 865, column: 8, scope: !688)
!710 = !DILocation(line: 875, column: 17, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !6, line: 875, column: 11)
!712 = distinct !DILexicalBlock(scope: !713, file: !6, line: 868, column: 5)
!713 = distinct !DILexicalBlock(scope: !688, file: !6, line: 867, column: 7)
!714 = !DILocation(line: 875, column: 11, scope: !712)
!715 = !DILocation(line: 877, column: 22, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !6, line: 877, column: 15)
!717 = distinct !DILexicalBlock(scope: !711, file: !6, line: 876, column: 9)
!718 = !DILocation(line: 0, scope: !535, inlinedAt: !719)
!719 = distinct !DILocation(line: 877, column: 15, scope: !716)
!720 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !719)
!721 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !719)
!722 = !DILocation(line: 877, column: 15, scope: !717)
!723 = !DILocation(line: 878, column: 13, scope: !716)
!724 = !DILocation(line: 0, scope: !535, inlinedAt: !725)
!725 = distinct !DILocation(line: 880, column: 15, scope: !726)
!726 = distinct !DILexicalBlock(scope: !717, file: !6, line: 880, column: 15)
!727 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !725)
!728 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !725)
!729 = !DILocation(line: 880, column: 15, scope: !717)
!730 = !DILocation(line: 882, column: 28, scope: !731)
!731 = distinct !DILexicalBlock(scope: !726, file: !6, line: 881, column: 13)
!732 = !DILocation(line: 882, column: 64, scope: !731)
!733 = !DILocation(line: 882, column: 73, scope: !731)
!734 = !DILocation(line: 882, column: 15, scope: !731)
!735 = !DILocation(line: 884, column: 15, scope: !731)
!736 = !DILocation(line: 887, column: 17, scope: !737)
!737 = distinct !DILexicalBlock(scope: !712, file: !6, line: 887, column: 11)
!738 = !DILocation(line: 887, column: 21, scope: !737)
!739 = !DILocation(line: 887, column: 44, scope: !737)
!740 = !DILocation(line: 887, column: 32, scope: !737)
!741 = !DILocation(line: 0, scope: !535, inlinedAt: !742)
!742 = distinct !DILocation(line: 887, column: 25, scope: !737)
!743 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !742)
!744 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !742)
!745 = !DILocation(line: 887, column: 11, scope: !712)
!746 = !DILocation(line: 888, column: 28, scope: !737)
!747 = !DILocation(line: 888, column: 45, scope: !737)
!748 = !DILocation(line: 888, column: 9, scope: !737)
!749 = !DILocation(line: 893, column: 8, scope: !688)
!750 = !DILocation(line: 894, column: 7, scope: !688)
!751 = !DILocation(line: 896, column: 11, scope: !752)
!752 = distinct !DILexicalBlock(scope: !688, file: !6, line: 896, column: 7)
!753 = !DILocation(line: 896, column: 7, scope: !688)
!754 = !DILocation(line: 899, column: 27, scope: !688)
!755 = !DILocation(line: 899, column: 11, scope: !688)
!756 = !DILocation(line: 901, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !688, file: !6, line: 901, column: 7)
!758 = !DILocation(line: 901, column: 14, scope: !757)
!759 = !DILocation(line: 901, column: 11, scope: !757)
!760 = !DILocation(line: 901, column: 7, scope: !688)
!761 = !DILocation(line: 902, column: 24, scope: !757)
!762 = !DILocation(line: 902, column: 55, scope: !757)
!763 = !DILocation(line: 902, column: 60, scope: !757)
!764 = !DILocation(line: 902, column: 48, scope: !757)
!765 = !DILocation(line: 902, column: 5, scope: !757)
!766 = !DILocation(line: 904, column: 3, scope: !688)
!767 = !DILocation(line: 905, column: 1, scope: !688)
!768 = !DISubprogram(name: "bindtextdomain", scope: !575, file: !575, line: 86, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!769 = !DISubroutineType(types: !770)
!770 = !{!43, !51, !51}
!771 = !DISubprogram(name: "textdomain", scope: !575, file: !575, line: 82, type: !680, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!772 = !DISubprogram(name: "atexit", scope: !679, file: !679, line: 602, type: !773, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !578)
!773 = !DISubroutineType(types: !774)
!774 = !{!46, !200}
!775 = distinct !DISubprogram(name: "test_syntax_error", scope: !6, file: !6, line: 97, type: !776, scopeLine: 98, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !51, null}
!778 = !{!779, !780}
!779 = !DILocalVariable(name: "format", arg: 1, scope: !775, file: !6, line: 97, type: !51)
!780 = !DILocalVariable(name: "ap", scope: !775, file: !6, line: 99, type: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !174, line: 52, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !176, line: 32, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !784, baseType: !785)
!784 = !DIFile(filename: "src/lbracket.c", directory: "/src")
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !180, size: 256, elements: !786)
!786 = !{!787, !788, !789, !790, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !785, file: !784, line: 99, baseType: !45, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !785, file: !784, line: 99, baseType: !45, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !785, file: !784, line: 99, baseType: !45, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !785, file: !784, line: 99, baseType: !46, size: 32, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !785, file: !784, line: 99, baseType: !46, size: 32, offset: 224)
!792 = !DILocation(line: 0, scope: !775)
!793 = !DILocation(line: 99, column: 3, scope: !775)
!794 = !DILocation(line: 99, column: 11, scope: !775)
!795 = !DILocation(line: 100, column: 3, scope: !775)
!796 = !DILocation(line: 101, column: 3, scope: !775)
!797 = !{i64 0, i64 8, !457, i64 8, i64 8, !457, i64 16, i64 8, !457, i64 24, i64 4, !586, i64 28, i64 4, !586}
!798 = !DILocation(line: 102, column: 3, scope: !775)
!799 = distinct !DISubprogram(name: "posixtest", scope: !6, file: !6, line: 616, type: !800, scopeLine: 617, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !802)
!800 = !DISubroutineType(types: !801)
!801 = !{!77, !46}
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "nargs", arg: 1, scope: !799, file: !6, line: 616, type: !46)
!804 = !DILocalVariable(name: "value", scope: !799, file: !6, line: 618, type: !77)
!805 = !DILocation(line: 0, scope: !799)
!806 = !DILocation(line: 620, column: 3, scope: !799)
!807 = !DILocation(line: 562, column: 10, scope: !808, inlinedAt: !811)
!808 = distinct !DISubprogram(name: "one_argument", scope: !6, file: !6, line: 560, type: !809, scopeLine: 561, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !578)
!809 = !DISubroutineType(types: !810)
!810 = !{!77}
!811 = distinct !DILocation(line: 623, column: 17, scope: !812)
!812 = distinct !DILexicalBlock(scope: !799, file: !6, line: 621, column: 5)
!813 = !DILocation(line: 562, column: 18, scope: !808, inlinedAt: !811)
!814 = !DILocation(line: 562, column: 25, scope: !808, inlinedAt: !811)
!815 = !DILocation(line: 624, column: 9, scope: !812)
!816 = !DILocation(line: 570, column: 14, scope: !817, inlinedAt: !821)
!817 = distinct !DILexicalBlock(scope: !818, file: !6, line: 570, column: 7)
!818 = distinct !DISubprogram(name: "two_arguments", scope: !6, file: !6, line: 566, type: !809, scopeLine: 567, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !819)
!819 = !{!820}
!820 = !DILocalVariable(name: "value", scope: !818, file: !6, line: 568, type: !77)
!821 = distinct !DILocation(line: 627, column: 17, scope: !812)
!822 = !DILocation(line: 570, column: 19, scope: !817, inlinedAt: !821)
!823 = !DILocation(line: 0, scope: !535, inlinedAt: !824)
!824 = distinct !DILocation(line: 570, column: 7, scope: !817, inlinedAt: !821)
!825 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !824)
!826 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !824)
!827 = !DILocation(line: 570, column: 7, scope: !818, inlinedAt: !821)
!828 = !DILocalVariable(name: "f", arg: 1, scope: !829, file: !6, line: 110, type: !77)
!829 = distinct !DISubprogram(name: "advance", scope: !6, file: !6, line: 110, type: !830, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !77}
!832 = !{!828}
!833 = !DILocation(line: 0, scope: !829, inlinedAt: !834)
!834 = distinct !DILocation(line: 572, column: 7, scope: !835, inlinedAt: !821)
!835 = distinct !DILexicalBlock(scope: !817, file: !6, line: 571, column: 5)
!836 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !834)
!837 = !DILocation(line: 562, column: 18, scope: !808, inlinedAt: !838)
!838 = distinct !DILocation(line: 573, column: 17, scope: !835, inlinedAt: !821)
!839 = !DILocation(line: 562, column: 10, scope: !808, inlinedAt: !838)
!840 = !DILocation(line: 562, column: 25, scope: !808, inlinedAt: !838)
!841 = !DILocation(line: 0, scope: !818, inlinedAt: !821)
!842 = !DILocation(line: 574, column: 5, scope: !835, inlinedAt: !821)
!843 = !DILocation(line: 575, column: 12, scope: !844, inlinedAt: !821)
!844 = distinct !DILexicalBlock(scope: !817, file: !6, line: 575, column: 12)
!845 = !DILocation(line: 575, column: 25, scope: !844, inlinedAt: !821)
!846 = !DILocation(line: 576, column: 12, scope: !844, inlinedAt: !821)
!847 = !DILocation(line: 576, column: 15, scope: !844, inlinedAt: !821)
!848 = !DILocation(line: 576, column: 28, scope: !844, inlinedAt: !821)
!849 = !DILocation(line: 577, column: 12, scope: !844, inlinedAt: !821)
!850 = !DILocation(line: 577, column: 15, scope: !844, inlinedAt: !821)
!851 = !DILocation(line: 577, column: 28, scope: !844, inlinedAt: !821)
!852 = !DILocation(line: 575, column: 12, scope: !817, inlinedAt: !821)
!853 = !DILocation(line: 579, column: 15, scope: !854, inlinedAt: !821)
!854 = distinct !DILexicalBlock(scope: !844, file: !6, line: 578, column: 5)
!855 = !DILocation(line: 582, column: 5, scope: !844, inlinedAt: !821)
!856 = !DILocation(line: 631, column: 17, scope: !812)
!857 = !DILocation(line: 632, column: 9, scope: !812)
!858 = !DILocation(line: 635, column: 20, scope: !859)
!859 = distinct !DILexicalBlock(scope: !812, file: !6, line: 635, column: 13)
!860 = !DILocation(line: 635, column: 25, scope: !859)
!861 = !DILocation(line: 0, scope: !535, inlinedAt: !862)
!862 = distinct !DILocation(line: 635, column: 13, scope: !859)
!863 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !862)
!864 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !862)
!865 = !DILocation(line: 635, column: 13, scope: !812)
!866 = !DILocation(line: 0, scope: !829, inlinedAt: !867)
!867 = distinct !DILocation(line: 637, column: 13, scope: !868)
!868 = distinct !DILexicalBlock(scope: !859, file: !6, line: 636, column: 11)
!869 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !867)
!870 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !867)
!871 = distinct !DILexicalBlock(scope: !829, file: !6, line: 114, column: 7)
!872 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !867)
!873 = !DILocation(line: 638, column: 22, scope: !868)
!874 = !DILocation(line: 638, column: 21, scope: !868)
!875 = !DILocation(line: 639, column: 13, scope: !868)
!876 = !DILocation(line: 0, scope: !535, inlinedAt: !877)
!877 = distinct !DILocation(line: 641, column: 13, scope: !878)
!878 = distinct !DILexicalBlock(scope: !812, file: !6, line: 641, column: 13)
!879 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !877)
!880 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !877)
!881 = !DILocation(line: 641, column: 36, scope: !878)
!882 = !DILocation(line: 641, column: 55, scope: !878)
!883 = !DILocation(line: 641, column: 46, scope: !878)
!884 = !DILocation(line: 0, scope: !535, inlinedAt: !885)
!885 = distinct !DILocation(line: 641, column: 39, scope: !878)
!886 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !885)
!887 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !885)
!888 = !DILocation(line: 641, column: 13, scope: !812)
!889 = !DILocation(line: 0, scope: !829, inlinedAt: !890)
!890 = distinct !DILocation(line: 643, column: 13, scope: !891)
!891 = distinct !DILexicalBlock(scope: !878, file: !6, line: 642, column: 11)
!892 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !890)
!893 = !DILocation(line: 570, column: 14, scope: !817, inlinedAt: !894)
!894 = distinct !DILocation(line: 644, column: 21, scope: !891)
!895 = !DILocation(line: 0, scope: !535, inlinedAt: !896)
!896 = distinct !DILocation(line: 570, column: 7, scope: !817, inlinedAt: !894)
!897 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !896)
!898 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !896)
!899 = !DILocation(line: 570, column: 7, scope: !818, inlinedAt: !894)
!900 = !DILocation(line: 0, scope: !829, inlinedAt: !901)
!901 = distinct !DILocation(line: 572, column: 7, scope: !835, inlinedAt: !894)
!902 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !901)
!903 = !DILocation(line: 562, column: 10, scope: !808, inlinedAt: !904)
!904 = distinct !DILocation(line: 573, column: 17, scope: !835, inlinedAt: !894)
!905 = !DILocation(line: 562, column: 25, scope: !808, inlinedAt: !904)
!906 = !DILocation(line: 0, scope: !818, inlinedAt: !894)
!907 = !DILocation(line: 574, column: 5, scope: !835, inlinedAt: !894)
!908 = !DILocation(line: 575, column: 12, scope: !844, inlinedAt: !894)
!909 = !DILocation(line: 575, column: 25, scope: !844, inlinedAt: !894)
!910 = !DILocation(line: 576, column: 12, scope: !844, inlinedAt: !894)
!911 = !DILocation(line: 576, column: 15, scope: !844, inlinedAt: !894)
!912 = !DILocation(line: 576, column: 28, scope: !844, inlinedAt: !894)
!913 = !DILocation(line: 577, column: 12, scope: !844, inlinedAt: !894)
!914 = !DILocation(line: 577, column: 15, scope: !844, inlinedAt: !894)
!915 = !DILocation(line: 577, column: 28, scope: !844, inlinedAt: !894)
!916 = !DILocation(line: 575, column: 12, scope: !817, inlinedAt: !894)
!917 = !DILocation(line: 579, column: 15, scope: !854, inlinedAt: !894)
!918 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !919)
!919 = distinct !DILocation(line: 645, column: 13, scope: !891)
!920 = !DILocation(line: 582, column: 5, scope: !844, inlinedAt: !894)
!921 = !DILocation(line: 0, scope: !829, inlinedAt: !919)
!922 = !DILocation(line: 646, column: 13, scope: !891)
!923 = !DILocation(line: 651, column: 9, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !6, line: 651, column: 9)
!925 = distinct !DILexicalBlock(scope: !812, file: !6, line: 651, column: 9)
!926 = !DILocation(line: 651, column: 9, scope: !925)
!927 = !DILocation(line: 553, column: 7, scope: !928, inlinedAt: !930)
!928 = distinct !DILexicalBlock(scope: !929, file: !6, line: 553, column: 7)
!929 = distinct !DISubprogram(name: "expr", scope: !6, file: !6, line: 551, type: !809, scopeLine: 552, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !578)
!930 = distinct !DILocation(line: 652, column: 17, scope: !812)
!931 = !DILocation(line: 553, column: 14, scope: !928, inlinedAt: !930)
!932 = !DILocation(line: 553, column: 11, scope: !928, inlinedAt: !930)
!933 = !DILocation(line: 553, column: 7, scope: !929, inlinedAt: !930)
!934 = !DILocation(line: 554, column: 5, scope: !928, inlinedAt: !930)
!935 = !DILocation(line: 556, column: 10, scope: !929, inlinedAt: !930)
!936 = !DILocation(line: 653, column: 5, scope: !812)
!937 = !DILocation(line: 655, column: 3, scope: !799)
!938 = distinct !DISubprogram(name: "unary_operator", scope: !6, file: !6, line: 366, type: !809, scopeLine: 367, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !939)
!939 = !{!940, !975, !978, !979, !983, !984, !987, !988, !990}
!940 = !DILocalVariable(name: "stat_buf", scope: !938, file: !6, line: 368, type: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !942, line: 44, size: 1024, elements: !943)
!942 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!943 = !{!944, !946, !948, !950, !952, !954, !956, !957, !958, !959, !961, !962, !964, !971, !972, !973}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !941, file: !942, line: 46, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !57, line: 145, baseType: !50)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !941, file: !942, line: 47, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !57, line: 148, baseType: !50)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !941, file: !942, line: 48, baseType: !949, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !57, line: 150, baseType: !7)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !941, file: !942, line: 49, baseType: !951, size: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !57, line: 151, baseType: !7)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !941, file: !942, line: 50, baseType: !953, size: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !57, line: 146, baseType: !7)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !941, file: !942, line: 51, baseType: !955, size: 32, offset: 224)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !57, line: 147, baseType: !7)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !941, file: !942, line: 52, baseType: !945, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !941, file: !942, line: 53, baseType: !945, size: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !941, file: !942, line: 54, baseType: !116, size: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !941, file: !942, line: 55, baseType: !960, size: 32, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !57, line: 175, baseType: !46)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !941, file: !942, line: 56, baseType: !46, size: 32, offset: 480)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !941, file: !942, line: 57, baseType: !963, size: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !57, line: 180, baseType: !58)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !941, file: !942, line: 65, baseType: !965, size: 128, offset: 576)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !966, line: 11, size: 128, elements: !967)
!966 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !965, file: !966, line: 16, baseType: !56, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !965, file: !966, line: 21, baseType: !970, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !57, line: 197, baseType: !58)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !941, file: !942, line: 66, baseType: !965, size: 128, offset: 704)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !941, file: !942, line: 67, baseType: !965, size: 128, offset: 832)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !941, file: !942, line: 79, baseType: !974, size: 64, offset: 960)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !243)
!975 = !DILocalVariable(name: "atime", scope: !976, file: !6, line: 401, type: !965)
!976 = distinct !DILexicalBlock(scope: !977, file: !6, line: 397, column: 7)
!977 = distinct !DILexicalBlock(scope: !938, file: !6, line: 371, column: 5)
!978 = !DILocalVariable(name: "mtime", scope: !976, file: !6, line: 402, type: !965)
!979 = !DILocalVariable(name: "euid", scope: !980, file: !6, line: 412, type: !981)
!980 = distinct !DILexicalBlock(scope: !977, file: !6, line: 407, column: 7)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !982, line: 79, baseType: !953)
!982 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!983 = !DILocalVariable(name: "NO_UID", scope: !980, file: !6, line: 413, type: !981)
!984 = !DILocalVariable(name: "egid", scope: !985, file: !6, line: 423, type: !986)
!985 = distinct !DILexicalBlock(scope: !977, file: !6, line: 418, column: 7)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !982, line: 64, baseType: !955)
!987 = !DILocalVariable(name: "NO_GID", scope: !985, file: !6, line: 424, type: !986)
!988 = !DILocalVariable(name: "fd", scope: !989, file: !6, line: 489, type: !58)
!989 = distinct !DILexicalBlock(scope: !977, file: !6, line: 488, column: 7)
!990 = !DILocalVariable(name: "arg", scope: !989, file: !6, line: 490, type: !51)
!991 = !DILocation(line: 368, column: 3, scope: !938)
!992 = !DILocation(line: 368, column: 15, scope: !938)
!993 = !DILocation(line: 370, column: 11, scope: !938)
!994 = !DILocation(line: 370, column: 16, scope: !938)
!995 = !DILocation(line: 370, column: 3, scope: !938)
!996 = !DILocation(line: 373, column: 26, scope: !977)
!997 = !DILocation(line: 373, column: 67, scope: !977)
!998 = !DILocation(line: 373, column: 72, scope: !977)
!999 = !DILocation(line: 373, column: 60, scope: !977)
!1000 = !DILocation(line: 373, column: 7, scope: !977)
!1001 = !DILocation(line: 0, scope: !829, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1004)
!1003 = distinct !DISubprogram(name: "unary_advance", scope: !6, file: !6, line: 119, type: !201, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !578)
!1004 = distinct !DILocation(line: 381, column: 7, scope: !977)
!1005 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1002)
!1006 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1002)
!1007 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1002)
!1008 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1004)
!1009 = !DILocation(line: 382, column: 20, scope: !977)
!1010 = !DILocation(line: 382, column: 14, scope: !977)
!1011 = !DILocation(line: 382, column: 46, scope: !977)
!1012 = !DILocation(line: 382, column: 7, scope: !977)
!1013 = !DILocation(line: 0, scope: !829, inlinedAt: !1014)
!1014 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1015)
!1015 = distinct !DILocation(line: 385, column: 7, scope: !977)
!1016 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1014)
!1017 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1014)
!1018 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1014)
!1019 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1015)
!1020 = !DILocation(line: 386, column: 26, scope: !977)
!1021 = !DILocation(line: 386, column: 14, scope: !977)
!1022 = !DILocation(line: 386, column: 47, scope: !977)
!1023 = !DILocation(line: 386, column: 7, scope: !977)
!1024 = !DILocation(line: 0, scope: !829, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1026)
!1026 = distinct !DILocation(line: 389, column: 7, scope: !977)
!1027 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1025)
!1028 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1025)
!1029 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1025)
!1030 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1026)
!1031 = !DILocation(line: 390, column: 26, scope: !977)
!1032 = !DILocation(line: 390, column: 14, scope: !977)
!1033 = !DILocation(line: 390, column: 47, scope: !977)
!1034 = !DILocation(line: 390, column: 7, scope: !977)
!1035 = !DILocation(line: 0, scope: !829, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1037)
!1037 = distinct !DILocation(line: 393, column: 7, scope: !977)
!1038 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1036)
!1039 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1036)
!1040 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1036)
!1041 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1037)
!1042 = !DILocation(line: 394, column: 26, scope: !977)
!1043 = !DILocation(line: 394, column: 14, scope: !977)
!1044 = !DILocation(line: 394, column: 47, scope: !977)
!1045 = !DILocation(line: 394, column: 7, scope: !977)
!1046 = !DILocation(line: 0, scope: !829, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 398, column: 9, scope: !976)
!1049 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1047)
!1050 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1047)
!1051 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1047)
!1052 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1048)
!1053 = !DILocation(line: 399, column: 19, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !976, file: !6, line: 399, column: 13)
!1055 = !DILocation(line: 399, column: 13, scope: !1054)
!1056 = !DILocation(line: 399, column: 45, scope: !1054)
!1057 = !DILocation(line: 399, column: 13, scope: !976)
!1058 = !DILocalVariable(name: "st", arg: 1, scope: !1059, file: !1060, line: 147, type: !1063)
!1059 = distinct !DISubprogram(name: "get_stat_atime", scope: !1060, file: !1060, line: 147, type: !1061, scopeLine: 148, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1065)
!1060 = !DIFile(filename: "./lib/stat-time.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f4edb1fd4cb81bf2ea0eec563958d759")
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!965, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1065 = !{!1058}
!1066 = !DILocation(line: 0, scope: !1059, inlinedAt: !1067)
!1067 = distinct !DILocation(line: 401, column: 33, scope: !976)
!1068 = !DILocation(line: 150, column: 10, scope: !1059, inlinedAt: !1067)
!1069 = !DILocation(line: 0, scope: !976)
!1070 = !DILocalVariable(name: "st", arg: 1, scope: !1071, file: !1060, line: 169, type: !1063)
!1071 = distinct !DISubprogram(name: "get_stat_mtime", scope: !1060, file: !1060, line: 169, type: !1061, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1072)
!1072 = !{!1070}
!1073 = !DILocation(line: 0, scope: !1071, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 402, column: 33, scope: !976)
!1075 = !DILocation(line: 172, column: 10, scope: !1071, inlinedAt: !1074)
!1076 = !DILocalVariable(name: "a", arg: 1, scope: !1077, file: !1078, line: 64, type: !965)
!1077 = distinct !DISubprogram(name: "timespec_cmp", scope: !1078, file: !1078, line: 64, type: !1079, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1081)
!1078 = !DIFile(filename: "./lib/timespec.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2321879fdee55a014e00353b7423449")
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!46, !965, !965}
!1081 = !{!1076, !1082}
!1082 = !DILocalVariable(name: "b", arg: 2, scope: !1077, file: !1078, line: 64, type: !965)
!1083 = !DILocation(line: 0, scope: !1077, inlinedAt: !1084)
!1084 = distinct !DILocation(line: 403, column: 17, scope: !976)
!1085 = !DILocation(line: 66, column: 45, scope: !1077, inlinedAt: !1084)
!1086 = !DILocation(line: 66, column: 12, scope: !1077, inlinedAt: !1084)
!1087 = !DILocation(line: 66, column: 43, scope: !1077, inlinedAt: !1084)
!1088 = !DILocation(line: 403, column: 45, scope: !976)
!1089 = !DILocation(line: 0, scope: !829, inlinedAt: !1090)
!1090 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 408, column: 9, scope: !980)
!1092 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1090)
!1093 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1090)
!1094 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1090)
!1095 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1091)
!1096 = !DILocation(line: 409, column: 19, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !980, file: !6, line: 409, column: 13)
!1098 = !DILocation(line: 409, column: 13, scope: !1097)
!1099 = !DILocation(line: 409, column: 45, scope: !1097)
!1100 = !DILocation(line: 409, column: 13, scope: !980)
!1101 = !DILocation(line: 411, column: 9, scope: !980)
!1102 = !DILocation(line: 411, column: 15, scope: !980)
!1103 = !DILocation(line: 412, column: 22, scope: !980)
!1104 = !DILocation(line: 0, scope: !980)
!1105 = !DILocation(line: 414, column: 24, scope: !980)
!1106 = !DILocation(line: 414, column: 34, scope: !980)
!1107 = !DILocation(line: 414, column: 37, scope: !980)
!1108 = !DILocation(line: 414, column: 44, scope: !980)
!1109 = !DILocation(line: 414, column: 64, scope: !980)
!1110 = !{!1111, !587, i64 24}
!1111 = !{!"stat", !1112, i64 0, !1112, i64 8, !587, i64 16, !587, i64 20, !587, i64 24, !587, i64 28, !1112, i64 32, !1112, i64 40, !1112, i64 48, !587, i64 56, !587, i64 60, !1112, i64 64, !1113, i64 72, !1113, i64 88, !1113, i64 104, !459, i64 120}
!1112 = !{!"long", !459, i64 0}
!1113 = !{!"timespec", !1112, i64 0, !1112, i64 8}
!1114 = !DILocation(line: 414, column: 52, scope: !980)
!1115 = !DILocation(line: 0, scope: !829, inlinedAt: !1116)
!1116 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 419, column: 9, scope: !985)
!1118 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1116)
!1119 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1116)
!1120 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1116)
!1121 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1117)
!1122 = !DILocation(line: 420, column: 19, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !985, file: !6, line: 420, column: 13)
!1124 = !DILocation(line: 420, column: 13, scope: !1123)
!1125 = !DILocation(line: 420, column: 45, scope: !1123)
!1126 = !DILocation(line: 420, column: 13, scope: !985)
!1127 = !DILocation(line: 422, column: 9, scope: !985)
!1128 = !DILocation(line: 422, column: 15, scope: !985)
!1129 = !DILocation(line: 423, column: 22, scope: !985)
!1130 = !DILocation(line: 0, scope: !985)
!1131 = !DILocation(line: 425, column: 24, scope: !985)
!1132 = !DILocation(line: 425, column: 34, scope: !985)
!1133 = !DILocation(line: 425, column: 37, scope: !985)
!1134 = !DILocation(line: 425, column: 44, scope: !985)
!1135 = !DILocation(line: 425, column: 64, scope: !985)
!1136 = !{!1111, !587, i64 28}
!1137 = !DILocation(line: 425, column: 52, scope: !985)
!1138 = !DILocation(line: 0, scope: !829, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 429, column: 7, scope: !977)
!1141 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1139)
!1142 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1139)
!1143 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1139)
!1144 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1140)
!1145 = !DILocation(line: 432, column: 21, scope: !977)
!1146 = !DILocation(line: 432, column: 15, scope: !977)
!1147 = !DILocation(line: 432, column: 47, scope: !977)
!1148 = !DILocation(line: 433, column: 15, scope: !977)
!1149 = !DILocation(line: 432, column: 7, scope: !977)
!1150 = !DILocation(line: 0, scope: !829, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1152)
!1152 = distinct !DILocation(line: 436, column: 7, scope: !977)
!1153 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1151)
!1154 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1151)
!1155 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1151)
!1156 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1152)
!1157 = !DILocation(line: 437, column: 21, scope: !977)
!1158 = !DILocation(line: 437, column: 15, scope: !977)
!1159 = !DILocation(line: 437, column: 47, scope: !977)
!1160 = !DILocation(line: 438, column: 15, scope: !977)
!1161 = !DILocation(line: 437, column: 7, scope: !977)
!1162 = !DILocation(line: 0, scope: !829, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 441, column: 7, scope: !977)
!1165 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1163)
!1166 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1163)
!1167 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1163)
!1168 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1164)
!1169 = !DILocation(line: 442, column: 21, scope: !977)
!1170 = !DILocation(line: 442, column: 15, scope: !977)
!1171 = !DILocation(line: 442, column: 47, scope: !977)
!1172 = !DILocation(line: 443, column: 15, scope: !977)
!1173 = !DILocation(line: 442, column: 7, scope: !977)
!1174 = !DILocation(line: 0, scope: !829, inlinedAt: !1175)
!1175 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1176)
!1176 = distinct !DILocation(line: 446, column: 7, scope: !977)
!1177 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1175)
!1178 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1175)
!1179 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1175)
!1180 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1176)
!1181 = !DILocation(line: 447, column: 21, scope: !977)
!1182 = !DILocation(line: 447, column: 15, scope: !977)
!1183 = !DILocation(line: 447, column: 47, scope: !977)
!1184 = !DILocation(line: 448, column: 15, scope: !977)
!1185 = !DILocation(line: 447, column: 7, scope: !977)
!1186 = !DILocation(line: 0, scope: !829, inlinedAt: !1187)
!1187 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1188)
!1188 = distinct !DILocation(line: 451, column: 7, scope: !977)
!1189 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1187)
!1190 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1187)
!1191 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1187)
!1192 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1188)
!1193 = !DILocation(line: 452, column: 21, scope: !977)
!1194 = !DILocation(line: 452, column: 15, scope: !977)
!1195 = !DILocation(line: 452, column: 47, scope: !977)
!1196 = !DILocation(line: 453, column: 15, scope: !977)
!1197 = !DILocation(line: 452, column: 7, scope: !977)
!1198 = !DILocation(line: 0, scope: !829, inlinedAt: !1199)
!1199 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1200)
!1200 = distinct !DILocation(line: 456, column: 7, scope: !977)
!1201 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1199)
!1202 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1199)
!1203 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1199)
!1204 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1200)
!1205 = !DILocation(line: 457, column: 21, scope: !977)
!1206 = !DILocation(line: 457, column: 15, scope: !977)
!1207 = !DILocation(line: 457, column: 47, scope: !977)
!1208 = !DILocation(line: 458, column: 15, scope: !977)
!1209 = !DILocation(line: 457, column: 7, scope: !977)
!1210 = !DILocation(line: 0, scope: !829, inlinedAt: !1211)
!1211 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1212)
!1212 = distinct !DILocation(line: 461, column: 7, scope: !977)
!1213 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1211)
!1214 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1211)
!1215 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1211)
!1216 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1212)
!1217 = !DILocation(line: 462, column: 21, scope: !977)
!1218 = !DILocation(line: 462, column: 15, scope: !977)
!1219 = !DILocation(line: 462, column: 47, scope: !977)
!1220 = !DILocation(line: 463, column: 15, scope: !977)
!1221 = !DILocation(line: 462, column: 7, scope: !977)
!1222 = !DILocation(line: 0, scope: !829, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1224)
!1224 = distinct !DILocation(line: 469, column: 7, scope: !977)
!1225 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1223)
!1226 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1223)
!1227 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1223)
!1228 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1224)
!1229 = !DILocation(line: 470, column: 25, scope: !977)
!1230 = !DILocalVariable(name: "filename", arg: 1, scope: !1231, file: !1232, line: 49, type: !51)
!1231 = distinct !DISubprogram(name: "issymlink", scope: !1232, file: !1232, line: 49, type: !1233, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1235)
!1232 = !DIFile(filename: "./lib/issymlink.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3ed5fe5c76158b7c9a68dd013fb9e151")
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!46, !51}
!1235 = !{!1230, !1236}
!1236 = !DILocalVariable(name: "linkbuf", scope: !1231, file: !1232, line: 51, type: !121)
!1237 = !DILocation(line: 0, scope: !1231, inlinedAt: !1238)
!1238 = distinct !DILocation(line: 470, column: 14, scope: !977)
!1239 = !DILocation(line: 51, column: 3, scope: !1231, inlinedAt: !1238)
!1240 = !DILocation(line: 51, column: 8, scope: !1231, inlinedAt: !1238)
!1241 = !DILocation(line: 52, column: 7, scope: !1242, inlinedAt: !1238)
!1242 = distinct !DILexicalBlock(scope: !1231, file: !1232, line: 52, column: 7)
!1243 = !DILocation(line: 52, column: 54, scope: !1242, inlinedAt: !1238)
!1244 = !DILocation(line: 58, column: 1, scope: !1231, inlinedAt: !1238)
!1245 = !DILocation(line: 470, column: 7, scope: !977)
!1246 = !DILocation(line: 0, scope: !829, inlinedAt: !1247)
!1247 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1248)
!1248 = distinct !DILocation(line: 473, column: 7, scope: !977)
!1249 = !DILocation(line: 112, column: 3, scope: !829, inlinedAt: !1247)
!1250 = !DILocation(line: 114, column: 9, scope: !871, inlinedAt: !1247)
!1251 = !DILocation(line: 115, column: 5, scope: !871, inlinedAt: !1247)
!1252 = !DILocation(line: 122, column: 3, scope: !1003, inlinedAt: !1248)
!1253 = !DILocation(line: 474, column: 21, scope: !977)
!1254 = !DILocation(line: 474, column: 15, scope: !977)
!1255 = !DILocation(line: 474, column: 47, scope: !977)
!1256 = !DILocation(line: 475, column: 15, scope: !977)
!1257 = !DILocation(line: 474, column: 7, scope: !977)
!1258 = !DILocation(line: 0, scope: !829, inlinedAt: !1259)
!1259 = distinct !DILocation(line: 121, column: 3, scope: !1003, inlinedAt: !1260)
