; ModuleID = 'src/basename.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [53 x i8] c"Usage: %s NAME [SUFFIX]\0A  or:  %s OPTION... NAME...\0A\00", align 1
@.str.2 = private unnamed_addr constant [104 x i8] c"Print NAME with any leading directory components removed.\0AIf specified, also remove a trailing SUFFIX.\0A\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"basename\00", align 1
@.str.4 = private unnamed_addr constant [79 x i8] c"  -a, --multiple\0A         support multiple arguments and treat each as a NAME\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 30, type: !121, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/basename.c", directory: "/src", checksumkind: CSK_MD5, checksum: "477d3cd1850fe551cd0c5a9952f88312")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !24, !25, !26, !27, !30, !32}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 46, baseType: !29)
!28 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!29 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34, !0}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !36, file: !37, line: 575, type: !25, isLocal: true, isDefinition: true)
!36 = distinct !DISubprogram(name: "oputs_", scope: !37, file: !37, line: 573, type: !38, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !40)
!37 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!38 = !DISubroutineType(types: !39)
!39 = !{null, !30, !30}
!40 = !{!41, !42, !43, !46, !48, !49, !50, !54, !55, !56, !57, !59, !115, !116, !117, !119, !120}
!41 = !DILocalVariable(name: "program", arg: 1, scope: !36, file: !37, line: 573, type: !30)
!42 = !DILocalVariable(name: "option", arg: 2, scope: !36, file: !37, line: 573, type: !30)
!43 = !DILocalVariable(name: "term", scope: !44, file: !37, line: 585, type: !30)
!44 = distinct !DILexicalBlock(scope: !45, file: !37, line: 582, column: 5)
!45 = distinct !DILexicalBlock(scope: !36, file: !37, line: 581, column: 7)
!46 = !DILocalVariable(name: "double_space", scope: !36, file: !37, line: 594, type: !47)
!47 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!48 = !DILocalVariable(name: "first_word", scope: !36, file: !37, line: 595, type: !30)
!49 = !DILocalVariable(name: "option_text", scope: !36, file: !37, line: 596, type: !30)
!50 = !DILocalVariable(name: "s", scope: !51, file: !37, line: 608, type: !30)
!51 = distinct !DILexicalBlock(scope: !52, file: !37, line: 605, column: 5)
!52 = distinct !DILexicalBlock(scope: !53, file: !37, line: 604, column: 12)
!53 = distinct !DILexicalBlock(scope: !36, file: !37, line: 597, column: 7)
!54 = !DILocalVariable(name: "spaces", scope: !51, file: !37, line: 609, type: !27)
!55 = !DILocalVariable(name: "anchor_len", scope: !36, file: !37, line: 620, type: !27)
!56 = !DILocalVariable(name: "desc_text", scope: !36, file: !37, line: 625, type: !30)
!57 = !DILocalVariable(name: "__ptr", scope: !58, file: !37, line: 644, type: !30)
!58 = distinct !DILexicalBlock(scope: !36, file: !37, line: 644, column: 3)
!59 = !DILocalVariable(name: "__stream", scope: !58, file: !37, line: 644, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 7, baseType: !63)
!62 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 49, size: 1728, elements: !65)
!64 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !81, !83, !84, !85, !89, !90, !92, !96, !99, !101, !104, !107, !108, !109, !110, !111}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 51, baseType: !25, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 54, baseType: !22, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 55, baseType: !22, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 56, baseType: !22, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 57, baseType: !22, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 58, baseType: !22, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 59, baseType: !22, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 60, baseType: !22, size: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 61, baseType: !22, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 64, baseType: !22, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 65, baseType: !22, size: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 66, baseType: !22, size: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 68, baseType: !79, size: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 36, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 70, baseType: !82, size: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 72, baseType: !25, size: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 73, baseType: !25, size: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 74, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !87, line: 152, baseType: !88)
!87 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!88 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 77, baseType: !26, size: 16, offset: 1024)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 78, baseType: !91, size: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 79, baseType: !93, size: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 81, baseType: !97, size: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 43, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 89, baseType: !100, size: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !87, line: 153, baseType: !88)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !63, file: !64, line: 91, baseType: !102, size: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !64, line: 37, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !63, file: !64, line: 92, baseType: !105, size: 64, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !64, line: 38, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !63, file: !64, line: 93, baseType: !82, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !63, file: !64, line: 94, baseType: !24, size: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 95, baseType: !27, size: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 96, baseType: !25, size: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 98, baseType: !112, size: 160, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DILocalVariable(name: "__cnt", scope: !58, file: !37, line: 644, type: !27)
!116 = !DILocalVariable(name: "url_program", scope: !36, file: !37, line: 648, type: !30)
!117 = !DILocalVariable(name: "__ptr", scope: !118, file: !37, line: 686, type: !30)
!118 = distinct !DILexicalBlock(scope: !36, file: !37, line: 686, column: 3)
!119 = !DILocalVariable(name: "__stream", scope: !118, file: !37, line: 686, type: !60)
!120 = !DILocalVariable(name: "__cnt", scope: !118, file: !37, line: 686, type: !27)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 1536, elements: !131)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !124, line: 50, size: 256, elements: !125)
!124 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 52, baseType: !30, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !123, file: !124, line: 55, baseType: !25, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !123, file: !124, line: 56, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !123, file: !124, line: 57, baseType: !25, size: 32, offset: 192)
!131 = !{!132}
!132 = !DISubrange(count: 6)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "Version", scope: !135, file: !136, line: 3, type: !30, isLocal: false, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !137, splitDebugInlining: false, nameTableKind: None)
!136 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!137 = !{!133}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "file_name", scope: !140, file: !141, line: 45, type: !30, isLocal: true, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !142, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!142 = !{!138, !143}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !140, file: !141, line: 55, type: !47, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !147, file: !148, line: 66, type: !183, isLocal: false, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !149, globals: !150, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!149 = !{!24, !32}
!150 = !{!151, !177, !145, !179, !181}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "old_file_name", scope: !153, file: !148, line: 304, type: !30, isLocal: true, isDefinition: true)
!153 = distinct !DISubprogram(name: "verror_at_line", scope: !148, file: !148, line: 298, type: !154, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !170)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !25, !25, !30, !7, !30, !156}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !157, line: 52, baseType: !158)
!157 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !159, line: 32, baseType: !160)
!159 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !161, baseType: !162)
!161 = !DIFile(filename: "lib/error.c", directory: "/src")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !163, size: 256, elements: !164)
!163 = !DINamespace(name: "std", scope: null)
!164 = !{!165, !166, !167, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !162, file: !161, baseType: !24, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !162, file: !161, baseType: !24, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !162, file: !161, baseType: !24, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !162, file: !161, baseType: !25, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !162, file: !161, baseType: !25, size: 32, offset: 224)
!170 = !{!171, !172, !173, !174, !175, !176}
!171 = !DILocalVariable(name: "status", arg: 1, scope: !153, file: !148, line: 298, type: !25)
!172 = !DILocalVariable(name: "errnum", arg: 2, scope: !153, file: !148, line: 298, type: !25)
!173 = !DILocalVariable(name: "file_name", arg: 3, scope: !153, file: !148, line: 298, type: !30)
!174 = !DILocalVariable(name: "line_number", arg: 4, scope: !153, file: !148, line: 298, type: !7)
!175 = !DILocalVariable(name: "message", arg: 5, scope: !153, file: !148, line: 298, type: !30)
!176 = !DILocalVariable(name: "args", arg: 6, scope: !153, file: !148, line: 298, type: !156)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "old_line_number", scope: !153, file: !148, line: 305, type: !7, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "error_message_count", scope: !147, file: !148, line: 69, type: !7, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !147, file: !148, line: 295, type: !25, isLocal: false, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "program_name", scope: !188, file: !189, line: 31, type: !30, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !191, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!190 = !{!22}
!191 = !{!186}
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "utf07FF", scope: !194, file: !195, line: 46, type: !225, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "proper_name_lite", scope: !195, file: !195, line: 38, type: !196, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !198, retainedNodes: !200)
!195 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!196 = !DISubroutineType(types: !197)
!197 = !{!30, !30, !30}
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !199, splitDebugInlining: false, nameTableKind: None)
!199 = !{!192}
!200 = !{!201, !202, !203, !204, !209}
!201 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !194, file: !195, line: 38, type: !30)
!202 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !194, file: !195, line: 38, type: !30)
!203 = !DILocalVariable(name: "translation", scope: !194, file: !195, line: 40, type: !30)
!204 = !DILocalVariable(name: "w", scope: !194, file: !195, line: 47, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !206, line: 37, baseType: !207)
!206 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !87, line: 57, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !87, line: 42, baseType: !7)
!209 = !DILocalVariable(name: "mbs", scope: !194, file: !195, line: 48, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !211, line: 6, baseType: !212)
!211 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !213, line: 21, baseType: !214)
!213 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 13, size: 64, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !214, file: !213, line: 15, baseType: !25, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !214, file: !213, line: 20, baseType: !218, size: 32, offset: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !213, line: 16, size: 32, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !218, file: !213, line: 18, baseType: !7, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !218, file: !213, line: 19, baseType: !222, size: 32)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 4)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 16, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 2)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !230, file: !231, line: 76, type: !313, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !252, globals: !253, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!232 = !{!233, !247, !5}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !234, line: 42, baseType: !7, size: 32, elements: !235)
!234 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!236 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!237 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!238 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!239 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!240 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!241 = !DIEnumerator(name: "c_quoting_style", value: 5)
!242 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!243 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!244 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!245 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!246 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !234, line: 254, baseType: !7, size: 32, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!250 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!251 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!252 = !{!25, !26, !27}
!253 = !{!228, !254, !260, !272, !274, !279, !302, !309, !311}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !230, file: !231, line: 92, type: !256, isLocal: false, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 320, elements: !258)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!258 = !{!259}
!259 = !DISubrange(count: 10)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !230, file: !231, line: 1040, type: !262, isLocal: false, isDefinition: true)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !231, line: 56, size: 448, elements: !263)
!263 = !{!264, !265, !266, !270, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !262, file: !231, line: 59, baseType: !233, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !262, file: !231, line: 62, baseType: !25, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !262, file: !231, line: 66, baseType: !267, size: 256, offset: 64)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !262, file: !231, line: 69, baseType: !30, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !262, file: !231, line: 72, baseType: !30, size: 64, offset: 384)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !230, file: !231, line: 107, type: !262, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "slot0", scope: !230, file: !231, line: 831, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "quote", scope: !281, file: !231, line: 228, type: !300, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "gettext_quote", scope: !231, file: !231, line: 197, type: !282, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !284)
!282 = !DISubroutineType(types: !283)
!283 = !{!30, !30, !233}
!284 = !{!285, !286, !287, !288, !289}
!285 = !DILocalVariable(name: "msgid", arg: 1, scope: !281, file: !231, line: 197, type: !30)
!286 = !DILocalVariable(name: "s", arg: 2, scope: !281, file: !231, line: 197, type: !233)
!287 = !DILocalVariable(name: "translation", scope: !281, file: !231, line: 199, type: !30)
!288 = !DILocalVariable(name: "w", scope: !281, file: !231, line: 229, type: !205)
!289 = !DILocalVariable(name: "mbs", scope: !281, file: !231, line: 230, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !211, line: 6, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !213, line: 21, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 13, size: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !292, file: !213, line: 15, baseType: !25, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !292, file: !213, line: 20, baseType: !296, size: 32, offset: 32)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !213, line: 16, size: 32, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !296, file: !213, line: 18, baseType: !7, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !296, file: !213, line: 19, baseType: !222, size: 32)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !301)
!301 = !{!227, !224}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "slotvec", scope: !230, file: !231, line: 834, type: !304, isLocal: true, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !231, line: 823, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !305, file: !231, line: 825, baseType: !27, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !305, file: !231, line: 826, baseType: !22, size: 64, offset: 64)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "nslots", scope: !230, file: !231, line: 832, type: !25, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "slotvec0", scope: !230, file: !231, line: 833, type: !305, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!315 = !{!316}
!316 = !DISubrange(count: 11)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !319, file: !320, line: 26, type: !322, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !321, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!321 = !{!317}
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 47)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "exit_failure", scope: !327, file: !328, line: 24, type: !330, isLocal: false, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!329 = !{!325}
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "internal_state", scope: !333, file: !334, line: 97, type: !337, isLocal: true, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !335, globals: !336, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!335 = !{!24, !27, !32}
!336 = !{!331}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !211, line: 6, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !213, line: 21, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 13, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !339, file: !213, line: 15, baseType: !25, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !339, file: !213, line: 20, baseType: !343, size: 32, offset: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !213, line: 16, size: 32, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !343, file: !213, line: 18, baseType: !7, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !343, file: !213, line: 19, baseType: !222, size: 32)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "lib/basename.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f66445772cbc4fc024422470508e242e")
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !355, retainedTypes: !359, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!355 = !{!356}
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 40, baseType: !7, size: 32, elements: !357)
!357 = !{!358}
!358 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!359 = !{!24}
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !362, retainedTypes: !393, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!362 = !{!363, !375}
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !364, file: !361, line: 188, baseType: !7, size: 32, elements: !373)
!364 = distinct !DISubprogram(name: "x2nrealloc", scope: !361, file: !361, line: 176, type: !365, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !360, retainedNodes: !368)
!365 = !DISubroutineType(types: !366)
!366 = !{!24, !24, !367, !27}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!368 = !{!369, !370, !371, !372}
!369 = !DILocalVariable(name: "p", arg: 1, scope: !364, file: !361, line: 176, type: !24)
!370 = !DILocalVariable(name: "pn", arg: 2, scope: !364, file: !361, line: 176, type: !367)
!371 = !DILocalVariable(name: "s", arg: 3, scope: !364, file: !361, line: 176, type: !27)
!372 = !DILocalVariable(name: "n", scope: !364, file: !361, line: 178, type: !27)
!373 = !{!374}
!374 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !376, file: !361, line: 228, baseType: !7, size: 32, elements: !373)
!376 = distinct !DISubprogram(name: "xpalloc", scope: !361, file: !361, line: 223, type: !377, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !360, retainedNodes: !383)
!377 = !DISubroutineType(types: !378)
!378 = !{!24, !24, !379, !380, !382, !380}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !381, line: 130, baseType: !382)
!381 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !28, line: 35, baseType: !88)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392}
!384 = !DILocalVariable(name: "pa", arg: 1, scope: !376, file: !361, line: 223, type: !24)
!385 = !DILocalVariable(name: "pn", arg: 2, scope: !376, file: !361, line: 223, type: !379)
!386 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !376, file: !361, line: 223, type: !380)
!387 = !DILocalVariable(name: "n_max", arg: 4, scope: !376, file: !361, line: 223, type: !382)
!388 = !DILocalVariable(name: "s", arg: 5, scope: !376, file: !361, line: 223, type: !380)
!389 = !DILocalVariable(name: "n0", scope: !376, file: !361, line: 230, type: !380)
!390 = !DILocalVariable(name: "n", scope: !376, file: !361, line: 237, type: !380)
!391 = !DILocalVariable(name: "nbytes", scope: !376, file: !361, line: 248, type: !380)
!392 = !DILocalVariable(name: "adjusted_nbytes", scope: !376, file: !361, line: 252, type: !380)
!393 = !{!22, !24, !47, !88, !29}
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !359, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !359, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !408, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!408 = !{!47, !29, !24}
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !359, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!415 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!416 = !{i32 7, !"Dwarf Version", i32 5}
!417 = !{i32 2, !"Debug Info Version", i32 3}
!418 = !{i32 1, !"wchar_size", i32 4}
!419 = !{i32 1, !"branch-target-enforcement", i32 0}
!420 = !{i32 1, !"sign-return-address", i32 0}
!421 = !{i32 1, !"sign-return-address-all", i32 0}
!422 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!423 = !{i32 7, !"PIC Level", i32 2}
!424 = !{i32 7, !"PIE Level", i32 2}
!425 = !{i32 7, !"uwtable", i32 1}
!426 = !{i32 7, !"frame-pointer", i32 1}
!427 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 41, type: !428, scopeLine: 42, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !25}
!430 = !{!431}
!431 = !DILocalVariable(name: "status", arg: 1, scope: !427, file: !3, line: 41, type: !25)
!432 = !DILocation(line: 0, scope: !427)
!433 = !DILocation(line: 43, column: 14, scope: !434)
!434 = distinct !DILexicalBlock(scope: !427, file: !3, line: 43, column: 7)
!435 = !DILocation(line: 43, column: 7, scope: !427)
!436 = !DILocation(line: 44, column: 5, scope: !437)
!437 = distinct !DILexicalBlock(scope: !434, file: !3, line: 44, column: 5)
!438 = !{!439, !439, i64 0}
!439 = !{!"any pointer", !440, i64 0}
!440 = !{!"omnipotent char", !441, i64 0}
!441 = !{!"Simple C/C++ TBAA"}
!442 = !DILocation(line: 47, column: 7, scope: !443)
!443 = distinct !DILexicalBlock(scope: !434, file: !3, line: 46, column: 5)
!444 = !DILocation(line: 52, column: 7, scope: !443)
!445 = !DILocation(line: 736, column: 3, scope: !446, inlinedAt: !448)
!446 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !37, file: !37, line: 734, type: !184, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !447)
!447 = !{}
!448 = distinct !DILocation(line: 57, column: 7, scope: !443)
!449 = !DILocation(line: 59, column: 7, scope: !443)
!450 = !DILocation(line: 63, column: 7, scope: !443)
!451 = !DILocation(line: 67, column: 7, scope: !443)
!452 = !DILocation(line: 71, column: 7, scope: !443)
!453 = !DILocation(line: 72, column: 7, scope: !443)
!454 = !DILocation(line: 73, column: 7, scope: !443)
!455 = !DILocalVariable(name: "program", arg: 1, scope: !456, file: !37, line: 836, type: !30)
!456 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !37, file: !37, line: 836, type: !457, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !30}
!459 = !{!455, !460, !469, !470, !472, !473}
!460 = !DILocalVariable(name: "infomap", scope: !456, file: !37, line: 838, type: !461)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 896, elements: !467)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !456, file: !37, line: 838, size: 128, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !463, file: !37, line: 838, baseType: !30, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !463, file: !37, line: 838, baseType: !30, size: 64, offset: 64)
!467 = !{!468}
!468 = !DISubrange(count: 7)
!469 = !DILocalVariable(name: "node", scope: !456, file: !37, line: 848, type: !30)
!470 = !DILocalVariable(name: "map_prog", scope: !456, file: !37, line: 849, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!472 = !DILocalVariable(name: "lc_messages", scope: !456, file: !37, line: 861, type: !30)
!473 = !DILocalVariable(name: "url_program", scope: !456, file: !37, line: 874, type: !30)
!474 = !DILocation(line: 0, scope: !456, inlinedAt: !475)
!475 = distinct !DILocation(line: 82, column: 7, scope: !443)
!476 = !DILocation(line: 838, column: 3, scope: !456, inlinedAt: !475)
!477 = !DILocation(line: 838, column: 67, scope: !456, inlinedAt: !475)
!478 = !DILocation(line: 849, column: 36, scope: !456, inlinedAt: !475)
!479 = !DILocation(line: 851, column: 3, scope: !456, inlinedAt: !475)
!480 = !DILocalVariable(name: "__s1", arg: 1, scope: !481, file: !482, line: 1359, type: !30)
!481 = distinct !DISubprogram(name: "streq", scope: !482, file: !482, line: 1359, type: !483, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !485)
!482 = !DIFile(filename: "./lib/string.h", directory: "/src")
!483 = !DISubroutineType(types: !484)
!484 = !{!47, !30, !30}
!485 = !{!480, !486}
!486 = !DILocalVariable(name: "__s2", arg: 2, scope: !481, file: !482, line: 1359, type: !30)
!487 = !DILocation(line: 0, scope: !481, inlinedAt: !488)
!488 = distinct !DILocation(line: 851, column: 33, scope: !456, inlinedAt: !475)
!489 = !DILocation(line: 1361, column: 11, scope: !481, inlinedAt: !488)
!490 = !DILocation(line: 1361, column: 10, scope: !481, inlinedAt: !488)
!491 = !DILocation(line: 852, column: 13, scope: !456, inlinedAt: !475)
!492 = !DILocation(line: 851, column: 20, scope: !456, inlinedAt: !475)
!493 = !{!494, !439, i64 0}
!494 = !{!"infomap", !439, i64 0, !439, i64 8}
!495 = !DILocation(line: 851, column: 10, scope: !456, inlinedAt: !475)
!496 = !DILocation(line: 851, column: 28, scope: !456, inlinedAt: !475)
!497 = distinct !{!497, !479, !491, !498}
!498 = !{!"llvm.loop.mustprogress"}
!499 = !DILocation(line: 854, column: 17, scope: !500, inlinedAt: !475)
!500 = distinct !DILexicalBlock(scope: !456, file: !37, line: 854, column: 7)
!501 = !{!494, !439, i64 8}
!502 = !DILocation(line: 854, column: 7, scope: !500, inlinedAt: !475)
!503 = !DILocation(line: 854, column: 7, scope: !456, inlinedAt: !475)
!504 = !DILocation(line: 857, column: 3, scope: !456, inlinedAt: !475)
!505 = !DILocation(line: 861, column: 29, scope: !456, inlinedAt: !475)
!506 = !DILocation(line: 862, column: 7, scope: !507, inlinedAt: !475)
!507 = distinct !DILexicalBlock(scope: !456, file: !37, line: 862, column: 7)
!508 = !DILocation(line: 862, column: 19, scope: !507, inlinedAt: !475)
!509 = !DILocation(line: 862, column: 22, scope: !507, inlinedAt: !475)
!510 = !DILocation(line: 862, column: 7, scope: !456, inlinedAt: !475)
!511 = !DILocation(line: 868, column: 7, scope: !512, inlinedAt: !475)
!512 = distinct !DILexicalBlock(scope: !507, file: !37, line: 863, column: 5)
!513 = !DILocation(line: 870, column: 5, scope: !512, inlinedAt: !475)
!514 = !DILocation(line: 0, scope: !481, inlinedAt: !515)
!515 = distinct !DILocation(line: 874, column: 29, scope: !456, inlinedAt: !475)
!516 = !DILocation(line: 875, column: 3, scope: !456, inlinedAt: !475)
!517 = !DILocation(line: 877, column: 3, scope: !456, inlinedAt: !475)
!518 = !DILocation(line: 879, column: 1, scope: !456, inlinedAt: !475)
!519 = !DILocation(line: 84, column: 3, scope: !427)
!520 = !DISubprogram(name: "dcgettext", scope: !521, file: !521, line: 51, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!521 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!522 = !DISubroutineType(types: !523)
!523 = !{!22, !30, !30, !25}
!524 = !DISubprogram(name: "fputs_unlocked", scope: !157, file: !157, line: 691, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!525 = !DISubroutineType(types: !526)
!526 = !{!25, !527, !528}
!527 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !30)
!528 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!529 = !DILocation(line: 0, scope: !36)
!530 = !DILocation(line: 581, column: 7, scope: !45)
!531 = !{!532, !532, i64 0}
!532 = !{!"int", !440, i64 0}
!533 = !DILocation(line: 581, column: 19, scope: !45)
!534 = !DILocation(line: 581, column: 7, scope: !36)
!535 = !DILocation(line: 585, column: 26, scope: !44)
!536 = !DILocation(line: 0, scope: !44)
!537 = !DILocation(line: 586, column: 23, scope: !44)
!538 = !DILocation(line: 586, column: 28, scope: !44)
!539 = !DILocation(line: 586, column: 32, scope: !44)
!540 = !{!440, !440, i64 0}
!541 = !DILocation(line: 586, column: 38, scope: !44)
!542 = !DILocation(line: 0, scope: !481, inlinedAt: !543)
!543 = distinct !DILocation(line: 586, column: 41, scope: !44)
!544 = !DILocation(line: 1361, column: 11, scope: !481, inlinedAt: !543)
!545 = !DILocation(line: 1361, column: 10, scope: !481, inlinedAt: !543)
!546 = !DILocation(line: 586, column: 19, scope: !44)
!547 = !DILocation(line: 587, column: 5, scope: !44)
!548 = !DILocation(line: 588, column: 7, scope: !549)
!549 = distinct !DILexicalBlock(scope: !36, file: !37, line: 588, column: 7)
!550 = !DILocation(line: 588, column: 7, scope: !36)
!551 = !DILocation(line: 590, column: 7, scope: !552)
!552 = distinct !DILexicalBlock(scope: !549, file: !37, line: 589, column: 5)
!553 = !DILocation(line: 591, column: 7, scope: !552)
!554 = !DILocation(line: 595, column: 37, scope: !36)
!555 = !DILocation(line: 595, column: 35, scope: !36)
!556 = !DILocation(line: 596, column: 29, scope: !36)
!557 = !DILocation(line: 597, column: 8, scope: !53)
!558 = !DILocation(line: 597, column: 7, scope: !36)
!559 = !DILocation(line: 604, column: 24, scope: !52)
!560 = !DILocation(line: 604, column: 12, scope: !53)
!561 = !DILocation(line: 0, scope: !51)
!562 = !DILocation(line: 610, column: 16, scope: !51)
!563 = !DILocation(line: 610, column: 7, scope: !51)
!564 = !DILocation(line: 611, column: 21, scope: !51)
!565 = !{!566, !566, i64 0}
!566 = !{!"short", !440, i64 0}
!567 = !DILocation(line: 611, column: 19, scope: !51)
!568 = !DILocation(line: 611, column: 16, scope: !51)
!569 = !DILocation(line: 610, column: 30, scope: !51)
!570 = distinct !{!570, !563, !564, !498}
!571 = !DILocation(line: 612, column: 18, scope: !572)
!572 = distinct !DILexicalBlock(scope: !51, file: !37, line: 612, column: 11)
!573 = !DILocation(line: 612, column: 11, scope: !51)
!574 = !DILocation(line: 620, column: 23, scope: !36)
!575 = !DILocation(line: 625, column: 39, scope: !36)
!576 = !DILocation(line: 626, column: 3, scope: !36)
!577 = !DILocation(line: 626, column: 10, scope: !36)
!578 = !DILocation(line: 626, column: 21, scope: !36)
!579 = !DILocation(line: 628, column: 44, scope: !580)
!580 = distinct !DILexicalBlock(scope: !581, file: !37, line: 628, column: 11)
!581 = distinct !DILexicalBlock(scope: !36, file: !37, line: 627, column: 5)
!582 = !DILocation(line: 628, column: 32, scope: !580)
!583 = !DILocation(line: 628, column: 49, scope: !580)
!584 = !DILocation(line: 628, column: 11, scope: !581)
!585 = !DILocation(line: 630, column: 11, scope: !586)
!586 = distinct !DILexicalBlock(scope: !581, file: !37, line: 630, column: 11)
!587 = !DILocation(line: 630, column: 11, scope: !581)
!588 = !DILocation(line: 632, column: 26, scope: !589)
!589 = distinct !DILexicalBlock(scope: !590, file: !37, line: 632, column: 15)
!590 = distinct !DILexicalBlock(scope: !586, file: !37, line: 631, column: 9)
!591 = !DILocation(line: 632, column: 34, scope: !589)
!592 = !DILocation(line: 632, column: 37, scope: !589)
!593 = !DILocation(line: 632, column: 15, scope: !590)
!594 = !DILocation(line: 636, column: 29, scope: !595)
!595 = distinct !DILexicalBlock(scope: !590, file: !37, line: 636, column: 15)
!596 = !DILocation(line: 640, column: 16, scope: !581)
!597 = distinct !{!597, !576, !598, !498}
!598 = !DILocation(line: 641, column: 5, scope: !36)
!599 = !DILocation(line: 644, column: 3, scope: !36)
!600 = !DILocation(line: 0, scope: !481, inlinedAt: !601)
!601 = distinct !DILocation(line: 648, column: 31, scope: !36)
!602 = !DILocation(line: 0, scope: !481, inlinedAt: !603)
!603 = distinct !DILocation(line: 649, column: 31, scope: !36)
!604 = !DILocation(line: 0, scope: !481, inlinedAt: !605)
!605 = distinct !DILocation(line: 650, column: 31, scope: !36)
!606 = !DILocation(line: 0, scope: !481, inlinedAt: !607)
!607 = distinct !DILocation(line: 651, column: 31, scope: !36)
!608 = !DILocation(line: 0, scope: !481, inlinedAt: !609)
!609 = distinct !DILocation(line: 652, column: 31, scope: !36)
!610 = !DILocation(line: 0, scope: !481, inlinedAt: !611)
!611 = distinct !DILocation(line: 653, column: 31, scope: !36)
!612 = !DILocation(line: 0, scope: !481, inlinedAt: !613)
!613 = distinct !DILocation(line: 654, column: 31, scope: !36)
!614 = !DILocation(line: 0, scope: !481, inlinedAt: !615)
!615 = distinct !DILocation(line: 655, column: 31, scope: !36)
!616 = !DILocation(line: 0, scope: !481, inlinedAt: !617)
!617 = distinct !DILocation(line: 656, column: 31, scope: !36)
!618 = !DILocation(line: 0, scope: !481, inlinedAt: !619)
!619 = distinct !DILocation(line: 657, column: 31, scope: !36)
!620 = !DILocation(line: 663, column: 7, scope: !621)
!621 = distinct !DILexicalBlock(scope: !36, file: !37, line: 663, column: 7)
!622 = !DILocation(line: 664, column: 7, scope: !621)
!623 = !DILocation(line: 664, column: 10, scope: !621)
!624 = !DILocation(line: 663, column: 7, scope: !36)
!625 = !DILocation(line: 669, column: 7, scope: !626)
!626 = distinct !DILexicalBlock(scope: !621, file: !37, line: 665, column: 5)
!627 = !DILocation(line: 671, column: 5, scope: !626)
!628 = !DILocation(line: 676, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !621, file: !37, line: 673, column: 5)
!630 = !DILocation(line: 679, column: 3, scope: !36)
!631 = !DILocation(line: 683, column: 3, scope: !36)
!632 = !DILocation(line: 686, column: 3, scope: !36)
!633 = !DILocation(line: 688, column: 3, scope: !36)
!634 = !DILocation(line: 691, column: 3, scope: !36)
!635 = !DILocation(line: 695, column: 3, scope: !36)
!636 = !DILocation(line: 696, column: 1, scope: !36)
!637 = !DISubprogram(name: "setlocale", scope: !638, file: !638, line: 122, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!638 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!639 = !DISubroutineType(types: !640)
!640 = !{!22, !25, !30}
!641 = !DISubprogram(name: "getenv", scope: !642, file: !642, line: 641, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!642 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!643 = !DISubroutineType(types: !644)
!644 = !{!22, !30}
!645 = !DISubprogram(name: "fwrite_unlocked", scope: !157, file: !157, line: 704, type: !646, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!646 = !DISubroutineType(types: !647)
!647 = !{!27, !648, !27, !27, !528}
!648 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!651 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 127, type: !652, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !655)
!652 = !DISubroutineType(types: !653)
!653 = !{!25, !25, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!655 = !{!656, !657, !658, !659, !660, !661}
!656 = !DILocalVariable(name: "argc", arg: 1, scope: !651, file: !3, line: 127, type: !25)
!657 = !DILocalVariable(name: "argv", arg: 2, scope: !651, file: !3, line: 127, type: !654)
!658 = !DILocalVariable(name: "multiple_names", scope: !651, file: !3, line: 129, type: !47)
!659 = !DILocalVariable(name: "use_nuls", scope: !651, file: !3, line: 130, type: !47)
!660 = !DILocalVariable(name: "suffix", scope: !651, file: !3, line: 131, type: !30)
!661 = !DILocalVariable(name: "c", scope: !662, file: !3, line: 143, type: !25)
!662 = distinct !DILexicalBlock(scope: !651, file: !3, line: 142, column: 5)
!663 = !DILocation(line: 0, scope: !651)
!664 = !DILocation(line: 134, column: 21, scope: !651)
!665 = !DILocation(line: 134, column: 3, scope: !651)
!666 = !DILocation(line: 135, column: 3, scope: !651)
!667 = !DILocation(line: 136, column: 3, scope: !651)
!668 = !DILocation(line: 137, column: 3, scope: !651)
!669 = !DILocation(line: 139, column: 3, scope: !651)
!670 = !DILocation(line: 141, column: 3, scope: !651)
!671 = !DILocation(line: 145, column: 11, scope: !662)
!672 = !DILocation(line: 143, column: 15, scope: !662)
!673 = !DILocation(line: 0, scope: !662)
!674 = !DILocation(line: 151, column: 20, scope: !675)
!675 = distinct !DILexicalBlock(scope: !662, file: !3, line: 149, column: 9)
!676 = !DILocation(line: 151, column: 11, scope: !675)
!677 = !DILocation(line: 163, column: 9, scope: !675)
!678 = !DILocation(line: 164, column: 9, scope: !675)
!679 = !DILocation(line: 167, column: 11, scope: !675)
!680 = !DILocation(line: 171, column: 14, scope: !681)
!681 = distinct !DILexicalBlock(scope: !651, file: !3, line: 171, column: 7)
!682 = !DILocation(line: 171, column: 12, scope: !681)
!683 = !DILocation(line: 171, column: 7, scope: !651)
!684 = !DILocation(line: 173, column: 7, scope: !685)
!685 = distinct !DILexicalBlock(scope: !681, file: !3, line: 172, column: 5)
!686 = !DILocation(line: 174, column: 7, scope: !685)
!687 = !DILocation(line: 177, column: 23, scope: !688)
!688 = distinct !DILexicalBlock(scope: !651, file: !3, line: 177, column: 7)
!689 = !DILocation(line: 179, column: 7, scope: !690)
!690 = distinct !DILexicalBlock(scope: !688, file: !3, line: 178, column: 5)
!691 = !DILocation(line: 180, column: 7, scope: !690)
!692 = !DILocation(line: 183, column: 7, scope: !651)
!693 = !DILocation(line: 186, column: 27, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 185, column: 7)
!695 = distinct !DILexicalBlock(scope: !696, file: !3, line: 185, column: 7)
!696 = distinct !DILexicalBlock(scope: !697, file: !3, line: 184, column: 5)
!697 = distinct !DILexicalBlock(scope: !651, file: !3, line: 183, column: 7)
!698 = !DILocation(line: 186, column: 9, scope: !694)
!699 = !DILocation(line: 185, column: 35, scope: !694)
!700 = !DILocation(line: 185, column: 21, scope: !694)
!701 = !DILocation(line: 185, column: 7, scope: !695)
!702 = distinct !{!702, !701, !703, !498}
!703 = !DILocation(line: 186, column: 57, scope: !695)
!704 = !DILocation(line: 189, column: 23, scope: !697)
!705 = !DILocation(line: 190, column: 34, scope: !697)
!706 = !DILocation(line: 190, column: 23, scope: !697)
!707 = !DILocation(line: 190, column: 56, scope: !697)
!708 = !DILocation(line: 190, column: 44, scope: !697)
!709 = !DILocation(line: 189, column: 5, scope: !697)
!710 = !DILocation(line: 194, column: 1, scope: !651)
!711 = !DISubprogram(name: "bindtextdomain", scope: !521, file: !521, line: 86, type: !712, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!712 = !DISubroutineType(types: !713)
!713 = !{!22, !30, !30}
!714 = !DISubprogram(name: "textdomain", scope: !521, file: !521, line: 82, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!715 = !DISubprogram(name: "atexit", scope: !642, file: !642, line: 602, type: !716, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!716 = !DISubroutineType(types: !717)
!717 = !{!25, !183}
!718 = !DISubprogram(name: "getopt_long", scope: !124, file: !124, line: 66, type: !719, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!719 = !DISubroutineType(types: !720)
!720 = !{!25, !25, !721, !30, !723, !129}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!724 = distinct !DISubprogram(name: "perform_basename", scope: !3, file: !3, line: 107, type: !725, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !30, !30, !47}
!727 = !{!728, !729, !730, !731}
!728 = !DILocalVariable(name: "string", arg: 1, scope: !724, file: !3, line: 107, type: !30)
!729 = !DILocalVariable(name: "suffix", arg: 2, scope: !724, file: !3, line: 107, type: !30)
!730 = !DILocalVariable(name: "use_nuls", arg: 3, scope: !724, file: !3, line: 107, type: !47)
!731 = !DILocalVariable(name: "name", scope: !724, file: !3, line: 109, type: !22)
!732 = !DILocation(line: 0, scope: !724)
!733 = !DILocation(line: 109, column: 16, scope: !724)
!734 = !DILocation(line: 110, column: 3, scope: !724)
!735 = !DILocation(line: 118, column: 7, scope: !736)
!736 = distinct !DILexicalBlock(scope: !724, file: !3, line: 118, column: 7)
!737 = !DILocation(line: 118, column: 14, scope: !736)
!738 = !DILocation(line: 118, column: 17, scope: !736)
!739 = !DILocation(line: 118, column: 46, scope: !736)
!740 = !DILocalVariable(name: "name", arg: 1, scope: !741, file: !3, line: 91, type: !22)
!741 = distinct !DISubprogram(name: "remove_suffix", scope: !3, file: !3, line: 91, type: !742, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !22, !30}
!744 = !{!740, !745, !746, !747}
!745 = !DILocalVariable(name: "suffix", arg: 2, scope: !741, file: !3, line: 91, type: !30)
!746 = !DILocalVariable(name: "np", scope: !741, file: !3, line: 93, type: !22)
!747 = !DILocalVariable(name: "sp", scope: !741, file: !3, line: 94, type: !30)
!748 = !DILocation(line: 0, scope: !741, inlinedAt: !749)
!749 = distinct !DILocation(line: 119, column: 5, scope: !736)
!750 = !DILocation(line: 93, column: 21, scope: !741, inlinedAt: !749)
!751 = !DILocation(line: 93, column: 19, scope: !741, inlinedAt: !749)
!752 = !DILocation(line: 94, column: 29, scope: !741, inlinedAt: !749)
!753 = !DILocation(line: 94, column: 27, scope: !741, inlinedAt: !749)
!754 = !DILocation(line: 96, column: 3, scope: !741, inlinedAt: !749)
!755 = !DILocation(line: 96, column: 13, scope: !741, inlinedAt: !749)
!756 = !DILocation(line: 96, column: 20, scope: !741, inlinedAt: !749)
!757 = !DILocation(line: 97, column: 10, scope: !758, inlinedAt: !749)
!758 = distinct !DILexicalBlock(scope: !741, file: !3, line: 97, column: 9)
!759 = !DILocation(line: 97, column: 9, scope: !758, inlinedAt: !749)
!760 = !DILocation(line: 97, column: 19, scope: !758, inlinedAt: !749)
!761 = !DILocation(line: 97, column: 18, scope: !758, inlinedAt: !749)
!762 = !DILocation(line: 97, column: 15, scope: !758, inlinedAt: !749)
!763 = !DILocation(line: 97, column: 9, scope: !741, inlinedAt: !749)
!764 = distinct !{!764, !754, !765, !498}
!765 = !DILocation(line: 98, column: 7, scope: !741, inlinedAt: !749)
!766 = !DILocation(line: 99, column: 7, scope: !741, inlinedAt: !749)
!767 = !DILocation(line: 100, column: 9, scope: !768, inlinedAt: !749)
!768 = distinct !DILexicalBlock(scope: !741, file: !3, line: 99, column: 7)
!769 = !DILocation(line: 100, column: 5, scope: !768, inlinedAt: !749)
!770 = !DILocation(line: 121, column: 3, scope: !724)
!771 = !DILocation(line: 122, column: 3, scope: !724)
!772 = !DILocalVariable(name: "__c", arg: 1, scope: !773, file: !774, line: 108, type: !25)
!773 = distinct !DISubprogram(name: "putchar_unlocked", scope: !774, file: !774, line: 108, type: !775, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !777)
!774 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!775 = !DISubroutineType(types: !776)
!776 = !{!25, !25}
!777 = !{!772}
!778 = !DILocation(line: 0, scope: !773, inlinedAt: !779)
!779 = distinct !DILocation(line: 122, column: 3, scope: !724)
!780 = !DILocation(line: 110, column: 10, scope: !773, inlinedAt: !779)
!781 = !{!782, !439, i64 40}
!782 = !{!"_IO_FILE", !532, i64 0, !439, i64 8, !439, i64 16, !439, i64 24, !439, i64 32, !439, i64 40, !439, i64 48, !439, i64 56, !439, i64 64, !439, i64 72, !439, i64 80, !439, i64 88, !439, i64 96, !439, i64 104, !532, i64 112, !532, i64 116, !783, i64 120, !566, i64 128, !440, i64 130, !440, i64 131, !439, i64 136, !783, i64 144, !439, i64 152, !439, i64 160, !439, i64 168, !439, i64 176, !783, i64 184, !532, i64 192, !440, i64 196}
!783 = !{!"long", !440, i64 0}
!784 = !{!782, !439, i64 48}
!785 = !{!"branch_weights", i32 2000, i32 1}
!786 = !DILocation(line: 123, column: 3, scope: !724)
!787 = !DILocation(line: 124, column: 1, scope: !724)
!788 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !141, file: !141, line: 50, type: !457, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !789)
!789 = !{!790}
!790 = !DILocalVariable(name: "file", arg: 1, scope: !788, file: !141, line: 50, type: !30)
!791 = !DILocation(line: 0, scope: !788)
!792 = !DILocation(line: 52, column: 13, scope: !788)
!793 = !DILocation(line: 53, column: 1, scope: !788)
!794 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !141, file: !141, line: 87, type: !795, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !47}
!797 = !{!798}
!798 = !DILocalVariable(name: "ignore", arg: 1, scope: !794, file: !141, line: 87, type: !47)
!799 = !DILocation(line: 0, scope: !794)
!800 = !DILocation(line: 89, column: 16, scope: !794)
!801 = !{!802, !802, i64 0}
!802 = !{!"_Bool", !440, i64 0}
!803 = !DILocation(line: 90, column: 1, scope: !794)
!804 = distinct !DISubprogram(name: "close_stdout", scope: !141, file: !141, line: 116, type: !184, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !805)
!805 = !{!806}
!806 = !DILocalVariable(name: "write_error", scope: !807, file: !141, line: 121, type: !30)
!807 = distinct !DILexicalBlock(scope: !808, file: !141, line: 120, column: 5)
!808 = distinct !DILexicalBlock(scope: !804, file: !141, line: 118, column: 7)
!809 = !DILocation(line: 118, column: 21, scope: !808)
!810 = !DILocation(line: 118, column: 7, scope: !808)
!811 = !DILocation(line: 118, column: 29, scope: !808)
!812 = !DILocation(line: 119, column: 7, scope: !808)
!813 = !DILocation(line: 119, column: 12, scope: !808)
!814 = !{i8 0, i8 2}
!815 = !DILocation(line: 119, column: 25, scope: !808)
!816 = !DILocation(line: 119, column: 28, scope: !808)
!817 = !DILocation(line: 119, column: 34, scope: !808)
!818 = !DILocation(line: 118, column: 7, scope: !804)
!819 = !DILocation(line: 121, column: 33, scope: !807)
!820 = !DILocation(line: 0, scope: !807)
!821 = !DILocation(line: 122, column: 11, scope: !822)
!822 = distinct !DILexicalBlock(scope: !807, file: !141, line: 122, column: 11)
!823 = !DILocation(line: 0, scope: !822)
!824 = !DILocation(line: 122, column: 11, scope: !807)
!825 = !DILocation(line: 123, column: 9, scope: !822)
!826 = !DILocation(line: 126, column: 9, scope: !822)
!827 = !DILocation(line: 128, column: 14, scope: !807)
!828 = !DILocation(line: 128, column: 7, scope: !807)
!829 = !DILocation(line: 133, column: 42, scope: !830)
!830 = distinct !DILexicalBlock(scope: !804, file: !141, line: 133, column: 7)
!831 = !DILocation(line: 133, column: 28, scope: !830)
!832 = !DILocation(line: 133, column: 50, scope: !830)
!833 = !DILocation(line: 133, column: 7, scope: !804)
!834 = !DILocation(line: 134, column: 12, scope: !830)
!835 = !DILocation(line: 134, column: 5, scope: !830)
!836 = !DILocation(line: 135, column: 1, scope: !804)
!837 = distinct !DISubprogram(name: "base_name", scope: !348, file: !348, line: 27, type: !643, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !347, retainedNodes: !838)
!838 = !{!839, !840, !841, !842, !843}
!839 = !DILocalVariable(name: "name", arg: 1, scope: !837, file: !348, line: 27, type: !30)
!840 = !DILocalVariable(name: "base", scope: !837, file: !348, line: 29, type: !30)
!841 = !DILocalVariable(name: "length", scope: !837, file: !348, line: 30, type: !380)
!842 = !DILocalVariable(name: "dotslash_len", scope: !837, file: !348, line: 31, type: !25)
!843 = !DILocalVariable(name: "p", scope: !837, file: !348, line: 53, type: !22)
!844 = !DILocation(line: 0, scope: !837)
!845 = !DILocation(line: 29, column: 22, scope: !837)
!846 = !DILocation(line: 32, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !837, file: !348, line: 32, column: 7)
!848 = !DILocation(line: 32, column: 7, scope: !837)
!849 = !DILocation(line: 34, column: 16, scope: !850)
!850 = distinct !DILexicalBlock(scope: !847, file: !348, line: 33, column: 5)
!851 = !DILocation(line: 37, column: 17, scope: !850)
!852 = !DILocation(line: 37, column: 14, scope: !850)
!853 = !DILocation(line: 43, column: 5, scope: !850)
!854 = !DILocation(line: 49, column: 16, scope: !855)
!855 = distinct !DILexicalBlock(scope: !847, file: !348, line: 45, column: 5)
!856 = !DILocation(line: 0, scope: !847)
!857 = !DILocation(line: 53, column: 45, scope: !837)
!858 = !DILocation(line: 53, column: 13, scope: !837)
!859 = !DILocalVariable(name: "__dest", arg: 1, scope: !860, file: !861, line: 26, type: !864)
!860 = distinct !DISubprogram(name: "memcpy", scope: !861, file: !861, line: 26, type: !862, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !347, retainedNodes: !865)
!861 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!862 = !DISubroutineType(types: !863)
!863 = !{!24, !864, !648, !27}
!864 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !24)
!865 = !{!859, !866, !867}
!866 = !DILocalVariable(name: "__src", arg: 2, scope: !860, file: !861, line: 26, type: !648)
!867 = !DILocalVariable(name: "__len", arg: 3, scope: !860, file: !861, line: 26, type: !27)
!868 = !DILocation(line: 0, scope: !860, inlinedAt: !869)
!869 = distinct !DILocation(line: 61, column: 3, scope: !837)
!870 = !DILocation(line: 29, column: 10, scope: !860, inlinedAt: !869)
!871 = !DILocation(line: 62, column: 3, scope: !837)
!872 = !DILocation(line: 62, column: 28, scope: !837)
!873 = !DILocation(line: 63, column: 3, scope: !837)
!874 = distinct !DISubprogram(name: "strip_trailing_slashes", scope: !350, file: !350, line: 31, type: !875, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!47, !22}
!877 = !{!878, !879, !880, !881}
!878 = !DILocalVariable(name: "file", arg: 1, scope: !874, file: !350, line: 31, type: !22)
!879 = !DILocalVariable(name: "base", scope: !874, file: !350, line: 33, type: !22)
!880 = !DILocalVariable(name: "base_lim", scope: !874, file: !350, line: 39, type: !22)
!881 = !DILocalVariable(name: "had_slash", scope: !874, file: !350, line: 40, type: !47)
!882 = !DILocation(line: 0, scope: !874)
!883 = !DILocation(line: 33, column: 16, scope: !874)
!884 = !DILocation(line: 37, column: 9, scope: !885)
!885 = distinct !DILexicalBlock(scope: !874, file: !350, line: 37, column: 7)
!886 = !DILocation(line: 37, column: 7, scope: !874)
!887 = !DILocation(line: 39, column: 27, scope: !874)
!888 = !DILocation(line: 39, column: 25, scope: !874)
!889 = !DILocation(line: 40, column: 21, scope: !874)
!890 = !DILocation(line: 40, column: 31, scope: !874)
!891 = !DILocation(line: 41, column: 13, scope: !874)
!892 = !DILocation(line: 42, column: 3, scope: !874)
!893 = distinct !DISubprogram(name: "verror", scope: !148, file: !148, line: 251, type: !894, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !25, !25, !30, !156}
!896 = !{!897, !898, !899, !900}
!897 = !DILocalVariable(name: "status", arg: 1, scope: !893, file: !148, line: 251, type: !25)
!898 = !DILocalVariable(name: "errnum", arg: 2, scope: !893, file: !148, line: 251, type: !25)
!899 = !DILocalVariable(name: "message", arg: 3, scope: !893, file: !148, line: 251, type: !30)
!900 = !DILocalVariable(name: "args", arg: 4, scope: !893, file: !148, line: 251, type: !156)
!901 = !DILocation(line: 0, scope: !893)
!902 = !DILocation(line: 251, column: 1, scope: !893)
!903 = !DILocation(line: 261, column: 3, scope: !893)
!904 = !DILocation(line: 265, column: 7, scope: !905)
!905 = distinct !DILexicalBlock(scope: !893, file: !148, line: 265, column: 7)
!906 = !DILocation(line: 265, column: 7, scope: !893)
!907 = !DILocation(line: 266, column: 5, scope: !905)
!908 = !DILocation(line: 272, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !905, file: !148, line: 268, column: 5)
!910 = !DILocation(line: 276, column: 3, scope: !893)
!911 = !{i64 0, i64 8, !438, i64 8, i64 8, !438, i64 16, i64 8, !438, i64 24, i64 4, !531, i64 28, i64 4, !531}
!912 = !DILocation(line: 282, column: 1, scope: !893)
!913 = distinct !DISubprogram(name: "flush_stdout", scope: !148, file: !148, line: 163, type: !184, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !914)
!914 = !{!915}
!915 = !DILocalVariable(name: "stdout_fd", scope: !913, file: !148, line: 166, type: !25)
!916 = !DILocation(line: 0, scope: !913)
!917 = !DILocalVariable(name: "fd", arg: 1, scope: !918, file: !148, line: 145, type: !25)
!918 = distinct !DISubprogram(name: "is_open", scope: !148, file: !148, line: 145, type: !775, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !919)
!919 = !{!917}
!920 = !DILocation(line: 0, scope: !918, inlinedAt: !921)
!921 = distinct !DILocation(line: 182, column: 25, scope: !922)
!922 = distinct !DILexicalBlock(scope: !913, file: !148, line: 182, column: 7)
!923 = !DILocation(line: 157, column: 15, scope: !918, inlinedAt: !921)
!924 = !DILocation(line: 182, column: 25, scope: !922)
!925 = !DILocation(line: 182, column: 7, scope: !913)
!926 = !DILocation(line: 184, column: 5, scope: !922)
!927 = !DILocation(line: 185, column: 1, scope: !913)
!928 = distinct !DISubprogram(name: "error_tail", scope: !148, file: !148, line: 219, type: !894, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !929)
!929 = !{!930, !931, !932, !933}
!930 = !DILocalVariable(name: "status", arg: 1, scope: !928, file: !148, line: 219, type: !25)
!931 = !DILocalVariable(name: "errnum", arg: 2, scope: !928, file: !148, line: 219, type: !25)
!932 = !DILocalVariable(name: "message", arg: 3, scope: !928, file: !148, line: 219, type: !30)
!933 = !DILocalVariable(name: "args", arg: 4, scope: !928, file: !148, line: 219, type: !156)
!934 = !DILocation(line: 0, scope: !928)
!935 = !DILocation(line: 219, column: 1, scope: !928)
!936 = !DILocation(line: 229, column: 13, scope: !928)
!937 = !DILocation(line: 229, column: 3, scope: !928)
!938 = !DILocalVariable(name: "__stream", arg: 1, scope: !939, file: !940, line: 132, type: !943)
!939 = distinct !DISubprogram(name: "vfprintf", scope: !940, file: !940, line: 132, type: !941, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !978)
!940 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!941 = !DISubroutineType(types: !942)
!942 = !{!25, !943, !527, !158}
!943 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 7, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 49, size: 1728, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !946, file: !64, line: 51, baseType: !25, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !946, file: !64, line: 54, baseType: !22, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !946, file: !64, line: 55, baseType: !22, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !946, file: !64, line: 56, baseType: !22, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !946, file: !64, line: 57, baseType: !22, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !946, file: !64, line: 58, baseType: !22, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !946, file: !64, line: 59, baseType: !22, size: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !946, file: !64, line: 60, baseType: !22, size: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !946, file: !64, line: 61, baseType: !22, size: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !946, file: !64, line: 64, baseType: !22, size: 64, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !946, file: !64, line: 65, baseType: !22, size: 64, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !946, file: !64, line: 66, baseType: !22, size: 64, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !946, file: !64, line: 68, baseType: !79, size: 64, offset: 768)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !946, file: !64, line: 70, baseType: !962, size: 64, offset: 832)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !946, file: !64, line: 72, baseType: !25, size: 32, offset: 896)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !946, file: !64, line: 73, baseType: !25, size: 32, offset: 928)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !946, file: !64, line: 74, baseType: !86, size: 64, offset: 960)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !946, file: !64, line: 77, baseType: !26, size: 16, offset: 1024)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !946, file: !64, line: 78, baseType: !91, size: 8, offset: 1040)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !946, file: !64, line: 79, baseType: !93, size: 8, offset: 1048)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !946, file: !64, line: 81, baseType: !97, size: 64, offset: 1088)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !946, file: !64, line: 89, baseType: !100, size: 64, offset: 1152)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !946, file: !64, line: 91, baseType: !102, size: 64, offset: 1216)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !946, file: !64, line: 92, baseType: !105, size: 64, offset: 1280)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !946, file: !64, line: 93, baseType: !962, size: 64, offset: 1344)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !946, file: !64, line: 94, baseType: !24, size: 64, offset: 1408)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !946, file: !64, line: 95, baseType: !27, size: 64, offset: 1472)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !946, file: !64, line: 96, baseType: !25, size: 32, offset: 1536)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !946, file: !64, line: 98, baseType: !112, size: 160, offset: 1568)
!978 = !{!938, !979, !980}
!979 = !DILocalVariable(name: "__fmt", arg: 2, scope: !939, file: !940, line: 133, type: !527)
!980 = !DILocalVariable(name: "__ap", arg: 3, scope: !939, file: !940, line: 133, type: !158)
!981 = !DILocation(line: 0, scope: !939, inlinedAt: !982)
!982 = distinct !DILocation(line: 229, column: 3, scope: !928)
!983 = !DILocation(line: 135, column: 10, scope: !939, inlinedAt: !982)
!984 = !{!985, !987}
!985 = distinct !{!985, !986, !"vfprintf.inline: argument 0"}
!986 = distinct !{!986, !"vfprintf.inline"}
!987 = distinct !{!987, !986, !"vfprintf.inline: argument 1"}
!988 = !DILocation(line: 232, column: 3, scope: !928)
!989 = !DILocation(line: 233, column: 7, scope: !990)
!990 = distinct !DILexicalBlock(scope: !928, file: !148, line: 233, column: 7)
!991 = !DILocation(line: 233, column: 7, scope: !928)
!992 = !DILocalVariable(name: "errnum", arg: 1, scope: !993, file: !148, line: 188, type: !25)
!993 = distinct !DISubprogram(name: "print_errno_message", scope: !148, file: !148, line: 188, type: !428, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !994)
!994 = !{!992, !995, !996}
!995 = !DILocalVariable(name: "s", scope: !993, file: !148, line: 190, type: !30)
!996 = !DILocalVariable(name: "errbuf", scope: !993, file: !148, line: 193, type: !997)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 1024)
!1000 = !DILocation(line: 0, scope: !993, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 234, column: 5, scope: !990)
!1002 = !DILocation(line: 193, column: 3, scope: !993, inlinedAt: !1001)
!1003 = !DILocation(line: 193, column: 8, scope: !993, inlinedAt: !1001)
!1004 = !DILocation(line: 195, column: 7, scope: !993, inlinedAt: !1001)
!1005 = !DILocation(line: 207, column: 9, scope: !1006, inlinedAt: !1001)
!1006 = distinct !DILexicalBlock(scope: !993, file: !148, line: 207, column: 7)
!1007 = !DILocation(line: 207, column: 7, scope: !993, inlinedAt: !1001)
!1008 = !DILocation(line: 208, column: 9, scope: !1006, inlinedAt: !1001)
!1009 = !DILocation(line: 208, column: 5, scope: !1006, inlinedAt: !1001)
!1010 = !DILocation(line: 214, column: 3, scope: !993, inlinedAt: !1001)
!1011 = !DILocation(line: 216, column: 1, scope: !993, inlinedAt: !1001)
!1012 = !DILocation(line: 234, column: 5, scope: !990)
!1013 = !DILocation(line: 238, column: 3, scope: !928)
!1014 = !DILocalVariable(name: "__c", arg: 1, scope: !1015, file: !774, line: 101, type: !25)
!1015 = distinct !DISubprogram(name: "putc_unlocked", scope: !774, file: !774, line: 101, type: !1016, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1018)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!25, !25, !944}
!1018 = !{!1014, !1019}
!1019 = !DILocalVariable(name: "__stream", arg: 2, scope: !1015, file: !774, line: 101, type: !944)
!1020 = !DILocation(line: 0, scope: !1015, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 238, column: 3, scope: !928)
!1022 = !DILocation(line: 103, column: 10, scope: !1015, inlinedAt: !1021)
!1023 = !DILocation(line: 240, column: 3, scope: !928)
!1024 = !DILocation(line: 241, column: 7, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !928, file: !148, line: 241, column: 7)
!1026 = !DILocation(line: 241, column: 7, scope: !928)
!1027 = !DILocation(line: 242, column: 5, scope: !1025)
!1028 = !DILocation(line: 243, column: 1, scope: !928)
!1029 = !DISubprogram(name: "strerror_r", scope: !1030, file: !1030, line: 444, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!1030 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!22, !25, !22, !27}
!1033 = !DISubprogram(name: "fflush_unlocked", scope: !157, file: !157, line: 239, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!25, !944}
!1036 = !DISubprogram(name: "fcntl", scope: !1037, file: !1037, line: 149, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!1037 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!25, !25, !25, null}
!1040 = distinct !DISubprogram(name: "error", scope: !148, file: !148, line: 285, type: !1041, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1043)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !25, !25, !30, null}
!1043 = !{!1044, !1045, !1046, !1047}
!1044 = !DILocalVariable(name: "status", arg: 1, scope: !1040, file: !148, line: 285, type: !25)
!1045 = !DILocalVariable(name: "errnum", arg: 2, scope: !1040, file: !148, line: 285, type: !25)
!1046 = !DILocalVariable(name: "message", arg: 3, scope: !1040, file: !148, line: 285, type: !30)
!1047 = !DILocalVariable(name: "ap", scope: !1040, file: !148, line: 287, type: !156)
!1048 = !DILocation(line: 0, scope: !1040)
!1049 = !DILocation(line: 287, column: 3, scope: !1040)
!1050 = !DILocation(line: 287, column: 11, scope: !1040)
!1051 = !DILocation(line: 288, column: 3, scope: !1040)
!1052 = !DILocation(line: 289, column: 3, scope: !1040)
!1053 = !DILocation(line: 290, column: 3, scope: !1040)
!1054 = !DILocation(line: 291, column: 1, scope: !1040)
!1055 = !DILocation(line: 0, scope: !153)
!1056 = !DILocation(line: 298, column: 1, scope: !153)
!1057 = !DILocation(line: 302, column: 7, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !153, file: !148, line: 302, column: 7)
!1059 = !DILocation(line: 302, column: 7, scope: !153)
!1060 = !DILocation(line: 307, column: 11, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !148, line: 307, column: 11)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !148, line: 303, column: 5)
!1063 = !DILocation(line: 307, column: 27, scope: !1061)
!1064 = !DILocation(line: 308, column: 11, scope: !1061)
!1065 = !DILocation(line: 308, column: 28, scope: !1061)
!1066 = !DILocation(line: 308, column: 25, scope: !1061)
!1067 = !DILocation(line: 309, column: 15, scope: !1061)
!1068 = !DILocation(line: 309, column: 33, scope: !1061)
!1069 = !DILocation(line: 310, column: 19, scope: !1061)
!1070 = !DILocation(line: 311, column: 22, scope: !1061)
!1071 = !DILocation(line: 311, column: 56, scope: !1061)
!1072 = !DILocation(line: 307, column: 11, scope: !1062)
!1073 = !DILocation(line: 316, column: 21, scope: !1062)
!1074 = !DILocation(line: 317, column: 23, scope: !1062)
!1075 = !DILocation(line: 318, column: 5, scope: !1062)
!1076 = !DILocation(line: 327, column: 3, scope: !153)
!1077 = !DILocation(line: 331, column: 7, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !153, file: !148, line: 331, column: 7)
!1079 = !DILocation(line: 331, column: 7, scope: !153)
!1080 = !DILocation(line: 332, column: 5, scope: !1078)
!1081 = !DILocation(line: 338, column: 7, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !148, line: 334, column: 5)
!1083 = !DILocation(line: 346, column: 3, scope: !153)
!1084 = !DILocation(line: 350, column: 3, scope: !153)
!1085 = !DILocation(line: 356, column: 1, scope: !153)
!1086 = distinct !DISubprogram(name: "error_at_line", scope: !148, file: !148, line: 359, type: !1087, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1089)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{null, !25, !25, !30, !7, !30, null}
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095}
!1090 = !DILocalVariable(name: "status", arg: 1, scope: !1086, file: !148, line: 359, type: !25)
!1091 = !DILocalVariable(name: "errnum", arg: 2, scope: !1086, file: !148, line: 359, type: !25)
!1092 = !DILocalVariable(name: "file_name", arg: 3, scope: !1086, file: !148, line: 359, type: !30)
!1093 = !DILocalVariable(name: "line_number", arg: 4, scope: !1086, file: !148, line: 360, type: !7)
!1094 = !DILocalVariable(name: "message", arg: 5, scope: !1086, file: !148, line: 360, type: !30)
!1095 = !DILocalVariable(name: "ap", scope: !1086, file: !148, line: 362, type: !156)
!1096 = !DILocation(line: 0, scope: !1086)
!1097 = !DILocation(line: 362, column: 3, scope: !1086)
!1098 = !DILocation(line: 362, column: 11, scope: !1086)
!1099 = !DILocation(line: 363, column: 3, scope: !1086)
!1100 = !DILocation(line: 364, column: 3, scope: !1086)
!1101 = !DILocation(line: 366, column: 3, scope: !1086)
!1102 = !DILocation(line: 367, column: 1, scope: !1086)
!1103 = distinct !DISubprogram(name: "getprogname", scope: !352, file: !352, line: 54, type: !1104, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !351, retainedNodes: !447)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!30}
!1106 = !DILocation(line: 58, column: 10, scope: !1103)
!1107 = !DILocation(line: 58, column: 3, scope: !1103)
!1108 = distinct !DISubprogram(name: "set_program_name", scope: !189, file: !189, line: 37, type: !457, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DILocalVariable(name: "argv0", arg: 1, scope: !1108, file: !189, line: 37, type: !30)
!1111 = !DILocalVariable(name: "slash", scope: !1108, file: !189, line: 44, type: !30)
!1112 = !DILocalVariable(name: "base", scope: !1108, file: !189, line: 45, type: !30)
!1113 = !DILocation(line: 0, scope: !1108)
!1114 = !DILocation(line: 44, column: 23, scope: !1108)
!1115 = !DILocation(line: 45, column: 22, scope: !1108)
!1116 = !DILocation(line: 46, column: 17, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1108, file: !189, line: 46, column: 7)
!1118 = !DILocation(line: 46, column: 9, scope: !1117)
!1119 = !DILocation(line: 46, column: 25, scope: !1117)
!1120 = !DILocation(line: 46, column: 40, scope: !1117)
!1121 = !DILocalVariable(name: "__s1", arg: 1, scope: !1122, file: !482, line: 974, type: !649)
!1122 = distinct !DISubprogram(name: "memeq", scope: !482, file: !482, line: 974, type: !1123, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !1125)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!47, !649, !649, !27}
!1125 = !{!1121, !1126, !1127}
!1126 = !DILocalVariable(name: "__s2", arg: 2, scope: !1122, file: !482, line: 974, type: !649)
!1127 = !DILocalVariable(name: "__n", arg: 3, scope: !1122, file: !482, line: 974, type: !27)
!1128 = !DILocation(line: 0, scope: !1122, inlinedAt: !1129)
!1129 = distinct !DILocation(line: 46, column: 28, scope: !1117)
!1130 = !DILocation(line: 976, column: 11, scope: !1122, inlinedAt: !1129)
!1131 = !DILocation(line: 976, column: 10, scope: !1122, inlinedAt: !1129)
!1132 = !DILocation(line: 46, column: 7, scope: !1108)
!1133 = !DILocation(line: 49, column: 11, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !189, line: 49, column: 11)
!1135 = distinct !DILexicalBlock(scope: !1117, file: !189, line: 47, column: 5)
!1136 = !DILocation(line: 49, column: 36, scope: !1134)
!1137 = !DILocation(line: 49, column: 11, scope: !1135)
!1138 = !DILocation(line: 65, column: 16, scope: !1108)
!1139 = !DILocation(line: 71, column: 27, scope: !1108)
!1140 = !DILocation(line: 74, column: 33, scope: !1108)
!1141 = !DILocation(line: 76, column: 1, scope: !1108)
!1142 = !DILocation(line: 0, scope: !194)
!1143 = !DILocation(line: 40, column: 29, scope: !194)
!1144 = !DILocation(line: 41, column: 19, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !194, file: !195, line: 41, column: 7)
!1146 = !DILocation(line: 41, column: 7, scope: !194)
!1147 = !DILocation(line: 47, column: 3, scope: !194)
!1148 = !DILocation(line: 48, column: 3, scope: !194)
!1149 = !DILocation(line: 48, column: 13, scope: !194)
!1150 = !DILocalVariable(name: "ps", arg: 1, scope: !1151, file: !1152, line: 1135, type: !1155)
!1151 = distinct !DISubprogram(name: "mbszero", scope: !1152, file: !1152, line: 1135, type: !1153, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !198, retainedNodes: !1156)
!1152 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1155}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!1156 = !{!1150}
!1157 = !DILocation(line: 0, scope: !1151, inlinedAt: !1158)
!1158 = distinct !DILocation(line: 48, column: 18, scope: !194)
!1159 = !DILocalVariable(name: "__dest", arg: 1, scope: !1160, file: !861, line: 57, type: !24)
!1160 = distinct !DISubprogram(name: "memset", scope: !861, file: !861, line: 57, type: !1161, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !198, retainedNodes: !1163)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!24, !24, !25, !27}
!1163 = !{!1159, !1164, !1165}
!1164 = !DILocalVariable(name: "__ch", arg: 2, scope: !1160, file: !861, line: 57, type: !25)
!1165 = !DILocalVariable(name: "__len", arg: 3, scope: !1160, file: !861, line: 57, type: !27)
!1166 = !DILocation(line: 0, scope: !1160, inlinedAt: !1167)
!1167 = distinct !DILocation(line: 1137, column: 3, scope: !1151, inlinedAt: !1158)
!1168 = !DILocation(line: 59, column: 10, scope: !1160, inlinedAt: !1167)
!1169 = !DILocation(line: 49, column: 7, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !194, file: !195, line: 49, column: 7)
!1171 = !DILocation(line: 49, column: 39, scope: !1170)
!1172 = !DILocation(line: 49, column: 44, scope: !1170)
!1173 = !DILocation(line: 54, column: 1, scope: !194)
!1174 = !DISubprogram(name: "mbrtoc32", scope: !206, file: !206, line: 57, type: !1175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !447)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!27, !1177, !527, !27, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1155)
!1180 = distinct !DISubprogram(name: "clone_quoting_options", scope: !231, file: !231, line: 113, type: !1181, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !1184)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!1183, !1183}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!1184 = !{!1185, !1186, !1187}
!1185 = !DILocalVariable(name: "o", arg: 1, scope: !1180, file: !231, line: 113, type: !1183)
!1186 = !DILocalVariable(name: "saved_errno", scope: !1180, file: !231, line: 115, type: !25)
!1187 = !DILocalVariable(name: "p", scope: !1180, file: !231, line: 116, type: !1183)
!1188 = !DILocation(line: 0, scope: !1180)
!1189 = !DILocation(line: 115, column: 21, scope: !1180)
!1190 = !DILocation(line: 116, column: 40, scope: !1180)
!1191 = !DILocation(line: 116, column: 31, scope: !1180)
!1192 = !DILocation(line: 118, column: 9, scope: !1180)
!1193 = !DILocation(line: 119, column: 3, scope: !1180)
!1194 = distinct !DISubprogram(name: "get_quoting_style", scope: !231, file: !231, line: 124, type: !1195, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !1199)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!233, !1197}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
