; ModuleID = 'src/basenc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.base_decode_context = type { %union.anon, i8*, i64 }
%union.anon = type { %struct.base58_context }
%struct.base58_context = type { i8*, i64, i64 }
%struct.base_encode_context = type { %union.anon }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.35 }
%union.anon.35 = type { i32 }
%struct.base64_decode_context = type { i32, [4 x i8] }
%struct.base32_decode_context = type { i32, [8 x i8] }
%struct.base2_decode_context = type { i8, i32 }
%struct.z85_decode_context = type { i32, [5 x i8] }
%struct.__mpz_struct = type { i32, i32, i64* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.mpn_base_info = type { i32, i64 }
%struct.gmp_div_inverse = type { i32, i64, i64, i64 }


!29 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!32 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!33 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!34 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!35 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!36 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 46, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!40 = !DIEnumerator(name: "_ISupper", value: 256)
!41 = !DIEnumerator(name: "_ISlower", value: 512)
!42 = !DIEnumerator(name: "_ISalpha", value: 1024)
!43 = !DIEnumerator(name: "_ISdigit", value: 2048)
!44 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!45 = !DIEnumerator(name: "_ISspace", value: 8192)
!46 = !DIEnumerator(name: "_ISprint", value: 16384)
!47 = !DIEnumerator(name: "_ISgraph", value: 32768)
!48 = !DIEnumerator(name: "_ISblank", value: 1)
!49 = !DIEnumerator(name: "_IScntrl", value: 2)
!50 = !DIEnumerator(name: "_ISpunct", value: 4)
!51 = !DIEnumerator(name: "_ISalnum", value: 8)
!52 = !{!53, !55, !56, !57, !58, !61, !63, !64}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 46, baseType: !60)
!59 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!60 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !65, line: 62, baseType: !66)
!65 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!66 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!67 = !{!68, !76, !81, !87, !94, !150, !156, !162, !174, !179, !184, !189, !194, !0, !278, !283, !285, !291, !304, !309, !314, !316}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "base_length", scope: !2, file: !3, line: 272, type: !70, isLocal: true, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !73}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !74, line: 130, baseType: !75)
!74 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !59, line: 35, baseType: !66)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "required_padding", scope: !2, file: !3, line: 273, type: !78, isLocal: true, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!56, !56}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "isubase", scope: !2, file: !3, line: 274, type: !83, isLocal: true, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !63}
!86 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "base_encode", scope: !2, file: !3, line: 275, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !92, !73, !93, !73}
!92 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!93 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "base_decode_ctx_init", scope: !2, file: !3, line: 316, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_decode_context", file: !3, line: 303, size: 320, elements: !101)
!101 = !{!102, !148, !149}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !100, file: !3, line: 312, baseType: !103, size: 192)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !3, line: 305, size: 192, elements: !104)
!104 = !{!105, !114, !123, !128, !133, !141}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "base64", scope: !103, file: !3, line: 306, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base64_decode_context", file: !107, line: 47, size: 64, elements: !108)
!107 = !DIFile(filename: "./lib/base64.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b7f4aff5f88956a8b1e90ed552346cd0")
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !106, file: !107, line: 49, baseType: !56, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !106, file: !107, line: 50, baseType: !111, size: 32, offset: 32)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 4)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "base32", scope: !103, file: !3, line: 307, baseType: !115, size: 96)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base32_decode_context", file: !116, line: 47, size: 96, elements: !117)
!116 = !DIFile(filename: "./lib/base32.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e713a01df52addfef9645906d93b4fcb")
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !115, file: !116, line: 49, baseType: !56, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !115, file: !116, line: 50, baseType: !120, size: 64, offset: 32)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "base16", scope: !103, file: !3, line: 308, baseType: !124, size: 8)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base16_decode_context", file: !3, line: 278, size: 8, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nibble", scope: !124, file: !3, line: 281, baseType: !127, size: 8)
!127 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !103, file: !3, line: 309, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base2_decode_context", file: !3, line: 297, size: 64, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "octet", scope: !129, file: !3, line: 299, baseType: !63, size: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bit_pos", scope: !129, file: !3, line: 300, baseType: !56, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "z85", scope: !103, file: !3, line: 310, baseType: !134, size: 96)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z85_decode_context", file: !3, line: 284, size: 96, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !134, file: !3, line: 286, baseType: !56, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "octets", scope: !134, file: !3, line: 287, baseType: !138, size: 40, offset: 32)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 40, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 5)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "base58", scope: !103, file: !3, line: 311, baseType: !142, size: 192)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base58_context", file: !3, line: 290, size: 192, elements: !143)
!143 = !{!144, !146, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !142, file: !3, line: 292, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !142, file: !3, line: 293, baseType: !73, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !142, file: !3, line: 294, baseType: !73, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "inbuf", scope: !100, file: !3, line: 313, baseType: !53, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !100, file: !3, line: 314, baseType: !73, size: 64, offset: 256)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "base_decode_ctx", scope: !2, file: !3, line: 317, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!86, !99, !92, !73, !93, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "base_decode_ctx_finalize", scope: !2, file: !3, line: 320, type: !158, isLocal: true, isDefinition: true)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!86, !99, !161, !155}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "base_encode_ctx_init", scope: !2, file: !3, line: 330, type: !164, isLocal: true, isDefinition: true)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_encode_context", file: !3, line: 323, size: 192, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !168, file: !3, line: 327, baseType: !171, size: 192)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !3, line: 325, size: 192, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "base58", scope: !171, file: !3, line: 326, baseType: !142, size: 192)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "base_encode_ctx", scope: !2, file: !3, line: 331, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!86, !167, !92, !73, !93, !155}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "base_encode_ctx_finalize", scope: !2, file: !3, line: 334, type: !181, isLocal: true, isDefinition: true)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!86, !167, !161, !155}
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "has_padding", scope: !2, file: !3, line: 351, type: !186, isLocal: true, isDefinition: true)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!86, !99}
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "get_pending_length", scope: !2, file: !3, line: 352, type: !191, isLocal: true, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!56, !99}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !196, file: !197, line: 575, type: !56, isLocal: true, isDefinition: true)
!196 = distinct !DISubprogram(name: "oputs_", scope: !197, file: !197, line: 573, type: !198, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !200)
!197 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!198 = !DISubroutineType(types: !199)
!199 = !{null, !61, !61}
!200 = !{!201, !202, !203, !206, !207, !208, !209, !213, !214, !215, !216, !218, !272, !273, !274, !276, !277}
!201 = !DILocalVariable(name: "program", arg: 1, scope: !196, file: !197, line: 573, type: !61)
!202 = !DILocalVariable(name: "option", arg: 2, scope: !196, file: !197, line: 573, type: !61)
!203 = !DILocalVariable(name: "term", scope: !204, file: !197, line: 585, type: !61)
!204 = distinct !DILexicalBlock(scope: !205, file: !197, line: 582, column: 5)
!205 = distinct !DILexicalBlock(scope: !196, file: !197, line: 581, column: 7)
!206 = !DILocalVariable(name: "double_space", scope: !196, file: !197, line: 594, type: !86)
!207 = !DILocalVariable(name: "first_word", scope: !196, file: !197, line: 595, type: !61)
!208 = !DILocalVariable(name: "option_text", scope: !196, file: !197, line: 596, type: !61)
!209 = !DILocalVariable(name: "s", scope: !210, file: !197, line: 608, type: !61)
!210 = distinct !DILexicalBlock(scope: !211, file: !197, line: 605, column: 5)
!211 = distinct !DILexicalBlock(scope: !212, file: !197, line: 604, column: 12)
!212 = distinct !DILexicalBlock(scope: !196, file: !197, line: 597, column: 7)
!213 = !DILocalVariable(name: "spaces", scope: !210, file: !197, line: 609, type: !58)
!214 = !DILocalVariable(name: "anchor_len", scope: !196, file: !197, line: 620, type: !58)
!215 = !DILocalVariable(name: "desc_text", scope: !196, file: !197, line: 625, type: !61)
!216 = !DILocalVariable(name: "__ptr", scope: !217, file: !197, line: 644, type: !61)
!217 = distinct !DILexicalBlock(scope: !196, file: !197, line: 644, column: 3)
!218 = !DILocalVariable(name: "__stream", scope: !217, file: !197, line: 644, type: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !221, line: 7, baseType: !222)
!221 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !223, line: 49, size: 1728, elements: !224)
!223 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !240, !242, !243, !244, !247, !248, !249, !253, !256, !258, !261, !264, !265, !266, !267, !268}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !222, file: !223, line: 51, baseType: !56, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !222, file: !223, line: 54, baseType: !53, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !222, file: !223, line: 55, baseType: !53, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !222, file: !223, line: 56, baseType: !53, size: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !222, file: !223, line: 57, baseType: !53, size: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !222, file: !223, line: 58, baseType: !53, size: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !222, file: !223, line: 59, baseType: !53, size: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !222, file: !223, line: 60, baseType: !53, size: 64, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !222, file: !223, line: 61, baseType: !53, size: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !222, file: !223, line: 64, baseType: !53, size: 64, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !222, file: !223, line: 65, baseType: !53, size: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !222, file: !223, line: 66, baseType: !53, size: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !222, file: !223, line: 68, baseType: !238, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !223, line: 36, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !222, file: !223, line: 70, baseType: !241, size: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !222, file: !223, line: 72, baseType: !56, size: 32, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !222, file: !223, line: 73, baseType: !56, size: 32, offset: 928)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !222, file: !223, line: 74, baseType: !245, size: 64, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !246, line: 152, baseType: !66)
!246 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !222, file: !223, line: 77, baseType: !57, size: 16, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !222, file: !223, line: 78, baseType: !127, size: 8, offset: 1040)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !222, file: !223, line: 79, baseType: !250, size: 8, offset: 1048)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 1)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !222, file: !223, line: 81, baseType: !254, size: 64, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !223, line: 43, baseType: null)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !222, file: !223, line: 89, baseType: !257, size: 64, offset: 1152)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !246, line: 153, baseType: !66)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !222, file: !223, line: 91, baseType: !259, size: 64, offset: 1216)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !223, line: 37, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !222, file: !223, line: 92, baseType: !262, size: 64, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !223, line: 38, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !222, file: !223, line: 93, baseType: !241, size: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !222, file: !223, line: 94, baseType: !55, size: 64, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !222, file: !223, line: 95, baseType: !58, size: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !222, file: !223, line: 96, baseType: !56, size: 32, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !222, file: !223, line: 98, baseType: !269, size: 160, offset: 1568)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 160, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 20)
!272 = !DILocalVariable(name: "__cnt", scope: !217, file: !197, line: 644, type: !58)
!273 = !DILocalVariable(name: "url_program", scope: !196, file: !197, line: 648, type: !61)
!274 = !DILocalVariable(name: "__ptr", scope: !275, file: !197, line: 686, type: !61)
!275 = distinct !DILexicalBlock(scope: !196, file: !197, line: 686, column: 3)
!276 = !DILocalVariable(name: "__stream", scope: !275, file: !197, line: 686, type: !219)
!277 = !DILocalVariable(name: "__cnt", scope: !275, file: !197, line: 686, type: !58)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "base32_norm_to_hex", scope: !2, file: !3, line: 568, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 328, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 41)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "base32_hex_to_norm", scope: !2, file: !3, line: 590, type: !280, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "base16_to_int", scope: !2, file: !3, line: 686, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 2048, elements: !289)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!289 = !{!290}
!290 = !DISubrange(count: 256)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "base16", scope: !293, file: !3, line: 770, type: !301, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "base16_encode", scope: !3, file: !3, line: 767, type: !90, scopeLine: 769, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DILocalVariable(name: "in", arg: 1, scope: !293, file: !3, line: 767, type: !92)
!296 = !DILocalVariable(name: "inlen", arg: 2, scope: !293, file: !3, line: 767, type: !73)
!297 = !DILocalVariable(name: "out", arg: 3, scope: !293, file: !3, line: 768, type: !93)
!298 = !DILocalVariable(name: "outlen", arg: 4, scope: !293, file: !3, line: 768, type: !73)
!299 = !DILocalVariable(name: "c", scope: !300, file: !3, line: 774, type: !63)
!300 = distinct !DILexicalBlock(scope: !293, file: !3, line: 773, column: 5)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 16)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "z85_encoding", scope: !2, file: !3, line: 855, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 680, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 85)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "z85_decoding", scope: !2, file: !3, line: 941, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 744, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 93)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "base58_to_gmp", scope: !2, file: !3, line: 1200, type: !287, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "gmp_to_base58", scope: !2, file: !3, line: 1181, type: !287, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 3840, elements: !328)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !321, line: 50, size: 256, elements: !322)
!321 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!322 = !{!323, !324, !325, !327}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !321, line: 52, baseType: !61, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !320, file: !321, line: 55, baseType: !56, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !321, line: 56, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !320, file: !321, line: 57, baseType: !56, size: 32, offset: 192)
!328 = !{!329}
!329 = !DISubrange(count: 15)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "Version", scope: !332, file: !333, line: 3, type: !61, isLocal: false, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !334, splitDebugInlining: false, nameTableKind: None)
!333 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!334 = !{!330}
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "base32_to_int", scope: !337, file: !338, line: 206, type: !287, isLocal: false, isDefinition: true)
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !339, globals: !340, splitDebugInlining: false, nameTableKind: None)
!338 = !DIFile(filename: "lib/base32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "95987f1bba4d0dce67e048a4dafbe22a")
!339 = !{!86, !66, !60, !55, !53}
!340 = !{!341, !335}
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "b32str", scope: !343, file: !338, line: 68, type: !349, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "base32_encode", scope: !338, file: !338, line: 65, type: !90, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !337, retainedNodes: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DILocalVariable(name: "in", arg: 1, scope: !343, file: !338, line: 65, type: !92)
!346 = !DILocalVariable(name: "inlen", arg: 2, scope: !343, file: !338, line: 65, type: !73)
!347 = !DILocalVariable(name: "out", arg: 3, scope: !343, file: !338, line: 66, type: !93)
!348 = !DILocalVariable(name: "outlen", arg: 4, scope: !343, file: !338, line: 66, type: !73)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "base64_to_int", scope: !354, file: !355, line: 243, type: !287, isLocal: false, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !339, globals: !356, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "lib/base64.c", directory: "/src", checksumkind: CSK_MD5, checksum: "de7b87ba8809e6c9b8f3253a3b932105")
!356 = !{!352, !357}
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "b64c", scope: !354, file: !355, line: 62, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 512, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 64)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "file_name", scope: !364, file: !365, line: 45, type: !61, isLocal: true, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !366, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!366 = !{!362, !367}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !364, file: !365, line: 55, type: !86, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !371, file: !372, line: 66, type: !407, isLocal: false, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !373, globals: !374, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!373 = !{!55, !63}
!374 = !{!375, !401, !369, !403, !405}
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "old_file_name", scope: !377, file: !372, line: 304, type: !61, isLocal: true, isDefinition: true)
!377 = distinct !DISubprogram(name: "verror_at_line", scope: !372, file: !372, line: 298, type: !378, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !371, retainedNodes: !394)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !56, !56, !61, !7, !61, !380}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !381, line: 52, baseType: !382)
!381 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !383, line: 32, baseType: !384)
!383 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !385, baseType: !386)
!385 = !DIFile(filename: "lib/error.c", directory: "/src")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !387, size: 256, elements: !388)
!387 = !DINamespace(name: "std", scope: null)
!388 = !{!389, !390, !391, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !386, file: !385, baseType: !55, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !386, file: !385, baseType: !55, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !386, file: !385, baseType: !55, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !386, file: !385, baseType: !56, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !386, file: !385, baseType: !56, size: 32, offset: 224)
!394 = !{!395, !396, !397, !398, !399, !400}
!395 = !DILocalVariable(name: "status", arg: 1, scope: !377, file: !372, line: 298, type: !56)
!396 = !DILocalVariable(name: "errnum", arg: 2, scope: !377, file: !372, line: 298, type: !56)
!397 = !DILocalVariable(name: "file_name", arg: 3, scope: !377, file: !372, line: 298, type: !61)
!398 = !DILocalVariable(name: "line_number", arg: 4, scope: !377, file: !372, line: 298, type: !7)
!399 = !DILocalVariable(name: "message", arg: 5, scope: !377, file: !372, line: 298, type: !61)
!400 = !DILocalVariable(name: "args", arg: 6, scope: !377, file: !372, line: 298, type: !380)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "old_line_number", scope: !377, file: !372, line: 305, type: !7, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "error_message_count", scope: !371, file: !372, line: 69, type: !7, isLocal: false, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !371, file: !372, line: 295, type: !56, isLocal: false, isDefinition: true)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "mp_bits_per_limb", scope: !412, file: !416, line: 288, type: !469, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !414, retainedTypes: !421, globals: !431, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "lib/mini-gmp-gnulib.c", directory: "/src", checksumkind: CSK_MD5, checksum: "18c9693e80e8dc09ed363761a1d33237")
!414 = !{!415, !37}
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mpz_div_round_mode", file: !416, line: 2197, baseType: !7, size: 32, elements: !417)
!416 = !DIFile(filename: "./lib/mini-gmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5bab32053bcda54c422f28ad9a48f3db")
!417 = !{!418, !419, !420}
!418 = !DIEnumerator(name: "GMP_DIV_FLOOR", value: 0)
!419 = !DIEnumerator(name: "GMP_DIV_CEIL", value: 1)
!420 = !DIEnumerator(name: "GMP_DIV_TRUNC", value: 2)
!421 = !{!422, !424, !60, !66, !426, !56, !427, !428, !53, !145, !63, !57, !7, !75, !429}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_limb_t", file: !423, line: 60, baseType: !60)
!423 = !DIFile(filename: "./lib/mini-gmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "68d9292d80d921bf50de4da10cd36738")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_ptr", file: !423, line: 64, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!426 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_size_t", file: !423, line: 61, baseType: !66)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_bitcnt_t", file: !423, line: 62, baseType: !60)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!431 = !{!410, !432, !447, !452, !457, !462}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "dummy_limb", scope: !434, file: !416, line: 1437, type: !446, isLocal: true, isDefinition: true)
!434 = distinct !DISubprogram(name: "mpz_init", scope: !416, file: !416, line: 1435, type: !435, scopeLine: 1436, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !412, retainedNodes: !444)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mpz_struct", file: !423, line: 75, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 67, size: 128, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_alloc", scope: !439, file: !423, line: 69, baseType: !56, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_size", scope: !439, file: !423, line: 71, baseType: !56, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_d", scope: !439, file: !423, line: 74, baseType: !425, size: 64, offset: 64)
!444 = !{!445}
!445 = !DILocalVariable(name: "r", arg: 1, scope: !434, file: !416, line: 1435, type: !437)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "gmp_allocate_func", scope: !412, file: !416, line: 332, type: !449, isLocal: true, isDefinition: true)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!55, !58}
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "gmp_reallocate_func", scope: !412, file: !416, line: 333, type: !454, isLocal: true, isDefinition: true)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!55, !55, !58, !58}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "gmp_free_func", scope: !412, file: !416, line: 334, type: !459, isLocal: true, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !55, !58}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "i", scope: !464, file: !416, line: 4495, type: !469, isLocal: true, isDefinition: true)
!464 = distinct !DISubprogram(name: "gmp_detect_endian", scope: !416, file: !416, line: 4493, type: !465, scopeLine: 4494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !412, retainedNodes: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!56}
!467 = !{!468}
!468 = !DILocalVariable(name: "p", scope: !464, file: !416, line: 4496, type: !429)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "program_name", scope: !472, file: !473, line: 31, type: !61, isLocal: false, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !474, globals: !475, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!474 = !{!53}
!475 = !{!470}
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "utf07FF", scope: !478, file: !479, line: 46, type: !506, isLocal: true, isDefinition: true)
!478 = distinct !DISubprogram(name: "proper_name_lite", scope: !479, file: !479, line: 38, type: !480, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !482, retainedNodes: !484)
!479 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!480 = !DISubroutineType(types: !481)
!481 = !{!61, !61, !61}
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !483, splitDebugInlining: false, nameTableKind: None)
!483 = !{!476}
!484 = !{!485, !486, !487, !488, !493}
!485 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !478, file: !479, line: 38, type: !61)
!486 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !478, file: !479, line: 38, type: !61)
!487 = !DILocalVariable(name: "translation", scope: !478, file: !479, line: 40, type: !61)
!488 = !DILocalVariable(name: "w", scope: !478, file: !479, line: 47, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !490, line: 37, baseType: !491)
!490 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !246, line: 57, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !246, line: 42, baseType: !7)
!493 = !DILocalVariable(name: "mbs", scope: !478, file: !479, line: 48, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !495, line: 6, baseType: !496)
!495 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !497, line: 21, baseType: !498)
!497 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 13, size: 64, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !498, file: !497, line: 15, baseType: !56, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !498, file: !497, line: 20, baseType: !502, size: 32, offset: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !498, file: !497, line: 16, size: 32, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !502, file: !497, line: 18, baseType: !7, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !502, file: !497, line: 19, baseType: !111, size: 32)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 16, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 2)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !511, file: !512, line: 76, type: !576, isLocal: false, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !513, retainedTypes: !519, globals: !520, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!513 = !{!14, !514, !37}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 254, baseType: !7, size: 32, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!517 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!518 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!519 = !{!56, !57, !58}
!520 = !{!509, !521, !527, !537, !539, !542, !565, !572, !574}
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !511, file: !512, line: 92, type: !523, isLocal: false, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !525)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!525 = !{!526}
!526 = !DISubrange(count: 10)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !511, file: !512, line: 1040, type: !529, isLocal: false, isDefinition: true)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !512, line: 56, size: 448, elements: !530)
!530 = !{!531, !532, !533, !535, !536}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !529, file: !512, line: 59, baseType: !14, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !529, file: !512, line: 62, baseType: !56, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !529, file: !512, line: 66, baseType: !534, size: 256, offset: 64)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !121)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !529, file: !512, line: 69, baseType: !61, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !529, file: !512, line: 72, baseType: !61, size: 64, offset: 384)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !511, file: !512, line: 107, type: !529, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "slot0", scope: !511, file: !512, line: 831, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, elements: !289)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "quote", scope: !544, file: !512, line: 228, type: !563, isLocal: true, isDefinition: true)
!544 = distinct !DISubprogram(name: "gettext_quote", scope: !512, file: !512, line: 197, type: !545, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !511, retainedNodes: !547)
!545 = !DISubroutineType(types: !546)
!546 = !{!61, !61, !14}
!547 = !{!548, !549, !550, !551, !552}
!548 = !DILocalVariable(name: "msgid", arg: 1, scope: !544, file: !512, line: 197, type: !61)
!549 = !DILocalVariable(name: "s", arg: 2, scope: !544, file: !512, line: 197, type: !14)
!550 = !DILocalVariable(name: "translation", scope: !544, file: !512, line: 199, type: !61)
!551 = !DILocalVariable(name: "w", scope: !544, file: !512, line: 229, type: !489)
!552 = !DILocalVariable(name: "mbs", scope: !544, file: !512, line: 230, type: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !495, line: 6, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !497, line: 21, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 13, size: 64, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !555, file: !497, line: 15, baseType: !56, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !555, file: !497, line: 20, baseType: !559, size: 32, offset: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !555, file: !497, line: 16, size: 32, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !559, file: !497, line: 18, baseType: !7, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !559, file: !497, line: 19, baseType: !111, size: 32)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 64, elements: !564)
!564 = !{!508, !113}
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "slotvec", scope: !511, file: !512, line: 834, type: !567, isLocal: true, isDefinition: true)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !512, line: 823, size: 128, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !568, file: !512, line: 825, baseType: !58, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !568, file: !512, line: 826, baseType: !53, size: 64, offset: 64)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "nslots", scope: !511, file: !512, line: 832, type: !56, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "slotvec0", scope: !511, file: !512, line: 833, type: !568, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 704, elements: !578)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!578 = !{!579}
!579 = !DISubrange(count: 11)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !582, file: !583, line: 26, type: !585, isLocal: false, isDefinition: true)
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !584, splitDebugInlining: false, nameTableKind: None)
!583 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!584 = !{!580}
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 376, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 47)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "exit_failure", scope: !590, file: !591, line: 24, type: !593, isLocal: false, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !592, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!592 = !{!588}
!593 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !56)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "internal_state", scope: !596, file: !597, line: 97, type: !600, isLocal: true, isDefinition: true)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !598, globals: !599, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!598 = !{!55, !58, !63}
!599 = !{!594}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !495, line: 6, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !497, line: 21, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 13, size: 64, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !602, file: !497, line: 15, baseType: !56, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !602, file: !497, line: 20, baseType: !606, size: 32, offset: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !602, file: !497, line: 16, size: 32, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !606, file: !497, line: 18, baseType: !7, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !606, file: !497, line: 19, baseType: !111, size: 32)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/c-ctype.c", directory: "/src", checksumkind: CSK_MD5, checksum: "245df19f202f37bba31cfa46647ceb93")
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !614, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!614 = !{!28}
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!616 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !619, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!619 = !{!55}
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!621 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !619, splitDebugInlining: false, nameTableKind: None)
!623 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !628, retainedTypes: !619, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!628 = !{!629}
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !627, line: 40, baseType: !7, size: 32, elements: !630)
!630 = !{!631}
!631 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !661, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!634 = !{!635, !647}
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !636, file: !633, line: 188, baseType: !7, size: 32, elements: !645)
!636 = distinct !DISubprogram(name: "x2nrealloc", scope: !633, file: !633, line: 176, type: !637, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !632, retainedNodes: !640)
!637 = !DISubroutineType(types: !638)
!638 = !{!55, !55, !639, !58}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!640 = !{!641, !642, !643, !644}
!641 = !DILocalVariable(name: "p", arg: 1, scope: !636, file: !633, line: 176, type: !55)
!642 = !DILocalVariable(name: "pn", arg: 2, scope: !636, file: !633, line: 176, type: !639)
!643 = !DILocalVariable(name: "s", arg: 3, scope: !636, file: !633, line: 176, type: !58)
!644 = !DILocalVariable(name: "n", scope: !636, file: !633, line: 178, type: !58)
!645 = !{!646}
!646 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !648, file: !633, line: 228, baseType: !7, size: 32, elements: !645)
!648 = distinct !DISubprogram(name: "xpalloc", scope: !633, file: !633, line: 223, type: !649, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !632, retainedNodes: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{!55, !55, !155, !73, !75, !73}
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660}
!652 = !DILocalVariable(name: "pa", arg: 1, scope: !648, file: !633, line: 223, type: !55)
!653 = !DILocalVariable(name: "pn", arg: 2, scope: !648, file: !633, line: 223, type: !155)
!654 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !648, file: !633, line: 223, type: !73)
!655 = !DILocalVariable(name: "n_max", arg: 4, scope: !648, file: !633, line: 223, type: !75)
!656 = !DILocalVariable(name: "s", arg: 5, scope: !648, file: !633, line: 223, type: !73)
!657 = !DILocalVariable(name: "n0", scope: !648, file: !633, line: 230, type: !73)
!658 = !DILocalVariable(name: "n", scope: !648, file: !633, line: 237, type: !73)
!659 = !DILocalVariable(name: "nbytes", scope: !648, file: !633, line: 248, type: !73)
!660 = !DILocalVariable(name: "adjusted_nbytes", scope: !648, file: !633, line: 252, type: !73)
!661 = !{!53, !55, !86, !66, !60}
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!663 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, retainedTypes: !667, splitDebugInlining: false, nameTableKind: None)
!665 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!666 = !{!5}
!667 = !{!86, !66, !60, !668}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !65, line: 101, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !246, line: 72, baseType: !66)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !619, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !676, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!676 = !{!86, !60, !55}
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !619, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!683 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!684 = !{i32 7, !"Dwarf Version", i32 5}
!685 = !{i32 2, !"Debug Info Version", i32 3}
!686 = !{i32 1, !"wchar_size", i32 4}
!687 = !{i32 1, !"branch-target-enforcement", i32 0}
!688 = !{i32 1, !"sign-return-address", i32 0}
!689 = !{i32 1, !"sign-return-address-all", i32 0}
!690 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!691 = !{i32 7, !"PIC Level", i32 2}
!692 = !{i32 7, !"PIE Level", i32 2}
!693 = !{i32 7, !"uwtable", i32 1}
!694 = !{i32 7, !"frame-pointer", i32 1}
!695 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 97, type: !696, scopeLine: 98, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !56}
!698 = !{!699}
!699 = !DILocalVariable(name: "status", arg: 1, scope: !695, file: !3, line: 97, type: !56)
!700 = !DILocation(line: 0, scope: !695)
!701 = !DILocation(line: 99, column: 14, scope: !702)
!702 = distinct !DILexicalBlock(scope: !695, file: !3, line: 99, column: 7)
!703 = !DILocation(line: 99, column: 7, scope: !695)
!704 = !DILocation(line: 100, column: 5, scope: !705)
!705 = distinct !DILexicalBlock(scope: !702, file: !3, line: 100, column: 5)
!706 = !{!707, !707, i64 0}
!707 = !{!"any pointer", !708, i64 0}
!708 = !{!"omnipotent char", !709, i64 0}
!709 = !{!"Simple C/C++ TBAA"}
!710 = !DILocation(line: 103, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !702, file: !3, line: 102, column: 5)
!712 = !DILocation(line: 108, column: 7, scope: !711)
!713 = !DILocation(line: 729, column: 3, scope: !714, inlinedAt: !716)
!714 = distinct !DISubprogram(name: "emit_stdin_note", scope: !197, file: !197, line: 727, type: !408, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !715)
!715 = !{}
!716 = distinct !DILocation(line: 117, column: 7, scope: !711)
!717 = !DILocation(line: 736, column: 3, scope: !718, inlinedAt: !719)
!718 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !197, file: !197, line: 734, type: !408, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !715)
!719 = distinct !DILocation(line: 118, column: 7, scope: !711)
!720 = !DILocation(line: 120, column: 7, scope: !711)
!721 = !DILocation(line: 124, column: 7, scope: !711)
!722 = !DILocation(line: 128, column: 7, scope: !711)
!723 = !DILocation(line: 132, column: 7, scope: !711)
!724 = !DILocation(line: 136, column: 7, scope: !711)
!725 = !DILocation(line: 140, column: 7, scope: !711)
!726 = !DILocation(line: 144, column: 7, scope: !711)
!727 = !DILocation(line: 148, column: 7, scope: !711)
!728 = !DILocation(line: 153, column: 7, scope: !711)
!729 = !DILocation(line: 157, column: 7, scope: !711)
!730 = !DILocation(line: 161, column: 7, scope: !711)
!731 = !DILocation(line: 167, column: 7, scope: !711)
!732 = !DILocation(line: 174, column: 7, scope: !711)
!733 = !DILocation(line: 175, column: 7, scope: !711)
!734 = !DILocation(line: 177, column: 7, scope: !711)
!735 = !DILocalVariable(name: "program", arg: 1, scope: !736, file: !197, line: 836, type: !61)
!736 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !197, file: !197, line: 836, type: !737, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !61}
!739 = !{!735, !740, !749, !750, !752, !753}
!740 = !DILocalVariable(name: "infomap", scope: !736, file: !197, line: 838, type: !741)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 896, elements: !747)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !736, file: !197, line: 838, size: 128, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !743, file: !197, line: 838, baseType: !61, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !743, file: !197, line: 838, baseType: !61, size: 64, offset: 64)
!747 = !{!748}
!748 = !DISubrange(count: 7)
!749 = !DILocalVariable(name: "node", scope: !736, file: !197, line: 848, type: !61)
!750 = !DILocalVariable(name: "map_prog", scope: !736, file: !197, line: 849, type: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!752 = !DILocalVariable(name: "lc_messages", scope: !736, file: !197, line: 861, type: !61)
!753 = !DILocalVariable(name: "url_program", scope: !736, file: !197, line: 874, type: !61)
!754 = !DILocation(line: 0, scope: !736, inlinedAt: !755)
!755 = distinct !DILocation(line: 192, column: 7, scope: !711)
!756 = !DILocation(line: 838, column: 3, scope: !736, inlinedAt: !755)
!757 = !DILocation(line: 838, column: 67, scope: !736, inlinedAt: !755)
!758 = !DILocation(line: 849, column: 36, scope: !736, inlinedAt: !755)
!759 = !DILocation(line: 851, column: 3, scope: !736, inlinedAt: !755)
!760 = !DILocalVariable(name: "__s1", arg: 1, scope: !761, file: !762, line: 1359, type: !61)
!761 = distinct !DISubprogram(name: "streq", scope: !762, file: !762, line: 1359, type: !763, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !765)
!762 = !DIFile(filename: "./lib/string.h", directory: "/src")
!763 = !DISubroutineType(types: !764)
!764 = !{!86, !61, !61}
!765 = !{!760, !766}
!766 = !DILocalVariable(name: "__s2", arg: 2, scope: !761, file: !762, line: 1359, type: !61)
!767 = !DILocation(line: 0, scope: !761, inlinedAt: !768)
!768 = distinct !DILocation(line: 851, column: 33, scope: !736, inlinedAt: !755)
!769 = !DILocation(line: 1361, column: 11, scope: !761, inlinedAt: !768)
!770 = !DILocation(line: 1361, column: 10, scope: !761, inlinedAt: !768)
!771 = !DILocation(line: 852, column: 13, scope: !736, inlinedAt: !755)
!772 = !DILocation(line: 851, column: 20, scope: !736, inlinedAt: !755)
!773 = !{!774, !707, i64 0}
!774 = !{!"infomap", !707, i64 0, !707, i64 8}
!775 = !DILocation(line: 851, column: 10, scope: !736, inlinedAt: !755)
!776 = !DILocation(line: 851, column: 28, scope: !736, inlinedAt: !755)
!777 = distinct !{!777, !759, !771, !778}
!778 = !{!"llvm.loop.mustprogress"}
!779 = !DILocation(line: 854, column: 17, scope: !780, inlinedAt: !755)
!780 = distinct !DILexicalBlock(scope: !736, file: !197, line: 854, column: 7)
!781 = !{!774, !707, i64 8}
!782 = !DILocation(line: 854, column: 7, scope: !780, inlinedAt: !755)
!783 = !DILocation(line: 854, column: 7, scope: !736, inlinedAt: !755)
!784 = !DILocation(line: 857, column: 3, scope: !736, inlinedAt: !755)
!785 = !DILocation(line: 861, column: 29, scope: !736, inlinedAt: !755)
!786 = !DILocation(line: 862, column: 7, scope: !787, inlinedAt: !755)
!787 = distinct !DILexicalBlock(scope: !736, file: !197, line: 862, column: 7)
!788 = !DILocation(line: 862, column: 19, scope: !787, inlinedAt: !755)
!789 = !DILocation(line: 862, column: 22, scope: !787, inlinedAt: !755)
!790 = !DILocation(line: 862, column: 7, scope: !736, inlinedAt: !755)
!791 = !DILocation(line: 868, column: 7, scope: !792, inlinedAt: !755)
!792 = distinct !DILexicalBlock(scope: !787, file: !197, line: 863, column: 5)
!793 = !DILocation(line: 870, column: 5, scope: !792, inlinedAt: !755)
!794 = !DILocation(line: 0, scope: !761, inlinedAt: !795)
!795 = distinct !DILocation(line: 874, column: 29, scope: !736, inlinedAt: !755)
!796 = !DILocation(line: 875, column: 3, scope: !736, inlinedAt: !755)
!797 = !DILocation(line: 877, column: 3, scope: !736, inlinedAt: !755)
!798 = !DILocation(line: 879, column: 1, scope: !736, inlinedAt: !755)
!799 = !DILocation(line: 195, column: 3, scope: !695)
!800 = !DISubprogram(name: "dcgettext", scope: !801, file: !801, line: 51, type: !802, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!801 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!802 = !DISubroutineType(types: !803)
!803 = !{!53, !61, !61, !56}
!804 = !DISubprogram(name: "fputs_unlocked", scope: !381, file: !381, line: 691, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!805 = !DISubroutineType(types: !806)
!806 = !{!56, !92, !807}
!807 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !219)
!808 = !DILocation(line: 0, scope: !196)
!809 = !DILocation(line: 581, column: 7, scope: !205)
!810 = !{!811, !811, i64 0}
!811 = !{!"int", !708, i64 0}
!812 = !DILocation(line: 581, column: 19, scope: !205)
!813 = !DILocation(line: 581, column: 7, scope: !196)
!814 = !DILocation(line: 585, column: 26, scope: !204)
!815 = !DILocation(line: 0, scope: !204)
!816 = !DILocation(line: 586, column: 23, scope: !204)
!817 = !DILocation(line: 586, column: 28, scope: !204)
!818 = !DILocation(line: 586, column: 32, scope: !204)
!819 = !{!708, !708, i64 0}
!820 = !DILocation(line: 586, column: 38, scope: !204)
!821 = !DILocation(line: 0, scope: !761, inlinedAt: !822)
!822 = distinct !DILocation(line: 586, column: 41, scope: !204)
!823 = !DILocation(line: 1361, column: 11, scope: !761, inlinedAt: !822)
!824 = !DILocation(line: 1361, column: 10, scope: !761, inlinedAt: !822)
!825 = !DILocation(line: 586, column: 19, scope: !204)
!826 = !DILocation(line: 587, column: 5, scope: !204)
!827 = !DILocation(line: 588, column: 7, scope: !828)
!828 = distinct !DILexicalBlock(scope: !196, file: !197, line: 588, column: 7)
!829 = !DILocation(line: 588, column: 7, scope: !196)
!830 = !DILocation(line: 590, column: 7, scope: !831)
!831 = distinct !DILexicalBlock(scope: !828, file: !197, line: 589, column: 5)
!832 = !DILocation(line: 591, column: 7, scope: !831)
!833 = !DILocation(line: 595, column: 37, scope: !196)
!834 = !DILocation(line: 595, column: 35, scope: !196)
!835 = !DILocation(line: 596, column: 29, scope: !196)
!836 = !DILocation(line: 597, column: 8, scope: !212)
!837 = !DILocation(line: 597, column: 7, scope: !196)
!838 = !DILocation(line: 604, column: 24, scope: !211)
!839 = !DILocation(line: 604, column: 12, scope: !212)
!840 = !DILocation(line: 0, scope: !210)
!841 = !DILocation(line: 610, column: 16, scope: !210)
!842 = !DILocation(line: 610, column: 7, scope: !210)
!843 = !DILocation(line: 611, column: 21, scope: !210)
!844 = !{!845, !845, i64 0}
!845 = !{!"short", !708, i64 0}
!846 = !DILocation(line: 611, column: 19, scope: !210)
!847 = !DILocation(line: 611, column: 16, scope: !210)
!848 = !DILocation(line: 610, column: 30, scope: !210)
!849 = distinct !{!849, !842, !843, !778}
!850 = !DILocation(line: 612, column: 18, scope: !851)
!851 = distinct !DILexicalBlock(scope: !210, file: !197, line: 612, column: 11)
!852 = !DILocation(line: 612, column: 11, scope: !210)
!853 = !DILocation(line: 620, column: 23, scope: !196)
!854 = !DILocation(line: 625, column: 39, scope: !196)
!855 = !DILocation(line: 626, column: 3, scope: !196)
!856 = !DILocation(line: 626, column: 10, scope: !196)
!857 = !DILocation(line: 626, column: 21, scope: !196)
!858 = !DILocation(line: 628, column: 44, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !197, line: 628, column: 11)
!860 = distinct !DILexicalBlock(scope: !196, file: !197, line: 627, column: 5)
!861 = !DILocation(line: 628, column: 32, scope: !859)
!862 = !DILocation(line: 628, column: 49, scope: !859)
!863 = !DILocation(line: 628, column: 11, scope: !860)
!864 = !DILocation(line: 630, column: 11, scope: !865)
!865 = distinct !DILexicalBlock(scope: !860, file: !197, line: 630, column: 11)
!866 = !DILocation(line: 630, column: 11, scope: !860)
!867 = !DILocation(line: 632, column: 26, scope: !868)
!868 = distinct !DILexicalBlock(scope: !869, file: !197, line: 632, column: 15)
!869 = distinct !DILexicalBlock(scope: !865, file: !197, line: 631, column: 9)
!870 = !DILocation(line: 632, column: 34, scope: !868)
!871 = !DILocation(line: 632, column: 37, scope: !868)
!872 = !DILocation(line: 632, column: 15, scope: !869)
!873 = !DILocation(line: 636, column: 29, scope: !874)
!874 = distinct !DILexicalBlock(scope: !869, file: !197, line: 636, column: 15)
!875 = !DILocation(line: 640, column: 16, scope: !860)
!876 = distinct !{!876, !855, !877, !778}
!877 = !DILocation(line: 641, column: 5, scope: !196)
!878 = !DILocation(line: 644, column: 3, scope: !196)
!879 = !DILocation(line: 0, scope: !761, inlinedAt: !880)
!880 = distinct !DILocation(line: 648, column: 31, scope: !196)
!881 = !DILocation(line: 0, scope: !761, inlinedAt: !882)
!882 = distinct !DILocation(line: 649, column: 31, scope: !196)
!883 = !DILocation(line: 0, scope: !761, inlinedAt: !884)
!884 = distinct !DILocation(line: 650, column: 31, scope: !196)
!885 = !DILocation(line: 0, scope: !761, inlinedAt: !886)
!886 = distinct !DILocation(line: 651, column: 31, scope: !196)
!887 = !DILocation(line: 0, scope: !761, inlinedAt: !888)
!888 = distinct !DILocation(line: 652, column: 31, scope: !196)
!889 = !DILocation(line: 0, scope: !761, inlinedAt: !890)
!890 = distinct !DILocation(line: 653, column: 31, scope: !196)
!891 = !DILocation(line: 0, scope: !761, inlinedAt: !892)
!892 = distinct !DILocation(line: 654, column: 31, scope: !196)
!893 = !DILocation(line: 0, scope: !761, inlinedAt: !894)
!894 = distinct !DILocation(line: 655, column: 31, scope: !196)
!895 = !DILocation(line: 0, scope: !761, inlinedAt: !896)
!896 = distinct !DILocation(line: 656, column: 31, scope: !196)
!897 = !DILocation(line: 0, scope: !761, inlinedAt: !898)
!898 = distinct !DILocation(line: 657, column: 31, scope: !196)
!899 = !DILocation(line: 663, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !196, file: !197, line: 663, column: 7)
!901 = !DILocation(line: 664, column: 7, scope: !900)
!902 = !DILocation(line: 664, column: 10, scope: !900)
!903 = !DILocation(line: 663, column: 7, scope: !196)
!904 = !DILocation(line: 669, column: 7, scope: !905)
!905 = distinct !DILexicalBlock(scope: !900, file: !197, line: 665, column: 5)
!906 = !DILocation(line: 671, column: 5, scope: !905)
!907 = !DILocation(line: 676, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !900, file: !197, line: 673, column: 5)
!909 = !DILocation(line: 679, column: 3, scope: !196)
!910 = !DILocation(line: 683, column: 3, scope: !196)
!911 = !DILocation(line: 686, column: 3, scope: !196)
!912 = !DILocation(line: 688, column: 3, scope: !196)
!913 = !DILocation(line: 691, column: 3, scope: !196)
!914 = !DILocation(line: 695, column: 3, scope: !196)
!915 = !DILocation(line: 696, column: 1, scope: !196)
!916 = !DISubprogram(name: "setlocale", scope: !917, file: !917, line: 122, type: !918, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!917 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!918 = !DISubroutineType(types: !919)
!919 = !{!53, !56, !61}
!920 = !DISubprogram(name: "getenv", scope: !921, file: !921, line: 641, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!921 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!922 = !DISubroutineType(types: !923)
!923 = !{!53, !61}
!924 = !DISubprogram(name: "fwrite_unlocked", scope: !381, file: !381, line: 704, type: !925, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!925 = !DISubroutineType(types: !926)
!926 = !{!58, !927, !58, !58, !807}
!927 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!930 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1630, type: !931, scopeLine: 1631, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !934)
!931 = !DISubroutineType(types: !932)
!932 = !{!56, !56, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !947}
!935 = !DILocalVariable(name: "argc", arg: 1, scope: !930, file: !3, line: 1630, type: !56)
!936 = !DILocalVariable(name: "argv", arg: 2, scope: !930, file: !3, line: 1630, type: !933)
!937 = !DILocalVariable(name: "opt", scope: !930, file: !3, line: 1632, type: !56)
!938 = !DILocalVariable(name: "input_fh", scope: !930, file: !3, line: 1633, type: !219)
!939 = !DILocalVariable(name: "infile", scope: !930, file: !3, line: 1634, type: !61)
!940 = !DILocalVariable(name: "decode", scope: !930, file: !3, line: 1637, type: !86)
!941 = !DILocalVariable(name: "ignore_garbage", scope: !930, file: !3, line: 1639, type: !86)
!942 = !DILocalVariable(name: "wrap_column", scope: !930, file: !3, line: 1641, type: !73)
!943 = !DILocalVariable(name: "base_type", scope: !930, file: !3, line: 1644, type: !56)
!944 = !DILocalVariable(name: "w", scope: !945, file: !3, line: 1664, type: !668)
!945 = distinct !DILexicalBlock(scope: !946, file: !3, line: 1663, column: 9)
!946 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1657, column: 7)
!947 = !DILocalVariable(name: "s_err", scope: !945, file: !3, line: 1665, type: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !6, line: 43, baseType: !5)
!949 = !DILocation(line: 0, scope: !930)
!950 = !DILocation(line: 1648, column: 21, scope: !930)
!951 = !DILocation(line: 1648, column: 3, scope: !930)
!952 = !DILocation(line: 1649, column: 3, scope: !930)
!953 = !DILocation(line: 1650, column: 3, scope: !930)
!954 = !DILocation(line: 1651, column: 3, scope: !930)
!955 = !DILocation(line: 1653, column: 3, scope: !930)
!956 = !DILocation(line: 1655, column: 3, scope: !930)
!957 = !DILocation(line: 1655, column: 17, scope: !930)
!958 = distinct !{!958, !956, !959, !778}
!959 = !DILocation(line: 1698, column: 7, scope: !930)
!960 = !DILocation(line: 1664, column: 11, scope: !945)
!961 = !DILocation(line: 1665, column: 44, scope: !945)
!962 = !DILocation(line: 0, scope: !945)
!963 = !DILocation(line: 1665, column: 32, scope: !945)
!964 = !DILocation(line: 1666, column: 32, scope: !965)
!965 = distinct !DILexicalBlock(scope: !945, file: !3, line: 1666, column: 15)
!966 = !DILocation(line: 1666, column: 40, scope: !965)
!967 = !DILocation(line: 1667, column: 13, scope: !965)
!968 = !DILocation(line: 1669, column: 31, scope: !945)
!969 = !DILocation(line: 1669, column: 51, scope: !945)
!970 = !DILocation(line: 1670, column: 9, scope: !946)
!971 = !DILocation(line: 1671, column: 9, scope: !946)
!972 = !DILocation(line: 1688, column: 9, scope: !946)
!973 = !DILocation(line: 1691, column: 7, scope: !946)
!974 = !DILocation(line: 1693, column: 7, scope: !946)
!975 = !DILocation(line: 1696, column: 9, scope: !946)
!976 = !DILocation(line: 1701, column: 20, scope: !930)
!977 = !DILocation(line: 1702, column: 15, scope: !930)
!978 = !DILocation(line: 1703, column: 22, scope: !930)
!979 = !DILocation(line: 1704, column: 28, scope: !930)
!980 = !DILocation(line: 1706, column: 3, scope: !930)
!981 = !DILocation(line: 1709, column: 19, scope: !982)
!982 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1707, column: 5)
!983 = !DILocation(line: 1710, column: 24, scope: !982)
!984 = !DILocation(line: 1711, column: 19, scope: !982)
!985 = !DILocation(line: 1712, column: 26, scope: !982)
!986 = !DILocation(line: 1713, column: 15, scope: !982)
!987 = !DILocation(line: 1714, column: 19, scope: !982)
!988 = !DILocation(line: 1715, column: 28, scope: !982)
!989 = !DILocation(line: 1716, column: 23, scope: !982)
!990 = !DILocation(line: 1717, column: 7, scope: !982)
!991 = !DILocation(line: 1720, column: 19, scope: !982)
!992 = !DILocation(line: 1721, column: 24, scope: !982)
!993 = !DILocation(line: 1722, column: 19, scope: !982)
!994 = !DILocation(line: 1723, column: 26, scope: !982)
!995 = !DILocation(line: 1724, column: 15, scope: !982)
!996 = !DILocation(line: 1725, column: 19, scope: !982)
!997 = !DILocation(line: 1726, column: 28, scope: !982)
!998 = !DILocation(line: 1727, column: 23, scope: !982)
!999 = !DILocation(line: 1728, column: 7, scope: !982)
!1000 = !DILocation(line: 1731, column: 19, scope: !982)
!1001 = !DILocation(line: 1732, column: 24, scope: !982)
!1002 = !DILocation(line: 1733, column: 19, scope: !982)
!1003 = !DILocation(line: 1734, column: 26, scope: !982)
!1004 = !DILocation(line: 1735, column: 15, scope: !982)
!1005 = !DILocation(line: 1736, column: 19, scope: !982)
!1006 = !DILocation(line: 1737, column: 28, scope: !982)
!1007 = !DILocation(line: 1738, column: 23, scope: !982)
!1008 = !DILocation(line: 1739, column: 7, scope: !982)
!1009 = !DILocation(line: 1742, column: 19, scope: !982)
!1010 = !DILocation(line: 1743, column: 24, scope: !982)
!1011 = !DILocation(line: 1744, column: 19, scope: !982)
!1012 = !DILocation(line: 1745, column: 26, scope: !982)
!1013 = !DILocation(line: 1746, column: 15, scope: !982)
!1014 = !DILocation(line: 1747, column: 19, scope: !982)
!1015 = !DILocation(line: 1748, column: 28, scope: !982)
!1016 = !DILocation(line: 1749, column: 23, scope: !982)
!1017 = !DILocation(line: 1750, column: 7, scope: !982)
!1018 = !DILocation(line: 1753, column: 19, scope: !982)
!1019 = !DILocation(line: 1754, column: 26, scope: !982)
!1020 = !DILocation(line: 1755, column: 15, scope: !982)
!1021 = !DILocation(line: 1756, column: 19, scope: !982)
!1022 = !DILocation(line: 1757, column: 28, scope: !982)
!1023 = !DILocation(line: 1758, column: 23, scope: !982)
!1024 = !DILocation(line: 1759, column: 7, scope: !982)
!1025 = !DILocation(line: 1762, column: 19, scope: !982)
!1026 = !DILocation(line: 1763, column: 26, scope: !982)
!1027 = !DILocation(line: 1764, column: 15, scope: !982)
!1028 = !DILocation(line: 1765, column: 19, scope: !982)
!1029 = !DILocation(line: 1766, column: 28, scope: !982)
!1030 = !DILocation(line: 1767, column: 23, scope: !982)
!1031 = !DILocation(line: 1768, column: 7, scope: !982)
!1032 = !DILocation(line: 1771, column: 19, scope: !982)
!1033 = !DILocation(line: 1772, column: 26, scope: !982)
!1034 = !DILocation(line: 1773, column: 15, scope: !982)
!1035 = !DILocation(line: 1774, column: 19, scope: !982)
!1036 = !DILocation(line: 1775, column: 28, scope: !982)
!1037 = !DILocation(line: 1776, column: 23, scope: !982)
!1038 = !DILocation(line: 1777, column: 7, scope: !982)
!1039 = !DILocation(line: 1780, column: 19, scope: !982)
!1040 = !DILocation(line: 1781, column: 26, scope: !982)
!1041 = !DILocation(line: 1782, column: 15, scope: !982)
!1042 = !DILocation(line: 1783, column: 19, scope: !982)
!1043 = !DILocation(line: 1784, column: 28, scope: !982)
!1044 = !DILocation(line: 1785, column: 23, scope: !982)
!1045 = !DILocation(line: 1786, column: 7, scope: !982)
!1046 = !DILocation(line: 1789, column: 19, scope: !982)
!1047 = !DILocation(line: 1790, column: 15, scope: !982)
!1048 = !DILocation(line: 1791, column: 28, scope: !982)
!1049 = !DILocation(line: 1793, column: 32, scope: !982)
!1050 = !DILocation(line: 1794, column: 28, scope: !982)
!1051 = !DILocation(line: 1795, column: 23, scope: !982)
!1052 = !DILocation(line: 1796, column: 32, scope: !982)
!1053 = !DILocation(line: 1797, column: 7, scope: !982)
!1054 = !DILocation(line: 1800, column: 7, scope: !982)
!1055 = !DILocation(line: 1801, column: 7, scope: !982)
!1056 = !DILocation(line: 1805, column: 14, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1805, column: 7)
!1058 = !DILocation(line: 1805, column: 12, scope: !1057)
!1059 = !DILocation(line: 1805, column: 21, scope: !1057)
!1060 = !DILocation(line: 1805, column: 7, scope: !930)
!1061 = !DILocation(line: 1807, column: 7, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 1806, column: 5)
!1063 = !DILocation(line: 1808, column: 7, scope: !1062)
!1064 = !DILocation(line: 1811, column: 14, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1811, column: 7)
!1066 = !DILocation(line: 1811, column: 7, scope: !930)
!1067 = !DILocation(line: 1812, column: 14, scope: !1065)
!1068 = !DILocation(line: 1812, column: 5, scope: !1065)
!1069 = !DILocation(line: 0, scope: !1065)
!1070 = !DILocation(line: 0, scope: !761, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 1816, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1816, column: 7)
!1073 = !DILocation(line: 1361, column: 11, scope: !761, inlinedAt: !1071)
!1074 = !DILocation(line: 1361, column: 10, scope: !761, inlinedAt: !1071)
!1075 = !DILocation(line: 1816, column: 7, scope: !930)
!1076 = !DILocation(line: 1819, column: 18, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 1817, column: 5)
!1078 = !DILocation(line: 1820, column: 5, scope: !1077)
!1079 = !DILocation(line: 1823, column: 18, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 1822, column: 5)
!1081 = !DILocation(line: 1824, column: 20, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 1824, column: 11)
!1083 = !DILocation(line: 1824, column: 11, scope: !1080)
!1084 = !DILocation(line: 1825, column: 9, scope: !1082)
!1085 = !DILocation(line: 0, scope: !1072)
!1086 = !DILocation(line: 1828, column: 3, scope: !930)
!1087 = !DILocation(line: 0, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1830, column: 7)
!1089 = !DILocation(line: 1830, column: 7, scope: !930)
!1090 = !DILocation(line: 1831, column: 5, scope: !1088)
!1091 = !DILocation(line: 1833, column: 5, scope: !1088)
!1092 = !DISubprogram(name: "bindtextdomain", scope: !801, file: !801, line: 86, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!53, !61, !61}
!1095 = !DISubprogram(name: "textdomain", scope: !801, file: !801, line: 82, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!1096 = !DISubprogram(name: "atexit", scope: !921, file: !921, line: 602, type: !1097, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!56, !407}
!1099 = !DISubprogram(name: "getopt_long", scope: !321, file: !321, line: 66, type: !1100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!56, !56, !1102, !61, !1104, !326}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!1105 = distinct !DISubprogram(name: "no_required_padding", scope: !3, file: !3, line: 218, type: !79, scopeLine: 219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1106)
!1106 = !{!1107}
!1107 = !DILocalVariable(name: "len", arg: 1, scope: !1105, file: !3, line: 218, type: !56)
!1108 = !DILocation(line: 0, scope: !1105)
!1109 = !DILocation(line: 220, column: 3, scope: !1105)
!1110 = distinct !DISubprogram(name: "no_padding", scope: !3, file: !3, line: 338, type: !187, scopeLine: 339, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1111)
!1111 = !{!1112}
!1112 = !DILocalVariable(name: "ctx", arg: 1, scope: !1110, file: !3, line: 338, type: !99)
!1113 = !DILocation(line: 0, scope: !1110)
!1114 = !DILocation(line: 340, column: 3, scope: !1110)
!1115 = distinct !DISubprogram(name: "no_pending_length", scope: !3, file: !3, line: 344, type: !192, scopeLine: 345, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1116)
!1116 = !{!1117}
!1117 = !DILocalVariable(name: "ctx", arg: 1, scope: !1115, file: !3, line: 344, type: !99)
!1118 = !DILocation(line: 0, scope: !1115)
!1119 = !DILocation(line: 346, column: 3, scope: !1115)
!1120 = distinct !DISubprogram(name: "decode_ctx_finalize", scope: !3, file: !3, line: 414, type: !159, scopeLine: 416, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1122 = !DILocalVariable(name: "ctx", arg: 1, scope: !1120, file: !3, line: 414, type: !99)
!1123 = !DILocalVariable(name: "out", arg: 2, scope: !1120, file: !3, line: 415, type: !161)
!1124 = !DILocalVariable(name: "outlen", arg: 3, scope: !1120, file: !3, line: 415, type: !155)
!1125 = !DILocalVariable(name: "padbuf", scope: !1120, file: !3, line: 424, type: !120)
!1126 = !DILocalVariable(name: "pending_len", scope: !1120, file: !3, line: 425, type: !73)
!1127 = !DILocalVariable(name: "auto_padding", scope: !1120, file: !3, line: 426, type: !73)
!1128 = !DILocalVariable(name: "n", scope: !1120, file: !3, line: 427, type: !73)
!1129 = !DILocalVariable(name: "result", scope: !1120, file: !3, line: 428, type: !86)
!1130 = !DILocation(line: 0, scope: !1120)
!1131 = !DILocation(line: 417, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 417, column: 7)
!1133 = !DILocation(line: 417, column: 32, scope: !1132)
!1134 = !DILocation(line: 417, column: 7, scope: !1120)
!1135 = !DILocation(line: 419, column: 15, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 418, column: 5)
!1137 = !{!1138, !1138, i64 0}
!1138 = !{!"long", !708, i64 0}
!1139 = !DILocation(line: 420, column: 7, scope: !1136)
!1140 = !DILocation(line: 424, column: 3, scope: !1120)
!1141 = !DILocation(line: 424, column: 8, scope: !1120)
!1142 = !DILocation(line: 425, column: 23, scope: !1120)
!1143 = !DILocation(line: 426, column: 24, scope: !1120)
!1144 = !{i32 (i32)* @base32_required_padding, i32 (i32)* @base64_required_padding, i32 (i32)* @no_required_padding}
!1145 = !DILocation(line: 427, column: 3, scope: !1120)
!1146 = !DILocation(line: 427, column: 13, scope: !1120)
!1147 = !DILocation(line: 427, column: 9, scope: !1120)
!1148 = !DILocation(line: 430, column: 7, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 430, column: 7)
!1150 = !DILocation(line: 430, column: 20, scope: !1149)
!1151 = !DILocation(line: 430, column: 25, scope: !1149)
!1152 = !{i1 (%struct.base_decode_context*)* @base32_ctx_has_padding, i1 (%struct.base_decode_context*)* @base64_ctx_has_padding, i1 (%struct.base_decode_context*)* @no_padding}
!1153 = !DILocation(line: 430, column: 7, scope: !1120)
!1154 = !DILocation(line: 432, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 432, column: 7)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 432, column: 7)
!1157 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 431, column: 5)
!1158 = !DILocation(line: 432, column: 7, scope: !1156)
!1159 = !DILocation(line: 433, column: 16, scope: !1157)
!1160 = !DILocation(line: 433, column: 60, scope: !1157)
!1161 = !DILocation(line: 434, column: 5, scope: !1157)
!1162 = !DILocation(line: 437, column: 16, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 436, column: 5)
!1164 = !DILocation(line: 437, column: 45, scope: !1163)
!1165 = !DILocation(line: 440, column: 13, scope: !1120)
!1166 = !DILocation(line: 440, column: 11, scope: !1120)
!1167 = !DILocation(line: 442, column: 1, scope: !1120)
!1168 = distinct !DISubprogram(name: "base64_length_wrapper", scope: !3, file: !3, line: 447, type: !71, scopeLine: 448, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1169)
!1169 = !{!1170}
!1170 = !DILocalVariable(name: "len", arg: 1, scope: !1168, file: !3, line: 447, type: !73)
!1171 = !DILocation(line: 0, scope: !1168)
!1172 = !DILocation(line: 449, column: 10, scope: !1168)
!1173 = !DILocation(line: 449, column: 3, scope: !1168)
!1174 = distinct !DISubprogram(name: "base64_required_padding", scope: !3, file: !3, line: 209, type: !79, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1175)
!1175 = !{!1176, !1177}
!1176 = !DILocalVariable(name: "len", arg: 1, scope: !1174, file: !3, line: 209, type: !56)
!1177 = !DILocalVariable(name: "partial", scope: !1174, file: !3, line: 211, type: !56)
!1178 = !DILocation(line: 0, scope: !1174)
!1179 = !DILocation(line: 211, column: 21, scope: !1174)
!1180 = !DILocation(line: 212, column: 10, scope: !1174)
!1181 = !DILocation(line: 212, column: 3, scope: !1174)
!1182 = distinct !DISubprogram(name: "base64_ctx_has_padding", scope: !3, file: !3, line: 355, type: !187, scopeLine: 356, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1183)
!1183 = !{!1184}
!1184 = !DILocalVariable(name: "ctx", arg: 1, scope: !1182, file: !3, line: 355, type: !99)
!1185 = !DILocation(line: 0, scope: !1182)
!1186 = !DILocation(line: 357, column: 26, scope: !1182)
!1187 = !DILocation(line: 357, column: 10, scope: !1182)
!1188 = !DILocation(line: 357, column: 28, scope: !1182)
!1189 = !DILocation(line: 357, column: 19, scope: !1182)
!1190 = !DILocation(line: 357, column: 69, scope: !1182)
!1191 = !DILocation(line: 357, column: 31, scope: !1182)
!1192 = !DILocation(line: 357, column: 74, scope: !1182)
!1193 = !DILocation(line: 357, column: 3, scope: !1182)
!1194 = distinct !DISubprogram(name: "base64_ctx_get_pending_length", scope: !3, file: !3, line: 367, type: !192, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1195)
!1195 = !{!1196}
!1196 = !DILocalVariable(name: "ctx", arg: 1, scope: !1194, file: !3, line: 367, type: !99)
!1197 = !DILocation(line: 0, scope: !1194)
!1198 = !DILocation(line: 369, column: 26, scope: !1194)
!1199 = !DILocation(line: 369, column: 3, scope: !1194)
!1200 = distinct !DISubprogram(name: "base64_decode_ctx_init_wrapper", scope: !3, file: !3, line: 453, type: !97, scopeLine: 454, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1201)
!1201 = !{!1202}
!1202 = !DILocalVariable(name: "ctx", arg: 1, scope: !1200, file: !3, line: 453, type: !99)
!1203 = !DILocation(line: 0, scope: !1200)
!1204 = !DILocalVariable(name: "ctx", arg: 1, scope: !1205, file: !107, line: 74, type: !1208)
!1205 = distinct !DISubprogram(name: "base64_decode_ctx_init", scope: !107, file: !107, line: 74, type: !1206, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1209)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !1208}
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!1209 = !{!1204}
!1210 = !DILocation(line: 0, scope: !1205, inlinedAt: !1211)
!1211 = distinct !DILocation(line: 455, column: 3, scope: !1200)
!1212 = !DILocation(line: 76, column: 8, scope: !1205, inlinedAt: !1211)
!1213 = !DILocation(line: 76, column: 10, scope: !1205, inlinedAt: !1211)
!1214 = !{!1215, !811, i64 0}
!1215 = !{!"base64_decode_context", !811, i64 0, !708, i64 4}
!1216 = !DILocation(line: 456, column: 1, scope: !1200)
!1217 = distinct !DISubprogram(name: "base64_decode_ctx_wrapper", scope: !3, file: !3, line: 459, type: !153, scopeLine: 462, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1223}
!1219 = !DILocalVariable(name: "ctx", arg: 1, scope: !1217, file: !3, line: 459, type: !99)
